chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/*
 * Copyright (c) 2009-2018 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     /tmp/SIM3U167_B.h
 * @brief    CMSIS HeaderFile
 * @version  1
 * @date     05. February 2019
 * @note     Generated by SVDConv V3.3.21 on Tuesday, 05.02.2019 17:50:37
 *           from File 'SIM3U1x7_SVD.svd',
 */



/** @addtogroup 
  * @{
  */


/** @addtogroup SIM3U167_B
  * @{
  */


#ifndef SIM3U167_B_H
#define SIM3U167_B_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M3 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =========================================  SIM3U167_B Specific Interrupt Numbers  ========================================= */
  WDTIMER_IRQn              =   0,              /*!< 0  WDTIMER                                                                */
  PBEXT0_IRQn               =   1,              /*!< 1  PBEXT0                                                                 */
  PBEXT1_IRQn               =   2,              /*!< 2  PBEXT1                                                                 */
  RTCALRM_IRQn              =   3,              /*!< 3  RTCALRM                                                                */
  DMACH0_IRQn               =   4,              /*!< 4  DMACH0                                                                 */
  DMACH1_IRQn               =   5,              /*!< 5  DMACH1                                                                 */
  DMACH2_IRQn               =   6,              /*!< 6  DMACH2                                                                 */
  DMACH3_IRQn               =   7,              /*!< 7  DMACH3                                                                 */
  DMACH4_IRQn               =   8,              /*!< 8  DMACH4                                                                 */
  DMACH5_IRQn               =   9,              /*!< 9  DMACH5                                                                 */
  DMACH6_IRQn               =  10,              /*!< 10 DMACH6                                                                 */
  DMACH7_IRQn               =  11,              /*!< 11 DMACH7                                                                 */
  DMACH8_IRQn               =  12,              /*!< 12 DMACH8                                                                 */
  DMACH9_IRQn               =  13,              /*!< 13 DMACH9                                                                 */
  DMACH10_IRQn              =  14,              /*!< 14 DMACH10                                                                */
  DMACH11_IRQn              =  15,              /*!< 15 DMACH11                                                                */
  DMACH12_IRQn              =  16,              /*!< 16 DMACH12                                                                */
  DMACH13_IRQn              =  17,              /*!< 17 DMACH13                                                                */
  DMACH14_IRQn              =  18,              /*!< 18 DMACH14                                                                */
  DMACH15_IRQn              =  19,              /*!< 19 DMACH15                                                                */
  TIMER0L_IRQn              =  20,              /*!< 20 TIMER0L                                                                */
  TIMER0H_IRQn              =  21,              /*!< 21 TIMER0H                                                                */
  TIMER1L_IRQn              =  22,              /*!< 22 TIMER1L                                                                */
  TIMER1H_IRQn              =  23,              /*!< 23 TIMER1H                                                                */
  EPCA0_IRQn                =  24,              /*!< 24 EPCA0                                                                  */
  PCA0_IRQn                 =  25,              /*!< 25 PCA0                                                                   */
  PCA1_IRQn                 =  26,              /*!< 26 PCA1                                                                   */
  USART0_IRQn               =  27,              /*!< 27 USART0                                                                 */
  USART1_IRQn               =  28,              /*!< 28 USART1                                                                 */
  SPI0_IRQn                 =  29,              /*!< 29 SPI0                                                                   */
  SPI1_IRQn                 =  30,              /*!< 30 SPI1                                                                   */
  SPI2_IRQn                 =  31,              /*!< 31 SPI2                                                                   */
  I2C0_IRQn                 =  32,              /*!< 32 I2C0                                                                   */
  I2C1_IRQn                 =  33,              /*!< 33 I2C1                                                                   */
  USB0_IRQn                 =  34,              /*!< 34 USB0                                                                   */
  SARADC0_IRQn              =  35,              /*!< 35 SARADC0                                                                */
  SARADC1_IRQn              =  36,              /*!< 36 SARADC1                                                                */
  CMP0_IRQn                 =  37,              /*!< 37 CMP0                                                                   */
  CMP1_IRQn                 =  38,              /*!< 38 CMP1                                                                   */
  CAPSENSE0_IRQn            =  39,              /*!< 39 CAPSENSE0                                                              */
  I2S0RX_IRQn               =  40,              /*!< 40 I2S0RX                                                                 */
  I2S0TX_IRQn               =  41,              /*!< 41 I2S0TX                                                                 */
  AES0_IRQn                 =  42,              /*!< 42 AES0                                                                   */
  VDDLOW_IRQn               =  43,              /*!< 43 VDDLOW                                                                 */
  RTCFAIL_IRQn              =  44,              /*!< 44 RTCFAIL                                                                */
  PMATCH0_IRQn              =  45,              /*!< 45 PMATCH0                                                                */
  UART0_IRQn                =  46,              /*!< 46 UART0                                                                  */
  UART1_IRQn                =  47,              /*!< 47 UART1                                                                  */
  IDAC0_IRQn                =  48,              /*!< 48 IDAC0                                                                  */
  IDAC1_IRQn                =  49,              /*!< 49 IDAC1                                                                  */
  LPTIMER0_IRQn             =  50,              /*!< 50 LPTIMER0                                                               */
  PLL_IRQn                  =  51,              /*!< 51 PLL                                                                    */
  VREGDROPOUT_IRQn          =  52,              /*!< 52 VREGDROPOUT                                                            */
  VREGLOW_IRQn              =  53               /*!< 53 VREGLOW                                                                */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

