chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================  Configuration of the ARM Cortex-M3 Processor and Core Peripherals  =========================== */
#define __CM3_REV                 0x0200U       /*!< CM3 Core Revision                                                         */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  0        /*!< MPU present or not                                                        */
#define __FPU_PRESENT                  0        /*!< FPU present or not                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                           /*!< ARM Cortex-M3 processor and core peripherals                              */
#include "system_sim3u.h"                       /*!< SIM3U167_B System                                                         */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                              Device Specific Cluster Section                              ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_clusters
  * @{
  */


/**
  * @brief UART_DATA [DATA] (FIFO Input/Output Data)
  */
typedef struct {
  union {
    __IOM uint32_t U32;                         /*!< (@ 0x00000000) FIFO Data U32.                                             */
    __IOM uint16_t U16;                         /*!< (@ 0x00000000) FIFO Data U16.                                             */
    __IOM uint8_t U8;                           /*!< (@ 0x00000000) FIFO Data U8.                                              */
  };
} UART_DATA_Type;                               /*!< Size = 4 (0x4)                                                            */


/** @} */ /* End of group Device_Peripheral_clusters */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         SARADC_0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (SARADC_0)
  */

typedef struct {                                /*!< (@ 0x4001A000) SARADC_0 Structure                                         */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Configuration                                       */
    
    struct {
      __IOM uint32_t SPSEL      : 4;            /*!< [3..0] Sampling Phase Select.                                             */
      __IOM uint32_t SPEN       : 1;            /*!< [4..4] Sampling Phase Enable.                                             */
      __IOM uint32_t SSGEN      : 1;            /*!< [5..5] Synchronous Sample Generator Enable.                               */
      __IOM uint32_t PACKMD     : 2;            /*!< [7..6] Output Packing Mode.                                               */
      __IOM uint32_t SIMCEN     : 1;            /*!< [8..8] Simultaneous Conversion Packing Enable.                            */
      __IOM uint32_t INTLVEN    : 1;            /*!< [9..9] Interleaved Conversion Packing Enable.                             */
      __IOM uint32_t SCANEN     : 1;            /*!< [10..10] Scan Mode Enable.                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t SCANMD     : 1;            /*!< [12..12] Scan Mode Select.                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t DMAEN      : 1;            /*!< [14..14] DMA Interface Enable .                                           */
      __IOM uint32_t BCLKSEL    : 1;            /*!< [15..15] Burst Mode Clock Select.                                         */
      __IOM uint32_t CLKDIV     : 11;           /*!< [26..16] SAR Clock Divider.                                               */
      __IOM uint32_t SCCIEN     : 1;            /*!< [27..27] Single Conversion Complete Interrupt Enable.                     */
      __IOM uint32_t SDIEN      : 1;            /*!< [28..28] Scan Done Interrupt Enable.                                      */
      __IOM uint32_t FORIEN     : 1;            /*!< [29..29] FIFO Overrun Interrupt Enable.                                   */
      __IOM uint32_t FURIEN     : 1;            /*!< [30..30] FIFO Underrun Interrupt Enable.                                  */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Measurement Control                                        */
    
