chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CHR0GN     : 1;            /*!< [0..0] Conversion Characteristic 0 Gain.                                  */
      __IOM uint32_t CHR0RPT    : 3;            /*!< [3..1] Conversion Characteristic 0 Repeat Counter.                        */
      __IOM uint32_t CHR0LS     : 3;            /*!< [6..4] Conversion Characteristic 0 Left-Shift Bits.                       */
      __IOM uint32_t CHR0RSEL   : 1;            /*!< [7..7] Conversion Characteristic 0 Resolution Selection.                  */
      __IOM uint32_t CHR0WCIEN  : 1;            /*!< [8..8] Conversion Characteristic 0 Window Comparator Interrupt
                                                     Enable.                                                                   */
      __IM  uint32_t            : 7;
      __IOM uint32_t CHR1GN     : 1;            /*!< [16..16] Conversion Characteristic 1 Gain.                                */
      __IOM uint32_t CHR1RPT    : 3;            /*!< [19..17] Conversion Characteristic 1 Repeat Counter.                      */
      __IOM uint32_t CHR1LS     : 3;            /*!< [22..20] Conversion Characteristic 1 Left-Shift Bits.                     */
      __IOM uint32_t CHR1RSEL   : 1;            /*!< [23..23] Conversion Characteristic 1 Resolution Selection.                */
      __IOM uint32_t CHR1WCIEN  : 1;            /*!< [24..24] Conversion Characteristic 1 Window Comparator Interrupt
                                                     Enable.                                                                   */
    } bit;
  } CHAR10;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Output Data Word                                           */
    
    struct {
      __IM  uint32_t DATA       : 32;           /*!< [31..0] Output Data Word.                                                 */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Window Comparator Limits                                   */
    
    struct {
      __IOM uint32_t WCLT       : 16;           /*!< [15..0] Less-Than Window Comparator Limit.                                */
      __IOM uint32_t WCGT       : 16;           /*!< [31..16] Greater-Than Window Comparator Limit.                            */
    } bit;
  } WCLIMITS;
  __IM  uint32_t  RESERVED7[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Accumulator Initial Value                                  */
    
    struct {
      __OM  uint32_t ACC        : 16;           /*!< [15..0] Accumulator Initial Value.                                        */
    } bit;
  } ACC;
  __IM  uint32_t  RESERVED8[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Module Status                                              */
    
    struct {
      __IOM uint32_t WCI        : 1;            /*!< [0..0] Window Compare Interrupt.                                          */
      __IOM uint32_t SCCI       : 1;            /*!< [1..1] Single Conversion Complete Interrupt.                              */
      __IOM uint32_t SDI        : 1;            /*!< [2..2] Scan Done Interrupt.                                               */
      __IOM uint32_t FORI       : 1;            /*!< [3..3] FIFO Overrun Interrupt.                                            */
      __IOM uint32_t FURI       : 1;            /*!< [4..4] FIFO Underrun Interrupt.                                           */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED9[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) FIFO Status                                                */
    
    struct {
      __IM  uint32_t FIFOLVL    : 4;            /*!< [3..0] FIFO Level.                                                        */
      __IM  uint32_t DPSTS      : 1;            /*!< [4..4] Data Packing Status.                                               */
      __IM  uint32_t DRDYF      : 1;            /*!< [5..5] Data Ready Flag.                                                   */
    } bit;
  } FIFOSTATUS;
} SARADC_0_Type;                                /*!< Size = 164 (0xa4)                                                         */



/* =========================================================================================================================== */
/* ================                                         SARADC_1                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (SARADC_1)
  */

typedef struct {                                /*!< (@ 0x4001B000) SARADC_1 Structure                                         */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Configuration                                       */
    
    struct {
      __IOM uint32_t SPSEL      : 4;            /*!< [3..0] Sampling Phase Select.                                             */
      __IOM uint32_t SPEN       : 1;            /*!< [4..4] Sampling Phase Enable.                                             */
      __IOM uint32_t SSGEN      : 1;            /*!< [5..5] Synchronous Sample Generator Enable.                               */
      __IOM uint32_t PACKMD     : 2;            /*!< [7..6] Output Packing Mode.                                               */
      __IOM uint32_t SIMCEN     : 1;            /*!< [8..8] Simultaneous Conversion Packing Enable.                            */
      __IOM uint32_t INTLVEN    : 1;            /*!< [9..9] Interleaved Conversion Packing Enable.                             */
      __IOM uint32_t SCANEN     : 1;            /*!< [10..10] Scan Mode Enable.                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t SCANMD     : 1;            /*!< [12..12] Scan Mode Select.                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t DMAEN      : 1;            /*!< [14..14] DMA Interface Enable .                                           */
      __IOM uint32_t BCLKSEL    : 1;            /*!< [15..15] Burst Mode Clock Select.                                         */
      __IOM uint32_t CLKDIV     : 11;           /*!< [26..16] SAR Clock Divider.                                               */
      __IOM uint32_t SCCIEN     : 1;            /*!< [27..27] Single Conversion Complete Interrupt Enable.                     */
      __IOM uint32_t SDIEN      : 1;            /*!< [28..28] Scan Done Interrupt Enable.                                      */
      __IOM uint32_t FORIEN     : 1;            /*!< [29..29] FIFO Overrun Interrupt Enable.                                   */
      __IOM uint32_t FURIEN     : 1;            /*!< [30..30] FIFO Underrun Interrupt Enable.                                  */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Measurement Control                                        */
    
