chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t REFGNDSEL  : 1;            /*!< [0..0] Reference Ground Select.                                           */
      __IOM uint32_t CLKESEL    : 1;            /*!< [1..1] Sampling Clock Edge Select.                                        */
      __IOM uint32_t BMTK       : 6;            /*!< [7..2] Burst Mode Tracking Time.                                          */
      __IOM uint32_t SCSEL      : 4;            /*!< [11..8] Start-Of-Conversion Source Select.                                */
      __IOM uint32_t PWRTIME    : 4;            /*!< [15..12] Burst Mode Power Up Time.                                        */
      __IOM uint32_t BURSTEN    : 1;            /*!< [16..16] Burst Mode Enable.                                               */
      __IOM uint32_t ADCEN      : 1;            /*!< [17..17] ADC Enable.                                                      */
      __IOM uint32_t AD12BSSEL  : 1;            /*!< [18..18] 12-Bit Mode Sample Select.                                       */
      __IOM uint32_t VCMEN      : 1;            /*!< [19..19] Common Mode Buffer Enable.                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t ACCMD      : 1;            /*!< [21..21] Accumulation Mode.                                               */
      __IOM uint32_t TRKMD      : 1;            /*!< [22..22] ADC Tracking Mode.                                               */
      __IOM uint32_t ADBUSY     : 1;            /*!< [23..23] ADC Busy.                                                        */
      __IOM uint32_t BIASSEL    : 2;            /*!< [25..24] Bias Power Select.                                               */
      __IOM uint32_t LPMDEN     : 1;            /*!< [26..26] Low Power Mode Enable.                                           */
      __IOM uint32_t MREFLPEN   : 1;            /*!< [27..27] MUX and VREF Low Power Enable.                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t VREFSEL    : 2;            /*!< [31..30] Voltage Reference Select.                                        */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Channel Sequencer Time Slots 4-7 Setup                     */
    
    struct {
      __IOM uint32_t TS4CHR     : 2;            /*!< [1..0] Time Slot 4 Conversion Characteristic.                             */
      __IOM uint32_t TS4MUX     : 5;            /*!< [6..2] Time Slot 4 Input Channel.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS5CHR     : 2;            /*!< [9..8] Time Slot 5 Conversion Characteristic.                             */
      __IOM uint32_t TS5MUX     : 5;            /*!< [14..10] Time Slot 5 Input Channel.                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS6CHR     : 2;            /*!< [17..16] Time Slot 6 Conversion Characteristic.                           */
      __IOM uint32_t TS6MUX     : 5;            /*!< [22..18] Time Slot 6 Input Channel.                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS7CHR     : 2;            /*!< [25..24] Time Slot 7 Conversion Characteristic.                           */
      __IOM uint32_t TS7MUX     : 5;            /*!< [30..26] Time Slot 7 Input Channel.                                       */
    } bit;
  } SQ7654;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Channel Sequencer Time Slots 0-3 Setup                     */
    
    struct {
      __IOM uint32_t TS0CHR     : 2;            /*!< [1..0] Time Slot 0 Conversion Characteristic.                             */
      __IOM uint32_t TS0MUX     : 5;            /*!< [6..2] Time Slot 0 Input Channel.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS1CHR     : 2;            /*!< [9..8] Time Slot 1 Conversion Characteristic.                             */
      __IOM uint32_t TS1MUX     : 5;            /*!< [14..10] Time Slot 1 Input Channel.                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS2CHR     : 2;            /*!< [17..16] Time Slot 2 Conversion Characteristic.                           */
      __IOM uint32_t TS2MUX     : 5;            /*!< [22..18] Time Slot 2 Input Channel.                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS3CHR     : 2;            /*!< [25..24] Time Slot 3 Conversion Characteristic.                           */
      __IOM uint32_t TS3MUX     : 5;            /*!< [30..26] Time Slot 3 Input Channel.                                       */
    } bit;
  } SQ3210;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Conversion Characteristic 2 and 3 Setup                    */
    
    struct {
      __IOM uint32_t CHR2GN     : 1;            /*!< [0..0] Conversion Characteristic 2 Gain.                                  */
      __IOM uint32_t CHR2RPT    : 3;            /*!< [3..1] Conversion Characteristic 2 Repeat Counter.                        */
      __IOM uint32_t CHR2LS     : 3;            /*!< [6..4] Conversion Characteristic 2 Left-Shift Bits.                       */
      __IOM uint32_t CHR2RSEL   : 1;            /*!< [7..7] Conversion Characteristic 2 Resolution Selection.                  */
      __IOM uint32_t CHR2WCIEN  : 1;            /*!< [8..8] Conversion Characteristic 2 Window Comparator Interrupt
                                                     Enable.                                                                   */
      __IM  uint32_t            : 7;
      __IOM uint32_t CHR3GN     : 1;            /*!< [16..16] Conversion Characteristic 3 Gain.                                */
      __IOM uint32_t CHR3RPT    : 3;            /*!< [19..17] Conversion Characteristic 3 Repeat Counter.                      */
      __IOM uint32_t CHR3LS     : 3;            /*!< [22..20] Conversion Characteristic 3 Left-Shift Bits.                     */
      __IOM uint32_t CHR3RSEL   : 1;            /*!< [23..23] Conversion Characteristic 3 Resolution Selection.                */
      __IOM uint32_t CHR3WCIEN  : 1;            /*!< [24..24] Conversion Characteristic 3 Window Comparator Interrupt
                                                     Enable.                                                                   */
    } bit;
  } CHAR32;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Conversion Characteristic 0 and 1 Setup                    */
    
