chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CHR0GN     : 1;            /*!< [0..0] Conversion Characteristic 0 Gain.                                  */
      __IOM uint32_t CHR0RPT    : 3;            /*!< [3..1] Conversion Characteristic 0 Repeat Counter.                        */
      __IOM uint32_t CHR0LS     : 3;            /*!< [6..4] Conversion Characteristic 0 Left-Shift Bits.                       */
      __IOM uint32_t CHR0RSEL   : 1;            /*!< [7..7] Conversion Characteristic 0 Resolution Selection.                  */
      __IOM uint32_t CHR0WCIEN  : 1;            /*!< [8..8] Conversion Characteristic 0 Window Comparator Interrupt
                                                     Enable.                                                                   */
      __IM  uint32_t            : 7;
      __IOM uint32_t CHR1GN     : 1;            /*!< [16..16] Conversion Characteristic 1 Gain.                                */
      __IOM uint32_t CHR1RPT    : 3;            /*!< [19..17] Conversion Characteristic 1 Repeat Counter.                      */
      __IOM uint32_t CHR1LS     : 3;            /*!< [22..20] Conversion Characteristic 1 Left-Shift Bits.                     */
      __IOM uint32_t CHR1RSEL   : 1;            /*!< [23..23] Conversion Characteristic 1 Resolution Selection.                */
      __IOM uint32_t CHR1WCIEN  : 1;            /*!< [24..24] Conversion Characteristic 1 Window Comparator Interrupt
                                                     Enable.                                                                   */
    } bit;
  } CHAR10;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Output Data Word                                           */
    
    struct {
      __IM  uint32_t DATA       : 32;           /*!< [31..0] Output Data Word.                                                 */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Window Comparator Limits                                   */
    
    struct {
      __IOM uint32_t WCLT       : 16;           /*!< [15..0] Less-Than Window Comparator Limit.                                */
      __IOM uint32_t WCGT       : 16;           /*!< [31..16] Greater-Than Window Comparator Limit.                            */
    } bit;
  } WCLIMITS;
  __IM  uint32_t  RESERVED7[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Accumulator Initial Value                                  */
    
    struct {
      __OM  uint32_t ACC        : 16;           /*!< [15..0] Accumulator Initial Value.                                        */
    } bit;
  } ACC;
  __IM  uint32_t  RESERVED8[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Module Status                                              */
    
    struct {
      __IOM uint32_t WCI        : 1;            /*!< [0..0] Window Compare Interrupt.                                          */
      __IOM uint32_t SCCI       : 1;            /*!< [1..1] Single Conversion Complete Interrupt.                              */
      __IOM uint32_t SDI        : 1;            /*!< [2..2] Scan Done Interrupt.                                               */
      __IOM uint32_t FORI       : 1;            /*!< [3..3] FIFO Overrun Interrupt.                                            */
      __IOM uint32_t FURI       : 1;            /*!< [4..4] FIFO Underrun Interrupt.                                           */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED9[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) FIFO Status                                                */
    
    struct {
      __IM  uint32_t FIFOLVL    : 4;            /*!< [3..0] FIFO Level.                                                        */
      __IM  uint32_t DPSTS      : 1;            /*!< [4..4] Data Packing Status.                                               */
      __IM  uint32_t DRDYF      : 1;            /*!< [5..5] Data Ready Flag.                                                   */
    } bit;
  } FIFOSTATUS;
} SARADC_1_Type;                                /*!< Size = 164 (0xa4)                                                         */



/* =========================================================================================================================== */
/* ================                                           AES_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (AES_0)
  */

typedef struct {                                /*!< (@ 0x40027000) AES_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t XFRSTA     : 1;            /*!< [0..0] AES Transfer Start.                                                */
      __IOM uint32_t KEYCPEN    : 1;            /*!< [1..1] Key Capture Enable.                                                */
      __IOM uint32_t EDMD       : 1;            /*!< [2..2] Encryption/Decryption Mode.                                        */
      __IM  uint32_t            : 5;
      __IOM uint32_t SWMDEN     : 1;            /*!< [8..8] Software Mode Enable.                                              */
      __IOM uint32_t BEN        : 1;            /*!< [9..9] Bypass AES Operation Enable.                                       */
      __IOM uint32_t XOREN      : 2;            /*!< [11..10] XOR Enable.                                                      */
      __IOM uint32_t HCTREN     : 1;            /*!< [12..12] Hardware Counter Mode Enable.                                    */
      __IOM uint32_t HCBCEN     : 1;            /*!< [13..13] Hardware Cipher-Block Chaining Mode Enable.                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t KEYSIZE    : 2;            /*!< [17..16] Keystore Size Select.                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t ERRIEN     : 1;            /*!< [24..24] Error Interrupt Enable.                                          */
      __IOM uint32_t OCIEN      : 1;            /*!< [25..25] Operation Complete Interrupt Enable.                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t DBGMD      : 1;            /*!< [30..30] AES Debug Mode.                                                  */
      __IOM uint32_t RESET      : 1;            /*!< [31..31] Module Soft Reset.                                               */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Number of Blocks                                           */
    
