chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t XFRSIZE    : 11;           /*!< [10..0] Transfer Size.                                                    */
    } bit;
  } XFRSIZE;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Input/Output Data FIFO Access                              */
    
    struct {
      __IOM uint32_t DATAFIFO   : 32;           /*!< [31..0] Input/Output Data FIFO Access.                                    */
    } bit;
  } DATAFIFO;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) XOR Data FIFO Access                                       */
    
    struct {
      __IOM uint32_t XORFIFO    : 32;           /*!< [31..0] XOR Data FIFO Access.                                             */
    } bit;
  } XORFIFO;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Hardware Key Word 0                                        */
    
    struct {
      __IOM uint32_t HWKEY0     : 32;           /*!< [31..0] Hardware Key Word 0.                                              */
    } bit;
  } HWKEY0;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Hardware Key Word 1                                        */
    
    struct {
      __IOM uint32_t HWKEY1     : 32;           /*!< [31..0] Hardware Key Word 1.                                              */
    } bit;
  } HWKEY1;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Hardware Key Word 2                                        */
    
    struct {
      __IOM uint32_t HWKEY2     : 32;           /*!< [31..0] Hardware Key Word 2.                                              */
    } bit;
  } HWKEY2;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Hardware Key Word 3                                        */
    
    struct {
      __IOM uint32_t HWKEY3     : 32;           /*!< [31..0] Hardware Key Word 3.                                              */
    } bit;
  } HWKEY3;
  __IM  uint32_t  RESERVED7[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Hardware Key Word 4                                        */
    
    struct {
      __IOM uint32_t HWKEY4     : 32;           /*!< [31..0] Hardware Key Word 4.                                              */
    } bit;
  } HWKEY4;
  __IM  uint32_t  RESERVED8[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Hardware Key Word 5                                        */
    
    struct {
      __IOM uint32_t HWKEY5     : 32;           /*!< [31..0] Hardware Key Word 5.                                              */
    } bit;
  } HWKEY5;
  __IM  uint32_t  RESERVED9[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Hardware Key Word 6                                        */
    
    struct {
      __IOM uint32_t HWKEY6     : 32;           /*!< [31..0] Hardware Key Word 6.                                              */
    } bit;
  } HWKEY6;
  __IM  uint32_t  RESERVED10[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Hardware Key Word 7                                        */
    
    struct {
      __IOM uint32_t HWKEY7     : 32;           /*!< [31..0] Hardware Key Word 7.                                              */
    } bit;
  } HWKEY7;
  __IM  uint32_t  RESERVED11[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C0) Hardware Counter Word 0                                    */
    
    struct {
      __IOM uint32_t HWCTR0     : 32;           /*!< [31..0] Hardware Counter Word 0.                                          */
    } bit;
  } HWCTR0;
  __IM  uint32_t  RESERVED12[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D0) Hardware Counter Word 1                                    */
    
    struct {
      __IOM uint32_t HWCTR1     : 32;           /*!< [31..0] Hardware Counter Word 1.                                          */
    } bit;
  } HWCTR1;
  __IM  uint32_t  RESERVED13[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E0) Hardware Counter Word 2                                    */
    
    struct {
      __IOM uint32_t HWCTR2     : 32;           /*!< [31..0] Hardware Counter Word 2.                                          */
    } bit;
  } HWCTR2;
  __IM  uint32_t  RESERVED14[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F0) Hardware Counter Word 3                                    */
    
    struct {
      __IOM uint32_t HWCTR3     : 32;           /*!< [31..0] Hardware Counter Word 3.                                          */
    } bit;
  } HWCTR3;
  __IM  uint32_t  RESERVED15[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000100) Module Status                                              */
    
    struct {
      __IM  uint32_t DURF       : 1;            /*!< [0..0] Input/Output Data FIFO Underrun Flag.                              */
      __IM  uint32_t DORF       : 1;            /*!< [1..1] Input/Output Data FIFO Overrun Flag.                               */
      __IM  uint32_t XORF       : 1;            /*!< [2..2] XOR Data FIFO Overrun Flag.                                        */
      __IM  uint32_t            : 1;
      __IM  uint32_t DFIFOLVL   : 3;            /*!< [6..4] Input/Output Data FIFO Level.                                      */
      __IM  uint32_t            : 1;
      __IM  uint32_t XFIFOLVL   : 3;            /*!< [10..8] XOR Data FIFO Level.                                              */
      __IM  uint32_t            : 5;
      __IM  uint32_t BUSYF      : 1;            /*!< [16..16] Module Busy Flag.                                                */
      __IM  uint32_t            : 13;
      __IOM uint32_t ERRI       : 1;            /*!< [30..30] Error Interrupt Flag.                                            */
      __IOM uint32_t OCI        : 1;            /*!< [31..31] Operation Complete Interrupt Flag.                               */
    } bit;
  } STATUS;
} AES_0_Type;                                   /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                           CRC_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (CRC_0)
  */

typedef struct {                                /*!< (@ 0x40028000) CRC_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
