chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __OM  uint32_t SINITEN    : 1;            /*!< [0..0] Seed Initialization Enable.                                        */
      __OM  uint32_t SEED       : 1;            /*!< [1..1] Seed Setting.                                                      */
      __IOM uint32_t CRCEN      : 1;            /*!< [2..2] CRC Enable.                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t POLYSEL    : 2;            /*!< [5..4] Polynomial Selection.                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t BMDEN      : 1;            /*!< [8..8] Byte Mode Enable.                                                  */
      __IOM uint32_t BBREN      : 1;            /*!< [9..9] Byte-Level Bit Reversal Enable.                                    */
      __IOM uint32_t ORDER      : 2;            /*!< [11..10] Input Processing Order.                                          */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Input/Result Data                                          */
    
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Input/Result Data.                                                */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Bit-Reversed Output Data                                   */
    
    struct {
      __IM  uint32_t RDATA      : 32;           /*!< [31..0] Bit-Reversed Output Data.                                         */
    } bit;
  } RDATA;
} CRC_0_Type;                                   /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                        CAPSENSE_0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief None (CAPSENSE_0)
  */

typedef struct {                                /*!< (@ 0x40023000) CAPSENSE_0 Structure                                       */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t BUSYF      : 1;            /*!< [0..0] Start and Busy Flag.                                               */
      __IOM uint32_t CSEN       : 1;            /*!< [1..1] Module Enable.                                                     */
      __IOM uint32_t BIASEN     : 1;            /*!< [2..2] Bias Enable.                                                       */
      __IOM uint32_t CMPPOL     : 1;            /*!< [3..3] Digital Comparator Polarity Select.                                */
      __IOM uint32_t CMD        : 2;            /*!< [5..4] Conversion Mode Select.                                            */
      __IOM uint32_t CNVR       : 2;            /*!< [7..6] Conversion Rate.                                                   */
      __IOM uint32_t ACCMD      : 3;            /*!< [10..8] Accumulator Mode Select.                                          */
      __IOM uint32_t MCEN       : 1;            /*!< [11..11] Multiple Channel Enable.                                         */
      __IOM uint32_t CSCM       : 4;            /*!< [15..12] Start of Conversion Mode Select.                                 */
      __IOM uint32_t PMMD       : 2;            /*!< [17..16] Pin Monitor Mode.                                                */
      __IOM uint32_t PMEF       : 1;            /*!< [18..18] Pin Monitor Event Flag.                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CMPEN      : 1;            /*!< [20..20] Threshold Comparator Enable.                                     */
      __IOM uint32_t CDIEN      : 1;            /*!< [21..21] Conversion Done Interrupt Enable.                                */
      __IOM uint32_t EOSIEN     : 1;            /*!< [22..22] End-of-Scan Interrupt Enable.                                    */
      __IM  uint32_t            : 1;
      __IM  uint32_t CMPI       : 1;            /*!< [24..24] Threshold Comparator Interrupt Flag.                             */
      __IOM uint32_t CDI        : 1;            /*!< [25..25] Conversion Done Interrupt Flag.                                  */
      __IM  uint32_t EOSI       : 1;            /*!< [26..26] End-of-Scan Interrupt Flag.                                      */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Measurement Mode                                           */
    
    struct {
      __IOM uint32_t CGSEL      : 3;            /*!< [2..0] Capacitance Gain Select.                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t DRSEL      : 2;            /*!< [5..4] Double Reset Select.                                               */
      __IOM uint32_t RAMPSEL    : 2;            /*!< [7..6] Ramp Selection.                                                    */
      __IOM uint32_t IASEL      : 3;            /*!< [10..8] Output Current Select.                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t DTSEL      : 3;            /*!< [14..12] Discharge Time Select.                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t LPFSEL     : 3;            /*!< [18..16] Low Pass Filter Select.                                          */
    } bit;
  } MODE;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Measurement Data                                           */
    
