chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t DATA       : 16;           /*!< [15..0] Capacitive Sensing Data.                                          */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Channel Scan Enable                                        */
    
    struct {
      __IOM uint32_t SCANEN     : 16;           /*!< [15..0] Channel Scan Enable.                                              */
    } bit;
  } SCAN;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Compare Threshold                                          */
    
    struct {
      __IOM uint32_t CSTH       : 16;           /*!< [15..0] Compare Threshold.                                                */
    } bit;
  } CSTH;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Mux Channel Select                                         */
    
    struct {
      __IOM uint32_t CSMX       : 4;            /*!< [3..0] Mux Channel Select.                                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t CSDISC     : 1;            /*!< [7..7] Channel Disconnect.                                                */
    } bit;
  } MUX;
} CAPSENSE_0_Type;                              /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                         CLKCTRL_0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief None (CLKCTRL_0)
  */

typedef struct {                                /*!< (@ 0x4002D000) CLKCTRL_0 Structure                                        */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t AHBSEL     : 3;            /*!< [2..0] AHB Clock Source Select.                                           */
      __IM  uint32_t            : 5;
      __IOM uint32_t AHBDIV     : 3;            /*!< [10..8] AHB Clock Divider.                                                */
      __IM  uint32_t            : 5;
      __IOM uint32_t APBDIV     : 1;            /*!< [16..16] APB Clock Divider.                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t EXTESEL    : 1;            /*!< [28..28] External Clock Edge Select.                                      */
      __IM  uint32_t OBUSYF     : 1;            /*!< [29..29] Oscillators Busy Flag.                                           */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) AHB Clock Gate                                             */
    
    struct {
      __IOM uint32_t RAMCEN     : 1;            /*!< [0..0] RAM Clock Enable.                                                  */
      __IOM uint32_t DMACEN     : 1;            /*!< [1..1] DMA Controller Clock Enable.                                       */
      __IOM uint32_t FLASHCEN   : 1;            /*!< [2..2] Flash Clock Enable.                                                */
      __IOM uint32_t EMIF0CEN   : 1;            /*!< [3..3] EMIF Clock Enable.                                                 */
      __IOM uint32_t USB0BCEN   : 1;            /*!< [4..4] USB0 Buffer Clock Enable.                                          */
    } bit;
  } AHBCLKG;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) APB Clock Gate 0                                           */
    
    struct {
      __IOM uint32_t PLL0CEN    : 1;            /*!< [0..0] PLL Module Clock Enable.                                           */
      __IOM uint32_t PB0CEN     : 1;            /*!< [1..1] Port Bank Module Clock Enable.                                     */
      __IOM uint32_t USART0CEN  : 1;            /*!< [2..2] USART0 Module Clock Enable.                                        */
      __IOM uint32_t USART1CEN  : 1;            /*!< [3..3] USART1 Module Clock Enable.                                        */
      __IOM uint32_t UART0CEN   : 1;            /*!< [4..4] UART0 Module Clock Enable.                                         */
      __IOM uint32_t UART1CEN   : 1;            /*!< [5..5] UART1 Module Clock Enable.                                         */
      __IOM uint32_t SPI0CEN    : 1;            /*!< [6..6] SPI0 Module Clock Enable.                                          */
      __IOM uint32_t SPI1CEN    : 1;            /*!< [7..7] SPI1 Module Clock Enable.                                          */
      __IOM uint32_t SPI2CEN    : 1;            /*!< [8..8] SPI2 Module Clock Enable.                                          */
      __IOM uint32_t I2C0CEN    : 1;            /*!< [9..9] I2C0 Module Clock Enable.                                          */
      __IOM uint32_t I2C1CEN    : 1;            /*!< [10..10] I2C1 Module Clock Enable.                                        */
      __IOM uint32_t EPCA0CEN   : 1;            /*!< [11..11] EPCA0 Module Clock Enable.                                       */
      __IOM uint32_t PCA0CEN    : 1;            /*!< [12..12] PCA0 Module Clock Enable.                                        */
      __IOM uint32_t PCA1CEN    : 1;            /*!< [13..13] PCA1 Module Clock Enable.                                        */
      __IOM uint32_t SSG0CEN    : 1;            /*!< [14..14] SSG0 Module Clock Enable.                                        */
      __IOM uint32_t TIMER0CEN  : 1;            /*!< [15..15] TIMER0 Module Clock Enable.                                      */
      __IOM uint32_t TIMER1CEN  : 1;            /*!< [16..16] TIMER1 Module Clock Enable.                                      */
      __IOM uint32_t ADC0CEN    : 1;            /*!< [17..17] SARADC0 Module Clock Enable.                                     */
      __IOM uint32_t ADC1CEN    : 1;            /*!< [18..18] SARADC1 Module Clock Enable.                                     */
      __IOM uint32_t CMP0CEN    : 1;            /*!< [19..19] Comparator 0 Module Clock Enable.                                */
      __IOM uint32_t CMP1CEN    : 1;            /*!< [20..20] Comparator 1 Module Clock Enable.                                */
      __IOM uint32_t CS0CEN     : 1;            /*!< [21..21] Capacitive Sensing (CAPSENSE0) Module Clock Enable.              */
      __IOM uint32_t AES0CEN    : 1;            /*!< [22..22] AES0 Module Clock Enable.                                        */
      __IOM uint32_t CRC0CEN    : 1;            /*!< [23..23] CRC0 Module Clock Enable.                                        */
      __IOM uint32_t IDAC0CEN   : 1;            /*!< [24..24] IDAC0 Module Clock Enable.                                       */
      __IOM uint32_t IDAC1CEN   : 1;            /*!< [25..25] IDAC1 Module Clock Enable.                                       */
      __IOM uint32_t LPT0CEN    : 1;            /*!< [26..26] Low Power Timer (LPTIMER0) Module Clock Enable.                  */
      __IOM uint32_t I2S0CEN    : 1;            /*!< [27..27] I2S0 Module Clock Enable.                                        */
      __IOM uint32_t USB0CEN    : 1;            /*!< [28..28] USB0 Module Clock Enable.                                        */
      __IOM uint32_t EVREGCEN   : 1;            /*!< [29..29] External Regulator Clock Enable.                                 */
      __IOM uint32_t FLCTRLCEN  : 1;            /*!< [30..30] Flash Controller Clock Enable.                                   */
    } bit;
  } APBCLKG0;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) APB Clock Gate 1                                           */
    
