chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t MISC0CEN   : 1;            /*!< [0..0] Miscellaneous 0 Clock Enable.                                      */
      __IOM uint32_t MISC1CEN   : 1;            /*!< [1..1] Miscellaneous 1 Clock Enable.                                      */
      __IOM uint32_t MISC2CEN   : 1;            /*!< [2..2] Miscellaneous 2 Clock Enable.                                      */
    } bit;
  } APBCLKG1;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Power Mode 3 Clock Control                                 */
    
    struct {
      __IOM uint32_t PM3CSEL    : 3;            /*!< [2..0] Power Mode 3 Fast-Wake Clock Source.                               */
      __IM  uint32_t            : 13;
      __IOM uint32_t PM3CEN     : 1;            /*!< [16..16] Power Mode 3 Fast-Wake Clock Enable.                             */
    } bit;
  } PM3CN;
} CLKCTRL_0_Type;                               /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                           CMP_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (CMP_0)
  */

typedef struct {                                /*!< (@ 0x4001F000) CMP_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IM  uint32_t            : 13;
      __IOM uint32_t CMPFI      : 1;            /*!< [13..13] Falling Edge Interrupt Flag.                                     */
      __IOM uint32_t CMPRI      : 1;            /*!< [14..14] Rising Edge Interrupt Flag.                                      */
      __IM  uint32_t            : 15;
      __IM  uint32_t CMPOUT     : 1;            /*!< [30..30] Output State.                                                    */
      __IOM uint32_t CMPEN      : 1;            /*!< [31..31] Comparator Enable.                                               */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Input and Module Mode                                      */
    
    struct {
      __IOM uint32_t NMUX       : 4;            /*!< [3..0] Negative Input Select.                                             */
      __IOM uint32_t PMUX       : 4;            /*!< [7..4] Positive Input Select.                                             */
      __IOM uint32_t INMUX      : 2;            /*!< [9..8] Input MUX Select.                                                  */
      __IOM uint32_t CMPMD      : 2;            /*!< [11..10] Comparator Mode.                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t FIEN       : 1;            /*!< [13..13] Falling Edge Interrupt Enable.                                   */
      __IOM uint32_t RIEN       : 1;            /*!< [14..14] Rising Edge Interrupt Enable.                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t DACLVL     : 6;            /*!< [21..16] Comparator DAC Output Level.                                     */
      __IOM uint32_t NWPUEN     : 1;            /*!< [22..22] Negative Input Weak Pullup Enable.                               */
      __IOM uint32_t PWPUEN     : 1;            /*!< [23..23] Positive Input Weak Pullup Enable.                               */
      __IOM uint32_t CMPHYN     : 2;            /*!< [25..24] Negative Hysteresis Control.                                     */
      __IOM uint32_t CMPHYP     : 2;            /*!< [27..26] Positive Hysteresis Control.                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t INVEN      : 1;            /*!< [30..30] Invert Comparator Output Enable.                                 */
    } bit;
  } MODE;
} CMP_0_Type;                                   /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           CMP_1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (CMP_1)
  */

typedef struct {                                /*!< (@ 0x40020000) CMP_1 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IM  uint32_t            : 13;
      __IOM uint32_t CMPFI      : 1;            /*!< [13..13] Falling Edge Interrupt Flag.                                     */
      __IOM uint32_t CMPRI      : 1;            /*!< [14..14] Rising Edge Interrupt Flag.                                      */
      __IM  uint32_t            : 15;
      __IM  uint32_t CMPOUT     : 1;            /*!< [30..30] Output State.                                                    */
      __IOM uint32_t CMPEN      : 1;            /*!< [31..31] Comparator Enable.                                               */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Input and Module Mode                                      */
    
    struct {
      __IOM uint32_t NMUX       : 4;            /*!< [3..0] Negative Input Select.                                             */
      __IOM uint32_t PMUX       : 4;            /*!< [7..4] Positive Input Select.                                             */
      __IOM uint32_t INMUX      : 2;            /*!< [9..8] Input MUX Select.                                                  */
      __IOM uint32_t CMPMD      : 2;            /*!< [11..10] Comparator Mode.                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t FIEN       : 1;            /*!< [13..13] Falling Edge Interrupt Enable.                                   */
      __IOM uint32_t RIEN       : 1;            /*!< [14..14] Rising Edge Interrupt Enable.                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t DACLVL     : 6;            /*!< [21..16] Comparator DAC Output Level.                                     */
      __IOM uint32_t NWPUEN     : 1;            /*!< [22..22] Negative Input Weak Pullup Enable.                               */
      __IOM uint32_t PWPUEN     : 1;            /*!< [23..23] Positive Input Weak Pullup Enable.                               */
      __IOM uint32_t CMPHYN     : 2;            /*!< [25..24] Negative Hysteresis Control.                                     */
      __IOM uint32_t CMPHYP     : 2;            /*!< [27..26] Positive Hysteresis Control.                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t INVEN      : 1;            /*!< [30..30] Invert Comparator Output Enable.                                 */
    } bit;
  } MODE;
} CMP_1_Type;                                   /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                         DMACTRL_0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief None (DMACTRL_0)
  */

typedef struct {                                /*!< (@ 0x40036000) DMACTRL_0 Structure                                        */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Controller Status                                          */
    
