chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IM  uint32_t DMAENSTS   : 1;            /*!< [0..0] DMA Enable Status.                                                 */
      __IM  uint32_t            : 3;
      __IM  uint32_t STATE      : 4;            /*!< [7..4] State Machine State.                                               */
      __IM  uint32_t            : 8;
      __IM  uint32_t NUMCHAN    : 5;            /*!< [20..16] Number of Supported DMA Channels.                                */
    } bit;
  } STATUS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Controller Configuration                                   */
    
    struct {
      __OM  uint32_t DMAEN      : 1;            /*!< [0..0] DMA Enable.                                                        */
    } bit;
  } CONFIG;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Base Pointer                                               */
    
    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t BASEPTR    : 27;           /*!< [31..5] Control Base Pointer.                                             */
    } bit;
  } BASEPTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Alternate Base Pointer                                     */
    
    struct {
      __IM  uint32_t ABASEPTR   : 32;           /*!< [31..0] Alternate Control Base Pointer.                                   */
    } bit;
  } ABASEPTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Channel Status                                             */
    
    struct {
      __IM  uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Status.                                                  */
      __IM  uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Status.                                                  */
      __IM  uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Status.                                                  */
      __IM  uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Status.                                                  */
      __IM  uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Status.                                                  */
      __IM  uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Status.                                                  */
      __IM  uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Status.                                                  */
      __IM  uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Status.                                                  */
      __IM  uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Status.                                                  */
      __IM  uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Status.                                                  */
      __IM  uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Status.                                               */
      __IM  uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Status.                                               */
      __IM  uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Status.                                               */
      __IM  uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Status.                                               */
      __IM  uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Status.                                               */
      __IM  uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Status.                                               */
    } bit;
  } CHSTATUS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Channel Software Request Control                           */
    
    struct {
      __OM  uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Software Request.                                        */
      __OM  uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Software Request.                                        */
      __OM  uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Software Request.                                        */
      __OM  uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Software Request.                                        */
      __OM  uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Software Request.                                        */
      __OM  uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Software Request.                                        */
      __OM  uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Software Request.                                        */
      __OM  uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Software Request.                                        */
      __OM  uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Software Request.                                        */
      __OM  uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Software Request.                                        */
      __OM  uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Software Request.                                     */
      __OM  uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Software Request.                                     */
      __OM  uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Software Request.                                     */
      __OM  uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Software Request.                                     */
      __OM  uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Software Request.                                     */
      __OM  uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Software Request.                                     */
    } bit;
  } CHSWRCN;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Channel Request Mask Set                                   */
    
