chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Request Mask Enable.                                     */
      __IOM uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Request Mask Enable.                                     */
      __IOM uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Request Mask Enable.                                     */
      __IOM uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Request Mask Enable.                                     */
      __IOM uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Request Mask Enable.                                     */
      __IOM uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Request Mask Enable.                                     */
      __IOM uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Request Mask Enable.                                     */
      __IOM uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Request Mask Enable.                                     */
      __IOM uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Request Mask Enable.                                     */
      __IOM uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Request Mask Enable.                                     */
      __IOM uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Request Mask Enable.                                  */
      __IOM uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Request Mask Enable.                                  */
      __IOM uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Request Mask Enable.                                  */
      __IOM uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Request Mask Enable.                                  */
      __IOM uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Request Mask Enable.                                  */
      __IOM uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Request Mask Enable.                                  */
    } bit;
  } CHREQMSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Channel Request Mask Clear                                 */
    
    struct {
      __OM  uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Request Mask Disable.                                    */
      __OM  uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Request Mask Disable.                                    */
      __OM  uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Request Mask Disable.                                    */
      __OM  uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Request Mask Disable.                                    */
      __OM  uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Request Mask Disable.                                    */
      __OM  uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Request Mask Disable.                                    */
      __OM  uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Request Mask Disable.                                    */
      __OM  uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Request Mask Disable.                                    */
      __OM  uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Request Mask Disable.                                    */
      __OM  uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Request Mask Disable.                                    */
      __OM  uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Request Mask Disable.                                 */
      __OM  uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Request Mask Disable.                                 */
      __OM  uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Request Mask Disable.                                 */
      __OM  uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Request Mask Disable.                                 */
      __OM  uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Request Mask Disable.                                 */
      __OM  uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Request Mask Disable.                                 */
    } bit;
  } CHREQMCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Channel Enable Set                                         */
    
    struct {
      __IOM uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Enable.                                                  */
      __IOM uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Enable.                                                  */
      __IOM uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Enable.                                                  */
      __IOM uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Enable.                                                  */
      __IOM uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Enable.                                                  */
      __IOM uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Enable.                                                  */
      __IOM uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Enable.                                                  */
      __IOM uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Enable.                                                  */
      __IOM uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Enable.                                                  */
      __IOM uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Enable.                                                  */
      __IOM uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Enable.                                               */
      __IOM uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Enable.                                               */
      __IOM uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Enable.                                               */
      __IOM uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Enable.                                               */
      __IOM uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Enable.                                               */
      __IOM uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Enable.                                               */
    } bit;
  } CHENSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Channel Enable Clear                                       */
    
