chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __OM  uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Disable.                                                 */
      __OM  uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Disable.                                                 */
      __OM  uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Disable.                                                 */
      __OM  uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Disable.                                                 */
      __OM  uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Disable.                                                 */
      __OM  uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Disable.                                                 */
      __OM  uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Disable.                                                 */
      __OM  uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Disable.                                                 */
      __OM  uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Disable.                                                 */
      __OM  uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Disable.                                                 */
      __OM  uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Disable.                                              */
      __OM  uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Disable.                                              */
      __OM  uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Disable.                                              */
      __OM  uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Disable.                                              */
      __OM  uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Disable.                                              */
      __OM  uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Disable.                                              */
    } bit;
  } CHENCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Channel Alternate Select Set                               */
    
    struct {
      __IOM uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Alternate Enable.                                        */
      __IOM uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Alternate Enable.                                        */
      __IOM uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Alternate Enable.                                        */
      __IOM uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Alternate Enable.                                        */
      __IOM uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Alternate Enable.                                        */
      __IOM uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Alternate Enable.                                        */
      __IOM uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Alternate Enable.                                        */
      __IOM uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Alternate Enable.                                        */
      __IOM uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Alternate Enable.                                        */
      __IOM uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Alternate Enable.                                        */
      __IOM uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Alternate Enable.                                     */
      __IOM uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Alternate Enable.                                     */
      __IOM uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Alternate Enable.                                     */
      __IOM uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Alternate Enable.                                     */
      __IOM uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Alternate Enable.                                     */
      __IOM uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Alternate Enable.                                     */
    } bit;
  } CHALTSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Channel Alternate Select Clear                             */
    
    struct {
      __OM  uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Alternate Disable.                                       */
      __OM  uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Alternate Disable.                                       */
      __OM  uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Alternate Disable.                                       */
      __OM  uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Alternate Disable.                                       */
      __OM  uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Alternate Disable.                                       */
      __OM  uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Alternate Disable.                                       */
      __OM  uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Alternate Disable.                                       */
      __OM  uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Alternate Disable.                                       */
      __OM  uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Alternate Disable.                                       */
      __OM  uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Alternate Disable.                                       */
      __OM  uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Alternate Disable.                                    */
      __OM  uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Alternate Disable.                                    */
      __OM  uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Alternate Disable.                                    */
      __OM  uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Alternate Disable.                                    */
      __OM  uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Alternate Disable.                                    */
      __OM  uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Alternate Disable.                                    */
    } bit;
  } CHALTCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Channel High Priority Set                                  */
    
