chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CH0        : 1;            /*!< [0..0] Channel 0 High Priority Enable.                                    */
      __IOM uint32_t CH1        : 1;            /*!< [1..1] Channel 1 High Priority Enable.                                    */
      __IOM uint32_t CH2        : 1;            /*!< [2..2] Channel 2 High Priority Enable.                                    */
      __IOM uint32_t CH3        : 1;            /*!< [3..3] Channel 3 High Priority Enable.                                    */
      __IOM uint32_t CH4        : 1;            /*!< [4..4] Channel 4 High Priority Enable.                                    */
      __IOM uint32_t CH5        : 1;            /*!< [5..5] Channel 5 High Priority Enable.                                    */
      __IOM uint32_t CH6        : 1;            /*!< [6..6] Channel 6 High Priority Enable.                                    */
      __IOM uint32_t CH7        : 1;            /*!< [7..7] Channel 7 High Priority Enable.                                    */
      __IOM uint32_t CH8        : 1;            /*!< [8..8] Channel 8 High Priority Enable.                                    */
      __IOM uint32_t CH9        : 1;            /*!< [9..9] Channel 9 High Priority Enable.                                    */
      __IOM uint32_t CH10       : 1;            /*!< [10..10] Channel 10 High Priority Enable.                                 */
      __IOM uint32_t CH11       : 1;            /*!< [11..11] Channel 11 High Priority Enable.                                 */
      __IOM uint32_t CH12       : 1;            /*!< [12..12] Channel 12 High Priority Enable.                                 */
      __IOM uint32_t CH13       : 1;            /*!< [13..13] Channel 13 High Priority Enable.                                 */
      __IOM uint32_t CH14       : 1;            /*!< [14..14] Channel 14 High Priority Enable.                                 */
      __IOM uint32_t CH15       : 1;            /*!< [15..15] Channel 15 High Priority Enable.                                 */
    } bit;
  } CHHPSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Channel High Priority Clear                                */
    
    struct {
      __OM  uint32_t CH0        : 1;            /*!< [0..0] Channel 0 High Priority Disable.                                   */
      __OM  uint32_t CH1        : 1;            /*!< [1..1] Channel 1 High Priority Disable.                                   */
      __OM  uint32_t CH2        : 1;            /*!< [2..2] Channel 2 High Priority Disable.                                   */
      __OM  uint32_t CH3        : 1;            /*!< [3..3] Channel 3 High Priority Disable.                                   */
      __OM  uint32_t CH4        : 1;            /*!< [4..4] Channel 4 High Priority Disable.                                   */
      __OM  uint32_t CH5        : 1;            /*!< [5..5] Channel 5 High Priority Disable.                                   */
      __OM  uint32_t CH6        : 1;            /*!< [6..6] Channel 6 High Priority Disable.                                   */
      __OM  uint32_t CH7        : 1;            /*!< [7..7] Channel 7 High Priority Disable.                                   */
      __OM  uint32_t CH8        : 1;            /*!< [8..8] Channel 8 High Priority Disable.                                   */
      __OM  uint32_t CH9        : 1;            /*!< [9..9] Channel 9 High Priority Disable.                                   */
      __OM  uint32_t CH10       : 1;            /*!< [10..10] Channel 10 High Priority Disable.                                */
      __OM  uint32_t CH11       : 1;            /*!< [11..11] Channel 11 High Priority Disable.                                */
      __OM  uint32_t CH12       : 1;            /*!< [12..12] Channel 12 High Priority Disable.                                */
      __OM  uint32_t CH13       : 1;            /*!< [13..13] Channel 13 High Priority Disable.                                */
      __OM  uint32_t CH14       : 1;            /*!< [14..14] Channel 14 High Priority Disable.                                */
      __OM  uint32_t CH15       : 1;            /*!< [15..15] Channel 15 High Priority Disable.                                */
    } bit;
  } CHHPCLR;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Bus Error Clear                                            */
    
    struct {
      __IOM uint32_t ERROR      : 1;            /*!< [0..0] DMA Bus Error Clear.                                               */
    } bit;
  } BERRCLR;
} DMACTRL_0_Type;                               /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                         DMAXBAR_0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief None (DMAXBAR_0)
  */

typedef struct {                                /*!< (@ 0x40037000) DMAXBAR_0 Structure                                        */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Channel 0-7 Trigger Select                                 */
    
    struct {
      __IOM uint32_t CH0SEL     : 4;            /*!< [3..0] DMA Channel 0 Peripheral Select.                                   */
      __IOM uint32_t CH1SEL     : 4;            /*!< [7..4] DMA Channel 1 Peripheral Select.                                   */
      __IOM uint32_t CH2SEL     : 4;            /*!< [11..8] DMA Channel 2 Peripheral Select.                                  */
      __IOM uint32_t CH3SEL     : 4;            /*!< [15..12] DMA Channel 3 Peripheral Select.                                 */
      __IOM uint32_t CH4SEL     : 4;            /*!< [19..16] DMA Channel 4 Peripheral Select.                                 */
      __IOM uint32_t CH5SEL     : 4;            /*!< [23..20] DMA Channel 5 Peripheral Select.                                 */
      __IOM uint32_t CH6SEL     : 4;            /*!< [27..24] DMA Channel 6 Peripheral Select.                                 */
      __IOM uint32_t CH7SEL     : 4;            /*!< [31..28] DMA Channel 7 Peripheral Select.                                 */
    } bit;
  } DMAXBAR0;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Channel 8-15 Trigger Select                                */
    
