chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CH8SEL     : 4;            /*!< [3..0] DMA Channel 8 Peripheral Select.                                   */
      __IOM uint32_t CH9SEL     : 4;            /*!< [7..4] DMA Channel 9 Peripheral Select.                                   */
      __IOM uint32_t CH10SEL    : 4;            /*!< [11..8] DMA Channel 10 Peripheral Select.                                 */
      __IOM uint32_t CH11SEL    : 4;            /*!< [15..12] DMA Channel 11 Peripheral Select.                                */
      __IOM uint32_t CH12SEL    : 4;            /*!< [19..16] DMA Channel 12 Peripheral Select.                                */
      __IOM uint32_t CH13SEL    : 4;            /*!< [23..20] DMA Channel 13 Peripheral Select.                                */
      __IOM uint32_t CH14SEL    : 4;            /*!< [27..24] DMA Channel 14 Peripheral Select.                                */
      __IOM uint32_t CH15SEL    : 4;            /*!< [31..28] DMA Channel 15 Peripheral Select.                                */
    } bit;
  } DMAXBAR1;
} DMAXBAR_0_Type;                               /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                        DEVICEID_0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief None (DEVICEID_0)
  */

typedef struct {                                /*!< (@ 0x400490C0) DEVICEID_0 Structure                                       */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Device ID Word 0                                           */
    
    struct {
      __IOM uint32_t REVID      : 4;            /*!< [3..0] Revision ID.                                                       */
      __IOM uint32_t DEVICEID0  : 28;           /*!< [31..4] Device ID 0.                                                      */
    } bit;
  } DEVICEID0;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Device ID Word 1                                           */
    
    struct {
      __IOM uint32_t DEVICEID1  : 32;           /*!< [31..0] Device ID 1.                                                      */
    } bit;
  } DEVICEID1;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Device ID Word 2                                           */
    
    struct {
      __IOM uint32_t DEVICEID2  : 32;           /*!< [31..0] Device ID 2.                                                      */
    } bit;
  } DEVICEID2;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Device ID Word 3                                           */
    
    struct {
      __IOM uint32_t DEVICEID3  : 32;           /*!< [31..0] Device ID 3.                                                      */
    } bit;
  } DEVICEID3;
} DEVICEID_0_Type;                              /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                          EMIF_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (EMIF_0)
  */

typedef struct {                                /*!< (@ 0x40026000) EMIF_0 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t IF0EN      : 1;            /*!< [0..0] Interface 0 Enable.                                                */
      __IOM uint32_t IF1EN      : 1;            /*!< [1..1] Interface 1 Enable.                                                */
      __IM  uint32_t            : 2;
      __IOM uint32_t OFFSTEN    : 1;            /*!< [4..4] OFF Output State Enable.                                           */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[7];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Module Status                                              */
    
    struct {
      __IM  uint32_t OFFSTS     : 1;            /*!< [0..0] EMIF OFF Status.                                                   */
      __IM  uint32_t IDLESTS    : 1;            /*!< [1..1] EMIF IDLE Status.                                                  */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED1[23];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Interface Configuration                                    */
    
    struct {
      __IOM uint32_t BUSWIDTH   : 1;            /*!< [0..0] Interface Bus Data Width.                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t MUXMD      : 1;            /*!< [2..2] Interface Mux Mode.                                                */
      __IOM uint32_t ASEN       : 1;            /*!< [3..3] Interface Automatic Address Shift Enable.                          */
      __IOM uint32_t ROEN       : 1;            /*!< [4..4] Interface Read Only Enable.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t WDHINH     : 1;            /*!< [8..8] Write Data Hold State Inhibit.                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t DELAYOE    : 1;            /*!< [12..12] Output Enable Delay.                                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t KLREN      : 1;            /*!< [16..16] Keep Last Read Enable.                                           */
    } bit;
  } CONFIG_0;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Interface Read Timing                                      */
    
