chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t BUSWIDTH   : 1;            /*!< [0..0] Interface Bus Data Width.                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t MUXMD      : 1;            /*!< [2..2] Interface Mux Mode.                                                */
      __IOM uint32_t ASEN       : 1;            /*!< [3..3] Interface Automatic Address Shift Enable.                          */
      __IOM uint32_t ROEN       : 1;            /*!< [4..4] Interface Read Only Enable.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t WDHINH     : 1;            /*!< [8..8] Write Data Hold State Inhibit.                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t DELAYOE    : 1;            /*!< [12..12] Output Enable Delay.                                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t KLREN      : 1;            /*!< [16..16] Keep Last Read Enable.                                           */
    } bit;
  } CONFIG_1;
  __IM  uint32_t  RESERVED7[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000110) Interface Read Timing                                      */
    
    struct {
      __IOM uint32_t RASET      : 4;            /*!< [3..0] Interface Read Address Setup Delay .                               */
      __IOM uint32_t RAHOLD     : 4;            /*!< [7..4] Interface Read Address Hold Delay.                                 */
      __IOM uint32_t RDHOLD     : 4;            /*!< [11..8] Interface Read Data Hold Delay.                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t RDWAIT     : 6;            /*!< [21..16] Interface Read Data Wait Delay.                                  */
    } bit;
  } IFRT_1;
  __IM  uint32_t  RESERVED8[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000120) Interface Write Timing                                     */
    
    struct {
      __IOM uint32_t WASET      : 4;            /*!< [3..0] Interface Write Address Setup Delay .                              */
      __IOM uint32_t WAHOLD     : 4;            /*!< [7..4] Interface Write Address Hold Delay.                                */
      __IOM uint32_t WDHOLD     : 4;            /*!< [11..8] Interface Write Data Hold Delay.                                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t WDWAIT     : 6;            /*!< [21..16] Interface Write Data Wait Delay.                                 */
    } bit;
  } IFWT_1;
  __IM  uint32_t  RESERVED9[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000130) Interface Read Control States                              */
    
    struct {
      __IOM uint32_t CSRAS      : 1;            /*!< [0..0] Chip Select Read Address Setup State.                              */
      __IOM uint32_t CSRAH      : 1;            /*!< [1..1] Chip Select Read Address Hold State.                               */
      __IOM uint32_t CSRDW      : 1;            /*!< [2..2] Chip Select Read Data Wait State.                                  */
      __IOM uint32_t CSRDH      : 1;            /*!< [3..3] Chip Select Read Data Hold State.                                  */
      __IOM uint32_t OERAS      : 1;            /*!< [4..4] Output Enable Read Address Setup State.                            */
      __IOM uint32_t OERAH      : 1;            /*!< [5..5] Output Enable Read Address Hold State.                             */
      __IOM uint32_t OERDW      : 1;            /*!< [6..6] Output Enable Read Data Wait State.                                */
      __IOM uint32_t OERDH      : 1;            /*!< [7..7] Output Enable Read Data Hold State.                                */
      __IOM uint32_t WRRAS      : 1;            /*!< [8..8] Write Signal Read Address Setup State.                             */
      __IOM uint32_t WRRAH      : 1;            /*!< [9..9] Write Signal Read Address Hold State.                              */
      __IOM uint32_t WRRDW      : 1;            /*!< [10..10] Write Signal Read Data Wait State.                               */
      __IOM uint32_t WRRDH      : 1;            /*!< [11..11] Write Signal Read Data Hold State.                               */
      __IOM uint32_t ALERAS     : 1;            /*!< [12..12] Address Latch Enable Read Address Setup State.                   */
      __IOM uint32_t ALERAH     : 1;            /*!< [13..13] Address Latch Enable Read Address Hold State.                    */
      __IOM uint32_t ALERDW     : 1;            /*!< [14..14] Address Latch Enable Read Data Wait State.                       */
      __IOM uint32_t ALERDH     : 1;            /*!< [15..15] Address Latch Enable Read Data Hold State.                       */
    } bit;
  } IFRCST_1;
  __IM  uint32_t  RESERVED10[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000140) Interface Write Control States                             */
    
    struct {
      __IOM uint32_t CSWAS      : 1;            /*!< [0..0] Chip Select Write Address Setup State.                             */
      __IOM uint32_t CSWAH      : 1;            /*!< [1..1] Chip Select Write Address Hold State.                              */
      __IOM uint32_t CSWDW      : 1;            /*!< [2..2] Chip Select Write Data Wait State.                                 */
      __IOM uint32_t CSWDH      : 1;            /*!< [3..3] Chip Select Write Data Hold State.                                 */
      __IOM uint32_t OEWAS      : 1;            /*!< [4..4] Output Enable Write Address Setup State.                           */
      __IOM uint32_t OEWAH      : 1;            /*!< [5..5] Output Enable Write Address Hold State.                            */
      __IOM uint32_t OEWDW      : 1;            /*!< [6..6] Output Enable Write Data Wait State.                               */
      __IOM uint32_t OEWDH      : 1;            /*!< [7..7] Output Enable Write Data Hold State.                               */
      __IOM uint32_t WRWAS      : 1;            /*!< [8..8] Write Signal Write Address Setup State.                            */
      __IOM uint32_t WRWAH      : 1;            /*!< [9..9] Write Signal Write Address Hold State.                             */
      __IOM uint32_t WRWDW      : 1;            /*!< [10..10] Write Signal Write Data Wait State.                              */
      __IOM uint32_t WRWDH      : 1;            /*!< [11..11] Write Signal Write Data Hold State.                              */
      __IOM uint32_t ALEWAS     : 1;            /*!< [12..12] Address Latch Enable Write Address Setup State.                  */
      __IOM uint32_t ALEWAH     : 1;            /*!< [13..13] Address Latch Enable Write Address Hold State.                   */
      __IOM uint32_t ALEWDW     : 1;            /*!< [14..14] Address Latch Enable Write Data Wait State.                      */
      __IOM uint32_t ALEWDH     : 1;            /*!< [15..15] Address Latch Enable Write Data Hold State.                      */
    } bit;
  } IFWCST_1;
} EMIF_0_Type;                                  /*!< Size = 324 (0x144)                                                        */



/* =========================================================================================================================== */
/* ================                                          EPCA_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (EPCA_0)
  */

typedef struct {                                /*!< (@ 0x4000E000) EPCA_0 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Channel Capture/Compare Mode                               */
    
