chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CCAPV      : 18;           /*!< [17..0] Channel Compare Value.                                            */
    } bit;
  } CCAPV_3;
  __IM  uint32_t  RESERVED14[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F0) Channel Compare Update Value                               */
    
    struct {
      __IOM uint32_t CCAPVUPD   : 18;           /*!< [17..0] Channel Compare Update Value.                                     */
    } bit;
  } CCAPVUPD_3;
  __IM  uint32_t  RESERVED15[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000100) Channel Capture/Compare Mode                               */
    
    struct {
      __IOM uint32_t COSEL      : 2;            /*!< [1..0] Channel Output Function Select.                                    */
      __IOM uint32_t PWMMD      : 4;            /*!< [5..2] PWM N-Bit Mode.                                                    */
      __IOM uint32_t DIFGEN     : 1;            /*!< [6..6] Differential Signal Generator Enable.                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t CMD        : 3;            /*!< [10..8] Channel Operating Mode.                                           */
    } bit;
  } MODE_4;
  __IM  uint32_t  RESERVED16[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000110) Channel Capture/Compare Control                            */
    
    struct {
      __IOM uint32_t COUTST     : 1;            /*!< [0..0] Channel Output State.                                              */
      __IOM uint32_t CPCAPEN    : 1;            /*!< [1..1] Positive Edge Input Capture Enable.                                */
      __IOM uint32_t CNCAPEN    : 1;            /*!< [2..2] Negative Edge Input Capture Enable.                                */
      __IOM uint32_t CUPDCF     : 1;            /*!< [3..3] Channel Register Update Complete Flag.                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t YPHST      : 1;            /*!< [5..5] Differential Y Phase State.                                        */
      __IOM uint32_t ACTIVEPH   : 1;            /*!< [6..6] Active Channel Select.                                             */
      __IOM uint32_t XPHST      : 1;            /*!< [7..7] Differential X Phase State.                                        */
      __IOM uint32_t CCIEN      : 1;            /*!< [8..8] Capture/Compare Interrupt Enable.                                  */
      __IOM uint32_t CCDEN      : 1;            /*!< [9..9] Capture/Compare DMA Request Enable.                                */
      __IOM uint32_t CCSEN      : 1;            /*!< [10..10] Capture/Compare Synchronization Signal Enable.                   */
      __IOM uint32_t CIOVFIEN   : 1;            /*!< [11..11] Intermediate Overflow Interrupt Enable.                          */
      __IOM uint32_t CIOVFDEN   : 1;            /*!< [12..12] Intermediate Overflow DMA Request Enable.                        */
      __IOM uint32_t CIOVFSEN   : 1;            /*!< [13..13] Intermediate Overflow Synchronization Signal Enable.             */
    } bit;
  } CONTROL_4;
  __IM  uint32_t  RESERVED17[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000120) Channel Compare Value                                      */
    
    struct {
      __IOM uint32_t CCAPV      : 18;           /*!< [17..0] Channel Compare Value.                                            */
    } bit;
  } CCAPV_4;
  __IM  uint32_t  RESERVED18[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000130) Channel Compare Update Value                               */
    
    struct {
      __IOM uint32_t CCAPVUPD   : 18;           /*!< [17..0] Channel Compare Update Value.                                     */
    } bit;
  } CCAPVUPD_4;
  __IM  uint32_t  RESERVED19[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000140) Channel Capture/Compare Mode                               */
    
    struct {
      __IOM uint32_t COSEL      : 2;            /*!< [1..0] Channel Output Function Select.                                    */
      __IOM uint32_t PWMMD      : 4;            /*!< [5..2] PWM N-Bit Mode.                                                    */
      __IOM uint32_t DIFGEN     : 1;            /*!< [6..6] Differential Signal Generator Enable.                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t CMD        : 3;            /*!< [10..8] Channel Operating Mode.                                           */
    } bit;
  } MODE_5;
  __IM  uint32_t  RESERVED20[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000150) Channel Capture/Compare Control                            */
    
    struct {
      __IOM uint32_t COUTST     : 1;            /*!< [0..0] Channel Output State.                                              */
      __IOM uint32_t CPCAPEN    : 1;            /*!< [1..1] Positive Edge Input Capture Enable.                                */
      __IOM uint32_t CNCAPEN    : 1;            /*!< [2..2] Negative Edge Input Capture Enable.                                */
      __IOM uint32_t CUPDCF     : 1;            /*!< [3..3] Channel Register Update Complete Flag.                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t YPHST      : 1;            /*!< [5..5] Differential Y Phase State.                                        */
      __IOM uint32_t ACTIVEPH   : 1;            /*!< [6..6] Active Channel Select.                                             */
      __IOM uint32_t XPHST      : 1;            /*!< [7..7] Differential X Phase State.                                        */
      __IOM uint32_t CCIEN      : 1;            /*!< [8..8] Capture/Compare Interrupt Enable.                                  */
      __IOM uint32_t CCDEN      : 1;            /*!< [9..9] Capture/Compare DMA Request Enable.                                */
      __IOM uint32_t CCSEN      : 1;            /*!< [10..10] Capture/Compare Synchronization Signal Enable.                   */
      __IOM uint32_t CIOVFIEN   : 1;            /*!< [11..11] Intermediate Overflow Interrupt Enable.                          */
      __IOM uint32_t CIOVFDEN   : 1;            /*!< [12..12] Intermediate Overflow DMA Request Enable.                        */
      __IOM uint32_t CIOVFSEN   : 1;            /*!< [13..13] Intermediate Overflow Synchronization Signal Enable.             */
    } bit;
  } CONTROL_5;
  __IM  uint32_t  RESERVED21[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000160) Channel Compare Value                                      */
    
