chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CCAPV      : 18;           /*!< [17..0] Channel Compare Value.                                            */
    } bit;
  } CCAPV_5;
  __IM  uint32_t  RESERVED22[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000170) Channel Compare Update Value                               */
    
    struct {
      __IOM uint32_t CCAPVUPD   : 18;           /*!< [17..0] Channel Compare Update Value.                                     */
    } bit;
  } CCAPVUPD_5;
  __IM  uint32_t  RESERVED23[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000180) Module Operating Mode                                      */
    
    struct {
      __IOM uint32_t CLKDIV     : 10;           /*!< [9..0] Input Clock Divider.                                               */
      __IOM uint32_t CLKSEL     : 3;            /*!< [12..10] Input Clock (F<subscript>CLKIN</subscript>) Select.              */
      __IM  uint32_t            : 1;
      __IOM uint32_t HDOSEL     : 2;            /*!< [15..14] High Drive Port Bank Output Select.                              */
      __IOM uint32_t DEND       : 3;            /*!< [18..16] DMA Write End Index.                                             */
      __IOM uint32_t DPTR       : 3;            /*!< [21..19] DMA Write Transfer Pointer.                                      */
      __IOM uint32_t DSTART     : 3;            /*!< [24..22] DMA Target Start Index.                                          */
      __IOM uint32_t DBUSYF     : 1;            /*!< [25..25] DMA Busy Flag.                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t STDOSEL    : 2;            /*!< [28..27] Standard Port Bank Output Select.                                */
    } bit;
  } MODE;
  __IM  uint32_t  RESERVED24[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000190) Module Control                                             */
    
    struct {
      __IOM uint32_t OVFIEN     : 1;            /*!< [0..0] EPCA Counter Overflow/Limit Interrupt Enable.                      */
      __IOM uint32_t OVFDEN     : 1;            /*!< [1..1] EPCA Counter Overflow/Limit DMA Request Enable.                    */
      __IOM uint32_t OVFSEN     : 1;            /*!< [2..2] EPCA Counter Overflow/Limit Synchronization Signal Enable.         */
      __IOM uint32_t HALTIEN    : 1;            /*!< [3..3] EPCA Halt Input Interrupt Enable.                                  */
      __IOM uint32_t NOUPD      : 1;            /*!< [4..4] Internal Register Update Inhibit.                                  */
      __IOM uint32_t IDLEBEN    : 1;            /*!< [5..5] Idle Bypass Enable.                                                */
      __IOM uint32_t DBGMD      : 1;            /*!< [6..6] EPCA Debug Mode.                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HALTEN     : 1;            /*!< [9..9] Halt Input Enable.                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t STSEL      : 2;            /*!< [12..11] Synchronous Input Trigger Select.                                */
      __IOM uint32_t STESEL     : 1;            /*!< [13..13] Synchronous Input Trigger Edge Select.                           */
      __IOM uint32_t STEN       : 1;            /*!< [14..14] Synchronous Input Trigger Enable.                                */
      __IM  uint32_t            : 6;
      __IOM uint32_t DIVST      : 1;            /*!< [21..21] Clock Divider Output State.                                      */
      __IOM uint32_t DIV        : 10;           /*!< [31..22] Current Clock Divider Count.                                     */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED25[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A0) Module Status                                              */
    
    struct {
      __IOM uint32_t C0CCI      : 1;            /*!< [0..0] Channel 0 Capture/Compare Interrupt Flag.                          */
      __IOM uint32_t C1CCI      : 1;            /*!< [1..1] Channel 1 Capture/Compare Interrupt Flag.                          */
      __IOM uint32_t C2CCI      : 1;            /*!< [2..2] Channel 2 Capture/Compare Interrupt Flag.                          */
      __IOM uint32_t C3CCI      : 1;            /*!< [3..3] Channel 3 Capture/Compare Interrupt Flag.                          */
      __IOM uint32_t C4CCI      : 1;            /*!< [4..4] Channel 4 Capture/Compare Interrupt Flag.                          */
      __IOM uint32_t C5CCI      : 1;            /*!< [5..5] Channel 5 Capture/Compare Interrupt Flag.                          */
      __IOM uint32_t RUN        : 1;            /*!< [6..6] Counter/Timer Run.                                                 */
      __IOM uint32_t OVFI       : 1;            /*!< [7..7] Counter/Timer Overflow/Limit Interrupt Flag.                       */
      __IOM uint32_t UPDCF      : 1;            /*!< [8..8] Register Update Complete Flag.                                     */
      __IOM uint32_t HALTI      : 1;            /*!< [9..9] Halt Input Interrupt Flag.                                         */
      __IOM uint32_t C0IOVFI    : 1;            /*!< [10..10] Channel 0 Intermediate Overflow Interrupt Flag.                  */
      __IOM uint32_t C1IOVFI    : 1;            /*!< [11..11] Channel 1 Intermediate Overflow Interrupt Flag.                  */
      __IOM uint32_t C2IOVFI    : 1;            /*!< [12..12] Channel 2 Intermediate Overflow Interrupt Flag.                  */
      __IOM uint32_t C3IOVFI    : 1;            /*!< [13..13] Channel 3 Intermediate Overflow Interrupt Flag.                  */
      __IOM uint32_t C4IOVFI    : 1;            /*!< [14..14] Channel 4 Intermediate Overflow Interrupt Flag.                  */
      __IOM uint32_t C5IOVFI    : 1;            /*!< [15..15] Channel 5 Intermediate Overflow Interrupt Flag.                  */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED26[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001B0) Module Counter/Timer                                       */
    
