chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t COUNTER    : 16;           /*!< [15..0] Counter/Timer.                                                    */
    } bit;
  } COUNTER;
  __IM  uint32_t  RESERVED27[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001C0) Module Upper Limit                                         */
    
    struct {
      __IOM uint32_t LIMIT      : 16;           /*!< [15..0] Upper Limit.                                                      */
    } bit;
  } LIMIT;
  __IM  uint32_t  RESERVED28[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001D0) Module Upper Limit Update Value                            */
    
    struct {
      __IOM uint32_t LIMITUPD   : 16;           /*!< [15..0] Module Upper Limit Update Value.                                  */
    } bit;
  } LIMITUPD;
  __IM  uint32_t  RESERVED29[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001E0) Phase Delay Time                                           */
    
    struct {
      __IOM uint32_t DTIMEX     : 8;            /*!< [7..0] X Phase Delay Time.                                                */
      __IOM uint32_t DTIMEY     : 8;            /*!< [15..8] Y Phase Delay Time.                                               */
    } bit;
  } DTIME;
  __IM  uint32_t  RESERVED30[7];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000200) DMA Transfer Target                                        */
    
    struct {
      __OM  uint32_t DTARGET    : 32;           /*!< [31..0] DMA Transfer Target.                                              */
    } bit;
  } DTARGET;
} EPCA_0_Type;                                  /*!< Size = 516 (0x204)                                                        */



/* =========================================================================================================================== */
/* ================                                        FLASHCTRL_0                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief None (FLASHCTRL_0)
  */

typedef struct {                                /*!< (@ 0x4002E000) FLASHCTRL_0 Structure                                      */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Controller Configuration                                   */
    
    struct {
      __IOM uint32_t SPMD       : 2;            /*!< [1..0] Flash Speed Mode.                                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t RDSEN      : 1;            /*!< [4..4] Read Store Mode Enable.                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t DPFEN      : 1;            /*!< [6..6] Data Prefetch Enable.                                              */
      __IOM uint32_t PFINH      : 1;            /*!< [7..7] Prefetch Inhibit.                                                  */
      __IM  uint32_t            : 8;
      __IOM uint32_t SQWEN      : 1;            /*!< [16..16] Flash Write Sequence Enable.                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t ERASEEN    : 1;            /*!< [18..18] Flash Page Erase Enable.                                         */
      __IM  uint32_t BUFSTS     : 1;            /*!< [19..19] Flash Buffer Status.                                             */
      __IM  uint32_t BUSYF      : 1;            /*!< [20..20] Flash Operation Busy Flag.                                       */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED[39];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Flash Write Address                                        */
    
    struct {
      __IOM uint32_t WRADDR     : 32;           /*!< [31..0] Flash Write Address.                                              */
    } bit;
  } WRADDR;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Flash Write Data                                           */
    
    struct {
      __OM  uint32_t WRDATA     : 32;           /*!< [31..0] Flash Write Data.                                                 */
    } bit;
  } WRDATA;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C0) Flash Modification Key                                     */
    
    struct {
      __IOM uint32_t KEY        : 8;            /*!< [7..0] Flash Key.                                                         */
    } bit;
  } KEY;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D0) Flash Timing Control                                       */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t FLRTMD     : 1;            /*!< [6..6] Flash Read Timing Mode.                                            */
    } bit;
  } TCONTROL;
} FLASHCTRL_0_Type;                             /*!< Size = 212 (0xd4)                                                         */



/* =========================================================================================================================== */
/* ================                                           I2C_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (I2C_0)
  */

typedef struct {                                /*!< (@ 0x40009000) I2C_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
