chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IM  uint32_t BUSYF      : 1;            /*!< [0..0] Busy Flag.                                                         */
      __IOM uint32_t ACK        : 1;            /*!< [1..1] Acknowledge.                                                       */
      __IM  uint32_t ARBLF      : 1;            /*!< [2..2] Arbitration Lost Flag.                                             */
      __IM  uint32_t ACKRQF     : 1;            /*!< [3..3] Acknowledge Request Flag.                                          */
      __IOM uint32_t STO        : 1;            /*!< [4..4] Stop.                                                              */
      __IOM uint32_t STA        : 1;            /*!< [5..5] Start.                                                             */
      __IM  uint32_t TXMDF      : 1;            /*!< [6..6] Transmit Mode Flag.                                                */
      __IM  uint32_t MSMDF      : 1;            /*!< [7..7] Master/Slave Mode Flag.                                            */
      __IOM uint32_t STOI       : 1;            /*!< [8..8] Stop Interrupt Flag.                                               */
      __IOM uint32_t ACKI       : 1;            /*!< [9..9] Acknowledge Interrupt Flag.                                        */
      __IOM uint32_t RXI        : 1;            /*!< [10..10] Receive Done Interrupt Flag.                                     */
      __IOM uint32_t TXI        : 1;            /*!< [11..11] Transmit Done Interrupt Flag.                                    */
      __IOM uint32_t STAI       : 1;            /*!< [12..12] Start Interrupt Flag.                                            */
      __IOM uint32_t ARBLI      : 1;            /*!< [13..13] Arbitration Lost Interrupt Flag.                                 */
      __IOM uint32_t T0I        : 1;            /*!< [14..14] I2C Timer Byte 0 Interrupt Flag.                                 */
      __IOM uint32_t T1I        : 1;            /*!< [15..15] I2C Timer Byte 1 Interrupt Flag.                                 */
      __IOM uint32_t T2I        : 1;            /*!< [16..16] I2C Timer Byte 2 Interrupt Flag.                                 */
      __IOM uint32_t T3I        : 1;            /*!< [17..17] I2C Timer Byte 3 Interrupt Flag.                                 */
      __IOM uint32_t RXARM      : 1;            /*!< [18..18] Receive Arm.                                                     */
      __IOM uint32_t TXARM      : 1;            /*!< [19..19] Transmit Arm.                                                    */
      __IM  uint32_t SLVAF      : 1;            /*!< [20..20] Slave Address Type Flag.                                         */
      __IOM uint32_t ATXRXEN    : 1;            /*!< [21..21] Auto Transmit or Receive Enable.                                 */
      __IOM uint32_t FMD        : 1;            /*!< [22..22] Filter Mode.                                                     */
      __IOM uint32_t DBGMD      : 1;            /*!< [23..23] I2C Debug Mode.                                                  */
      __IOM uint32_t SMINH      : 1;            /*!< [24..24] Slave Mode Inhibit.                                              */
      __IOM uint32_t HACKEN     : 1;            /*!< [25..25] Auto Acknowledge Enable .                                        */
      __IOM uint32_t SLVAMD     : 1;            /*!< [26..26] Slave Address Mode.                                              */
      __IOM uint32_t LBACKEN    : 1;            /*!< [27..27] Last Byte Acknowledge Enable.                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t GCEN       : 1;            /*!< [29..29] General Call Address Enable.                                     */
      __IOM uint32_t RESET      : 1;            /*!< [30..30] Module Soft Reset.                                               */
      __IOM uint32_t I2CEN      : 1;            /*!< [31..31] I2C Enable.                                                      */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Configuration                                       */
    
    struct {
      __IOM uint32_t SCALER     : 6;            /*!< [5..0] I2C Clock Scaler.                                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t STOIEN     : 1;            /*!< [8..8] Stop Interrupt Enable.                                             */
      __IOM uint32_t ACKIEN     : 1;            /*!< [9..9] Acknowledge Interrupt Enable.                                      */
      __IOM uint32_t RXIEN      : 1;            /*!< [10..10] Receive Done Interrupt Enable.                                   */
      __IOM uint32_t TXIEN      : 1;            /*!< [11..11] Transmit Done Interrupt Enable.                                  */
      __IOM uint32_t STAIEN     : 1;            /*!< [12..12] Start Interrupt Enable.                                          */
      __IOM uint32_t ARBLIEN    : 1;            /*!< [13..13] Arbitration Lost Interrupt Enable.                               */
      __IOM uint32_t T0IEN      : 1;            /*!< [14..14] I2C Timer Byte 0 Interrupt Enable.                               */
      __IOM uint32_t T1IEN      : 1;            /*!< [15..15] I2C Timer Byte 1 Interrupt Enable.                               */
      __IOM uint32_t T2IEN      : 1;            /*!< [16..16] I2C Timer Byte 2 Interrupt Enable.                               */
      __IOM uint32_t T3IEN      : 1;            /*!< [17..17] I2C Timer Byte 3 Interrupt Enable.                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t BC         : 2;            /*!< [21..20] Transfer Byte Count.                                             */
      __IM  uint32_t BP         : 2;            /*!< [23..22] Transfer Byte Pointer.                                           */
      __IOM uint32_t T0RUN      : 1;            /*!< [24..24] I2C Timer Byte 0 Run.                                            */
      __IOM uint32_t T1RUN      : 1;            /*!< [25..25] I2C Timer Byte 1 Run.                                            */
      __IOM uint32_t T2RUN      : 1;            /*!< [26..26] I2C Timer Byte 2 Run.                                            */
      __IOM uint32_t T3RUN      : 1;            /*!< [27..27] I2C Timer Byte 3 Run.                                            */
      __IOM uint32_t TMD        : 2;            /*!< [29..28] I2C Timer Mode.                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIMEREN    : 1;            /*!< [31..31] I2C Timer Enable.                                                */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Slave Address                                              */
    
