chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t ADDRESS    : 10;           /*!< [10..1] Slave Address.                                                    */
    } bit;
  } SADDRESS;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Slave Address Mask                                         */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t MASK       : 10;           /*!< [10..1] Slave Address Mask.                                               */
    } bit;
  } SMASK;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Data Buffer Access                                         */
    
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Data.                                                             */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Timer Data                                                 */
    
    struct {
      __IOM uint32_t T0         : 8;            /*!< [7..0] Timer Byte 0.                                                      */
      __IOM uint32_t T1         : 8;            /*!< [15..8] Timer Byte 1.                                                     */
      __IOM uint32_t T2         : 8;            /*!< [23..16] Timer Byte 2.                                                    */
      __IOM uint32_t T3         : 8;            /*!< [31..24] Timer Byte 3.                                                    */
    } bit;
  } TIMER;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Timer Reload Values                                        */
    
    struct {
      __IOM uint32_t T0RL       : 8;            /*!< [7..0] Timer Byte 0 Reload Value.                                         */
      __IOM uint32_t T1RL       : 8;            /*!< [15..8] Timer Byte 1 Reload Value.                                        */
      __IOM uint32_t T2RL       : 8;            /*!< [23..16] Timer Byte 2 Reload Value.                                       */
      __IOM uint32_t T3RL       : 8;            /*!< [31..24] Timer Byte 3 Reload Value.                                       */
    } bit;
  } TIMERRL;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) SCL Signal Configuration                                   */
    
    struct {
      __IOM uint32_t SETUP      : 4;            /*!< [3..0] Data Setup Time Extension.                                         */
      __IOM uint32_t HOLD       : 4;            /*!< [7..4] Data Hold Time Extension.                                          */
      __IOM uint32_t SCLL       : 8;            /*!< [15..8] SCL Low Time Extension.                                           */
      __IM  uint32_t SCLLTIMER  : 4;            /*!< [19..16] SCL Low Timer Bits [3:0].                                        */
    } bit;
  } SCONFIG;
  __IM  uint32_t  RESERVED7[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) DMA Configuration                                          */
    
    struct {
      __IOM uint32_t DMALEN     : 8;            /*!< [7..0] DMA Transfer Length.                                               */
      __IM  uint32_t            : 23;
      __IOM uint32_t DMAEN      : 1;            /*!< [31..31] DMA Mode Enable.                                                 */
    } bit;
  } I2CDMA;
} I2C_Type;                                     /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                           I2S_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (I2S_0)
  */

typedef struct {                                /*!< (@ 0x4003A000) I2S_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Transmit Control                                           */
    
    struct {
      __IOM uint32_t FSGEN      : 1;            /*!< [0..0] DFS Generator Enable.                                              */
      __IOM uint32_t FSSEN      : 1;            /*!< [1..1] DFS Synchronize Enable.                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t DDIS       : 1;            /*!< [5..5] Transmit Delay Disable.                                            */
      __IOM uint32_t FSDEL      : 8;            /*!< [13..6] Transmit Initial Phase Delay.                                     */
      __IOM uint32_t FSSRCSEL   : 1;            /*!< [14..14] Transmit Frame Sync Source Select.                               */
      __IOM uint32_t FILLSEL    : 2;            /*!< [16..15] Transmit Data Fill Select.                                       */
      __IOM uint32_t JSEL       : 1;            /*!< [17..17] Transmit Data Justification Select.                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t FSINVEN    : 1;            /*!< [20..20] Transmit WS Inversion Enable.                                    */
      __IOM uint32_t SCLKINVEN  : 1;            /*!< [21..21] Transmit SCK Inversion Enable.                                   */
      __IOM uint32_t ORDER      : 1;            /*!< [22..22] Transmit Order.                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t MBSEL      : 3;            /*!< [26..24] Transmit Mono Bit-Width Select.                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t TXEN       : 1;            /*!< [29..29] Transmitter Enable.                                              */
    } bit;
  } TXCONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Transmit Mode                                              */
    
