chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CYCLE      : 12;           /*!< [11..0] Transmit Clock Cycle Select.                                      */
      __IOM uint32_t START      : 8;            /*!< [19..12] Transmit Start Control.                                          */
      __IOM uint32_t SLOTS      : 5;            /*!< [24..20] Transmit Drive Select.                                           */
      __IOM uint32_t DEDIS      : 1;            /*!< [25..25] Transmit Drive Early Disable.                                    */
      __IOM uint32_t DIMD       : 1;            /*!< [26..26] Transmit Drive Inactive Mode.                                    */
      __IOM uint32_t TDMEN      : 1;            /*!< [27..27] Transmit Time Division Multiplexing Enable.                      */
    } bit;
  } TXMODE;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Frame Sync Duty Cycle                                      */
    
    struct {
      __IOM uint32_t FSLOW      : 16;           /*!< [15..0] Frame Sync Low Time.                                              */
      __IOM uint32_t FSHIGH     : 16;           /*!< [31..16] Frame Sync High Time.                                            */
    } bit;
  } FSDUTY;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Receive Control                                            */
    
    struct {
      __IOM uint32_t FSDEL      : 8;            /*!< [7..0] Receive Initial Phase Delay.                                       */
      __IOM uint32_t JSEL       : 1;            /*!< [8..8] Receive Data Justification.                                        */
      __IOM uint32_t DDIS       : 1;            /*!< [9..9] Receive Delay Disable.                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t FSINVEN    : 1;            /*!< [11..11] Receive WS Inversion Enable.                                     */
      __IOM uint32_t SCLKINVEN  : 1;            /*!< [12..12] Receive SCK Inversion Enable.                                    */
      __IOM uint32_t ORDER      : 1;            /*!< [13..13] Receive Order.                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t MBSEL      : 3;            /*!< [17..15] Receive Mono Bit-Width Select.                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t FSSRCSEL   : 1;            /*!< [20..20] Receive Frame Sync Source Select.                                */
      __IOM uint32_t RXEN       : 1;            /*!< [21..21] Receive Enable.                                                  */
    } bit;
  } RXCONTROL;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Receive Mode                                               */
    
    struct {
      __IOM uint32_t CYCLE      : 12;           /*!< [11..0] Receive Clock Cycle Select.                                       */
      __IOM uint32_t START      : 8;            /*!< [19..12] Receive Start Control.                                           */
      __IOM uint32_t SLOTS      : 6;            /*!< [25..20] Receive Drive Select.                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t TDMEN      : 1;            /*!< [27..27] Receive Time Division Multiplexing Enable.                       */
    } bit;
  } RXMODE;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Clock Control                                              */
    
    struct {
      __IOM uint32_t INTDIV     : 10;           /*!< [9..0] Clock Divider Integer Value.                                       */
      __IOM uint32_t FRACDIV    : 8;            /*!< [17..10] Clock Divider Fractional Value.                                  */
      __IOM uint32_t DUTYMD     : 1;            /*!< [18..18] Duty Cycle Adjustment Mode.                                      */
      __OM  uint32_t CLKUPD     : 1;            /*!< [19..19] Clock Divider Update.                                            */
      __IOM uint32_t DIVEN      : 1;            /*!< [20..20] Clock Divider Enable.                                            */
      __IOM uint32_t TXCLKSEL   : 1;            /*!< [21..21] Transmit Clock Select.                                           */
      __IOM uint32_t RXCLKSEL   : 1;            /*!< [22..22] Receive Clock Select.                                            */
      __OM  uint32_t RESET      : 1;            /*!< [23..23] I2S Module Reset.                                                */
      __IOM uint32_t RXCLKEN    : 1;            /*!< [24..24] Receive Clock Enable.                                            */
      __IOM uint32_t TXCLKEN    : 1;            /*!< [25..25] Transmit Clock Enable.                                           */
      __IOM uint32_t RXSCLKMD   : 1;            /*!< [26..26] Receive SCK Mode.                                                */
      __IOM uint32_t TXSCLKMD   : 1;            /*!< [27..27] Transmit SCK Mode.                                               */
    } bit;
  } CLKCONTROL;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Transmit Data FIFO                                         */
    
    struct {
      __OM  uint32_t TXFIFO     : 32;           /*!< [31..0] Transmit Data FIFO.                                               */
    } bit;
  } TXFIFO;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Receive Data FIFO                                          */
    
    struct {
      __IM  uint32_t RXFIFO     : 32;           /*!< [31..0] Receive Data FIFO.                                                */
    } bit;
  } RXFIFO;
  __IM  uint32_t  RESERVED7[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) FIFO Status                                                */
    
