chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IM  uint32_t TXFIFONUM  : 4;            /*!< [3..0] Transmit FIFO Status.                                              */
      __IM  uint32_t            : 12;
      __IM  uint32_t RXFIFONUM  : 4;            /*!< [19..16] Receive FIFO Status.                                             */
    } bit;
  } FIFOSTATUS;
  __IM  uint32_t  RESERVED8[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) FIFO Control                                               */
    
    struct {
      __IOM uint32_t TXFIFOWM   : 4;            /*!< [3..0] Transmit FIFO Low Watermark.                                       */
      __IM  uint32_t            : 12;
      __IOM uint32_t RXFIFOWM   : 4;            /*!< [19..16] Receive FIFO High Watermark.                                     */
      __IM  uint32_t            : 1;
      __OM  uint32_t TXFIFOFL   : 1;            /*!< [21..21] Transmit FIFO Flush.                                             */
      __OM  uint32_t RXFIFOFL   : 1;            /*!< [22..22] Receive FIFO Flush.                                              */
    } bit;
  } FIFOCONTROL;
  __IM  uint32_t  RESERVED9[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Interrupt Control                                          */
    
    struct {
      __IOM uint32_t TXUFIEN    : 1;            /*!< [0..0] Transmit Underflow Interrupt Enable.                               */
      __IOM uint32_t RXOFIEN    : 1;            /*!< [1..1] Receive Overflow Interrupt Enable.                                 */
      __IOM uint32_t TXLWMIEN   : 1;            /*!< [2..2] Transmit FIFO Low Watermark Interrupt Enable.                      */
      __IOM uint32_t RXHWMIEN   : 1;            /*!< [3..3] Receive FIFO High Watermark Interrupt Enable.                      */
    } bit;
  } INTCONTROL;
  __IM  uint32_t  RESERVED10[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Module Status                                              */
    
    struct {
      __IOM uint32_t TXUFI      : 1;            /*!< [0..0] Transmit Underflow Interrupt Flag.                                 */
      __IOM uint32_t RXOFI      : 1;            /*!< [1..1] Receive Overflow Interrupt Flag.                                   */
      __IM  uint32_t TXLWMI     : 1;            /*!< [2..2] Transmit FIFO Low Watermark Interrupt Flag.                        */
      __IM  uint32_t RXHWMI     : 1;            /*!< [3..3] Receive FIFO High Watermark Interrupt Flag.                        */
      __IM  uint32_t CDBUSYF    : 1;            /*!< [4..4] Clock Divider Busy Flag.                                           */
      __IM  uint32_t CDSTS      : 1;            /*!< [5..5] Clock Divider Counter Status.                                      */
      __IM  uint32_t TXCLKSELRF : 1;            /*!< [6..6] Transmit Clock Select Ready Flag.                                  */
      __IM  uint32_t RXCLKSELRF : 1;            /*!< [7..7] Receive Clock Select Ready Flag.                                   */
      __IM  uint32_t TXCLKENRF  : 1;            /*!< [8..8] Transmit Clock Enable Ready Flag.                                  */
      __IM  uint32_t RXCLKENRF  : 1;            /*!< [9..9] Receive Clock Enable Ready Flag.                                   */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED11[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C0) DMA Control                                                */
    
    struct {
      __IOM uint32_t TXDMAEN    : 1;            /*!< [0..0] Transmit DMA Enable.                                               */
      __IOM uint32_t RXDMAEN    : 1;            /*!< [1..1] Receive DMA Enable.                                                */
      __IOM uint32_t TXDMABMD   : 1;            /*!< [2..2] Transmit DMA Burst Mode.                                           */
      __IOM uint32_t RXDMABMD   : 1;            /*!< [3..3] Receive DMA Burst Mode.                                            */
    } bit;
  } DMACONTROL;
  __IM  uint32_t  RESERVED12[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D0) Debug Control                                              */
    
    struct {
      __IOM uint32_t TXDBGHEN   : 1;            /*!< [0..0] I2S Transmit DMA Debug Halt Enable.                                */
      __IOM uint32_t RXDBGHEN   : 1;            /*!< [1..1] I2S Receive DMA Debug Halt Enable.                                 */
      __IOM uint32_t TXDBGMD    : 1;            /*!< [2..2] I2S Transmit Debug Mode.                                           */
      __IOM uint32_t RXDBGMD    : 1;            /*!< [3..3] I2S Receive Debug Mode.                                            */
    } bit;
  } DBGCONTROL;
} I2S_0_Type;                                   /*!< Size = 212 (0xd4)                                                         */



/* =========================================================================================================================== */
/* ================                                          IDAC_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (IDAC_0)
  */

typedef struct {                                /*!< (@ 0x40031000) IDAC_0 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t OUPDT      : 3;            /*!< [2..0] Output Update Trigger.                                             */
      __IOM uint32_t ETRIG      : 3;            /*!< [5..3] Edge Trigger Source Select.                                        */
      __IOM uint32_t OUTMD      : 2;            /*!< [7..6] Output Mode.                                                       */
      __IOM uint32_t INFMT      : 2;            /*!< [9..8] Data Input Format.                                                 */
      __IOM uint32_t DMARUN     : 1;            /*!< [10..10] DMA Run.                                                         */
      __IOM uint32_t JSEL       : 1;            /*!< [11..11] Data Justification Select.                                       */
      __OM  uint32_t BUFRESET   : 1;            /*!< [12..12] Data Buffer Reset.                                               */
      __IOM uint32_t TRIGINH    : 1;            /*!< [13..13] Trigger Source Inhibit.                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t WRAPEN     : 1;            /*!< [16..16] Wrap Mode Enable.                                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t ORIEN      : 1;            /*!< [20..20] FIFO Overrun Interrupt Enable.                                   */
      __IOM uint32_t URIEN      : 1;            /*!< [21..21] FIFO Underrun Interrupt Enable.                                  */
      __IOM uint32_t WEIEN      : 1;            /*!< [22..22] FIFO Went Empty Interrupt Enable.                                */
      __IM  uint32_t            : 6;
      __IOM uint32_t DBGMD      : 1;            /*!< [29..29] IDAC Debug Mode.                                                 */
      __IOM uint32_t LOADEN     : 1;            /*!< [30..30] Load Resistor Enable.                                            */
      __IOM uint32_t IDACEN     : 1;            /*!< [31..31] IDAC Enable.                                                     */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Output Data                                                */
    
