chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Output Data.                                                      */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) FIFO Buffer Status                                         */
    
    struct {
      __IM  uint32_t LEVEL      : 3;            /*!< [2..0] FIFO Level.                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t ORI        : 1;            /*!< [4..4] FIFO Overrun Interrupt Flag.                                       */
      __IOM uint32_t URI        : 1;            /*!< [5..5] FIFO Underrun Interrupt Flag.                                      */
      __IOM uint32_t WEI        : 1;            /*!< [6..6] FIFO Went Empty Interrupt Flag.                                    */
    } bit;
  } BUFSTATUS;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) FIFO Buffer Entries 0 and 1                                */
    
    struct {
      __IM  uint32_t BUFFER0    : 16;           /*!< [15..0] FIFO Buffer Entry 0.                                              */
      __IM  uint32_t BUFFER1    : 16;           /*!< [31..16] FIFO Buffer Entry 1.                                             */
    } bit;
  } BUFFER10;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) FIFO Buffer Entries 2 and 3                                */
    
    struct {
      __IM  uint32_t BUFFER2    : 16;           /*!< [15..0] FIFO Buffer Entry 2.                                              */
      __IM  uint32_t BUFFER3    : 16;           /*!< [31..16] FIFO Buffer Entry 3.                                             */
    } bit;
  } BUFFER32;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Output Current Gain Adjust                                 */
    
    struct {
      __IOM uint32_t GAINADJ    : 5;            /*!< [4..0] Output Current Gain Adjust.                                        */
    } bit;
  } GAINADJ;
} IDAC_0_Type;                                  /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                          IDAC_1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (IDAC_1)
  */

typedef struct {                                /*!< (@ 0x40032000) IDAC_1 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t OUPDT      : 3;            /*!< [2..0] Output Update Trigger.                                             */
      __IOM uint32_t ETRIG      : 3;            /*!< [5..3] Edge Trigger Source Select.                                        */
      __IOM uint32_t OUTMD      : 2;            /*!< [7..6] Output Mode.                                                       */
      __IOM uint32_t INFMT      : 2;            /*!< [9..8] Data Input Format.                                                 */
      __IOM uint32_t DMARUN     : 1;            /*!< [10..10] DMA Run.                                                         */
      __IOM uint32_t JSEL       : 1;            /*!< [11..11] Data Justification Select.                                       */
      __OM  uint32_t BUFRESET   : 1;            /*!< [12..12] Data Buffer Reset.                                               */
      __IOM uint32_t TRIGINH    : 1;            /*!< [13..13] Trigger Source Inhibit.                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t WRAPEN     : 1;            /*!< [16..16] Wrap Mode Enable.                                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t ORIEN      : 1;            /*!< [20..20] FIFO Overrun Interrupt Enable.                                   */
      __IOM uint32_t URIEN      : 1;            /*!< [21..21] FIFO Underrun Interrupt Enable.                                  */
      __IOM uint32_t WEIEN      : 1;            /*!< [22..22] FIFO Went Empty Interrupt Enable.                                */
      __IM  uint32_t            : 6;
      __IOM uint32_t DBGMD      : 1;            /*!< [29..29] IDAC Debug Mode.                                                 */
      __IOM uint32_t LOADEN     : 1;            /*!< [30..30] Load Resistor Enable.                                            */
      __IOM uint32_t IDACEN     : 1;            /*!< [31..31] IDAC Enable.                                                     */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Output Data                                                */
    
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Output Data.                                                      */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) FIFO Buffer Status                                         */
    
    struct {
      __IM  uint32_t LEVEL      : 3;            /*!< [2..0] FIFO Level.                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t ORI        : 1;            /*!< [4..4] FIFO Overrun Interrupt Flag.                                       */
      __IOM uint32_t URI        : 1;            /*!< [5..5] FIFO Underrun Interrupt Flag.                                      */
      __IOM uint32_t WEI        : 1;            /*!< [6..6] FIFO Went Empty Interrupt Flag.                                    */
    } bit;
  } BUFSTATUS;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) FIFO Buffer Entries 0 and 1                                */
    
