chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IM  uint32_t BUFFER0    : 16;           /*!< [15..0] FIFO Buffer Entry 0.                                              */
      __IM  uint32_t BUFFER1    : 16;           /*!< [31..16] FIFO Buffer Entry 1.                                             */
    } bit;
  } BUFFER10;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) FIFO Buffer Entries 2 and 3                                */
    
    struct {
      __IM  uint32_t BUFFER2    : 16;           /*!< [15..0] FIFO Buffer Entry 2.                                              */
      __IM  uint32_t BUFFER3    : 16;           /*!< [31..16] FIFO Buffer Entry 3.                                             */
    } bit;
  } BUFFER32;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Output Current Gain Adjust                                 */
    
    struct {
      __IOM uint32_t GAINADJ    : 5;            /*!< [4..0] Output Current Gain Adjust.                                        */
    } bit;
  } GAINADJ;
} IDAC_1_Type;                                  /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                           IVC_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (IVC_0)
  */

typedef struct {                                /*!< (@ 0x40044000) IVC_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t IN0RANGE   : 3;            /*!< [2..0] Input 0 Range.                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t IN1RANGE   : 3;            /*!< [6..4] Input 1 Range.                                                     */
      __IM  uint32_t            : 23;
      __IOM uint32_t C0EN       : 1;            /*!< [30..30] Converter 0 Enable.                                              */
      __IOM uint32_t C1EN       : 1;            /*!< [31..31] Converter 1 Enable.                                              */
    } bit;
  } CONTROL;
} IVC_0_Type;                                   /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                          LOCK_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (LOCK_0)
  */

typedef struct {                                /*!< (@ 0x40049000) LOCK_0 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Security Key                                               */
    
    struct {
      __IOM uint32_t KEY        : 8;            /*!< [7..0] Peripheral Lock Mask Key.                                          */
    } bit;
  } KEY;
  __IM  uint32_t  RESERVED[7];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Peripheral Lock Control 0                                  */
    
    struct {
      __IOM uint32_t USARTL     : 1;            /*!< [0..0] USART/UART Module Lock Enable.                                     */
      __IOM uint32_t SPIL       : 1;            /*!< [1..1] SPI Module Lock Enable.                                            */
      __IOM uint32_t I2CL       : 1;            /*!< [2..2] I2C Module Lock Enable.                                            */
      __IOM uint32_t PCAL       : 1;            /*!< [3..3] PCA Module Lock Enable.                                            */
      __IOM uint32_t TIMERL     : 1;            /*!< [4..4] Timer Module Lock Enable.                                          */
      __IOM uint32_t USBL       : 1;            /*!< [5..5] USB Module Lock Enable.                                            */
      __IOM uint32_t SARADCL    : 1;            /*!< [6..6] SARADC Module Lock Enable.                                         */
      __IOM uint32_t SSGL       : 1;            /*!< [7..7] SSG Module Lock Enable.                                            */
      __IOM uint32_t CMPL       : 1;            /*!< [8..8] Comparator Module Lock Enable.                                     */
      __IOM uint32_t CSL        : 1;            /*!< [9..9] Capacitive Sensing Module Lock Enable.                             */
      __IOM uint32_t EMIFL      : 1;            /*!< [10..10] EMIF Module Lock Enable.                                         */
      __IOM uint32_t AESL       : 1;            /*!< [11..11] AES Module Lock Enable.                                          */
      __IOM uint32_t CRCL       : 1;            /*!< [12..12] CRC Module Lock Enable.                                          */
      __IOM uint32_t RTCL       : 1;            /*!< [13..13] RTC Module Lock Enable.                                          */
      __IOM uint32_t CLKRSTL    : 1;            /*!< [14..14] Clock Control and Reset Sources Lock Enable.                     */
      __IOM uint32_t VMONL      : 1;            /*!< [15..15] Voltage Supply Monitor Module Lock Enable.                       */
      __IOM uint32_t IDACL      : 1;            /*!< [16..16] IDAC Module Lock Enable.                                         */
      __IOM uint32_t DMACTRLL   : 1;            /*!< [17..17] DMA Controller Module Lock Enable.                               */
      __IOM uint32_t DMAXBARL   : 1;            /*!< [18..18] DMA Crossbar Module Lock Enable.                                 */
      __IOM uint32_t LPTL       : 1;            /*!< [19..19] Low Power Timer Module Lock Enable.                              */
      __IOM uint32_t VREFL      : 1;            /*!< [20..20] Voltage Reference Module Lock Enable.                            */
      __IOM uint32_t I2SL       : 1;            /*!< [21..21] I2S Module Lock Enable.                                          */
      __IOM uint32_t PLLL       : 1;            /*!< [22..22] PLL Module Lock Enable.                                          */
      __IOM uint32_t EXTOSCL    : 1;            /*!< [23..23] External Oscillator Module Lock Enable.                          */
      __IOM uint32_t VREGL      : 1;            /*!< [24..24] Voltage Regulator Module Lock Enable.                            */
      __IOM uint32_t LPOSCL     : 1;            /*!< [25..25] Low Power Oscillator Lock Enable.                                */
      __IOM uint32_t EVREGL     : 1;            /*!< [26..26] External Regulator Module Lock Enable.                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t IVCL       : 1;            /*!< [28..28] IVC Module Lock Enable.                                          */
    } bit;
  } PERIPHLOCK0;
  __IM  uint32_t  RESERVED1[7];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Peripheral Lock Control 1                                  */
    
