chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t PMUL       : 1;            /*!< [0..0] PMU Module Lock Enable.                                            */
    } bit;
  } PERIPHLOCK1;
} LOCK_0_Type;                                  /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                         LPTIMER_0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief None (LPTIMER_0)
  */

typedef struct {                                /*!< (@ 0x40038000) LPTIMER_0 Structure                                        */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t CMD        : 2;            /*!< [1..0] Count Mode.                                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t EXTSEL     : 4;            /*!< [7..4] External Trigger Source Select.                                    */
      __IOM uint32_t TMRSET     : 1;            /*!< [8..8] Timer Set.                                                         */
      __IOM uint32_t TMRCAP     : 1;            /*!< [9..9] Timer Capture.                                                     */
      __IOM uint32_t CMPSET     : 1;            /*!< [10..10] Timer Comparator Set.                                            */
      __IOM uint32_t CMPCAP     : 1;            /*!< [11..11] Timer Comparator Capture.                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t OVFIEN     : 1;            /*!< [16..16] Timer Overflow Interrupt Enable.                                 */
      __IOM uint32_t CMPIEN     : 1;            /*!< [17..17] Timer Compare Event Interrupt Enable.                            */
      __IOM uint32_t OVFTMD     : 1;            /*!< [18..18] Timer Overflow Toggle Mode.                                      */
      __IOM uint32_t CMPTMD     : 1;            /*!< [19..19] Timer Compare Event Toggle Mode .                                */
      __IM  uint32_t            : 4;
      __IOM uint32_t CMPRSTEN   : 1;            /*!< [24..24] Timer Compare Event Reset Enable.                                */
      __IM  uint32_t            : 5;
      __IOM uint32_t DBGMD      : 1;            /*!< [30..30] Low Power Timer Debug Mode.                                      */
      __IOM uint32_t RUN        : 1;            /*!< [31..31] Timer Run Control and Compare Threshold Enable.                  */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Timer and Comparator Data                                  */
    
    struct {
      __IOM uint32_t DATA       : 16;           /*!< [15..0] Timer and Comparator Data.                                        */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Module Status                                              */
    
    struct {
      __IOM uint32_t OVFI       : 1;            /*!< [0..0] Timer Overflow Interrupt Flag.                                     */
      __IOM uint32_t CMPI       : 1;            /*!< [1..1] Timer Compare Event Interrupt Flag.                                */
    } bit;
  } STATUS;
} LPTIMER_0_Type;                               /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           PLL_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (PLL_0)
  */

typedef struct {                                /*!< (@ 0x4003B000) PLL_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Reference Divider Setting                                  */
    
    struct {
      __IOM uint32_t M          : 12;           /*!< [11..0] M Divider Value.                                                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t N          : 12;           /*!< [27..16] N Divider Value.                                                 */
    } bit;
  } DIVIDER;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Control                                             */
    
    struct {
      __IM  uint32_t LLMTF      : 1;            /*!< [0..0] CAL Saturation (Low) Flag.                                         */
      __IM  uint32_t HLMTF      : 1;            /*!< [1..1] CAL Saturation (High) Flag.                                        */
      __IM  uint32_t LCKI       : 1;            /*!< [2..2] Phase-Lock and Frequency-Lock Locked Interrupt Flag.               */
      __IM  uint32_t            : 6;
      __IOM uint32_t LMTIEN     : 1;            /*!< [9..9] Limit Interrupt Enable.                                            */
      __IOM uint32_t LCKIEN     : 1;            /*!< [10..10] Locked Interrupt Enable.                                         */
      __IOM uint32_t LCKPOL     : 1;            /*!< [11..11] Lock Interrupt Polarity.                                         */
      __IM  uint32_t            : 4;
      __IOM uint32_t REFSEL     : 2;            /*!< [17..16] Reference Clock Selection Control.                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t LOCKTH     : 2;            /*!< [21..20] Lock Threshold Control.                                          */
      __IM  uint32_t            : 4;
      __IOM uint32_t STALL      : 1;            /*!< [26..26] DCO Output Updates Stall.                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t DITHEN     : 1;            /*!< [28..28] Dithering Enable.                                                */
      __IOM uint32_t EDGSEL     : 1;            /*!< [29..29] Edge Lock Select.                                                */
      __IOM uint32_t OUTMD      : 2;            /*!< [31..30] PLL Output Mode.                                                 */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Spectrum Spreading Control                                 */
    
