chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t SSAMP      : 3;            /*!< [2..0] Spectrum Spreading Amplitude.                                      */
      __IM  uint32_t            : 5;
      __IOM uint32_t SSUINV     : 5;            /*!< [12..8] Spectrum Spreading Update Interval.                               */
    } bit;
  } SSPR;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Calibration Configuration                                  */
    
    struct {
      __IOM uint32_t DITHER     : 4;            /*!< [3..0] DCO Dither Setting.                                                */
      __IOM uint32_t CAL        : 12;           /*!< [15..4] DCO Calibration Value.                                            */
      __IOM uint32_t RANGE      : 3;            /*!< [18..16] DCO Range.                                                       */
    } bit;
  } CALCONFIG;
} PLL_0_Type;                                   /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                         EXTOSC_0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (EXTOSC_0)
  */

typedef struct {                                /*!< (@ 0x4003C000) EXTOSC_0 Structure                                         */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Oscillator Control                                         */
    
    struct {
      __IOM uint32_t FREQCN     : 3;            /*!< [2..0] Frequency Control.                                                 */
      __IM  uint32_t OSCVLDF    : 1;            /*!< [3..3] Oscillator Valid Flag.                                             */
      __IOM uint32_t OSCMD      : 3;            /*!< [6..4] Oscillator Mode.                                                   */
    } bit;
  } CONTROL;
} EXTOSC_0_Type;                                /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                          LPOSC_0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (LPOSC_0)
  */

typedef struct {                                /*!< (@ 0x40041000) LPOSC_0 Structure                                          */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Low Power Oscillator Output Value                          */
    
    struct {
      __IM  uint32_t OSCVAL     : 4;            /*!< [3..0] Low Power Oscillator Output Value.                                 */
    } bit;
  } OSCVAL;
} LPOSC_0_Type;                                 /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           PCA_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (PCA_0)
  */

typedef struct {                                /*!< (@ 0x4000F000) PCA_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Channel Capture/Compare Mode                               */
    
    struct {
      __IOM uint32_t COSEL      : 2;            /*!< [1..0] Channel Output Function Select.                                    */
      __IOM uint32_t PWMMD      : 4;            /*!< [5..2] PWM N-Bit Mode.                                                    */
      __IM  uint32_t            : 2;
      __IOM uint32_t CMD        : 3;            /*!< [10..8] Channel Operating Mode.                                           */
    } bit;
  } MODE_0;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Channel Capture/Compare Control                            */
    
    struct {
      __IOM uint32_t COUTST     : 1;            /*!< [0..0] Channel Output State.                                              */
      __IOM uint32_t CPCAPEN    : 1;            /*!< [1..1] Positive Edge Input Capture Enable.                                */
      __IOM uint32_t CNCAPEN    : 1;            /*!< [2..2] Negative Edge Input Capture Enable.                                */
      __IOM uint32_t CUPDCF     : 1;            /*!< [3..3] Channel Register Update Complete Flag.                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t CCIEN      : 1;            /*!< [8..8] Capture/Compare Interrupt Enable.                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t CIOVFIEN   : 1;            /*!< [11..11] Intermediate Overflow Interrupt Enable.                          */
    } bit;
  } CONTROL_0;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Channel Compare Value                                      */
    
    struct {
      __IOM uint32_t CCAPV      : 18;           /*!< [17..0] Channel Compare Value.                                            */
    } bit;
  } CCAPV_0;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Channel Compare Update Value                               */
    
