chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CCAPVUPD   : 18;           /*!< [17..0] Channel Compare Update Value.                                     */
    } bit;
  } CCAPVUPD_0;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Channel Capture/Compare Mode                               */
    
    struct {
      __IOM uint32_t COSEL      : 2;            /*!< [1..0] Channel Output Function Select.                                    */
      __IOM uint32_t PWMMD      : 4;            /*!< [5..2] PWM N-Bit Mode.                                                    */
      __IM  uint32_t            : 2;
      __IOM uint32_t CMD        : 3;            /*!< [10..8] Channel Operating Mode.                                           */
    } bit;
  } MODE_1;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Channel Capture/Compare Control                            */
    
    struct {
      __IOM uint32_t COUTST     : 1;            /*!< [0..0] Channel Output State.                                              */
      __IOM uint32_t CPCAPEN    : 1;            /*!< [1..1] Positive Edge Input Capture Enable.                                */
      __IOM uint32_t CNCAPEN    : 1;            /*!< [2..2] Negative Edge Input Capture Enable.                                */
      __IOM uint32_t CUPDCF     : 1;            /*!< [3..3] Channel Register Update Complete Flag.                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t CCIEN      : 1;            /*!< [8..8] Capture/Compare Interrupt Enable.                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t CIOVFIEN   : 1;            /*!< [11..11] Intermediate Overflow Interrupt Enable.                          */
    } bit;
  } CONTROL_1;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Channel Compare Value                                      */
    
    struct {
      __IOM uint32_t CCAPV      : 18;           /*!< [17..0] Channel Compare Value.                                            */
    } bit;
  } CCAPV_1;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Channel Compare Update Value                               */
    
    struct {
      __IOM uint32_t CCAPVUPD   : 18;           /*!< [17..0] Channel Compare Update Value.                                     */
    } bit;
  } CCAPVUPD_1;
  __IM  uint32_t  RESERVED7[67];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000180) Module Operating Mode                                      */
    
    struct {
      __IOM uint32_t CLKDIV     : 10;           /*!< [9..0] Input Clock Divisor.                                               */
      __IOM uint32_t CLKSEL     : 3;            /*!< [12..10] Input Clock (F<subscript>CLKIN</subscript>) Select.              */
    } bit;
  } MODE;
  __IM  uint32_t  RESERVED8[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000190) Module Control                                             */
    
    struct {
      __IOM uint32_t OVFIEN     : 1;            /*!< [0..0] PCA Counter Overflow/Limit Interrupt Enable.                       */
      __IM  uint32_t            : 5;
      __IOM uint32_t DBGMD      : 1;            /*!< [6..6] PCA Debug Mode.                                                    */
      __IM  uint32_t            : 14;
      __IOM uint32_t DIVST      : 1;            /*!< [21..21] Clock Divider Output State.                                      */
      __IOM uint32_t DIV        : 10;           /*!< [31..22] Current Clock Divider Count.                                     */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED9[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A0) Module Status                                              */
    
    struct {
      __IOM uint32_t C0CCI      : 1;            /*!< [0..0] Channel 0 Capture/Compare Interrupt Flag.                          */
      __IOM uint32_t C1CCI      : 1;            /*!< [1..1] Channel 1 Capture/Compare Interrupt Flag.                          */
      __IM  uint32_t            : 4;
      __IOM uint32_t RUN        : 1;            /*!< [6..6] Counter/Timer Run.                                                 */
      __IOM uint32_t OVFI       : 1;            /*!< [7..7] Counter/Timer Overflow/Limit Interrupt Flag.                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t C0IOVFI    : 1;            /*!< [10..10] Channel 0 Intermediate Overflow Interrupt Flag.                  */
      __IOM uint32_t C1IOVFI    : 1;            /*!< [11..11] Channel 1 Intermediate Overflow Interrupt Flag.                  */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED10[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001B0) Module Counter/Timer                                       */
    
    struct {
      __IOM uint32_t COUNTER    : 16;           /*!< [15..0] Counter/Timer.                                                    */
    } bit;
  } COUNTER;
  __IM  uint32_t  RESERVED11[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001C0) Module Counter/Timer Upper Limit                           */
    
    struct {
      __IOM uint32_t LIMIT      : 16;           /*!< [15..0] Upper Limit.                                                      */
    } bit;
  } LIMIT;
} PCA_0_Type;                                   /*!< Size = 452 (0x1c4)                                                        */



/* =========================================================================================================================== */
/* ================                                           PCA_1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (PCA_1)
  */

