chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t C0CCI      : 1;            /*!< [0..0] Channel 0 Capture/Compare Interrupt Flag.                          */
      __IOM uint32_t C1CCI      : 1;            /*!< [1..1] Channel 1 Capture/Compare Interrupt Flag.                          */
      __IM  uint32_t            : 4;
      __IOM uint32_t RUN        : 1;            /*!< [6..6] Counter/Timer Run.                                                 */
      __IOM uint32_t OVFI       : 1;            /*!< [7..7] Counter/Timer Overflow/Limit Interrupt Flag.                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t C0IOVFI    : 1;            /*!< [10..10] Channel 0 Intermediate Overflow Interrupt Flag.                  */
      __IOM uint32_t C1IOVFI    : 1;            /*!< [11..11] Channel 1 Intermediate Overflow Interrupt Flag.                  */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED10[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001B0) Module Counter/Timer                                       */
    
    struct {
      __IOM uint32_t COUNTER    : 16;           /*!< [15..0] Counter/Timer.                                                    */
    } bit;
  } COUNTER;
  __IM  uint32_t  RESERVED11[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001C0) Module Counter/Timer Upper Limit                           */
    
    struct {
      __IOM uint32_t LIMIT      : 16;           /*!< [15..0] Upper Limit.                                                      */
    } bit;
  } LIMIT;
} PCA_1_Type;                                   /*!< Size = 452 (0x1c4)                                                        */



/* =========================================================================================================================== */
/* ================                                           PMU_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (PMU_0)
  */

typedef struct {                                /*!< (@ 0x40048000) PMU_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __OM  uint32_t WAKECLR    : 1;            /*!< [0..0] Wakeup Source Clear.                                               */
      __IOM uint32_t PERILPEN   : 1;            /*!< [1..1] Peripheral Low Power Enable.                                       */
      __IOM uint32_t PINLPEN    : 1;            /*!< [2..2] Pin Low Power Enable.                                              */
      __IOM uint32_t PWAKEEN    : 1;            /*!< [3..3] Pin Wake Match Enable.                                             */
      __IOM uint32_t PMUASLPEN  : 1;            /*!< [4..4] PMU Asleep Pin Enable.                                             */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Configuration                                       */
    
    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t RTC0FREN   : 1;            /*!< [8..8] RTC0 Fail RTC0/LPTIMER0 Reset Enable.                              */
      __IOM uint32_t RTC0AREN   : 1;            /*!< [9..9] RTC0 Alarm RTC0/LPTIMER0 Reset Enable.                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t CMP0REN    : 1;            /*!< [13..13] Comparator 0 RTC0/LPTIMER0 Reset Enable.                         */
      __IOM uint32_t PWAKEREN   : 1;            /*!< [14..14] Pin Wake RTC0/LPTIMER0 Reset Enable.                             */
      __IOM uint32_t LPT0REN    : 1;            /*!< [15..15] Low Power Timer RTC0/LPTIMER0 Reset Enable.                      */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Module Status                                              */
    
    struct {
      __IOM uint32_t PM9EF      : 1;            /*!< [0..0] Power Mode 9 Exited Flag.                                          */
      __IM  uint32_t PWAKEF     : 1;            /*!< [1..1] Pin Wake Status Flag.                                              */
      __IOM uint32_t PORF       : 1;            /*!< [2..2] Power-On Reset Flag.                                               */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Wake Source Enable                                         */
    
    struct {
      __IOM uint32_t RTC0FWEN   : 1;            /*!< [0..0] RTC0 Fail Wake Enable.                                             */
      __IOM uint32_t RTC0AWEN   : 1;            /*!< [1..1] RTC0 Alarm Wake Enable.                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t CMP0WEN    : 1;            /*!< [5..5] Comparator 0 Wake Enable.                                          */
      __IOM uint32_t PWAKEWEN   : 1;            /*!< [6..6] Pin Wake Wake Enable.                                              */
      __IOM uint32_t LPT0WEN    : 1;            /*!< [7..7] Low Power Timer Wake Enable.                                       */
      __IOM uint32_t RSTWEN     : 1;            /*!< [8..8] Reset Pin Wake Enable.                                             */
    } bit;
  } WAKEEN;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Wake Source Status                                         */
    
    struct {
      __IM  uint32_t RTC0FWF    : 1;            /*!< [0..0] RTC0 Fail Wake Flag.                                               */
      __IM  uint32_t RTC0AWF    : 1;            /*!< [1..1] RTC0 Alarm Wake Flag.                                              */
      __IM  uint32_t            : 3;
      __IM  uint32_t CMP0WF     : 1;            /*!< [5..5] Comparator 0 Wake Flag.                                            */
      __IM  uint32_t PWAKEWF    : 1;            /*!< [6..6] Pin Wake Wake Flag.                                                */
      __IM  uint32_t LPT0WF     : 1;            /*!< [7..7] Low Power Timer Wake Flag.                                         */
      __IM  uint32_t RSTWF      : 1;            /*!< [8..8] Reset Pin Wake Flag.                                               */
    } bit;
  } WAKESTATUS;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Pin Wake Pin Enable                                        */
    
