chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t PW0EN      : 1;            /*!< [0..0] WAKE.0 Enable.                                                     */
      __IOM uint32_t PW1EN      : 1;            /*!< [1..1] WAKE.1 Enable.                                                     */
      __IOM uint32_t PW2EN      : 1;            /*!< [2..2] WAKE.2 Enable.                                                     */
      __IOM uint32_t PW3EN      : 1;            /*!< [3..3] WAKE.3 Enable.                                                     */
      __IOM uint32_t PW4EN      : 1;            /*!< [4..4] WAKE.4 Enable.                                                     */
      __IOM uint32_t PW5EN      : 1;            /*!< [5..5] WAKE.5 Enable.                                                     */
      __IOM uint32_t PW6EN      : 1;            /*!< [6..6] WAKE.6 Enable.                                                     */
      __IOM uint32_t PW7EN      : 1;            /*!< [7..7] WAKE.7 Enable.                                                     */
      __IOM uint32_t PW8EN      : 1;            /*!< [8..8] WAKE.8 Enable.                                                     */
      __IOM uint32_t PW9EN      : 1;            /*!< [9..9] WAKE.9 Enable.                                                     */
      __IOM uint32_t PW10EN     : 1;            /*!< [10..10] WAKE.10 Enable.                                                  */
      __IOM uint32_t PW11EN     : 1;            /*!< [11..11] WAKE.11 Enable.                                                  */
      __IOM uint32_t PW12EN     : 1;            /*!< [12..12] WAKE.12 Enable.                                                  */
      __IOM uint32_t PW13EN     : 1;            /*!< [13..13] WAKE.13 Enable.                                                  */
      __IOM uint32_t PW14EN     : 1;            /*!< [14..14] WAKE.14 Enable.                                                  */
      __IOM uint32_t PW15EN     : 1;            /*!< [15..15] WAKE.15 Enable.                                                  */
    } bit;
  } PWEN;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Pin Wake Pin Polarity Select                               */
    
    struct {
      __IOM uint32_t PW0POL     : 1;            /*!< [0..0] WAKE.0 Polarity Select.                                            */
      __IOM uint32_t PW1POL     : 1;            /*!< [1..1] WAKE.1 Polarity Select.                                            */
      __IOM uint32_t PW2POL     : 1;            /*!< [2..2] WAKE.2 Polarity Select.                                            */
      __IOM uint32_t PW3POL     : 1;            /*!< [3..3] WAKE.3 Polarity Select.                                            */
      __IOM uint32_t PW4POL     : 1;            /*!< [4..4] WAKE.4 Polarity Select.                                            */
      __IOM uint32_t PW5POL     : 1;            /*!< [5..5] WAKE.5 Polarity Select.                                            */
      __IOM uint32_t PW6POL     : 1;            /*!< [6..6] WAKE.6 Polarity Select.                                            */
      __IOM uint32_t PW7POL     : 1;            /*!< [7..7] WAKE.7 Polarity Select.                                            */
      __IOM uint32_t PW8POL     : 1;            /*!< [8..8] WAKE.8 Polarity Select.                                            */
      __IOM uint32_t PW9POL     : 1;            /*!< [9..9] WAKE.9 Polarity Select.                                            */
      __IOM uint32_t PW10POL    : 1;            /*!< [10..10] WAKE.10 Polarity Select.                                         */
      __IOM uint32_t PW11POL    : 1;            /*!< [11..11] WAKE.11 Polarity Select.                                         */
      __IOM uint32_t PW12POL    : 1;            /*!< [12..12] WAKE.12 Polarity Select.                                         */
      __IOM uint32_t PW13POL    : 1;            /*!< [13..13] WAKE.13 Polarity Select.                                         */
      __IOM uint32_t PW14POL    : 1;            /*!< [14..14] WAKE.14 Polarity Select.                                         */
      __IOM uint32_t PW15POL    : 1;            /*!< [15..15] WAKE.15 Polarity Select.                                         */
    } bit;
  } PWPOL;
} PMU_0_Type;                                   /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                          PBCFG_0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (PBCFG_0)
  */

typedef struct {                                /*!< (@ 0x4002A000) PBCFG_0 Structure                                          */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Global Port Control 0                                      */
    
    struct {
      __IOM uint32_t INT0SEL    : 4;            /*!< [3..0] External Interrupt 0 Pin Selection.                                */
      __IOM uint32_t INT0POL    : 1;            /*!< [4..4] External Interrupt 0 Polarity.                                     */
      __IOM uint32_t INT0MD     : 1;            /*!< [5..5] External Interrupt 0 Mode.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t INT0EN     : 1;            /*!< [7..7] External Interrupt 0 Enable.                                       */
      __IOM uint32_t INT1SEL    : 4;            /*!< [11..8] External Interrupt 1 Pin Selection.                               */
      __IOM uint32_t INT1POL    : 1;            /*!< [12..12] External Interrupt 1 Polarity.                                   */
      __IOM uint32_t INT1MD     : 1;            /*!< [13..13] External Interrupt 1 Mode.                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t INT1EN     : 1;            /*!< [15..15] External Interrupt 1 Enable.                                     */
      __IM  uint32_t            : 8;
      __IOM uint32_t PGTIMER    : 5;            /*!< [28..24] Pulse Generator Timer.                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t PGDONEF    : 1;            /*!< [31..31] Pulse Generator Timer Done Flag.                                 */
    } bit;
  } CONTROL0;
  __IOM uint32_t  CONTROL0_SET;                 /*!< (@ 0x00000004) CONTROL0_SET                                               */
  __IOM uint32_t  CONTROL0_CLR;                 /*!< (@ 0x00000008) CONTROL0_CLR                                               */
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Global Port Control 1                                      */
    
