chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t JTAGEN     : 1;            /*!< [0..0] JTAG Enable.                                                       */
      __IOM uint32_t ETMEN      : 1;            /*!< [1..1] ETM Enable.                                                        */
      __IM  uint32_t            : 5;
      __IOM uint32_t EMIFBE0BEN : 1;            /*!< [7..7] EMIF <overline>BE0</overline> Pin Enable.                          */
      __IOM uint32_t EMIFCS1EN  : 1;            /*!< [8..8] EMIF CS1 Pin Enable.                                               */
      __IOM uint32_t EMIFEN     : 1;            /*!< [9..9] EMIF Enable.                                                       */
      __IOM uint32_t EMIFWIDTH  : 6;            /*!< [15..10] EMIF Width.                                                      */
      __IOM uint32_t MATMD      : 2;            /*!< [17..16] Match Mode.                                                      */
      __IM  uint32_t            : 5;
      __IOM uint32_t EVREGRMD   : 1;            /*!< [23..23] External Regulator Reset Mode.                                   */
      __IM  uint32_t            : 7;
      __IOM uint32_t LOCK       : 1;            /*!< [31..31] Port Bank Configuration Lock.                                    */
    } bit;
  } CONTROL1;
  __IOM uint32_t  CONTROL1_SET;                 /*!< (@ 0x00000014) CONTROL1_SET                                               */
  __IOM uint32_t  CONTROL1_CLR;                 /*!< (@ 0x00000018) CONTROL1_CLR                                               */
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Crossbar 0 Control (Low)                                   */
    
    struct {
      __IOM uint32_t USART0EN   : 1;            /*!< [0..0] USART0 Enable.                                                     */
      __IOM uint32_t USART0FCEN : 1;            /*!< [1..1] USART0 Flow Control Enable.                                        */
      __IOM uint32_t USART0CEN  : 1;            /*!< [2..2] USART0 Clock Signal Enable.                                        */
      __IOM uint32_t SPI0EN     : 1;            /*!< [3..3] SPI0 Enable.                                                       */
      __IOM uint32_t SPI0NSSEN  : 1;            /*!< [4..4] SPI0 NSS Pin Enable.                                               */
      __IOM uint32_t USART1EN   : 1;            /*!< [5..5] USART1 Enable.                                                     */
      __IOM uint32_t USART1FCEN : 1;            /*!< [6..6] USART1 Flow Control Enable.                                        */
      __IOM uint32_t USART1CEN  : 1;            /*!< [7..7] USART1 Clock Signal Enable.                                        */
      __IOM uint32_t EPCA0EN    : 3;            /*!< [10..8] EPCA0 Channel Enable.                                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t PCA0EN     : 2;            /*!< [15..14] PCA0 Channel Enable.                                             */
      __IOM uint32_t PCA1EN     : 2;            /*!< [17..16] PCA1 Channel Enable.                                             */
      __IOM uint32_t EECI0EN    : 1;            /*!< [18..18] EPCA0 ECI Enable.                                                */
      __IOM uint32_t ECI0EN     : 1;            /*!< [19..19] PCA0 ECI Enable.                                                 */
      __IOM uint32_t ECI1EN     : 1;            /*!< [20..20] PCA1 ECI Enable.                                                 */
      __IOM uint32_t I2S0TXEN   : 1;            /*!< [21..21] I2S0 TX Enable.                                                  */
      __IOM uint32_t I2C0EN     : 1;            /*!< [22..22] I2C0 Enable.                                                     */
      __IOM uint32_t CMP0SEN    : 1;            /*!< [23..23] Comparator 0 Synchronous Output (CMP0S) Enable.                  */
      __IOM uint32_t CMP0AEN    : 1;            /*!< [24..24] Comparator 0 Asynchronous Output (CMP0A) Enable.                 */
      __IOM uint32_t CMP1SEN    : 1;            /*!< [25..25] Comparator 1 Synchronous Output (CMP1S) Enable.                  */
      __IOM uint32_t CMP1AEN    : 1;            /*!< [26..26] Comparator 1 Asynchronous Output (CMP1A) Enable.                 */
      __IOM uint32_t TMR0CTEN   : 1;            /*!< [27..27] TIMER0 T0CT Enable.                                              */
      __IOM uint32_t TMR0EXEN   : 1;            /*!< [28..28] TIMER0 T0EX Enable.                                              */
      __IOM uint32_t TMR1CTEN   : 1;            /*!< [29..29] TIMER1 T1CT Enable.                                              */
      __IOM uint32_t TMR1EXEN   : 1;            /*!< [30..30] TIMER1 T1EX Enable.                                              */
    } bit;
  } XBAR0L;
  __IOM uint32_t  XBAR0L_SET;                   /*!< (@ 0x00000024) XBAR0L_SET                                                 */
  __IOM uint32_t  XBAR0L_CLR;                   /*!< (@ 0x00000028) XBAR0L_CLR                                                 */
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Crossbar 0 Control (High)                                  */
    
    struct {
      __IOM uint32_t UART0EN    : 1;            /*!< [0..0] UART0 Enable.                                                      */
      __IOM uint32_t UART0FCEN  : 1;            /*!< [1..1] UART0 Flow Control Enable.                                         */
      __IOM uint32_t UART1EN    : 1;            /*!< [2..2] UART1 Enable.                                                      */
      __IOM uint32_t SPI1EN     : 1;            /*!< [3..3] SPI1 Enable.                                                       */
      __IOM uint32_t SPI1NSSEN  : 1;            /*!< [4..4] SPI1 NSS Pin Enable.                                               */
      __IOM uint32_t SPI2EN     : 1;            /*!< [5..5] SPI2 Enable.                                                       */
      __IOM uint32_t SPI2NSSEN  : 1;            /*!< [6..6] SPI2 NSS Pin Enable.                                               */
      __IOM uint32_t AHBEN      : 1;            /*!< [7..7] AHB Clock Output Enable.                                           */
      __IM  uint32_t            : 23;
      __IOM uint32_t XBAR0EN    : 1;            /*!< [31..31] Crossbar 0 Enable.                                               */
    } bit;
  } XBAR0H;
  __IOM uint32_t  XBAR0H_SET;                   /*!< (@ 0x00000034) XBAR0H_SET                                                 */
  __IOM uint32_t  XBAR0H_CLR;                   /*!< (@ 0x00000038) XBAR0H_CLR                                                 */
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Crossbar 1 Control                                         */
    
