chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t SSG0EN     : 2;            /*!< [1..0] SSG0 Enable.                                                       */
      __IOM uint32_t CMP0SEN    : 1;            /*!< [2..2] Comparator 0 Synchronous Output (CMP0S) Enable.                    */
      __IOM uint32_t CMP1SEN    : 1;            /*!< [3..3] Comparator 1 Synchronous Output (CMP1S) Enable.                    */
      __IOM uint32_t SPI1EN     : 1;            /*!< [4..4] SPI1 Enable.                                                       */
      __IOM uint32_t SPI1NSSEN  : 1;            /*!< [5..5] SPI1 NSS Pin Enable.                                               */
      __IOM uint32_t RTC0EN     : 1;            /*!< [6..6] RTC0 Output Enable.                                                */
      __IOM uint32_t SPI2EN     : 1;            /*!< [7..7] SPI2 Enable.                                                       */
      __IOM uint32_t SPI2NSSEN  : 1;            /*!< [8..8] SPI2 NSS Pin Enable.                                               */
      __IOM uint32_t USART1EN   : 1;            /*!< [9..9] USART1 Enable.                                                     */
      __IOM uint32_t USART1FCEN : 1;            /*!< [10..10] USART1 Flow Control Enable.                                      */
      __IOM uint32_t USART1CEN  : 1;            /*!< [11..11] USART1 Clock Signal Enable.                                      */
      __IOM uint32_t UART0EN    : 1;            /*!< [12..12] UART0 Enable.                                                    */
      __IOM uint32_t UART0FCEN  : 1;            /*!< [13..13] UART0 Flow Control Enable.                                       */
      __IOM uint32_t I2S0TXEN   : 1;            /*!< [14..14] I2S0 TX Enable.                                                  */
      __IOM uint32_t I2C0EN     : 1;            /*!< [15..15] I2C0 Enable.                                                     */
      __IOM uint32_t UART1EN    : 1;            /*!< [16..16] UART1 Enable.                                                    */
      __IOM uint32_t I2S0RXEN   : 1;            /*!< [17..17] I2S0 RX Enable.                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t LPT0OEN    : 1;            /*!< [19..19] LPTIMER0 Output Enable.                                          */
      __IOM uint32_t I2C1EN     : 1;            /*!< [20..20] I2C1 Enable.                                                     */
      __IOM uint32_t KILLHDEN   : 1;            /*!< [21..21] High Drive Kill Pin Enable.                                      */
      __IM  uint32_t            : 9;
      __IOM uint32_t XBAR1EN    : 1;            /*!< [31..31] Crossbar 1 Enable.                                               */
    } bit;
  } XBAR1;
  __IOM uint32_t  XBAR1_SET;                    /*!< (@ 0x00000044) XBAR1_SET                                                  */
  __IOM uint32_t  XBAR1_CLR;                    /*!< (@ 0x00000048) XBAR1_CLR                                                  */
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Global Port Key                                            */
    
    struct {
      __IOM uint32_t KEY        : 8;            /*!< [7..0] Port Bank 2, 3, and 4 Key.                                         */
    } bit;
  } PBKEY;
} PBCFG_0_Type;                                 /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                          PBHD_4                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (PBHD_4)
  */

typedef struct {                                /*!< (@ 0x4002A3C0) PBHD_4 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Output Latch                                               */
    
    struct {
      __IOM uint32_t PB         : 6;            /*!< [5..0] Output Latch.                                                      */
    } bit;
  } PB;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Pin Value                                                  */
    
    struct {
      __IM  uint32_t PBPIN      : 6;            /*!< [5..0] Pin Value.                                                         */
    } bit;
  } PBPIN;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Mode Select                                                */
    
    struct {
      __IOM uint32_t PBMDSEL    : 6;            /*!< [5..0] Mode Select.                                                       */
    } bit;
  } PBMDSEL;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Driver Enable                                              */
    
    struct {
      __IOM uint32_t PBNDEN     : 6;            /*!< [5..0] Port Bank N-Channel Driver Enable.                                 */
      __IM  uint32_t            : 10;
      __IOM uint32_t PBPDEN     : 6;            /*!< [21..16] Port Bank P-Channel Driver Enable.                               */
    } bit;
  } PBDEN;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Drive Strength                                             */
    
    struct {
      __IOM uint32_t PBDRV      : 6;            /*!< [5..0] Drive Strength.                                                    */
      __IM  uint32_t            : 10;
      __IOM uint32_t PBPUEN     : 1;            /*!< [16..16] Port Bank Weak Pull-up Enable.                                   */
      __IOM uint32_t PBLVMD     : 1;            /*!< [17..17] Port Low Voltage Mode.                                           */
      __IOM uint32_t PBSLEW     : 2;            /*!< [19..18] Port Slew Control.                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t PBBIASEN   : 1;            /*!< [21..21] Port Bias Enable.                                                */
      __IOM uint32_t PBDRVEN    : 1;            /*!< [22..22] Port Drive Enable.                                               */
      __IOM uint32_t PBVTRKEN   : 1;            /*!< [23..23] Port Voltage Supply Tracking Enable.                             */
    } bit;
  } PBDRV;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Current Limit                                              */
    
