chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t PBILEN     : 6;            /*!< [5..0] Current Limit Enable.                                              */
      __IM  uint32_t            : 10;
      __IOM uint32_t NILIMIT    : 4;            /*!< [19..16] N-Channel Current Limit.                                         */
      __IOM uint32_t PILIMIT    : 4;            /*!< [23..20] P-Channel Current Limit.                                         */
    } bit;
  } PBILIMIT;
  __IM  uint32_t  RESERVED5[7];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Function Select                                            */
    
    struct {
      __IOM uint32_t PB0SEL     : 2;            /*!< [1..0] Port Bank n.0 Function Select.                                     */
      __IOM uint32_t PB1SEL     : 2;            /*!< [3..2] Port Bank n.1 Function Select.                                     */
      __IOM uint32_t PB2SEL     : 2;            /*!< [5..4] Port Bank n.2 Function Select.                                     */
      __IOM uint32_t PB3SEL     : 2;            /*!< [7..6] Port Bank n.3 Function Select.                                     */
      __IOM uint32_t PB4SEL     : 2;            /*!< [9..8] Port Bank n.4 Function Select.                                     */
      __IOM uint32_t PB5SEL     : 3;            /*!< [12..10] Port Bank n.5 Function Select.                                   */
    } bit;
  } PBFSEL;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Safe State Control                                         */
    
    struct {
      __IOM uint32_t PB0SSSEL   : 2;            /*!< [1..0] Port Bank n.0 Safe State Select.                                   */
      __IOM uint32_t PB1SSSEL   : 2;            /*!< [3..2] Port Bank n.1 Safe State Select.                                   */
      __IOM uint32_t PB2SSSEL   : 2;            /*!< [5..4] Port Bank n.2 Safe State Select.                                   */
      __IOM uint32_t PB3SSSEL   : 2;            /*!< [7..6] Port Bank n.3 Safe State Select.                                   */
      __IOM uint32_t PB4SSSEL   : 2;            /*!< [9..8] Port Bank n.4 Safe State Select.                                   */
      __IOM uint32_t PB5SSSEL   : 2;            /*!< [11..10] Port Bank n.5 Safe State Select.                                 */
      __IM  uint32_t            : 4;
      __IOM uint32_t SSMDEN     : 1;            /*!< [16..16] Enter Safe State Mode.                                           */
      __IOM uint32_t PBSSSMD    : 1;            /*!< [17..17] Safe State Signal Mode.                                          */
    } bit;
  } PBSS;
  __IM  uint32_t  RESERVED7[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Lock Control                                               */
    
    struct {
      __IOM uint32_t PBLOCK     : 6;            /*!< [5..0] Port Bank Lock.                                                    */
    } bit;
  } PBLOCK;
} PBHD_4_Type;                                  /*!< Size = 148 (0x94)                                                         */



/* =========================================================================================================================== */
/* ================                                          PBSTD_0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (PBSTD_0)
  */

typedef struct {                                /*!< (@ 0x4002A0A0) PBSTD_0 Structure                                          */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Output Latch                                               */
    
    struct {
      __IOM uint32_t PB         : 16;           /*!< [15..0] Output Latch.                                                     */
    } bit;
  } PB;
  __IOM uint32_t  PB_SET;                       /*!< (@ 0x00000004) PB_SET                                                     */
  __IOM uint32_t  PB_CLR;                       /*!< (@ 0x00000008) PB_CLR                                                     */
  __IOM uint32_t  PB_MSK;                       /*!< (@ 0x0000000C) PB_MSK                                                     */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Pin Value                                                  */
    
    struct {
      __IM  uint32_t PBPIN      : 16;           /*!< [15..0] Pin Value.                                                        */
    } bit;
  } PBPIN;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Mode Select                                                */
    
    struct {
      __IOM uint32_t PBMDSEL    : 16;           /*!< [15..0] Mode Select.                                                      */
    } bit;
  } PBMDSEL;
  __IOM uint32_t  PBMDSEL_SET;                  /*!< (@ 0x00000024) PBMDSEL_SET                                                */
  __IOM uint32_t  PBMDSEL_CLR;                  /*!< (@ 0x00000028) PBMDSEL_CLR                                                */
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Crossbar Pin Skip Enable                                   */
    
    struct {
      __IOM uint32_t PBSKIPEN   : 16;           /*!< [15..0] Crossbar Pin Skip Enable.                                         */
    } bit;
  } PBSKIPEN;
  __IOM uint32_t  PBSKIPEN_SET;                 /*!< (@ 0x00000034) PBSKIPEN_SET                                               */
  __IOM uint32_t  PBSKIPEN_CLR;                 /*!< (@ 0x00000038) PBSKIPEN_CLR                                               */
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Output Mode                                                */
    
