chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t PBOUTMD    : 16;           /*!< [15..0] Output Mode.                                                      */
    } bit;
  } PBOUTMD;
  __IOM uint32_t  PBOUTMD_SET;                  /*!< (@ 0x00000044) PBOUTMD_SET                                                */
  __IOM uint32_t  PBOUTMD_CLR;                  /*!< (@ 0x00000048) PBOUTMD_CLR                                                */
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Drive Strength                                             */
    
    struct {
      __IOM uint32_t PBDRV      : 16;           /*!< [15..0] Drive Strength.                                                   */
      __IOM uint32_t PBPUEN     : 1;            /*!< [16..16] Port Bank Weak Pull-up Enable.                                   */
    } bit;
  } PBDRV;
  __IOM uint32_t  PBDRV_SET;                    /*!< (@ 0x00000054) PBDRV_SET                                                  */
  __IOM uint32_t  PBDRV_CLR;                    /*!< (@ 0x00000058) PBDRV_CLR                                                  */
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Port Match Value                                           */
    
    struct {
      __IOM uint32_t PM         : 16;           /*!< [15..0] Port Match Value.                                                 */
    } bit;
  } PM;
  __IOM uint32_t  PM_SET;                       /*!< (@ 0x00000064) PM_SET                                                     */
  __IOM uint32_t  PM_CLR;                       /*!< (@ 0x00000068) PM_CLR                                                     */
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Port Match Enable                                          */
    
    struct {
      __IOM uint32_t PMEN       : 16;           /*!< [15..0] Port Match Enable.                                                */
    } bit;
  } PMEN;
  __IOM uint32_t  PMEN_SET;                     /*!< (@ 0x00000074) PMEN_SET                                                   */
  __IOM uint32_t  PMEN_CLR;                     /*!< (@ 0x00000078) PMEN_CLR                                                   */
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Lock Control                                               */
    
    struct {
      __IOM uint32_t PBLOCK     : 16;           /*!< [15..0] Port Bank Lock.                                                   */
    } bit;
  } PBLOCK;
  __IM  uint32_t  RESERVED7[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Pulse Generator Pin Enable                                 */
    
    struct {
      __IOM uint32_t PBPGEN     : 16;           /*!< [15..0] Pulse Generator Pin Enable.                                       */
    } bit;
  } PBPGEN;
  __IM  uint32_t  RESERVED8[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Pulse Generator Phase                                      */
    
    struct {
      __IOM uint32_t PBPGPH0    : 16;           /*!< [15..0] Pulse Generator Phase 0.                                          */
      __IOM uint32_t PBPGPH1    : 16;           /*!< [31..16] Pulse Generator Phase 1.                                         */
    } bit;
  } PBPGPHASE;
} PBSTD_Type;                                   /*!< Size = 164 (0xa4)                                                         */



/* =========================================================================================================================== */
/* ================                                           RTC_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (RTC_0)
  */

typedef struct {                                /*!< (@ 0x40029000) RTC_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) RTC Configuration                                          */
    
    struct {
      __IOM uint32_t ALM0AREN   : 1;            /*!< [0..0] Alarm 0 Automatic Reset Enable.                                    */
      __IOM uint32_t RUN        : 1;            /*!< [1..1] RTC Timer Enable.                                                  */
      __IOM uint32_t MCLKEN     : 1;            /*!< [2..2] Missing Clock Detector Enable.                                     */
      __IOM uint32_t ASEN       : 1;            /*!< [3..3] Automatic Crystal Load Capacitance Stepping Enable.                */
      __IOM uint32_t RTCLC      : 4;            /*!< [7..4] Load Capacitance Value.                                            */
      __IM  uint32_t            : 8;
      __IOM uint32_t BDEN       : 1;            /*!< [16..16] Bias Doubler Enable.                                             */
      __IOM uint32_t CRYSEN     : 1;            /*!< [17..17] Crystal Oscillator Enable.                                       */
      __IOM uint32_t AGCEN      : 1;            /*!< [18..18] Automatic Gain Control Enable.                                   */
      __IM  uint32_t            : 5;
      __IOM uint32_t ALM0EN     : 1;            /*!< [24..24] Alarm 0 Enable.                                                  */
      __IOM uint32_t ALM1EN     : 1;            /*!< [25..25] Alarm 1 Enable.                                                  */
      __IOM uint32_t ALM2EN     : 1;            /*!< [26..26] Alarm 2 Enable.                                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t RTCOEN     : 1;            /*!< [29..29] RTC0 External Output Enable.                                     */
      __IOM uint32_t CLKSEL     : 1;            /*!< [30..30] RTC Timer Clock Select.                                          */
      __IOM uint32_t RTCEN      : 1;            /*!< [31..31] RTC Oscillator and Timer Enable.                                 */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) RTC Control                                                */
    
