chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t ALM0I      : 1;            /*!< [0..0] Alarm 0 Interrupt Flag.                                            */
      __IOM uint32_t ALM1I      : 1;            /*!< [1..1] Alarm 1 Interrupt Flag.                                            */
      __IOM uint32_t ALM2I      : 1;            /*!< [2..2] Alarm 2 Interrupt Flag.                                            */
      __IOM uint32_t TMRCAP     : 1;            /*!< [3..3] RTC Timer Capture.                                                 */
      __IOM uint32_t TMRSET     : 1;            /*!< [4..4] RTC Timer Set.                                                     */
      __IM  uint32_t CLKVF      : 1;            /*!< [5..5] RTC External Oscillator Valid Flag.                                */
      __IOM uint32_t OSCFI      : 1;            /*!< [6..6] RTC Oscillator Fail Interrupt Flag.                                */
      __IOM uint32_t HSMDEN     : 1;            /*!< [7..7] RTC High Speed Mode Enable.                                        */
      __IM  uint32_t LRDYF      : 1;            /*!< [8..8] RTC Load Capacitance Ready Flag.                                   */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) RTC Alarm 0                                                */
    
    struct {
      __IOM uint32_t ALARM0     : 32;           /*!< [31..0] RTC Alarm 0.                                                      */
    } bit;
  } ALARM0;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) RTC Alarm 1                                                */
    
    struct {
      __IOM uint32_t ALARM1     : 32;           /*!< [31..0] RTC Alarm 1.                                                      */
    } bit;
  } ALARM1;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) RTC Alarm 2                                                */
    
    struct {
      __IOM uint32_t ALARM2     : 32;           /*!< [31..0] RTC Alarm 2.                                                      */
    } bit;
  } ALARM2;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) RTC Timer Set/Capture Value                                */
    
    struct {
      __IOM uint32_t SETCAP     : 32;           /*!< [31..0] RTC Timer Set/Capture Value.                                      */
    } bit;
  } SETCAP;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) LFOSC Control                                              */
    
    struct {
      __IM  uint32_t            : 31;
      __IOM uint32_t LFOSCEN    : 1;            /*!< [31..31] Low Frequency Oscillator Enable.                                 */
    } bit;
  } LFOCONTROL;
  __IM  uint32_t  RESERVED6[7];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) LFOSC Output Frequency Adjust                              */
    
    struct {
      __IOM uint32_t LFOSCADJ   : 4;            /*!< [3..0] LFOSC Output Frequency Adjust.                                     */
    } bit;
  } LFOSCADJ;
} RTC_0_Type;                                   /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                         RSTSRC_0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (RSTSRC_0)
  */

typedef struct {                                /*!< (@ 0x4002D060) RSTSRC_0 Structure                                         */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) System Reset Source Enable                                 */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t VMONREN    : 1;            /*!< [2..2] Voltage Supply Monitor VDD Reset Enable.                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t MCDREN     : 1;            /*!< [4..4] Missing Clock Detector Reset Enable.                               */
      __IOM uint32_t WDTREN     : 1;            /*!< [5..5] Watchdog Timer Reset Enable.                                       */
      __IOM uint32_t SWREN      : 1;            /*!< [6..6] Software Reset.                                                    */
      __IOM uint32_t CMP0REN    : 1;            /*!< [7..7] Comparator 0 Reset Enable.                                         */
      __IOM uint32_t CMP1REN    : 1;            /*!< [8..8] Comparator 1 Reset Enable.                                         */
      __IOM uint32_t USB0REN    : 1;            /*!< [9..9] USB0 Reset Enable.                                                 */
      __IOM uint32_t RTC0REN    : 1;            /*!< [10..10] RTC0 Reset Enable.                                               */
      __IOM uint32_t WAKEREN    : 1;            /*!< [11..11] PMU Wakeup Reset Enable.                                         */
    } bit;
  } RESETEN;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) System Reset Flags                                         */
    
    struct {
      __IM  uint32_t PINRF      : 1;            /*!< [0..0] Pin Reset Flag.                                                    */
      __IM  uint32_t PORRF      : 1;            /*!< [1..1] Power-On Reset Flag.                                               */
      __IM  uint32_t VMONRF     : 1;            /*!< [2..2] Voltage Supply Monitor VDD Reset Flag.                             */
      __IM  uint32_t CORERF     : 1;            /*!< [3..3] Core Reset Flag.                                                   */
      __IM  uint32_t MCDRF      : 1;            /*!< [4..4] Missing Clock Detector Reset Flag.                                 */
      __IM  uint32_t WDTRF      : 1;            /*!< [5..5] Watchdog Timer Reset Flag.                                         */
      __IM  uint32_t SWRF       : 1;            /*!< [6..6] Software Reset Flag.                                               */
      __IM  uint32_t CMP0RF     : 1;            /*!< [7..7] Comparator 0 Reset Flag.                                           */
      __IM  uint32_t CMP1RF     : 1;            /*!< [8..8] Comparator 1 Reset Flag.                                           */
      __IM  uint32_t USB0RF     : 1;            /*!< [9..9] USB0 Reset Flag.                                                   */
      __IM  uint32_t RTC0RF     : 1;            /*!< [10..10] RTC0 Reset Flag.                                                 */
      __IM  uint32_t WAKERF     : 1;            /*!< [11..11] PMU Wakeup Reset Flag.                                           */
    } bit;
  } RESETFLAG;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Configuration Options                                      */
    
