chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t PMSEL      : 1;            /*!< [0..0] Power Mode Select.                                                 */
    } bit;
  } CONFIG;
} RSTSRC_0_Type;                                /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (SPI_0)
  */

typedef struct {                                /*!< (@ 0x40004000) SPI_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Input/Output Data                                          */
    
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Input/Output Data.                                                */
    } bit;
  } DATA;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Control                                             */
    
    struct {
      __IM  uint32_t RFRQI      : 1;            /*!< [0..0] Receive FIFO Read Request Interrupt Flag.                          */
      __IOM uint32_t RFORI      : 1;            /*!< [1..1] Receive FIFO Overrun Interrupt Flag.                               */
      __IM  uint32_t TFRQI      : 1;            /*!< [2..2] Transmit FIFO Write Request Interrupt Flag.                        */
      __IOM uint32_t TFORI      : 1;            /*!< [3..3] Transmit FIFO Overrun Interrupt Flag.                              */
      __IM  uint32_t SLVSELI    : 1;            /*!< [4..4] Slave Selected Interrupt Flag.                                     */
      __IOM uint32_t MDFI       : 1;            /*!< [5..5] Mode Fault Interrupt Flag.                                         */
      __IOM uint32_t URI        : 1;            /*!< [6..6] Underrun Interrupt Flag.                                           */
      __IM  uint32_t SREI       : 1;            /*!< [7..7] Shift Register Empty Interrupt Flag.                               */
      __IOM uint32_t RFILI      : 1;            /*!< [8..8] Illegal Receive FIFO Access Interrupt Flag.                        */
      __IOM uint32_t TFILI      : 1;            /*!< [9..9] Illegal Transmit FIFO Access Interrupt Flag.                       */
      __IM  uint32_t            : 4;
      __IM  uint32_t NSSSTS     : 1;            /*!< [14..14] NSS Instantaneous Pin Status.                                    */
      __IM  uint32_t BUSYF      : 1;            /*!< [15..15] SPI Busy.                                                        */
      __IM  uint32_t RFCNT      : 4;            /*!< [19..16] Receive FIFO Counter.                                            */
      __IM  uint32_t TFCNT      : 4;            /*!< [23..20] Transmit FIFO Counter.                                           */
      __IOM uint32_t DBGMD      : 1;            /*!< [24..24] SPI Debug Mode.                                                  */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Module Configuration                                       */
    
    struct {
      __IOM uint32_t RFRQIEN    : 1;            /*!< [0..0] Receive FIFO Read Request Interrupt Enable.                        */
      __IOM uint32_t RFORIEN    : 1;            /*!< [1..1] Receive FIFO Overrun Interrupt Enable.                             */
      __IOM uint32_t TFRQIEN    : 1;            /*!< [2..2] Transmit FIFO Write Request Interrupt Enable.                      */
      __IOM uint32_t TFORIEN    : 1;            /*!< [3..3] Transmit FIFO Overrun Interrupt Enable.                            */
      __IOM uint32_t SLVSELIEN  : 1;            /*!< [4..4] Slave Selected Interrupt Enable.                                   */
      __IOM uint32_t MDFIEN     : 1;            /*!< [5..5] Mode Fault Interrupt Enable.                                       */
      __IOM uint32_t URIEN      : 1;            /*!< [6..6] Underrun Interrupt Enable.                                         */
      __IOM uint32_t SREIEN     : 1;            /*!< [7..7] Shift Register Empty Interrupt Enable.                             */
      __IOM uint32_t SPIEN      : 1;            /*!< [8..8] SPI Enable.                                                        */
      __IOM uint32_t MSTEN      : 1;            /*!< [9..9] Master Mode Enable.                                                */
      __IOM uint32_t CLKPOL     : 1;            /*!< [10..10] SPI Clock Polarity.                                              */
      __IOM uint32_t CLKPHA     : 1;            /*!< [11..11] SPI Clock Phase.                                                 */
      __IOM uint32_t NSSPOL     : 1;            /*!< [12..12] Slave Select Polarity Select.                                    */
      __IOM uint32_t DDIRSEL    : 1;            /*!< [13..13] Data Direction Select.                                           */
      __IOM uint32_t NSSMD      : 2;            /*!< [15..14] Slave Select Mode.                                               */
      __IOM uint32_t RFTH       : 2;            /*!< [17..16] Receive FIFO Threshold.                                          */
      __IOM uint32_t TFTH       : 2;            /*!< [19..18] Transmit FIFO Threshold.                                         */
      __IOM uint32_t DSIZE      : 4;            /*!< [23..20] Data Size.                                                       */
      __IOM uint32_t DMAEN      : 1;            /*!< [24..24] DMA Enable.                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t RFIFOFL    : 1;            /*!< [29..29] Receive FIFO Flush.                                              */
      __IOM uint32_t TFIFOFL    : 1;            /*!< [30..30] Transmit FIFO Flush.                                             */
      __IOM uint32_t RESET      : 1;            /*!< [31..31] Module Soft Reset.                                               */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Module Clock Rate Control                                  */
    
