chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CLKDIV     : 16;           /*!< [15..0] Clock Divider.                                                    */
    } bit;
  } CLKRATE;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) FIFO Status                                                */
    
    struct {
      __IM  uint32_t RFRPTR     : 4;            /*!< [3..0] Receive FIFO Read Pointer.                                         */
      __IM  uint32_t RFWPTR     : 4;            /*!< [7..4] Receive FIFO Write Pointer.                                        */
      __IM  uint32_t TFRPTR     : 4;            /*!< [11..8] Transmit FIFO Read Pointer.                                       */
      __IM  uint32_t TFWPTR     : 4;            /*!< [15..12] Transmit FIFO Write Pointer.                                     */
    } bit;
  } FSTATUS;
} SPI_Type;                                     /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                           SSG_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (SSG_0)
  */

typedef struct {                                /*!< (@ 0x4001E000) SSG_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Configuration                                       */
    
    struct {
      __IOM uint32_t COUNT      : 12;           /*!< [11..0] Pulse Generator Counter.                                          */
      __IOM uint32_t SSEL       : 1;            /*!< [12..12] Speed Select.                                                    */
      __IOM uint32_t PHGFREN    : 1;            /*!< [13..13] Phase Generator Free-Run Enable.                                 */
      __IOM uint32_t PUGFREN    : 1;            /*!< [14..14] Pulse Generator Free-Run Enable.                                 */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Control                                             */
    
    struct {
      __IOM uint32_t EX0INVEN   : 1;            /*!< [0..0] Output 0 Invert Enable.                                            */
      __IOM uint32_t EX1INVEN   : 1;            /*!< [1..1] Output 1 Invert Enable.                                            */
      __IOM uint32_t EX2INVEN   : 1;            /*!< [2..2] Output 2 Invert Enable.                                            */
      __IOM uint32_t EX3INVEN   : 1;            /*!< [3..3] Output 3 Invert Enable.                                            */
      __IOM uint32_t EX0EN      : 1;            /*!< [4..4] Output 0 Enable.                                                   */
      __IOM uint32_t EX1EN      : 1;            /*!< [5..5] Output 1 Enable.                                                   */
      __IOM uint32_t EX2EN      : 1;            /*!< [6..6] Output 2 Enable.                                                   */
      __IOM uint32_t EX3EN      : 1;            /*!< [7..7] Output 3 Enable.                                                   */
      __IM  uint32_t STATUS     : 1;            /*!< [8..8] SSG Module Status.                                                 */
    } bit;
  } CONTROL;
} SSG_0_Type;                                   /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER_0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (TIMER_0)
  */

typedef struct {                                /*!< (@ 0x40014000) TIMER_0 Structure                                          */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) High and Low Timer Configuration                           */
    
    struct {
      __IOM uint32_t LCLK       : 2;            /*!< [1..0] Low Clock Source.                                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t LMSTREN    : 1;            /*!< [4..4] Low Run Master Enable.                                             */
      __IOM uint32_t SPLITEN    : 1;            /*!< [5..5] Split Mode Enable.                                                 */
      __IOM uint32_t LEXIEN     : 1;            /*!< [6..6] Low Timer Extra Interrupt Enable.                                  */
      __IOM uint32_t LOVFIEN    : 1;            /*!< [7..7] Low Timer Overflow Interrupt Enable.                               */
      __IOM uint32_t LMD        : 3;            /*!< [10..8] Low Timer Mode.                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t LSTATE     : 1;            /*!< [12..12] Low Multi Purpose State Indicator.                               */
      __IOM uint32_t LRUN       : 1;            /*!< [13..13] Run Control Low.                                                 */
      __IOM uint32_t LEXI       : 1;            /*!< [14..14] Low Timer Extra Interrupt Flag.                                  */
      __IOM uint32_t LOVFI      : 1;            /*!< [15..15] Low Timer Overflow Interrupt.                                    */
      __IOM uint32_t HCLK       : 2;            /*!< [17..16] High Clock Source.                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t MSTRUN     : 1;            /*!< [19..19] Master Run Control.                                              */
      __IOM uint32_t HMSTREN    : 1;            /*!< [20..20] High Master Enable.                                              */
      __IOM uint32_t DBGMD      : 1;            /*!< [21..21] Timer Debug Mode.                                                */
      __IOM uint32_t HEXIEN     : 1;            /*!< [22..22] High Timer Extra Interrupt Enable.                               */
      __IOM uint32_t HOVFIEN    : 1;            /*!< [23..23] High Timer Overflow Interrupt Enable.                            */
      __IOM uint32_t HMD        : 4;            /*!< [27..24] High Timer Mode.                                                 */
      __IOM uint32_t HSTATE     : 1;            /*!< [28..28] High Multi Purpose State Indicator.                              */
      __IOM uint32_t HRUN       : 1;            /*!< [29..29] High Run Control.                                                */
      __IOM uint32_t HEXI       : 1;            /*!< [30..30] High Timer Extra Interrupt Flag.                                 */
      __IOM uint32_t HOVFI      : 1;            /*!< [31..31] High Timer Overflow Interrupt Flag.                              */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Clock Divider Control                               */
    
