chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t CLKDIVRL   : 8;            /*!< [7..0] Clock Divider Reload Value.                                        */
      __IM  uint32_t            : 8;
      __IOM uint32_t CLKDIVCT   : 8;            /*!< [23..16] Clock Divider Counter.                                           */
    } bit;
  } CLKDIV;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Timer Value                                                */
    
    struct {
      __IOM uint32_t LCOUNT     : 16;           /*!< [15..0] Low Timer Count.                                                  */
      __IOM uint32_t HCOUNT     : 16;           /*!< [31..16] High Timer Count.                                                */
    } bit;
  } COUNT;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Timer Capture/Reload Value                                 */
    
    struct {
      __IOM uint32_t LCCR       : 16;           /*!< [15..0] Low Timer Capture/Reload.                                         */
      __IOM uint32_t HCCR       : 16;           /*!< [31..16] High Timer Capture/Reload.                                       */
    } bit;
  } CAPTURE;
} TIMER_0_Type;                                 /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER_1                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief None (TIMER_1)
  */

typedef struct {                                /*!< (@ 0x40015000) TIMER_1 Structure                                          */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) High and Low Timer Configuration                           */
    
    struct {
      __IOM uint32_t LCLK       : 2;            /*!< [1..0] Low Clock Source.                                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t LMSTREN    : 1;            /*!< [4..4] Low Run Master Enable.                                             */
      __IOM uint32_t SPLITEN    : 1;            /*!< [5..5] Split Mode Enable.                                                 */
      __IOM uint32_t LEXIEN     : 1;            /*!< [6..6] Low Timer Extra Interrupt Enable.                                  */
      __IOM uint32_t LOVFIEN    : 1;            /*!< [7..7] Low Timer Overflow Interrupt Enable.                               */
      __IOM uint32_t LMD        : 3;            /*!< [10..8] Low Timer Mode.                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t LSTATE     : 1;            /*!< [12..12] Low Multi Purpose State Indicator.                               */
      __IOM uint32_t LRUN       : 1;            /*!< [13..13] Run Control Low.                                                 */
      __IOM uint32_t LEXI       : 1;            /*!< [14..14] Low Timer Extra Interrupt Flag.                                  */
      __IOM uint32_t LOVFI      : 1;            /*!< [15..15] Low Timer Overflow Interrupt.                                    */
      __IOM uint32_t HCLK       : 2;            /*!< [17..16] High Clock Source.                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t MSTRUN     : 1;            /*!< [19..19] Master Run Control.                                              */
      __IOM uint32_t HMSTREN    : 1;            /*!< [20..20] High Master Enable.                                              */
      __IOM uint32_t DBGMD      : 1;            /*!< [21..21] Timer Debug Mode.                                                */
      __IOM uint32_t HEXIEN     : 1;            /*!< [22..22] High Timer Extra Interrupt Enable.                               */
      __IOM uint32_t HOVFIEN    : 1;            /*!< [23..23] High Timer Overflow Interrupt Enable.                            */
      __IOM uint32_t HMD        : 4;            /*!< [27..24] High Timer Mode.                                                 */
      __IOM uint32_t HSTATE     : 1;            /*!< [28..28] High Multi Purpose State Indicator.                              */
      __IOM uint32_t HRUN       : 1;            /*!< [29..29] High Run Control.                                                */
      __IOM uint32_t HEXI       : 1;            /*!< [30..30] High Timer Extra Interrupt Flag.                                 */
      __IOM uint32_t HOVFI      : 1;            /*!< [31..31] High Timer Overflow Interrupt Flag.                              */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Clock Divider Control                               */
    
    struct {
      __IOM uint32_t CLKDIVRL   : 8;            /*!< [7..0] Clock Divider Reload Value.                                        */
      __IM  uint32_t            : 8;
      __IOM uint32_t CLKDIVCT   : 8;            /*!< [23..16] Clock Divider Counter.                                           */
    } bit;
  } CLKDIV;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Timer Value                                                */
    
    struct {
      __IOM uint32_t LCOUNT     : 16;           /*!< [15..0] Low Timer Count.                                                  */
      __IOM uint32_t HCOUNT     : 16;           /*!< [31..16] High Timer Count.                                                */
    } bit;
  } COUNT;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Timer Capture/Reload Value                                 */
    
