chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t LCCR       : 16;           /*!< [15..0] Low Timer Capture/Reload.                                         */
      __IOM uint32_t HCCR       : 16;           /*!< [31..16] High Timer Capture/Reload.                                       */
    } bit;
  } CAPTURE;
} TIMER_1_Type;                                 /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                          UART_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (UART_0)
  */

typedef struct {                                /*!< (@ 0x40002000) UART_0 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Configuration                                       */
    
    struct {
      __IOM uint32_t RSTRTEN    : 1;            /*!< [0..0] Receiver Start Enable.                                             */
      __IOM uint32_t RPAREN     : 1;            /*!< [1..1] Receiver Parity Enable.                                            */
      __IOM uint32_t RSTPEN     : 1;            /*!< [2..2] Receiver Stop Enable.                                              */
      __IOM uint32_t RSTPMD     : 2;            /*!< [4..3] Receiver Stop Mode.                                                */
      __IOM uint32_t RPARMD     : 2;            /*!< [6..5] Receiver Parity Mode.                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t RDATLN     : 3;            /*!< [10..8] Receiver Data Length.                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t RSCEN      : 1;            /*!< [12..12] Receiver Smartcard Parity Response Enable.                       */
      __IOM uint32_t RIRDAEN    : 1;            /*!< [13..13] Receiver IrDA Enable.                                            */
      __IOM uint32_t RINVEN     : 1;            /*!< [14..14] Receiver Invert Enable.                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t TSTRTEN    : 1;            /*!< [16..16] Transmitter Start Enable.                                        */
      __IOM uint32_t TPAREN     : 1;            /*!< [17..17] Transmitter Parity Enable.                                       */
      __IOM uint32_t TSTPEN     : 1;            /*!< [18..18] Transmitter Stop Enable.                                         */
      __IOM uint32_t TSTPMD     : 2;            /*!< [20..19] Transmitter Stop Mode.                                           */
      __IOM uint32_t TPARMD     : 2;            /*!< [22..21] Transmitter Parity Mode.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TDATLN     : 3;            /*!< [26..24] Transmitter Data Length.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TSCEN      : 1;            /*!< [28..28] Transmitter Smartcard Parity Response Enable.                    */
      __IOM uint32_t TIRDAEN    : 1;            /*!< [29..29] Transmitter IrDA Enable.                                         */
      __IOM uint32_t TINVEN     : 1;            /*!< [30..30] Transmitter Invert Enable.                                       */
    } bit;
  } CONFIG;
  __IOM uint32_t  CONFIG_SET;                   /*!< (@ 0x00000004) CONFIG_SET                                                 */
  __IOM uint32_t  CONFIG_CLR;                   /*!< (@ 0x00000008) CONFIG_CLR                                                 */
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Mode Select                                         */
    
    struct {
      __IM  uint32_t            : 16;
      __IOM uint32_t DBGMD      : 1;            /*!< [16..16] UART Debug Mode.                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBMD       : 2;            /*!< [19..18] Loop Back Mode.                                                  */
      __IM  uint32_t            : 7;
      __IOM uint32_t DUPLEXMD   : 1;            /*!< [27..27] Duplex Mode.                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t ITSEN      : 1;            /*!< [30..30] Idle TX Tristate Enable.                                         */
    } bit;
  } MODE;
  __IOM uint32_t  MODE_SET;                     /*!< (@ 0x00000014) MODE_SET                                                   */
  __IOM uint32_t  MODE_CLR;                     /*!< (@ 0x00000018) MODE_CLR                                                   */
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Flow Control                                               */
    
    struct {
      __IOM uint32_t RTS        : 1;            /*!< [0..0] RTS State.                                                         */
      __IM  uint32_t RX         : 1;            /*!< [1..1] RX Pin Status.                                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t RTSINVEN   : 1;            /*!< [5..5] RTS Invert Enable.                                                 */
      __IOM uint32_t RTSTH      : 1;            /*!< [6..6] RTS Threshold Control.                                             */
      __IOM uint32_t RTSEN      : 1;            /*!< [7..7] RTS Enable.                                                        */
      __IM  uint32_t            : 8;
      __IM  uint32_t CTS        : 1;            /*!< [16..16] CTS State.                                                       */
      __IOM uint32_t TX         : 1;            /*!< [17..17] TX State.                                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t CTSINVEN   : 1;            /*!< [21..21] CTS Invert Enable.                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t CTSEN      : 1;            /*!< [23..23] CTS Enable.                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t TIRDAPW    : 2;            /*!< [29..28] Transmit IrDA Pulse Width.                                       */
    } bit;
  } FLOWCN;
  __IOM uint32_t  FLOWCN_SET;                   /*!< (@ 0x00000024) FLOWCN_SET                                                 */
  __IOM uint32_t  FLOWCN_CLR;                   /*!< (@ 0x00000028) FLOWCN_CLR                                                 */
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Module Control                                             */
    
