chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t RSTRTEN    : 1;            /*!< [0..0] Receiver Start Enable.                                             */
      __IOM uint32_t RPAREN     : 1;            /*!< [1..1] Receiver Parity Enable.                                            */
      __IOM uint32_t RSTPEN     : 1;            /*!< [2..2] Receiver Stop Enable.                                              */
      __IOM uint32_t RSTPMD     : 2;            /*!< [4..3] Receiver Stop Mode.                                                */
      __IOM uint32_t RPARMD     : 2;            /*!< [6..5] Receiver Parity Mode.                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t RDATLN     : 3;            /*!< [10..8] Receiver Data Length.                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t RSCEN      : 1;            /*!< [12..12] Receiver Smartcard Parity Response Enable.                       */
      __IOM uint32_t RIRDAEN    : 1;            /*!< [13..13] Receiver IrDA Enable.                                            */
      __IOM uint32_t RINVEN     : 1;            /*!< [14..14] Receiver Invert Enable.                                          */
      __IOM uint32_t RSYNCEN    : 1;            /*!< [15..15] Receiver Synchronous Mode Enable.                                */
      __IOM uint32_t TSTRTEN    : 1;            /*!< [16..16] Transmitter Start Enable.                                        */
      __IOM uint32_t TPAREN     : 1;            /*!< [17..17] Transmitter Parity Enable.                                       */
      __IOM uint32_t TSTPEN     : 1;            /*!< [18..18] Transmitter Stop Enable.                                         */
      __IOM uint32_t TSTPMD     : 2;            /*!< [20..19] Transmitter Stop Mode.                                           */
      __IOM uint32_t TPARMD     : 2;            /*!< [22..21] Transmitter Parity Mode.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TDATLN     : 3;            /*!< [26..24] Transmitter Data Length.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TSCEN      : 1;            /*!< [28..28] Transmitter Smartcard Parity Response Enable.                    */
      __IOM uint32_t TIRDAEN    : 1;            /*!< [29..29] Transmitter IrDA Enable.                                         */
      __IOM uint32_t TINVEN     : 1;            /*!< [30..30] Transmitter Invert Enable.                                       */
      __IOM uint32_t TSYNCEN    : 1;            /*!< [31..31] Transmitter Synchronous Mode Enable.                             */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Mode Select                                         */
    
    struct {
      __IM  uint32_t            : 16;
      __IOM uint32_t DBGMD      : 1;            /*!< [16..16] USART Debug Mode.                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBMD       : 2;            /*!< [19..18] Loop Back Mode.                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t STPSTCLK   : 1;            /*!< [21..21] Stop State Clock Control.                                        */
      __IOM uint32_t STRTSTCLK  : 1;            /*!< [22..22] Start State Clock Control.                                       */
      __IOM uint32_t ISTCLK     : 1;            /*!< [23..23] Idle Clock Control.                                              */
      __IM  uint32_t            : 3;
      __IOM uint32_t DUPLEXMD   : 1;            /*!< [27..27] Duplex Mode.                                                     */
      __IOM uint32_t CLKIDLE    : 1;            /*!< [28..28] Clock Idle State.                                                */
      __IOM uint32_t CLKESEL    : 1;            /*!< [29..29] Clock Edge Select.                                               */
      __IOM uint32_t ITSEN      : 1;            /*!< [30..30] Idle TX/UCLK Tristate Enable.                                    */
      __IOM uint32_t OPMD       : 1;            /*!< [31..31] Operational Mode.                                                */
    } bit;
  } MODE;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Flow Control                                               */
    
    struct {
      __IOM uint32_t RTS        : 1;            /*!< [0..0] RTS State.                                                         */
      __IM  uint32_t RX         : 1;            /*!< [1..1] RX Pin Status.                                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t RTSINVEN   : 1;            /*!< [5..5] RTS Invert Enable.                                                 */
      __IOM uint32_t RTSTH      : 1;            /*!< [6..6] RTS Threshold Control.                                             */
      __IOM uint32_t RTSEN      : 1;            /*!< [7..7] RTS Enable.                                                        */
      __IM  uint32_t            : 8;
      __IM  uint32_t CTS        : 1;            /*!< [16..16] CTS State.                                                       */
      __IOM uint32_t TX         : 1;            /*!< [17..17] TX State.                                                        */
      __IOM uint32_t UCLK       : 1;            /*!< [18..18] UCLK State.                                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t CTSINVEN   : 1;            /*!< [21..21] CTS Invert Enable.                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t CTSEN      : 1;            /*!< [23..23] CTS Enable.                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t TIRDAPW    : 2;            /*!< [29..28] Transmit IrDA Pulse Width.                                       */
    } bit;
  } FLOWCN;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Module Control                                             */
    
