chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t RFRMERI    : 1;            /*!< [0..0] Receive Frame Error Interrupt Flag.                                */
      __IOM uint32_t RPARERI    : 1;            /*!< [1..1] Receive Parity Error Interrupt Flag.                               */
      __IOM uint32_t ROREI      : 1;            /*!< [2..2] Receive Overrun Error Interrupt Flag.                              */
      __IM  uint32_t RDREQI     : 1;            /*!< [3..3] Receive Data Request Interrupt Flag.                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t RERIEN     : 1;            /*!< [5..5] Receive Error Interrupt Enable.                                    */
      __IOM uint32_t RDREQIEN   : 1;            /*!< [6..6] Receive Data Request Interrupt Enable.                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t MATMD      : 2;            /*!< [9..8] Match Mode.                                                        */
      __IOM uint32_t RABDEN     : 1;            /*!< [10..10] Receiver Auto-Baud Enable.                                       */
      __IM  uint32_t RBUSYF     : 1;            /*!< [11..11] Receiver Busy Flag.                                              */
      __IOM uint32_t RBIT       : 1;            /*!< [12..12] Last Receive Bit.                                                */
      __IOM uint32_t ROSEN      : 1;            /*!< [13..13] Receiver One-Shot Enable.                                        */
      __IOM uint32_t RINH       : 1;            /*!< [14..14] Receiver Inhibit.                                                */
      __IOM uint32_t REN        : 1;            /*!< [15..15] Receiver Enable.                                                 */
      __IOM uint32_t TSCERI     : 1;            /*!< [16..16] Smartcard Parity Error Interrupt Flag.                           */
      __IOM uint32_t TUREI      : 1;            /*!< [17..17] Transmit Underrun Error Interrupt Flag.                          */
      __IM  uint32_t TDREQI     : 1;            /*!< [18..18] Transmit Data Request Interrupt Flag.                            */
      __IOM uint32_t TCPTI      : 1;            /*!< [19..19] Transmit Complete Interrupt Flag.                                */
      __IOM uint32_t TCPTTH     : 1;            /*!< [20..20] Transmit Complete Threshold.                                     */
      __IOM uint32_t TERIEN     : 1;            /*!< [21..21] Transmit Error Interrupt Enable.                                 */
      __IOM uint32_t TDREQIEN   : 1;            /*!< [22..22] Transmit Data Request Interrupt Enable.                          */
      __IOM uint32_t TCPTIEN    : 1;            /*!< [23..23] Transmit Complete Interrupt Enable.                              */
      __IM  uint32_t            : 3;
      __IM  uint32_t TBUSYF     : 1;            /*!< [27..27] Transmitter Busy Flag.                                           */
      __IOM uint32_t TBIT       : 1;            /*!< [28..28] Last Transmit Bit.                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t TINH       : 1;            /*!< [30..30] Transmit Inhibit.                                                */
      __IOM uint32_t TEN        : 1;            /*!< [31..31] Transmitter Enable.                                              */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Inter-Packet Delay                                         */
    
    struct {
      __IM  uint32_t            : 16;
      __IOM uint32_t IPDELAY    : 8;            /*!< [23..16] Inter-Packet Delay.                                              */
    } bit;
  } IPDELAY;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Transmit and Receive Baud Rate                             */
    
    struct {
      __IOM uint32_t RBAUD      : 16;           /*!< [15..0] Receiver Baud Rate Control.                                       */
      __IOM uint32_t TBAUD      : 16;           /*!< [31..16] Transmitter Baud Rate Control.                                   */
    } bit;
  } BAUDRATE;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) FIFO Control                                               */
    
    struct {
      __IM  uint32_t RCNT       : 3;            /*!< [2..0] Receive FIFO Count.                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t RFTH       : 2;            /*!< [5..4] Receive FIFO Threshold.                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t RDMAEN     : 1;            /*!< [7..7] Receiver DMA Enable.                                               */
      __IOM uint32_t RFIFOFL    : 1;            /*!< [8..8] Receive FIFO Flush.                                                */
      __IOM uint32_t RFERI      : 1;            /*!< [9..9] Receive FIFO Error Interrupt Flag.                                 */
      __IM  uint32_t RSRFULLF   : 1;            /*!< [10..10] Receive Shift Register Full Flag.                                */
      __IM  uint32_t            : 5;
      __IM  uint32_t TCNT       : 3;            /*!< [18..16] Transmit FIFO Count.                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t TFTH       : 2;            /*!< [21..20] Transmit FIFO Threshold.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TDMAEN     : 1;            /*!< [23..23] Transmitter DMA Enable.                                          */
      __IOM uint32_t TFIFOFL    : 1;            /*!< [24..24] Transmit FIFO Flush.                                             */
      __IOM uint32_t TFERI      : 1;            /*!< [25..25] Transmit FIFO Error Interrupt Flag.                              */
      __IM  uint32_t TSRFULLF   : 1;            /*!< [26..26] Transmit Shift Register Full Flag.                               */
    } bit;
  } FIFOCN;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) FIFO Input/Output Data                                     */
    
