chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] FIFO Data.                                                        */
    } bit;
  } DATA;
} USART_Type;                                   /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                           USB_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (USB_0)
  */

typedef struct {                                /*!< (@ 0x40018000) USB_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Function Address                                           */
    
    struct {
      __IOM uint32_t FADDR      : 7;            /*!< [6..0] Function Address.                                                  */
      __IM  uint32_t FADDRUPD   : 1;            /*!< [7..7] Function Address Update.                                           */
    } bit;
  } FADDR;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Power Control                                              */
    
    struct {
      __IOM uint32_t SUSDEN     : 1;            /*!< [0..0] Suspend Detection Enable.                                          */
      __IM  uint32_t SUSMDF     : 1;            /*!< [1..1] Suspend Mode Flag.                                                 */
      __IOM uint32_t RESUME     : 1;            /*!< [2..2] Force Resume.                                                      */
      __IM  uint32_t RSTDETF    : 1;            /*!< [3..3] Reset Detect Flag.                                                 */
      __IOM uint32_t USBINH     : 1;            /*!< [4..4] USB Inhibit.                                                       */
      __IOM uint32_t DITHEN     : 1;            /*!< [5..5] USB Dither Enable.                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t ISOUPDMD   : 1;            /*!< [7..7] ISO Update Mode.                                                   */
    } bit;
  } POWER;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) IN/OUT Endpoint Interrupt Flags                            */
    
    struct {
      __IOM uint32_t EP0I       : 1;            /*!< [0..0] Endpoint 0 Interrupt Flag.                                         */
      __IOM uint32_t IN1I       : 1;            /*!< [1..1] IN Endpoint 1 Interrupt Flag.                                      */
      __IOM uint32_t IN2I       : 1;            /*!< [2..2] IN Endpoint 2 Interrupt Flag.                                      */
      __IOM uint32_t IN3I       : 1;            /*!< [3..3] IN Endpoint 3 Interrupt Flag.                                      */
      __IOM uint32_t IN4I       : 1;            /*!< [4..4] IN Endpoint 4 Interrupt Flag.                                      */
      __IM  uint32_t            : 12;
      __IOM uint32_t OUT1I      : 1;            /*!< [17..17] OUT Endpoint 1 Interrupt Flag.                                   */
      __IOM uint32_t OUT2I      : 1;            /*!< [18..18] OUT Endpoint 2 Interrupt Flag.                                   */
      __IOM uint32_t OUT3I      : 1;            /*!< [19..19] OUT Endpoint 3 Interrupt Flag.                                   */
      __IOM uint32_t OUT4I      : 1;            /*!< [20..20] OUT Endpoint 4 Interrupt Flag.                                   */
    } bit;
  } IOINT;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Common Interrupt Flags                                     */
    
    struct {
      __IOM uint32_t SUSI       : 1;            /*!< [0..0] Suspend Interrupt Flag.                                            */
      __IOM uint32_t RESI       : 1;            /*!< [1..1] Resume Interrupt Flag.                                             */
      __IOM uint32_t RSTI       : 1;            /*!< [2..2] Reset Interrupt Flag.                                              */
      __IOM uint32_t SOFI       : 1;            /*!< [3..3] Start of Frame Interrupt Flag.                                     */
    } bit;
  } CMINT;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) IN/OUT Endpoint Interrupt Control                          */
    
    struct {
      __IOM uint32_t EP0IEN     : 1;            /*!< [0..0] Endpoint 0 Interrupt Enable.                                       */
      __IOM uint32_t IN1IEN     : 1;            /*!< [1..1] IN Endpoint 1 Interrupt Enable.                                    */
      __IOM uint32_t IN2IEN     : 1;            /*!< [2..2] IN Endpoint 2 Interrupt Enable.                                    */
      __IOM uint32_t IN3IEN     : 1;            /*!< [3..3] IN Endpoint 3 Interrupt Enable.                                    */
      __IOM uint32_t IN4IEN     : 1;            /*!< [4..4] IN Endpoint 4 Interrupt Enable.                                    */
      __IM  uint32_t            : 12;
      __IOM uint32_t OUT1IEN    : 1;            /*!< [17..17] OUT Endpoint 1 Interrupt Enable.                                 */
      __IOM uint32_t OUT2IEN    : 1;            /*!< [18..18] OUT Endpoint 2 Interrupt Enable.                                 */
      __IOM uint32_t OUT3IEN    : 1;            /*!< [19..19] OUT Endpoint 3 Interrupt Enable.                                 */
      __IOM uint32_t OUT4IEN    : 1;            /*!< [20..20] OUT Endpoint 4 Interrupt Enable.                                 */
    } bit;
  } IOINTE;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Common Interrupt and Endpoint Control                      */
    
