chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t SUSIEN     : 1;            /*!< [0..0] Suspend Interrupt Enable.                                          */
      __IOM uint32_t RESIEN     : 1;            /*!< [1..1] Resume Interrupt Enable.                                           */
      __IOM uint32_t RSTIEN     : 1;            /*!< [2..2] Reset Interrupt Enable.                                            */
      __IOM uint32_t SOFIEN     : 1;            /*!< [3..3] Start of Frame Interrupt Enable.                                   */
      __IM  uint32_t            : 12;
      __IOM uint32_t EP0EN      : 1;            /*!< [16..16] Endpoint 0 Enable.                                               */
      __IOM uint32_t EP1EN      : 1;            /*!< [17..17] Endpoint 1 Enable.                                               */
      __IOM uint32_t EP2EN      : 1;            /*!< [18..18] Endpoint 2 Enable.                                               */
      __IOM uint32_t EP3EN      : 1;            /*!< [19..19] Endpoint 3 Enable.                                               */
      __IOM uint32_t EP4EN      : 1;            /*!< [20..20] Endpoint 4 Enable.                                               */
    } bit;
  } CMINTEPE;
  __IM  uint32_t  RESERVED5[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Clock Recovery Control                                     */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t OLEN       : 1;            /*!< [4..4] Oscillator Open-Loop Mode Enable.                                  */
      __IOM uint32_t LSCRMD     : 1;            /*!< [5..5] Low Speed Clock Recovery Mode.                                     */
      __IOM uint32_t CRSSEN     : 1;            /*!< [6..6] Clock Recovery Single Step Enable.                                 */
      __IOM uint32_t CREN       : 1;            /*!< [7..7] Clock Recovery Enable.                                             */
    } bit;
  } CRCONTROL;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Frame Number                                               */
    
    struct {
      __IM  uint32_t FRAMENUM   : 11;           /*!< [10..0] Frame Number.                                                     */
    } bit;
  } FRAME;
  __IM  uint32_t  RESERVED7[99];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000200) Transceiver Control                                        */
    
    struct {
      __IM  uint32_t DN         : 1;            /*!< [0..0] D- Signal State.                                                   */
      __IM  uint32_t DP         : 1;            /*!< [1..1] D+ Signal State.                                                   */
      __IM  uint32_t DFREC      : 1;            /*!< [2..2] Differential Receiver State.                                       */
      __IOM uint32_t PHYTST     : 2;            /*!< [4..3] Physical Layer Test.                                               */
      __IOM uint32_t SSEL       : 1;            /*!< [5..5] USB Speed Select.                                                  */
      __IOM uint32_t PHYEN      : 1;            /*!< [6..6] Physical Layer Enable.                                             */
      __IOM uint32_t PUEN       : 1;            /*!< [7..7] Internal Pull-up Resistor Enable.                                  */
    } bit;
  } TCONTROL;
  __IM  uint32_t  RESERVED8[63];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000300) Module Clock Select                                        */
    
    struct {
      __IOM uint32_t CLKSEL     : 2;            /*!< [1..0] USB Clock Select.                                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t CLKDIV     : 2;            /*!< [5..4] USB Clock Divider.                                                 */
      __OM  uint32_t RESET      : 1;            /*!< [6..6] USB Reset.                                                         */
    } bit;
  } CLKSEL;
  __IM  uint32_t  RESERVED9[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000310) Oscillator Control                                         */
    
    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t SUSPEND    : 1;            /*!< [5..5] USB Oscillator Suspend.                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t OSCEN      : 1;            /*!< [7..7] USB Oscillator Enable.                                             */
    } bit;
  } OSCCONTROL;
  __IM  uint32_t  RESERVED10[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000320) Oscillator Additional Frequency Adjust                     */
    
    struct {
      __IOM uint32_t FINEFADJ   : 6;            /*!< [5..0] USB Oscillator Fine Output Frequency Adjust.                       */
      __IOM uint32_t DITHEN     : 1;            /*!< [6..6] USB Oscillator Dithering Enable.                                   */
    } bit;
  } AFADJUST;
  __IM  uint32_t  RESERVED11[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000330) Oscillator Frequency Adjust                                */
    
    struct {
      __IOM uint32_t FADJ       : 7;            /*!< [6..0] Oscillator Output Frequency Adjust.                                */
    } bit;
  } FADJUST;
  __IM  uint32_t  RESERVED12[51];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000400) DMA Data FIFO Access                                       */
    
    struct {
      __IOM uint32_t DMAFIFO    : 32;           /*!< [31..0] DMA Data FIFO Access.                                             */
    } bit;
  } DMAFIFO;
  __IM  uint32_t  RESERVED13[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000410) DMA Control                                                */
    
