chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DBGMD      : 1;            /*!< [4..4] USB DMA Debug Mode.                                                */
      __IOM uint32_t TERRF      : 1;            /*!< [5..5] Timeout Error Flag.                                                */
      __IM  uint32_t DBUSYF     : 1;            /*!< [6..6] USB DMA Busy Flag.                                                 */
      __IOM uint32_t DFIFOFL    : 1;            /*!< [7..7] USB DMA Buffer Flush Control.                                      */
    } bit;
  } DMACONTROL;
  __IM  uint32_t  RESERVED14[255];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000810) Endpoint 0 Control                                         */
    
    struct {
      __IM  uint32_t OPRDYI     : 1;            /*!< [0..0] OUT Packet Ready Interrupt Flag.                                   */
      __IOM uint32_t IPRDYI     : 1;            /*!< [1..1] IN Packet Ready Indicator.                                         */
      __IOM uint32_t STSTLI     : 1;            /*!< [2..2] Sent Stall Interrupt Flag.                                         */
      __IOM uint32_t DEND       : 1;            /*!< [3..3] Data End.                                                          */
      __IM  uint32_t SUENDI     : 1;            /*!< [4..4] Setup End Interrupt Flag.                                          */
      __IOM uint32_t SDSTL      : 1;            /*!< [5..5] Send Stall.                                                        */
      __IOM uint32_t OPRDYIS    : 1;            /*!< [6..6] Serviced Out Packet Ready Interrupt Flag.                          */
      __IOM uint32_t SUENDIS    : 1;            /*!< [7..7] Serviced Setup End Interrupt Flag.                                 */
    } bit;
  } EP0CONTROL;
  __IM  uint32_t  RESERVED15[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000820) Endpoint 0 Data Count                                      */
    
    struct {
      __IM  uint32_t COUNT      : 7;            /*!< [6..0] Endpoint 0 OUT Data Count.                                         */
    } bit;
  } EP0COUNT;
  __IM  uint32_t  RESERVED16[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000830) Endpoint 0 Data FIFO Access                                */
    
    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Endpoint 0 Data FIFO.                                             */
    } bit;
  } EP0FIFO;
  __IM  uint32_t  RESERVED17[19];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000880) Endpoint Maximum Packet Size                               */
    
    struct {
      __IOM uint32_t IMAXP      : 8;            /*!< [7..0] IN Maximum Packet Size.                                            */
      __IM  uint32_t            : 8;
      __IOM uint32_t OMAXP      : 8;            /*!< [23..16] OUT Maximum Packet Size.                                         */
    } bit;
  } EPMPSIZE_1;
  __IM  uint32_t  RESERVED18[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000890) Endpoint Control                                           */
    
    struct {
      __IOM uint32_t IPRDYI     : 1;            /*!< [0..0] IN Packet Ready Indicator.                                         */
      __IOM uint32_t IFIFONEF   : 1;            /*!< [1..1] IN FIFO Not Empty Flag.                                            */
      __IOM uint32_t IURF       : 1;            /*!< [2..2] IN FIFO Underrun Flag.                                             */
      __IOM uint32_t IFIFOFL    : 1;            /*!< [3..3] IN FIFO Flush.                                                     */
      __IOM uint32_t ISDSTL     : 1;            /*!< [4..4] IN Send Stall.                                                     */
      __IOM uint32_t ISTSTLI    : 1;            /*!< [5..5] IN Sent Stall Interrupt Flag.                                      */
      __IOM uint32_t ICLRDT     : 1;            /*!< [6..6] IN Clear Data Toggle.                                              */
      __IM  uint32_t            : 3;
      __IOM uint32_t SPLITEN    : 1;            /*!< [10..10] FIFO Split Enable.                                               */
      __IOM uint32_t FDTEN      : 1;            /*!< [11..11] Force Data Toggle Enable.                                        */
      __IOM uint32_t IDMAEN     : 1;            /*!< [12..12] IN Endpoint DMA Enable.                                          */
      __IOM uint32_t DIRSEL     : 1;            /*!< [13..13] Endpoint Direction Select.                                       */
      __IOM uint32_t IISOEN     : 1;            /*!< [14..14] IN Isochronous Transfer Enable.                                  */
      __IOM uint32_t AUTOSETEN  : 1;            /*!< [15..15] IN Endpoint IPRDYI Automatic Set Enable.                         */
      __IOM uint32_t OPRDYI     : 1;            /*!< [16..16] OUT Packet Ready.                                                */
      __IOM uint32_t OFIFOFF    : 1;            /*!< [17..17] OUT FIFO Full.                                                   */
      __IOM uint32_t OORF       : 1;            /*!< [18..18] OUT FIFO Overrun Flag.                                           */
      __IOM uint32_t ODERRF     : 1;            /*!< [19..19] OUT Data Error Flag.                                             */
      __IOM uint32_t OFIFOFL    : 1;            /*!< [20..20] OUT FIFO Flush.                                                  */
      __IOM uint32_t OSDSTL     : 1;            /*!< [21..21] OUT Send Stall.                                                  */
      __IOM uint32_t OSTSTLI    : 1;            /*!< [22..22] OUT Sent Stall Interrupt Flag.                                   */
      __IOM uint32_t OCLRDT     : 1;            /*!< [23..23] OUT Clear Data Toggle.                                           */
      __IM  uint32_t            : 4;
      __IOM uint32_t ODMAMD     : 1;            /*!< [28..28] OUT Endpoint DMA Mode.                                           */
      __IOM uint32_t ODMAEN     : 1;            /*!< [29..29] OUT Endpoint DMA Enable.                                         */
      __IOM uint32_t OISOEN     : 1;            /*!< [30..30] OUT Isochronous Transfer Enable.                                 */
      __IOM uint32_t AUTOCLREN  : 1;            /*!< [31..31] OUT Endpoint OPRDYI Auto-Clear Enable.                           */
    } bit;
  } EPCONTROL_1;
  __IM  uint32_t  RESERVED19[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000008A0) Endpoint Data Count                                        */
    
