chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IM  uint32_t COUNT      : 10;           /*!< [9..0] Endpoint OUT Data Count.                                           */
    } bit;
  } EPCOUNT_3;
  __IM  uint32_t  RESERVED28[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000009B0) Endpoint Data FIFO Access                                  */
    
    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Endpoint Data FIFO.                                               */
    } bit;
  } EPFIFO_3;
  __IM  uint32_t  RESERVED29[19];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000A00) Endpoint Maximum Packet Size                               */
    
    struct {
      __IOM uint32_t IMAXP      : 8;            /*!< [7..0] IN Maximum Packet Size.                                            */
      __IM  uint32_t            : 8;
      __IOM uint32_t OMAXP      : 8;            /*!< [23..16] OUT Maximum Packet Size.                                         */
    } bit;
  } EPMPSIZE_4;
  __IM  uint32_t  RESERVED30[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000A10) Endpoint Control                                           */
    
    struct {
      __IOM uint32_t IPRDYI     : 1;            /*!< [0..0] IN Packet Ready Indicator.                                         */
      __IOM uint32_t IFIFONEF   : 1;            /*!< [1..1] IN FIFO Not Empty Flag.                                            */
      __IOM uint32_t IURF       : 1;            /*!< [2..2] IN FIFO Underrun Flag.                                             */
      __IOM uint32_t IFIFOFL    : 1;            /*!< [3..3] IN FIFO Flush.                                                     */
      __IOM uint32_t ISDSTL     : 1;            /*!< [4..4] IN Send Stall.                                                     */
      __IOM uint32_t ISTSTLI    : 1;            /*!< [5..5] IN Sent Stall Interrupt Flag.                                      */
      __IOM uint32_t ICLRDT     : 1;            /*!< [6..6] IN Clear Data Toggle.                                              */
      __IM  uint32_t            : 3;
      __IOM uint32_t SPLITEN    : 1;            /*!< [10..10] FIFO Split Enable.                                               */
      __IOM uint32_t FDTEN      : 1;            /*!< [11..11] Force Data Toggle Enable.                                        */
      __IOM uint32_t IDMAEN     : 1;            /*!< [12..12] IN Endpoint DMA Enable.                                          */
      __IOM uint32_t DIRSEL     : 1;            /*!< [13..13] Endpoint Direction Select.                                       */
      __IOM uint32_t IISOEN     : 1;            /*!< [14..14] IN Isochronous Transfer Enable.                                  */
      __IOM uint32_t AUTOSETEN  : 1;            /*!< [15..15] IN Endpoint IPRDYI Automatic Set Enable.                         */
      __IOM uint32_t OPRDYI     : 1;            /*!< [16..16] OUT Packet Ready.                                                */
      __IOM uint32_t OFIFOFF    : 1;            /*!< [17..17] OUT FIFO Full.                                                   */
      __IOM uint32_t OORF       : 1;            /*!< [18..18] OUT FIFO Overrun Flag.                                           */
      __IOM uint32_t ODERRF     : 1;            /*!< [19..19] OUT Data Error Flag.                                             */
      __IOM uint32_t OFIFOFL    : 1;            /*!< [20..20] OUT FIFO Flush.                                                  */
      __IOM uint32_t OSDSTL     : 1;            /*!< [21..21] OUT Send Stall.                                                  */
      __IOM uint32_t OSTSTLI    : 1;            /*!< [22..22] OUT Sent Stall Interrupt Flag.                                   */
      __IOM uint32_t OCLRDT     : 1;            /*!< [23..23] OUT Clear Data Toggle.                                           */
      __IM  uint32_t            : 4;
      __IOM uint32_t ODMAMD     : 1;            /*!< [28..28] OUT Endpoint DMA Mode.                                           */
      __IOM uint32_t ODMAEN     : 1;            /*!< [29..29] OUT Endpoint DMA Enable.                                         */
      __IOM uint32_t OISOEN     : 1;            /*!< [30..30] OUT Isochronous Transfer Enable.                                 */
      __IOM uint32_t AUTOCLREN  : 1;            /*!< [31..31] OUT Endpoint OPRDYI Auto-Clear Enable.                           */
    } bit;
  } EPCONTROL_4;
  __IM  uint32_t  RESERVED31[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000A20) Endpoint Data Count                                        */
    
    struct {
      __IM  uint32_t COUNT      : 10;           /*!< [9..0] Endpoint OUT Data Count.                                           */
    } bit;
  } EPCOUNT_4;
  __IM  uint32_t  RESERVED32[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000A30) Endpoint Data FIFO Access                                  */
    
    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Endpoint Data FIFO.                                               */
    } bit;
  } EPFIFO_4;
} USB_0_Type;                                   /*!< Size = 2612 (0xa34)                                                       */



/* =========================================================================================================================== */
/* ================                                          VMON_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (VMON_0)
  */

typedef struct {                                /*!< (@ 0x4002F000) VMON_0 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
