chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t VREGINSEN  : 1;            /*!< [0..0] VREGIN Supply Monitor Enable.                                      */
      __IM  uint32_t VREGINLI   : 1;            /*!< [1..1] VREGIN Low Interrupt Flag.                                         */
      __IM  uint32_t VDDRSTF    : 1;            /*!< [2..2] VDD Reset Threshold Status Flag.                                   */
      __IM  uint32_t VDDLI      : 1;            /*!< [3..3] VDD Low Interrupt Flag.                                            */
      __IOM uint32_t VDDHITHEN  : 1;            /*!< [4..4] VDD High Threshold Enable.                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t VDDLIEN    : 1;            /*!< [6..6] VDD Low Interrupt Enable.                                          */
      __IOM uint32_t VREGINLIEN : 1;            /*!< [7..7] VREGIN Low Interrupt Enable.                                       */
      __IM  uint32_t            : 23;
      __IOM uint32_t VMONEN     : 1;            /*!< [31..31] VDD Supply Monitor Enable.                                       */
    } bit;
  } CONTROL;
} VMON_0_Type;                                  /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                          VREF_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (VREF_0)
  */

typedef struct {                                /*!< (@ 0x40039010) VREF_0 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Voltage Reference Control                                  */
    
    struct {
      __IOM uint32_t VREF2X     : 1;            /*!< [0..0] Voltage Reference Doubler.                                         */
      __IOM uint32_t TEMPEN     : 1;            /*!< [1..1] Temperature Sensor Enable.                                         */
      __IM  uint32_t            : 29;
      __IOM uint32_t VREFEN     : 1;            /*!< [31..31] Voltage Reference Enable.                                        */
    } bit;
  } CONTROL;
} VREF_0_Type;                                  /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                         EXTVREG_0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief None (EXTVREG_0)
  */

typedef struct {                                /*!< (@ 0x40042000) EXTVREG_0 Structure                                        */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t SAEN       : 1;            /*!< [0..0] Stand-Alone Mode Enable.                                           */
      __IM  uint32_t            : 23;
      __IOM uint32_t WPULLEN    : 1;            /*!< [24..24] Weak Pull Up/Down Enable.                                        */
      __IOM uint32_t FBLEN      : 1;            /*!< [25..25] Foldback Limiting Enable.                                        */
      __IOM uint32_t PNSEL      : 1;            /*!< [26..26] NPN/PNP Type Select.                                             */
      __IOM uint32_t FBPINSEL   : 1;            /*!< [27..27] Foldback Sensing Pin Select.                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t EVREGEN    : 1;            /*!< [31..31] External Regulator Enable.                                       */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Configuration                                       */
    
    struct {
      __IOM uint32_t IMINFINE   : 2;            /*!< [1..0] Minimum Current Fine Select.                                       */
      __IOM uint32_t IMIN       : 3;            /*!< [4..2] Minimum Current Select.                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t FBVOSEL    : 3;            /*!< [10..8] Foldback Voltage Offset Select.                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t FBRATE     : 3;            /*!< [14..12] Voltage Sense Gain Multiplier.                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t IMAX       : 3;            /*!< [18..16] Maximum Current Select.                                          */
      __IM  uint32_t            : 5;
      __IOM uint32_t VOUTSEL    : 6;            /*!< [29..24] Regulator Output Voltage Select.                                 */
    } bit;
  } CONFIG;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Module Status                                              */
    
    struct {
      __IM  uint32_t FBMAXF     : 1;            /*!< [0..0] Maximum Foldback Flag.                                             */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED2[7];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Current Sense Control                                      */
    
    struct {
      __IM  uint32_t            : 30;
      __IOM uint32_t ISNSEN     : 1;            /*!< [30..30] External Regulator Current Sense Enable.                         */
      __IOM uint32_t ADCISNSEN  : 1;            /*!< [31..31] ADC Current Sense Enable.                                        */
    } bit;
  } CSCONTROL;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Current Sense Configuration                                */
    
