chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __IOM uint32_t ISADCGAIN  : 3;            /*!< [2..0] ADC Current Sense Gain.                                            */
      __IOM uint32_t ISOGAIN    : 3;            /*!< [5..3] External Regulator Current Sense Gain.                             */
      __IOM uint32_t ISINSEL    : 2;            /*!< [7..6] External Regulator Current Sense Input Select.                     */
    } bit;
  } CSCONFIG;
} EXTVREG_0_Type;                               /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                          VREG_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (VREG_0)
  */

typedef struct {                                /*!< (@ 0x40040000) VREG_0 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IM  uint32_t VBUSVLDF   : 1;            /*!< [0..0] VBUS Valid Flag.                                                   */
      __IOM uint32_t SUSEN      : 1;            /*!< [1..1] Voltage Regulator Suspend Enable.                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t BGDIS      : 1;            /*!< [5..5] Band Gap Disable.                                                  */
      __IOM uint32_t SENSEEN    : 1;            /*!< [6..6] VREGIN Sense Enable.                                               */
      __IOM uint32_t VBUSIVLDI  : 1;            /*!< [7..7] VBUS Invalid Interrupt Flag.                                       */
      __IOM uint32_t VBUSIVLDIEN : 1;           /*!< [8..8] VBUS Invalid Interrupt Enable.                                     */
      __IM  uint32_t            : 22;
      __IOM uint32_t VREGDIS    : 1;            /*!< [31..31] Voltage Regulator Disable.                                       */
    } bit;
  } CONTROL;
} VREG_0_Type;                                  /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           LDO_0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief None (LDO_0)
  */

typedef struct {                                /*!< (@ 0x40039000) LDO_0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control                                                    */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t LDOIBIAS   : 1;            /*!< [1..1] LDO Bias Current Selection.                                        */
      __IM  uint32_t            : 29;
      __IOM uint32_t LDOAEN     : 1;            /*!< [31..31] LDO Analog Enable.                                               */
    } bit;
  } CONTROL;
} LDO_0_Type;                                   /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                         WDTIMER_0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief None (WDTIMER_0)
  */

typedef struct {                                /*!< (@ 0x40030000) WDTIMER_0 Structure                                        */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Module Control                                             */
    
    struct {
      __IOM uint32_t EWIEN      : 1;            /*!< [0..0] Early Warning Interrupt Enable.                                    */
      __IOM uint32_t DBGMD      : 1;            /*!< [1..1] Watchdog Timer Debug Mode.                                         */
    } bit;
  } CONTROL;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Module Status                                              */
    
    struct {
      __IM  uint32_t KEYSTS     : 1;            /*!< [0..0] Key Status.                                                        */
      __IM  uint32_t PRIVSTS    : 1;            /*!< [1..1] Register Access Status.                                            */
      __IOM uint32_t EWI        : 1;            /*!< [2..2] Early Warning Interrupt Flag.                                      */
      __IM  uint32_t RTHF       : 1;            /*!< [3..3] Reset Threshold Flag.                                              */
      __IM  uint32_t UPDSTS     : 1;            /*!< [4..4] Watchdog Timer Threshold Update Status.                            */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Threshold Values                                           */
    
    struct {
      __IOM uint32_t EWTH       : 16;           /*!< [15..0] Early Warning Threshold.                                          */
      __IOM uint32_t RTH        : 16;           /*!< [31..16] Reset Threshold.                                                 */
    } bit;
  } THRESHOLD;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Module Key                                                 */
    
