chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
    struct {
      __OM  uint32_t KEY        : 8;            /*!< [7..0] Watchdog Timer Key.                                                */
    } bit;
  } WDTKEY;
} WDTIMER_0_Type;                               /*!< Size = 52 (0x34)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define SARADC_0_BASE               0x4001A000UL
#define SARADC_1_BASE               0x4001B000UL
#define AES_0_BASE                  0x40027000UL
#define CRC_0_BASE                  0x40028000UL
#define CAPSENSE_0_BASE             0x40023000UL
#define CLKCTRL_0_BASE              0x4002D000UL
#define CMP_0_BASE                  0x4001F000UL
#define CMP_1_BASE                  0x40020000UL
#define DMACTRL_0_BASE              0x40036000UL
#define DMAXBAR_0_BASE              0x40037000UL
#define DEVICEID_0_BASE             0x400490C0UL
#define EMIF_0_BASE                 0x40026000UL
#define EPCA_0_BASE                 0x4000E000UL
#define FLASHCTRL_0_BASE            0x4002E000UL
#define I2C_0_BASE                  0x40009000UL
#define I2C_1_BASE                  0x4000A000UL
#define I2S_0_BASE                  0x4003A000UL
#define IDAC_0_BASE                 0x40031000UL
#define IDAC_1_BASE                 0x40032000UL
#define IVC_0_BASE                  0x40044000UL
#define LOCK_0_BASE                 0x40049000UL
#define LPTIMER_0_BASE              0x40038000UL
#define PLL_0_BASE                  0x4003B000UL
#define EXTOSC_0_BASE               0x4003C000UL
#define LPOSC_0_BASE                0x40041000UL
#define PCA_0_BASE                  0x4000F000UL
#define PCA_1_BASE                  0x40010000UL
#define PMU_0_BASE                  0x40048000UL
#define PBCFG_0_BASE                0x4002A000UL
#define PBHD_4_BASE                 0x4002A3C0UL
#define PBSTD_0_BASE                0x4002A0A0UL
#define PBSTD_1_BASE                0x4002A140UL
#define PBSTD_2_BASE                0x4002A1E0UL
#define PBSTD_3_BASE                0x4002A320UL
#define RTC_0_BASE                  0x40029000UL
#define RSTSRC_0_BASE               0x4002D060UL
#define SPI_0_BASE                  0x40004000UL
#define SPI_1_BASE                  0x40005000UL
#define SPI_2_BASE                  0x40006000UL
#define SSG_0_BASE                  0x4001E000UL
#define TIMER_0_BASE                0x40014000UL
#define TIMER_1_BASE                0x40015000UL
#define UART_0_BASE                 0x40002000UL
#define UART_1_BASE                 0x40003000UL
#define USART_0_BASE                0x40000000UL
#define USART_1_BASE                0x40001000UL
#define USB_0_BASE                  0x40018000UL
#define VMON_0_BASE                 0x4002F000UL
#define VREF_0_BASE                 0x40039010UL
#define EXTVREG_0_BASE              0x40042000UL
#define VREG_0_BASE                 0x40040000UL
#define LDO_0_BASE                  0x40039000UL
#define WDTIMER_0_BASE              0x40030000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define SARADC_0                    ((SARADC_0_Type*)          SARADC_0_BASE)
#define SARADC_1                    ((SARADC_1_Type*)          SARADC_1_BASE)
#define AES_0                       ((AES_0_Type*)             AES_0_BASE)
#define CRC_0                       ((CRC_0_Type*)             CRC_0_BASE)
#define CAPSENSE_0                  ((CAPSENSE_0_Type*)        CAPSENSE_0_BASE)
#define CLKCTRL_0                   ((CLKCTRL_0_Type*)         CLKCTRL_0_BASE)
#define CMP_0                       ((CMP_0_Type*)             CMP_0_BASE)
#define CMP_1                       ((CMP_1_Type*)             CMP_1_BASE)
#define DMACTRL_0                   ((DMACTRL_0_Type*)         DMACTRL_0_BASE)
#define DMAXBAR_0                   ((DMAXBAR_0_Type*)         DMAXBAR_0_BASE)
#define DEVICEID_0                  ((DEVICEID_0_Type*)        DEVICEID_0_BASE)
#define EMIF_0                      ((EMIF_0_Type*)            EMIF_0_BASE)
#define EPCA_0                      ((EPCA_0_Type*)            EPCA_0_BASE)
#define FLASHCTRL_0                 ((FLASHCTRL_0_Type*)       FLASHCTRL_0_BASE)
#define I2C_0                       ((I2C_Type*)               I2C_0_BASE)
#define I2C_1                       ((I2C_Type*)               I2C_1_BASE)
#define I2S_0                       ((I2S_0_Type*)             I2S_0_BASE)
#define IDAC_0                      ((IDAC_0_Type*)            IDAC_0_BASE)
#define IDAC_1                      ((IDAC_1_Type*)            IDAC_1_BASE)
#define IVC_0                       ((IVC_0_Type*)             IVC_0_BASE)
#define LOCK_0                      ((LOCK_0_Type*)            LOCK_0_BASE)
#define LPTIMER_0                   ((LPTIMER_0_Type*)         LPTIMER_0_BASE)
#define PLL_0                       ((PLL_0_Type*)             PLL_0_BASE)
#define EXTOSC_0                    ((EXTOSC_0_Type*)          EXTOSC_0_BASE)
#define LPOSC_0                     ((LPOSC_0_Type*)           LPOSC_0_BASE)
#define PCA_0                       ((PCA_0_Type*)             PCA_0_BASE)
#define PCA_1                       ((PCA_1_Type*)             PCA_1_BASE)
#define PMU_0                       ((PMU_0_Type*)             PMU_0_BASE)
#define PBCFG_0                     ((PBCFG_0_Type*)           PBCFG_0_BASE)
#define PBHD_4                      ((PBHD_4_Type*)            PBHD_4_BASE)
#define PBSTD_0                     ((PBSTD_Type*)             PBSTD_0_BASE)
#define PBSTD_1                     ((PBSTD_Type*)             PBSTD_1_BASE)
#define PBSTD_2                     ((PBSTD_Type*)             PBSTD_2_BASE)
#define PBSTD_3                     ((PBSTD_Type*)             PBSTD_3_BASE)
#define RTC_0                       ((RTC_0_Type*)             RTC_0_BASE)
#define RSTSRC_0                    ((RSTSRC_0_Type*)          RSTSRC_0_BASE)
#define SPI_0                       ((SPI_Type*)               SPI_0_BASE)
#define SPI_1                       ((SPI_Type*)               SPI_1_BASE)
#define SPI_2                       ((SPI_Type*)               SPI_2_BASE)
#define SSG_0                       ((SSG_0_Type*)             SSG_0_BASE)
#define TIMER_0                     ((TIMER_0_Type*)           TIMER_0_BASE)
#define TIMER_1                     ((TIMER_1_Type*)           TIMER_1_BASE)
#define UART_0                      ((UART_Type*)              UART_0_BASE)
#define UART_1                      ((UART_Type*)              UART_1_BASE)
#define USART_0                     ((USART_Type*)             USART_0_BASE)
#define USART_1                     ((USART_Type*)             USART_1_BASE)
#define USB_0                       ((USB_0_Type*)             USB_0_BASE)
#define VMON_0                      ((VMON_0_Type*)            VMON_0_BASE)
#define VREF_0                      ((VREF_0_Type*)            VREF_0_BASE)
#define EXTVREG_0                   ((EXTVREG_0_Type*)         EXTVREG_0_BASE)
#define VREG_0                      ((VREG_0_Type*)            VREG_0_BASE)
#define LDO_0                       ((LDO_0_Type*)             LDO_0_BASE)
#define WDTIMER_0                   ((WDTIMER_0_Type*)         WDTIMER_0_BASE)

