chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                 Pos/Mask Cluster Section                                  ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_clusters
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           DATA                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  U32  ========================================================== */
/* ==========================================================  U16  ========================================================== */
/* ==========================================================  U8  =========================================================== */

/** @} */ /* End of group PosMask_clusters */


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         SARADC_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
#define SARADC_0_CONFIG_SPSEL_Pos         (0UL)                     /*!< SARADC_0 CONFIG: SPSEL (Bit 0)                        */
#define SARADC_0_CONFIG_SPSEL_Msk         (0xfUL)                   /*!< SARADC_0 CONFIG: SPSEL (Bitfield-Mask: 0x0f)          */
#define SARADC_0_CONFIG_SPEN_Pos          (4UL)                     /*!< SARADC_0 CONFIG: SPEN (Bit 4)                         */
#define SARADC_0_CONFIG_SPEN_Msk          (0x10UL)                  /*!< SARADC_0 CONFIG: SPEN (Bitfield-Mask: 0x01)           */
#define SARADC_0_CONFIG_SSGEN_Pos         (5UL)                     /*!< SARADC_0 CONFIG: SSGEN (Bit 5)                        */
#define SARADC_0_CONFIG_SSGEN_Msk         (0x20UL)                  /*!< SARADC_0 CONFIG: SSGEN (Bitfield-Mask: 0x01)          */
#define SARADC_0_CONFIG_PACKMD_Pos        (6UL)                     /*!< SARADC_0 CONFIG: PACKMD (Bit 6)                       */
#define SARADC_0_CONFIG_PACKMD_Msk        (0xc0UL)                  /*!< SARADC_0 CONFIG: PACKMD (Bitfield-Mask: 0x03)         */
#define SARADC_0_CONFIG_SIMCEN_Pos        (8UL)                     /*!< SARADC_0 CONFIG: SIMCEN (Bit 8)                       */
#define SARADC_0_CONFIG_SIMCEN_Msk        (0x100UL)                 /*!< SARADC_0 CONFIG: SIMCEN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONFIG_INTLVEN_Pos       (9UL)                     /*!< SARADC_0 CONFIG: INTLVEN (Bit 9)                      */
#define SARADC_0_CONFIG_INTLVEN_Msk       (0x200UL)                 /*!< SARADC_0 CONFIG: INTLVEN (Bitfield-Mask: 0x01)        */
#define SARADC_0_CONFIG_SCANEN_Pos        (10UL)                    /*!< SARADC_0 CONFIG: SCANEN (Bit 10)                      */
#define SARADC_0_CONFIG_SCANEN_Msk        (0x400UL)                 /*!< SARADC_0 CONFIG: SCANEN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONFIG_SCANMD_Pos        (12UL)                    /*!< SARADC_0 CONFIG: SCANMD (Bit 12)                      */
#define SARADC_0_CONFIG_SCANMD_Msk        (0x1000UL)                /*!< SARADC_0 CONFIG: SCANMD (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONFIG_DMAEN_Pos         (14UL)                    /*!< SARADC_0 CONFIG: DMAEN (Bit 14)                       */
#define SARADC_0_CONFIG_DMAEN_Msk         (0x4000UL)                /*!< SARADC_0 CONFIG: DMAEN (Bitfield-Mask: 0x01)          */
#define SARADC_0_CONFIG_BCLKSEL_Pos       (15UL)                    /*!< SARADC_0 CONFIG: BCLKSEL (Bit 15)                     */
#define SARADC_0_CONFIG_BCLKSEL_Msk       (0x8000UL)                /*!< SARADC_0 CONFIG: BCLKSEL (Bitfield-Mask: 0x01)        */
#define SARADC_0_CONFIG_CLKDIV_Pos        (16UL)                    /*!< SARADC_0 CONFIG: CLKDIV (Bit 16)                      */
#define SARADC_0_CONFIG_CLKDIV_Msk        (0x7ff0000UL)             /*!< SARADC_0 CONFIG: CLKDIV (Bitfield-Mask: 0x7ff)        */
#define SARADC_0_CONFIG_SCCIEN_Pos        (27UL)                    /*!< SARADC_0 CONFIG: SCCIEN (Bit 27)                      */
#define SARADC_0_CONFIG_SCCIEN_Msk        (0x8000000UL)             /*!< SARADC_0 CONFIG: SCCIEN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONFIG_SDIEN_Pos         (28UL)                    /*!< SARADC_0 CONFIG: SDIEN (Bit 28)                       */
#define SARADC_0_CONFIG_SDIEN_Msk         (0x10000000UL)            /*!< SARADC_0 CONFIG: SDIEN (Bitfield-Mask: 0x01)          */
#define SARADC_0_CONFIG_FORIEN_Pos        (29UL)                    /*!< SARADC_0 CONFIG: FORIEN (Bit 29)                      */
#define SARADC_0_CONFIG_FORIEN_Msk        (0x20000000UL)            /*!< SARADC_0 CONFIG: FORIEN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONFIG_FURIEN_Pos        (30UL)                    /*!< SARADC_0 CONFIG: FURIEN (Bit 30)                      */
#define SARADC_0_CONFIG_FURIEN_Msk        (0x40000000UL)            /*!< SARADC_0 CONFIG: FURIEN (Bitfield-Mask: 0x01)         */
/* ========================================================  CONTROL  ======================================================== */
#define SARADC_0_CONTROL_REFGNDSEL_Pos    (0UL)                     /*!< SARADC_0 CONTROL: REFGNDSEL (Bit 0)                   */
#define SARADC_0_CONTROL_REFGNDSEL_Msk    (0x1UL)                   /*!< SARADC_0 CONTROL: REFGNDSEL (Bitfield-Mask: 0x01)     */
#define SARADC_0_CONTROL_CLKESEL_Pos      (1UL)                     /*!< SARADC_0 CONTROL: CLKESEL (Bit 1)                     */
#define SARADC_0_CONTROL_CLKESEL_Msk      (0x2UL)                   /*!< SARADC_0 CONTROL: CLKESEL (Bitfield-Mask: 0x01)       */
#define SARADC_0_CONTROL_BMTK_Pos         (2UL)                     /*!< SARADC_0 CONTROL: BMTK (Bit 2)                        */
#define SARADC_0_CONTROL_BMTK_Msk         (0xfcUL)                  /*!< SARADC_0 CONTROL: BMTK (Bitfield-Mask: 0x3f)          */
#define SARADC_0_CONTROL_SCSEL_Pos        (8UL)                     /*!< SARADC_0 CONTROL: SCSEL (Bit 8)                       */
#define SARADC_0_CONTROL_SCSEL_Msk        (0xf00UL)                 /*!< SARADC_0 CONTROL: SCSEL (Bitfield-Mask: 0x0f)         */
#define SARADC_0_CONTROL_PWRTIME_Pos      (12UL)                    /*!< SARADC_0 CONTROL: PWRTIME (Bit 12)                    */
#define SARADC_0_CONTROL_PWRTIME_Msk      (0xf000UL)                /*!< SARADC_0 CONTROL: PWRTIME (Bitfield-Mask: 0x0f)       */
#define SARADC_0_CONTROL_BURSTEN_Pos      (16UL)                    /*!< SARADC_0 CONTROL: BURSTEN (Bit 16)                    */
#define SARADC_0_CONTROL_BURSTEN_Msk      (0x10000UL)               /*!< SARADC_0 CONTROL: BURSTEN (Bitfield-Mask: 0x01)       */
#define SARADC_0_CONTROL_ADCEN_Pos        (17UL)                    /*!< SARADC_0 CONTROL: ADCEN (Bit 17)                      */
#define SARADC_0_CONTROL_ADCEN_Msk        (0x20000UL)               /*!< SARADC_0 CONTROL: ADCEN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONTROL_AD12BSSEL_Pos    (18UL)                    /*!< SARADC_0 CONTROL: AD12BSSEL (Bit 18)                  */
#define SARADC_0_CONTROL_AD12BSSEL_Msk    (0x40000UL)               /*!< SARADC_0 CONTROL: AD12BSSEL (Bitfield-Mask: 0x01)     */
#define SARADC_0_CONTROL_VCMEN_Pos        (19UL)                    /*!< SARADC_0 CONTROL: VCMEN (Bit 19)                      */
#define SARADC_0_CONTROL_VCMEN_Msk        (0x80000UL)               /*!< SARADC_0 CONTROL: VCMEN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONTROL_ACCMD_Pos        (21UL)                    /*!< SARADC_0 CONTROL: ACCMD (Bit 21)                      */
#define SARADC_0_CONTROL_ACCMD_Msk        (0x200000UL)              /*!< SARADC_0 CONTROL: ACCMD (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONTROL_TRKMD_Pos        (22UL)                    /*!< SARADC_0 CONTROL: TRKMD (Bit 22)                      */
#define SARADC_0_CONTROL_TRKMD_Msk        (0x400000UL)              /*!< SARADC_0 CONTROL: TRKMD (Bitfield-Mask: 0x01)         */
#define SARADC_0_CONTROL_ADBUSY_Pos       (23UL)                    /*!< SARADC_0 CONTROL: ADBUSY (Bit 23)                     */
#define SARADC_0_CONTROL_ADBUSY_Msk       (0x800000UL)              /*!< SARADC_0 CONTROL: ADBUSY (Bitfield-Mask: 0x01)        */
#define SARADC_0_CONTROL_BIASSEL_Pos      (24UL)                    /*!< SARADC_0 CONTROL: BIASSEL (Bit 24)                    */
#define SARADC_0_CONTROL_BIASSEL_Msk      (0x3000000UL)             /*!< SARADC_0 CONTROL: BIASSEL (Bitfield-Mask: 0x03)       */
#define SARADC_0_CONTROL_LPMDEN_Pos       (26UL)                    /*!< SARADC_0 CONTROL: LPMDEN (Bit 26)                     */
#define SARADC_0_CONTROL_LPMDEN_Msk       (0x4000000UL)             /*!< SARADC_0 CONTROL: LPMDEN (Bitfield-Mask: 0x01)        */
#define SARADC_0_CONTROL_MREFLPEN_Pos     (27UL)                    /*!< SARADC_0 CONTROL: MREFLPEN (Bit 27)                   */
#define SARADC_0_CONTROL_MREFLPEN_Msk     (0x8000000UL)             /*!< SARADC_0 CONTROL: MREFLPEN (Bitfield-Mask: 0x01)      */
#define SARADC_0_CONTROL_VREFSEL_Pos      (30UL)                    /*!< SARADC_0 CONTROL: VREFSEL (Bit 30)                    */
#define SARADC_0_CONTROL_VREFSEL_Msk      (0xc0000000UL)            /*!< SARADC_0 CONTROL: VREFSEL (Bitfield-Mask: 0x03)       */
/* ========================================================  SQ7654  ========================================================= */
#define SARADC_0_SQ7654_TS4CHR_Pos        (0UL)                     /*!< SARADC_0 SQ7654: TS4CHR (Bit 0)                       */
#define SARADC_0_SQ7654_TS4CHR_Msk        (0x3UL)                   /*!< SARADC_0 SQ7654: TS4CHR (Bitfield-Mask: 0x03)         */
#define SARADC_0_SQ7654_TS4MUX_Pos        (2UL)                     /*!< SARADC_0 SQ7654: TS4MUX (Bit 2)                       */
#define SARADC_0_SQ7654_TS4MUX_Msk        (0x7cUL)                  /*!< SARADC_0 SQ7654: TS4MUX (Bitfield-Mask: 0x1f)         */
#define SARADC_0_SQ7654_TS5CHR_Pos        (8UL)                     /*!< SARADC_0 SQ7654: TS5CHR (Bit 8)                       */
#define SARADC_0_SQ7654_TS5CHR_Msk        (0x300UL)                 /*!< SARADC_0 SQ7654: TS5CHR (Bitfield-Mask: 0x03)         */
#define SARADC_0_SQ7654_TS5MUX_Pos        (10UL)                    /*!< SARADC_0 SQ7654: TS5MUX (Bit 10)                      */
#define SARADC_0_SQ7654_TS5MUX_Msk        (0x7c00UL)                /*!< SARADC_0 SQ7654: TS5MUX (Bitfield-Mask: 0x1f)         */
#define SARADC_0_SQ7654_TS6CHR_Pos        (16UL)                    /*!< SARADC_0 SQ7654: TS6CHR (Bit 16)                      */
#define SARADC_0_SQ7654_TS6CHR_Msk        (0x30000UL)               /*!< SARADC_0 SQ7654: TS6CHR (Bitfield-Mask: 0x03)         */
#define SARADC_0_SQ7654_TS6MUX_Pos        (18UL)                    /*!< SARADC_0 SQ7654: TS6MUX (Bit 18)                      */
#define SARADC_0_SQ7654_TS6MUX_Msk        (0x7c0000UL)              /*!< SARADC_0 SQ7654: TS6MUX (Bitfield-Mask: 0x1f)         */
#define SARADC_0_SQ7654_TS7CHR_Pos        (24UL)                    /*!< SARADC_0 SQ7654: TS7CHR (Bit 24)                      */
#define SARADC_0_SQ7654_TS7CHR_Msk        (0x3000000UL)             /*!< SARADC_0 SQ7654: TS7CHR (Bitfield-Mask: 0x03)         */
#define SARADC_0_SQ7654_TS7MUX_Pos        (26UL)                    /*!< SARADC_0 SQ7654: TS7MUX (Bit 26)                      */
#define SARADC_0_SQ7654_TS7MUX_Msk        (0x7c000000UL)            /*!< SARADC_0 SQ7654: TS7MUX (Bitfield-Mask: 0x1f)         */
/* ========================================================  SQ3210  ========================================================= */
#define SARADC_0_SQ3210_TS0CHR_Pos        (0UL)                     /*!< SARADC_0 SQ3210: TS0CHR (Bit 0)                       */
#define SARADC_0_SQ3210_TS0CHR_Msk        (0x3UL)                   /*!< SARADC_0 SQ3210: TS0CHR (Bitfield-Mask: 0x03)         */
#define SARADC_0_SQ3210_TS0MUX_Pos        (2UL)                     /*!< SARADC_0 SQ3210: TS0MUX (Bit 2)                       */
#define SARADC_0_SQ3210_TS0MUX_Msk        (0x7cUL)                  /*!< SARADC_0 SQ3210: TS0MUX (Bitfield-Mask: 0x1f)         */
#define SARADC_0_SQ3210_TS1CHR_Pos        (8UL)                     /*!< SARADC_0 SQ3210: TS1CHR (Bit 8)                       */
#define SARADC_0_SQ3210_TS1CHR_Msk        (0x300UL)                 /*!< SARADC_0 SQ3210: TS1CHR (Bitfield-Mask: 0x03)         */
#define SARADC_0_SQ3210_TS1MUX_Pos        (10UL)                    /*!< SARADC_0 SQ3210: TS1MUX (Bit 10)                      */
#define SARADC_0_SQ3210_TS1MUX_Msk        (0x7c00UL)                /*!< SARADC_0 SQ3210: TS1MUX (Bitfield-Mask: 0x1f)         */
#define SARADC_0_SQ3210_TS2CHR_Pos        (16UL)                    /*!< SARADC_0 SQ3210: TS2CHR (Bit 16)                      */
#define SARADC_0_SQ3210_TS2CHR_Msk        (0x30000UL)               /*!< SARADC_0 SQ3210: TS2CHR (Bitfield-Mask: 0x03)         */
#define SARADC_0_SQ3210_TS2MUX_Pos        (18UL)                    /*!< SARADC_0 SQ3210: TS2MUX (Bit 18)                      */
#define SARADC_0_SQ3210_TS2MUX_Msk        (0x7c0000UL)              /*!< SARADC_0 SQ3210: TS2MUX (Bitfield-Mask: 0x1f)         */
#define SARADC_0_SQ3210_TS3CHR_Pos        (24UL)                    /*!< SARADC_0 SQ3210: TS3CHR (Bit 24)                      */
#define SARADC_0_SQ3210_TS3CHR_Msk        (0x3000000UL)             /*!< SARADC_0 SQ3210: TS3CHR (Bitfield-Mask: 0x03)         */
#define SARADC_0_SQ3210_TS3MUX_Pos        (26UL)                    /*!< SARADC_0 SQ3210: TS3MUX (Bit 26)                      */
#define SARADC_0_SQ3210_TS3MUX_Msk        (0x7c000000UL)            /*!< SARADC_0 SQ3210: TS3MUX (Bitfield-Mask: 0x1f)         */
/* ========================================================  CHAR32  ========================================================= */
#define SARADC_0_CHAR32_CHR2GN_Pos        (0UL)                     /*!< SARADC_0 CHAR32: CHR2GN (Bit 0)                       */
#define SARADC_0_CHAR32_CHR2GN_Msk        (0x1UL)                   /*!< SARADC_0 CHAR32: CHR2GN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CHAR32_CHR2RPT_Pos       (1UL)                     /*!< SARADC_0 CHAR32: CHR2RPT (Bit 1)                      */
#define SARADC_0_CHAR32_CHR2RPT_Msk       (0xeUL)                   /*!< SARADC_0 CHAR32: CHR2RPT (Bitfield-Mask: 0x07)        */
#define SARADC_0_CHAR32_CHR2LS_Pos        (4UL)                     /*!< SARADC_0 CHAR32: CHR2LS (Bit 4)                       */
#define SARADC_0_CHAR32_CHR2LS_Msk        (0x70UL)                  /*!< SARADC_0 CHAR32: CHR2LS (Bitfield-Mask: 0x07)         */
#define SARADC_0_CHAR32_CHR2RSEL_Pos      (7UL)                     /*!< SARADC_0 CHAR32: CHR2RSEL (Bit 7)                     */
#define SARADC_0_CHAR32_CHR2RSEL_Msk      (0x80UL)                  /*!< SARADC_0 CHAR32: CHR2RSEL (Bitfield-Mask: 0x01)       */
#define SARADC_0_CHAR32_CHR2WCIEN_Pos     (8UL)                     /*!< SARADC_0 CHAR32: CHR2WCIEN (Bit 8)                    */
#define SARADC_0_CHAR32_CHR2WCIEN_Msk     (0x100UL)                 /*!< SARADC_0 CHAR32: CHR2WCIEN (Bitfield-Mask: 0x01)      */
#define SARADC_0_CHAR32_CHR3GN_Pos        (16UL)                    /*!< SARADC_0 CHAR32: CHR3GN (Bit 16)                      */
#define SARADC_0_CHAR32_CHR3GN_Msk        (0x10000UL)               /*!< SARADC_0 CHAR32: CHR3GN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CHAR32_CHR3RPT_Pos       (17UL)                    /*!< SARADC_0 CHAR32: CHR3RPT (Bit 17)                     */
#define SARADC_0_CHAR32_CHR3RPT_Msk       (0xe0000UL)               /*!< SARADC_0 CHAR32: CHR3RPT (Bitfield-Mask: 0x07)        */
#define SARADC_0_CHAR32_CHR3LS_Pos        (20UL)                    /*!< SARADC_0 CHAR32: CHR3LS (Bit 20)                      */
#define SARADC_0_CHAR32_CHR3LS_Msk        (0x700000UL)              /*!< SARADC_0 CHAR32: CHR3LS (Bitfield-Mask: 0x07)         */
#define SARADC_0_CHAR32_CHR3RSEL_Pos      (23UL)                    /*!< SARADC_0 CHAR32: CHR3RSEL (Bit 23)                    */
#define SARADC_0_CHAR32_CHR3RSEL_Msk      (0x800000UL)              /*!< SARADC_0 CHAR32: CHR3RSEL (Bitfield-Mask: 0x01)       */
#define SARADC_0_CHAR32_CHR3WCIEN_Pos     (24UL)                    /*!< SARADC_0 CHAR32: CHR3WCIEN (Bit 24)                   */
#define SARADC_0_CHAR32_CHR3WCIEN_Msk     (0x1000000UL)             /*!< SARADC_0 CHAR32: CHR3WCIEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CHAR10  ========================================================= */
#define SARADC_0_CHAR10_CHR0GN_Pos        (0UL)                     /*!< SARADC_0 CHAR10: CHR0GN (Bit 0)                       */
#define SARADC_0_CHAR10_CHR0GN_Msk        (0x1UL)                   /*!< SARADC_0 CHAR10: CHR0GN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CHAR10_CHR0RPT_Pos       (1UL)                     /*!< SARADC_0 CHAR10: CHR0RPT (Bit 1)                      */
#define SARADC_0_CHAR10_CHR0RPT_Msk       (0xeUL)                   /*!< SARADC_0 CHAR10: CHR0RPT (Bitfield-Mask: 0x07)        */
#define SARADC_0_CHAR10_CHR0LS_Pos        (4UL)                     /*!< SARADC_0 CHAR10: CHR0LS (Bit 4)                       */
#define SARADC_0_CHAR10_CHR0LS_Msk        (0x70UL)                  /*!< SARADC_0 CHAR10: CHR0LS (Bitfield-Mask: 0x07)         */
#define SARADC_0_CHAR10_CHR0RSEL_Pos      (7UL)                     /*!< SARADC_0 CHAR10: CHR0RSEL (Bit 7)                     */
#define SARADC_0_CHAR10_CHR0RSEL_Msk      (0x80UL)                  /*!< SARADC_0 CHAR10: CHR0RSEL (Bitfield-Mask: 0x01)       */
#define SARADC_0_CHAR10_CHR0WCIEN_Pos     (8UL)                     /*!< SARADC_0 CHAR10: CHR0WCIEN (Bit 8)                    */
#define SARADC_0_CHAR10_CHR0WCIEN_Msk     (0x100UL)                 /*!< SARADC_0 CHAR10: CHR0WCIEN (Bitfield-Mask: 0x01)      */
#define SARADC_0_CHAR10_CHR1GN_Pos        (16UL)                    /*!< SARADC_0 CHAR10: CHR1GN (Bit 16)                      */
#define SARADC_0_CHAR10_CHR1GN_Msk        (0x10000UL)               /*!< SARADC_0 CHAR10: CHR1GN (Bitfield-Mask: 0x01)         */
#define SARADC_0_CHAR10_CHR1RPT_Pos       (17UL)                    /*!< SARADC_0 CHAR10: CHR1RPT (Bit 17)                     */
#define SARADC_0_CHAR10_CHR1RPT_Msk       (0xe0000UL)               /*!< SARADC_0 CHAR10: CHR1RPT (Bitfield-Mask: 0x07)        */
#define SARADC_0_CHAR10_CHR1LS_Pos        (20UL)                    /*!< SARADC_0 CHAR10: CHR1LS (Bit 20)                      */
#define SARADC_0_CHAR10_CHR1LS_Msk        (0x700000UL)              /*!< SARADC_0 CHAR10: CHR1LS (Bitfield-Mask: 0x07)         */
#define SARADC_0_CHAR10_CHR1RSEL_Pos      (23UL)                    /*!< SARADC_0 CHAR10: CHR1RSEL (Bit 23)                    */
#define SARADC_0_CHAR10_CHR1RSEL_Msk      (0x800000UL)              /*!< SARADC_0 CHAR10: CHR1RSEL (Bitfield-Mask: 0x01)       */
#define SARADC_0_CHAR10_CHR1WCIEN_Pos     (24UL)                    /*!< SARADC_0 CHAR10: CHR1WCIEN (Bit 24)                   */
#define SARADC_0_CHAR10_CHR1WCIEN_Msk     (0x1000000UL)             /*!< SARADC_0 CHAR10: CHR1WCIEN (Bitfield-Mask: 0x01)      */
/* =========================================================  DATA  ========================================================== */
#define SARADC_0_DATA_DATA_Pos            (0UL)                     /*!< SARADC_0 DATA: DATA (Bit 0)                           */
#define SARADC_0_DATA_DATA_Msk            (0xffffffffUL)            /*!< SARADC_0 DATA: DATA (Bitfield-Mask: 0xffffffff)       */
/* =======================================================  WCLIMITS  ======================================================== */
#define SARADC_0_WCLIMITS_WCLT_Pos        (0UL)                     /*!< SARADC_0 WCLIMITS: WCLT (Bit 0)                       */
#define SARADC_0_WCLIMITS_WCLT_Msk        (0xffffUL)                /*!< SARADC_0 WCLIMITS: WCLT (Bitfield-Mask: 0xffff)       */
#define SARADC_0_WCLIMITS_WCGT_Pos        (16UL)                    /*!< SARADC_0 WCLIMITS: WCGT (Bit 16)                      */
#define SARADC_0_WCLIMITS_WCGT_Msk        (0xffff0000UL)            /*!< SARADC_0 WCLIMITS: WCGT (Bitfield-Mask: 0xffff)       */
/* ==========================================================  ACC  ========================================================== */
#define SARADC_0_ACC_ACC_Pos              (0UL)                     /*!< SARADC_0 ACC: ACC (Bit 0)                             */
#define SARADC_0_ACC_ACC_Msk              (0xffffUL)                /*!< SARADC_0 ACC: ACC (Bitfield-Mask: 0xffff)             */
/* ========================================================  STATUS  ========================================================= */
#define SARADC_0_STATUS_WCI_Pos           (0UL)                     /*!< SARADC_0 STATUS: WCI (Bit 0)                          */
#define SARADC_0_STATUS_WCI_Msk           (0x1UL)                   /*!< SARADC_0 STATUS: WCI (Bitfield-Mask: 0x01)            */
#define SARADC_0_STATUS_SCCI_Pos          (1UL)                     /*!< SARADC_0 STATUS: SCCI (Bit 1)                         */
#define SARADC_0_STATUS_SCCI_Msk          (0x2UL)                   /*!< SARADC_0 STATUS: SCCI (Bitfield-Mask: 0x01)           */
#define SARADC_0_STATUS_SDI_Pos           (2UL)                     /*!< SARADC_0 STATUS: SDI (Bit 2)                          */
#define SARADC_0_STATUS_SDI_Msk           (0x4UL)                   /*!< SARADC_0 STATUS: SDI (Bitfield-Mask: 0x01)            */
#define SARADC_0_STATUS_FORI_Pos          (3UL)                     /*!< SARADC_0 STATUS: FORI (Bit 3)                         */
#define SARADC_0_STATUS_FORI_Msk          (0x8UL)                   /*!< SARADC_0 STATUS: FORI (Bitfield-Mask: 0x01)           */
#define SARADC_0_STATUS_FURI_Pos          (4UL)                     /*!< SARADC_0 STATUS: FURI (Bit 4)                         */
#define SARADC_0_STATUS_FURI_Msk          (0x10UL)                  /*!< SARADC_0 STATUS: FURI (Bitfield-Mask: 0x01)           */
/* ======================================================  FIFOSTATUS  ======================================================= */
