chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define AES_0_CONTROL_XFRSTA_Pos          (0UL)                     /*!< AES_0 CONTROL: XFRSTA (Bit 0)                         */
#define AES_0_CONTROL_XFRSTA_Msk          (0x1UL)                   /*!< AES_0 CONTROL: XFRSTA (Bitfield-Mask: 0x01)           */
#define AES_0_CONTROL_KEYCPEN_Pos         (1UL)                     /*!< AES_0 CONTROL: KEYCPEN (Bit 1)                        */
#define AES_0_CONTROL_KEYCPEN_Msk         (0x2UL)                   /*!< AES_0 CONTROL: KEYCPEN (Bitfield-Mask: 0x01)          */
#define AES_0_CONTROL_EDMD_Pos            (2UL)                     /*!< AES_0 CONTROL: EDMD (Bit 2)                           */
#define AES_0_CONTROL_EDMD_Msk            (0x4UL)                   /*!< AES_0 CONTROL: EDMD (Bitfield-Mask: 0x01)             */
#define AES_0_CONTROL_SWMDEN_Pos          (8UL)                     /*!< AES_0 CONTROL: SWMDEN (Bit 8)                         */
#define AES_0_CONTROL_SWMDEN_Msk          (0x100UL)                 /*!< AES_0 CONTROL: SWMDEN (Bitfield-Mask: 0x01)           */
#define AES_0_CONTROL_BEN_Pos             (9UL)                     /*!< AES_0 CONTROL: BEN (Bit 9)                            */
#define AES_0_CONTROL_BEN_Msk             (0x200UL)                 /*!< AES_0 CONTROL: BEN (Bitfield-Mask: 0x01)              */
#define AES_0_CONTROL_XOREN_Pos           (10UL)                    /*!< AES_0 CONTROL: XOREN (Bit 10)                         */
#define AES_0_CONTROL_XOREN_Msk           (0xc00UL)                 /*!< AES_0 CONTROL: XOREN (Bitfield-Mask: 0x03)            */
#define AES_0_CONTROL_HCTREN_Pos          (12UL)                    /*!< AES_0 CONTROL: HCTREN (Bit 12)                        */
#define AES_0_CONTROL_HCTREN_Msk          (0x1000UL)                /*!< AES_0 CONTROL: HCTREN (Bitfield-Mask: 0x01)           */
#define AES_0_CONTROL_HCBCEN_Pos          (13UL)                    /*!< AES_0 CONTROL: HCBCEN (Bit 13)                        */
#define AES_0_CONTROL_HCBCEN_Msk          (0x2000UL)                /*!< AES_0 CONTROL: HCBCEN (Bitfield-Mask: 0x01)           */
#define AES_0_CONTROL_KEYSIZE_Pos         (16UL)                    /*!< AES_0 CONTROL: KEYSIZE (Bit 16)                       */
#define AES_0_CONTROL_KEYSIZE_Msk         (0x30000UL)               /*!< AES_0 CONTROL: KEYSIZE (Bitfield-Mask: 0x03)          */
#define AES_0_CONTROL_ERRIEN_Pos          (24UL)                    /*!< AES_0 CONTROL: ERRIEN (Bit 24)                        */
#define AES_0_CONTROL_ERRIEN_Msk          (0x1000000UL)             /*!< AES_0 CONTROL: ERRIEN (Bitfield-Mask: 0x01)           */
#define AES_0_CONTROL_OCIEN_Pos           (25UL)                    /*!< AES_0 CONTROL: OCIEN (Bit 25)                         */
#define AES_0_CONTROL_OCIEN_Msk           (0x2000000UL)             /*!< AES_0 CONTROL: OCIEN (Bitfield-Mask: 0x01)            */
#define AES_0_CONTROL_DBGMD_Pos           (30UL)                    /*!< AES_0 CONTROL: DBGMD (Bit 30)                         */
#define AES_0_CONTROL_DBGMD_Msk           (0x40000000UL)            /*!< AES_0 CONTROL: DBGMD (Bitfield-Mask: 0x01)            */
#define AES_0_CONTROL_RESET_Pos           (31UL)                    /*!< AES_0 CONTROL: RESET (Bit 31)                         */
#define AES_0_CONTROL_RESET_Msk           (0x80000000UL)            /*!< AES_0 CONTROL: RESET (Bitfield-Mask: 0x01)            */
/* ========================================================  XFRSIZE  ======================================================== */
#define AES_0_XFRSIZE_XFRSIZE_Pos         (0UL)                     /*!< AES_0 XFRSIZE: XFRSIZE (Bit 0)                        */
#define AES_0_XFRSIZE_XFRSIZE_Msk         (0x7ffUL)                 /*!< AES_0 XFRSIZE: XFRSIZE (Bitfield-Mask: 0x7ff)         */
/* =======================================================  DATAFIFO  ======================================================== */
#define AES_0_DATAFIFO_DATAFIFO_Pos       (0UL)                     /*!< AES_0 DATAFIFO: DATAFIFO (Bit 0)                      */
#define AES_0_DATAFIFO_DATAFIFO_Msk       (0xffffffffUL)            /*!< AES_0 DATAFIFO: DATAFIFO (Bitfield-Mask: 0xffffffff)  */
/* ========================================================  XORFIFO  ======================================================== */
#define AES_0_XORFIFO_XORFIFO_Pos         (0UL)                     /*!< AES_0 XORFIFO: XORFIFO (Bit 0)                        */
#define AES_0_XORFIFO_XORFIFO_Msk         (0xffffffffUL)            /*!< AES_0 XORFIFO: XORFIFO (Bitfield-Mask: 0xffffffff)    */
/* ========================================================  HWKEY0  ========================================================= */
#define AES_0_HWKEY0_HWKEY0_Pos           (0UL)                     /*!< AES_0 HWKEY0: HWKEY0 (Bit 0)                          */
#define AES_0_HWKEY0_HWKEY0_Msk           (0xffffffffUL)            /*!< AES_0 HWKEY0: HWKEY0 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWKEY1  ========================================================= */
#define AES_0_HWKEY1_HWKEY1_Pos           (0UL)                     /*!< AES_0 HWKEY1: HWKEY1 (Bit 0)                          */
#define AES_0_HWKEY1_HWKEY1_Msk           (0xffffffffUL)            /*!< AES_0 HWKEY1: HWKEY1 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWKEY2  ========================================================= */
#define AES_0_HWKEY2_HWKEY2_Pos           (0UL)                     /*!< AES_0 HWKEY2: HWKEY2 (Bit 0)                          */
#define AES_0_HWKEY2_HWKEY2_Msk           (0xffffffffUL)            /*!< AES_0 HWKEY2: HWKEY2 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWKEY3  ========================================================= */
#define AES_0_HWKEY3_HWKEY3_Pos           (0UL)                     /*!< AES_0 HWKEY3: HWKEY3 (Bit 0)                          */
#define AES_0_HWKEY3_HWKEY3_Msk           (0xffffffffUL)            /*!< AES_0 HWKEY3: HWKEY3 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWKEY4  ========================================================= */
#define AES_0_HWKEY4_HWKEY4_Pos           (0UL)                     /*!< AES_0 HWKEY4: HWKEY4 (Bit 0)                          */
#define AES_0_HWKEY4_HWKEY4_Msk           (0xffffffffUL)            /*!< AES_0 HWKEY4: HWKEY4 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWKEY5  ========================================================= */
#define AES_0_HWKEY5_HWKEY5_Pos           (0UL)                     /*!< AES_0 HWKEY5: HWKEY5 (Bit 0)                          */
#define AES_0_HWKEY5_HWKEY5_Msk           (0xffffffffUL)            /*!< AES_0 HWKEY5: HWKEY5 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWKEY6  ========================================================= */
#define AES_0_HWKEY6_HWKEY6_Pos           (0UL)                     /*!< AES_0 HWKEY6: HWKEY6 (Bit 0)                          */
#define AES_0_HWKEY6_HWKEY6_Msk           (0xffffffffUL)            /*!< AES_0 HWKEY6: HWKEY6 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWKEY7  ========================================================= */
#define AES_0_HWKEY7_HWKEY7_Pos           (0UL)                     /*!< AES_0 HWKEY7: HWKEY7 (Bit 0)                          */
#define AES_0_HWKEY7_HWKEY7_Msk           (0xffffffffUL)            /*!< AES_0 HWKEY7: HWKEY7 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWCTR0  ========================================================= */
#define AES_0_HWCTR0_HWCTR0_Pos           (0UL)                     /*!< AES_0 HWCTR0: HWCTR0 (Bit 0)                          */
#define AES_0_HWCTR0_HWCTR0_Msk           (0xffffffffUL)            /*!< AES_0 HWCTR0: HWCTR0 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWCTR1  ========================================================= */
#define AES_0_HWCTR1_HWCTR1_Pos           (0UL)                     /*!< AES_0 HWCTR1: HWCTR1 (Bit 0)                          */
#define AES_0_HWCTR1_HWCTR1_Msk           (0xffffffffUL)            /*!< AES_0 HWCTR1: HWCTR1 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWCTR2  ========================================================= */
#define AES_0_HWCTR2_HWCTR2_Pos           (0UL)                     /*!< AES_0 HWCTR2: HWCTR2 (Bit 0)                          */
#define AES_0_HWCTR2_HWCTR2_Msk           (0xffffffffUL)            /*!< AES_0 HWCTR2: HWCTR2 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  HWCTR3  ========================================================= */
#define AES_0_HWCTR3_HWCTR3_Pos           (0UL)                     /*!< AES_0 HWCTR3: HWCTR3 (Bit 0)                          */
#define AES_0_HWCTR3_HWCTR3_Msk           (0xffffffffUL)            /*!< AES_0 HWCTR3: HWCTR3 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  STATUS  ========================================================= */
#define AES_0_STATUS_DURF_Pos             (0UL)                     /*!< AES_0 STATUS: DURF (Bit 0)                            */
#define AES_0_STATUS_DURF_Msk             (0x1UL)                   /*!< AES_0 STATUS: DURF (Bitfield-Mask: 0x01)              */
#define AES_0_STATUS_DORF_Pos             (1UL)                     /*!< AES_0 STATUS: DORF (Bit 1)                            */
#define AES_0_STATUS_DORF_Msk             (0x2UL)                   /*!< AES_0 STATUS: DORF (Bitfield-Mask: 0x01)              */
#define AES_0_STATUS_XORF_Pos             (2UL)                     /*!< AES_0 STATUS: XORF (Bit 2)                            */
#define AES_0_STATUS_XORF_Msk             (0x4UL)                   /*!< AES_0 STATUS: XORF (Bitfield-Mask: 0x01)              */
#define AES_0_STATUS_DFIFOLVL_Pos         (4UL)                     /*!< AES_0 STATUS: DFIFOLVL (Bit 4)                        */
#define AES_0_STATUS_DFIFOLVL_Msk         (0x70UL)                  /*!< AES_0 STATUS: DFIFOLVL (Bitfield-Mask: 0x07)          */
#define AES_0_STATUS_XFIFOLVL_Pos         (8UL)                     /*!< AES_0 STATUS: XFIFOLVL (Bit 8)                        */
#define AES_0_STATUS_XFIFOLVL_Msk         (0x700UL)                 /*!< AES_0 STATUS: XFIFOLVL (Bitfield-Mask: 0x07)          */
#define AES_0_STATUS_BUSYF_Pos            (16UL)                    /*!< AES_0 STATUS: BUSYF (Bit 16)                          */
#define AES_0_STATUS_BUSYF_Msk            (0x10000UL)               /*!< AES_0 STATUS: BUSYF (Bitfield-Mask: 0x01)             */
#define AES_0_STATUS_ERRI_Pos             (30UL)                    /*!< AES_0 STATUS: ERRI (Bit 30)                           */
#define AES_0_STATUS_ERRI_Msk             (0x40000000UL)            /*!< AES_0 STATUS: ERRI (Bitfield-Mask: 0x01)              */
#define AES_0_STATUS_OCI_Pos              (31UL)                    /*!< AES_0 STATUS: OCI (Bit 31)                            */
#define AES_0_STATUS_OCI_Msk              (0x80000000UL)            /*!< AES_0 STATUS: OCI (Bitfield-Mask: 0x01)               */


/* =========================================================================================================================== */
/* ================                                           CRC_0                                           ================ */
/* =========================================================================================================================== */

