chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define CRC_0_CONTROL_SINITEN_Pos         (0UL)                     /*!< CRC_0 CONTROL: SINITEN (Bit 0)                        */
#define CRC_0_CONTROL_SINITEN_Msk         (0x1UL)                   /*!< CRC_0 CONTROL: SINITEN (Bitfield-Mask: 0x01)          */
#define CRC_0_CONTROL_SEED_Pos            (1UL)                     /*!< CRC_0 CONTROL: SEED (Bit 1)                           */
#define CRC_0_CONTROL_SEED_Msk            (0x2UL)                   /*!< CRC_0 CONTROL: SEED (Bitfield-Mask: 0x01)             */
#define CRC_0_CONTROL_CRCEN_Pos           (2UL)                     /*!< CRC_0 CONTROL: CRCEN (Bit 2)                          */
#define CRC_0_CONTROL_CRCEN_Msk           (0x4UL)                   /*!< CRC_0 CONTROL: CRCEN (Bitfield-Mask: 0x01)            */
#define CRC_0_CONTROL_POLYSEL_Pos         (4UL)                     /*!< CRC_0 CONTROL: POLYSEL (Bit 4)                        */
#define CRC_0_CONTROL_POLYSEL_Msk         (0x30UL)                  /*!< CRC_0 CONTROL: POLYSEL (Bitfield-Mask: 0x03)          */
#define CRC_0_CONTROL_BMDEN_Pos           (8UL)                     /*!< CRC_0 CONTROL: BMDEN (Bit 8)                          */
#define CRC_0_CONTROL_BMDEN_Msk           (0x100UL)                 /*!< CRC_0 CONTROL: BMDEN (Bitfield-Mask: 0x01)            */
#define CRC_0_CONTROL_BBREN_Pos           (9UL)                     /*!< CRC_0 CONTROL: BBREN (Bit 9)                          */
#define CRC_0_CONTROL_BBREN_Msk           (0x200UL)                 /*!< CRC_0 CONTROL: BBREN (Bitfield-Mask: 0x01)            */
#define CRC_0_CONTROL_ORDER_Pos           (10UL)                    /*!< CRC_0 CONTROL: ORDER (Bit 10)                         */
#define CRC_0_CONTROL_ORDER_Msk           (0xc00UL)                 /*!< CRC_0 CONTROL: ORDER (Bitfield-Mask: 0x03)            */
/* =========================================================  DATA  ========================================================== */
#define CRC_0_DATA_DATA_Pos               (0UL)                     /*!< CRC_0 DATA: DATA (Bit 0)                              */
#define CRC_0_DATA_DATA_Msk               (0xffffffffUL)            /*!< CRC_0 DATA: DATA (Bitfield-Mask: 0xffffffff)          */
/* =========================================================  RDATA  ========================================================= */
#define CRC_0_RDATA_RDATA_Pos             (0UL)                     /*!< CRC_0 RDATA: RDATA (Bit 0)                            */
#define CRC_0_RDATA_RDATA_Msk             (0xffffffffUL)            /*!< CRC_0 RDATA: RDATA (Bitfield-Mask: 0xffffffff)        */


/* =========================================================================================================================== */
/* ================                                        CAPSENSE_0                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
#define CAPSENSE_0_CONTROL_BUSYF_Pos      (0UL)                     /*!< CAPSENSE_0 CONTROL: BUSYF (Bit 0)                     */
#define CAPSENSE_0_CONTROL_BUSYF_Msk      (0x1UL)                   /*!< CAPSENSE_0 CONTROL: BUSYF (Bitfield-Mask: 0x01)       */
#define CAPSENSE_0_CONTROL_CSEN_Pos       (1UL)                     /*!< CAPSENSE_0 CONTROL: CSEN (Bit 1)                      */
#define CAPSENSE_0_CONTROL_CSEN_Msk       (0x2UL)                   /*!< CAPSENSE_0 CONTROL: CSEN (Bitfield-Mask: 0x01)        */
#define CAPSENSE_0_CONTROL_BIASEN_Pos     (2UL)                     /*!< CAPSENSE_0 CONTROL: BIASEN (Bit 2)                    */
#define CAPSENSE_0_CONTROL_BIASEN_Msk     (0x4UL)                   /*!< CAPSENSE_0 CONTROL: BIASEN (Bitfield-Mask: 0x01)      */
#define CAPSENSE_0_CONTROL_CMPPOL_Pos     (3UL)                     /*!< CAPSENSE_0 CONTROL: CMPPOL (Bit 3)                    */
#define CAPSENSE_0_CONTROL_CMPPOL_Msk     (0x8UL)                   /*!< CAPSENSE_0 CONTROL: CMPPOL (Bitfield-Mask: 0x01)      */
#define CAPSENSE_0_CONTROL_CMD_Pos        (4UL)                     /*!< CAPSENSE_0 CONTROL: CMD (Bit 4)                       */
#define CAPSENSE_0_CONTROL_CMD_Msk        (0x30UL)                  /*!< CAPSENSE_0 CONTROL: CMD (Bitfield-Mask: 0x03)         */
#define CAPSENSE_0_CONTROL_CNVR_Pos       (6UL)                     /*!< CAPSENSE_0 CONTROL: CNVR (Bit 6)                      */
#define CAPSENSE_0_CONTROL_CNVR_Msk       (0xc0UL)                  /*!< CAPSENSE_0 CONTROL: CNVR (Bitfield-Mask: 0x03)        */
#define CAPSENSE_0_CONTROL_ACCMD_Pos      (8UL)                     /*!< CAPSENSE_0 CONTROL: ACCMD (Bit 8)                     */
#define CAPSENSE_0_CONTROL_ACCMD_Msk      (0x700UL)                 /*!< CAPSENSE_0 CONTROL: ACCMD (Bitfield-Mask: 0x07)       */
#define CAPSENSE_0_CONTROL_MCEN_Pos       (11UL)                    /*!< CAPSENSE_0 CONTROL: MCEN (Bit 11)                     */
#define CAPSENSE_0_CONTROL_MCEN_Msk       (0x800UL)                 /*!< CAPSENSE_0 CONTROL: MCEN (Bitfield-Mask: 0x01)        */
#define CAPSENSE_0_CONTROL_CSCM_Pos       (12UL)                    /*!< CAPSENSE_0 CONTROL: CSCM (Bit 12)                     */
#define CAPSENSE_0_CONTROL_CSCM_Msk       (0xf000UL)                /*!< CAPSENSE_0 CONTROL: CSCM (Bitfield-Mask: 0x0f)        */
#define CAPSENSE_0_CONTROL_PMMD_Pos       (16UL)                    /*!< CAPSENSE_0 CONTROL: PMMD (Bit 16)                     */
#define CAPSENSE_0_CONTROL_PMMD_Msk       (0x30000UL)               /*!< CAPSENSE_0 CONTROL: PMMD (Bitfield-Mask: 0x03)        */
#define CAPSENSE_0_CONTROL_PMEF_Pos       (18UL)                    /*!< CAPSENSE_0 CONTROL: PMEF (Bit 18)                     */
#define CAPSENSE_0_CONTROL_PMEF_Msk       (0x40000UL)               /*!< CAPSENSE_0 CONTROL: PMEF (Bitfield-Mask: 0x01)        */
#define CAPSENSE_0_CONTROL_CMPEN_Pos      (20UL)                    /*!< CAPSENSE_0 CONTROL: CMPEN (Bit 20)                    */
#define CAPSENSE_0_CONTROL_CMPEN_Msk      (0x100000UL)              /*!< CAPSENSE_0 CONTROL: CMPEN (Bitfield-Mask: 0x01)       */
#define CAPSENSE_0_CONTROL_CDIEN_Pos      (21UL)                    /*!< CAPSENSE_0 CONTROL: CDIEN (Bit 21)                    */
#define CAPSENSE_0_CONTROL_CDIEN_Msk      (0x200000UL)              /*!< CAPSENSE_0 CONTROL: CDIEN (Bitfield-Mask: 0x01)       */
#define CAPSENSE_0_CONTROL_EOSIEN_Pos     (22UL)                    /*!< CAPSENSE_0 CONTROL: EOSIEN (Bit 22)                   */
#define CAPSENSE_0_CONTROL_EOSIEN_Msk     (0x400000UL)              /*!< CAPSENSE_0 CONTROL: EOSIEN (Bitfield-Mask: 0x01)      */
#define CAPSENSE_0_CONTROL_CMPI_Pos       (24UL)                    /*!< CAPSENSE_0 CONTROL: CMPI (Bit 24)                     */
#define CAPSENSE_0_CONTROL_CMPI_Msk       (0x1000000UL)             /*!< CAPSENSE_0 CONTROL: CMPI (Bitfield-Mask: 0x01)        */
#define CAPSENSE_0_CONTROL_CDI_Pos        (25UL)                    /*!< CAPSENSE_0 CONTROL: CDI (Bit 25)                      */
#define CAPSENSE_0_CONTROL_CDI_Msk        (0x2000000UL)             /*!< CAPSENSE_0 CONTROL: CDI (Bitfield-Mask: 0x01)         */
#define CAPSENSE_0_CONTROL_EOSI_Pos       (26UL)                    /*!< CAPSENSE_0 CONTROL: EOSI (Bit 26)                     */
#define CAPSENSE_0_CONTROL_EOSI_Msk       (0x4000000UL)             /*!< CAPSENSE_0 CONTROL: EOSI (Bitfield-Mask: 0x01)        */
/* =========================================================  MODE  ========================================================== */
#define CAPSENSE_0_MODE_CGSEL_Pos         (0UL)                     /*!< CAPSENSE_0 MODE: CGSEL (Bit 0)                        */
#define CAPSENSE_0_MODE_CGSEL_Msk         (0x7UL)                   /*!< CAPSENSE_0 MODE: CGSEL (Bitfield-Mask: 0x07)          */
#define CAPSENSE_0_MODE_DRSEL_Pos         (4UL)                     /*!< CAPSENSE_0 MODE: DRSEL (Bit 4)                        */
#define CAPSENSE_0_MODE_DRSEL_Msk         (0x30UL)                  /*!< CAPSENSE_0 MODE: DRSEL (Bitfield-Mask: 0x03)          */
#define CAPSENSE_0_MODE_RAMPSEL_Pos       (6UL)                     /*!< CAPSENSE_0 MODE: RAMPSEL (Bit 6)                      */
#define CAPSENSE_0_MODE_RAMPSEL_Msk       (0xc0UL)                  /*!< CAPSENSE_0 MODE: RAMPSEL (Bitfield-Mask: 0x03)        */
#define CAPSENSE_0_MODE_IASEL_Pos         (8UL)                     /*!< CAPSENSE_0 MODE: IASEL (Bit 8)                        */
#define CAPSENSE_0_MODE_IASEL_Msk         (0x700UL)                 /*!< CAPSENSE_0 MODE: IASEL (Bitfield-Mask: 0x07)          */
#define CAPSENSE_0_MODE_DTSEL_Pos         (12UL)                    /*!< CAPSENSE_0 MODE: DTSEL (Bit 12)                       */
#define CAPSENSE_0_MODE_DTSEL_Msk         (0x7000UL)                /*!< CAPSENSE_0 MODE: DTSEL (Bitfield-Mask: 0x07)          */
#define CAPSENSE_0_MODE_LPFSEL_Pos        (16UL)                    /*!< CAPSENSE_0 MODE: LPFSEL (Bit 16)                      */
#define CAPSENSE_0_MODE_LPFSEL_Msk        (0x70000UL)               /*!< CAPSENSE_0 MODE: LPFSEL (Bitfield-Mask: 0x07)         */
/* =========================================================  DATA  ========================================================== */
#define CAPSENSE_0_DATA_DATA_Pos          (0UL)                     /*!< CAPSENSE_0 DATA: DATA (Bit 0)                         */
#define CAPSENSE_0_DATA_DATA_Msk          (0xffffUL)                /*!< CAPSENSE_0 DATA: DATA (Bitfield-Mask: 0xffff)         */
/* =========================================================  SCAN  ========================================================== */
#define CAPSENSE_0_SCAN_SCANEN_Pos        (0UL)                     /*!< CAPSENSE_0 SCAN: SCANEN (Bit 0)                       */
#define CAPSENSE_0_SCAN_SCANEN_Msk        (0xffffUL)                /*!< CAPSENSE_0 SCAN: SCANEN (Bitfield-Mask: 0xffff)       */
/* =========================================================  CSTH  ========================================================== */
#define CAPSENSE_0_CSTH_CSTH_Pos          (0UL)                     /*!< CAPSENSE_0 CSTH: CSTH (Bit 0)                         */
#define CAPSENSE_0_CSTH_CSTH_Msk          (0xffffUL)                /*!< CAPSENSE_0 CSTH: CSTH (Bitfield-Mask: 0xffff)         */
/* ==========================================================  MUX  ========================================================== */
#define CAPSENSE_0_MUX_CSMX_Pos           (0UL)                     /*!< CAPSENSE_0 MUX: CSMX (Bit 0)                          */
#define CAPSENSE_0_MUX_CSMX_Msk           (0xfUL)                   /*!< CAPSENSE_0 MUX: CSMX (Bitfield-Mask: 0x0f)            */
#define CAPSENSE_0_MUX_CSDISC_Pos         (7UL)                     /*!< CAPSENSE_0 MUX: CSDISC (Bit 7)                        */
#define CAPSENSE_0_MUX_CSDISC_Msk         (0x80UL)                  /*!< CAPSENSE_0 MUX: CSDISC (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                         CLKCTRL_0                                         ================ */
/* =========================================================================================================================== */

