chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define CLKCTRL_0_CONTROL_AHBSEL_Pos      (0UL)                     /*!< CLKCTRL_0 CONTROL: AHBSEL (Bit 0)                     */
#define CLKCTRL_0_CONTROL_AHBSEL_Msk      (0x7UL)                   /*!< CLKCTRL_0 CONTROL: AHBSEL (Bitfield-Mask: 0x07)       */
#define CLKCTRL_0_CONTROL_AHBDIV_Pos      (8UL)                     /*!< CLKCTRL_0 CONTROL: AHBDIV (Bit 8)                     */
#define CLKCTRL_0_CONTROL_AHBDIV_Msk      (0x700UL)                 /*!< CLKCTRL_0 CONTROL: AHBDIV (Bitfield-Mask: 0x07)       */
#define CLKCTRL_0_CONTROL_APBDIV_Pos      (16UL)                    /*!< CLKCTRL_0 CONTROL: APBDIV (Bit 16)                    */
#define CLKCTRL_0_CONTROL_APBDIV_Msk      (0x10000UL)               /*!< CLKCTRL_0 CONTROL: APBDIV (Bitfield-Mask: 0x01)       */
#define CLKCTRL_0_CONTROL_EXTESEL_Pos     (28UL)                    /*!< CLKCTRL_0 CONTROL: EXTESEL (Bit 28)                   */
#define CLKCTRL_0_CONTROL_EXTESEL_Msk     (0x10000000UL)            /*!< CLKCTRL_0 CONTROL: EXTESEL (Bitfield-Mask: 0x01)      */
#define CLKCTRL_0_CONTROL_OBUSYF_Pos      (29UL)                    /*!< CLKCTRL_0 CONTROL: OBUSYF (Bit 29)                    */
#define CLKCTRL_0_CONTROL_OBUSYF_Msk      (0x20000000UL)            /*!< CLKCTRL_0 CONTROL: OBUSYF (Bitfield-Mask: 0x01)       */
/* ========================================================  AHBCLKG  ======================================================== */
#define CLKCTRL_0_AHBCLKG_RAMCEN_Pos      (0UL)                     /*!< CLKCTRL_0 AHBCLKG: RAMCEN (Bit 0)                     */
#define CLKCTRL_0_AHBCLKG_RAMCEN_Msk      (0x1UL)                   /*!< CLKCTRL_0 AHBCLKG: RAMCEN (Bitfield-Mask: 0x01)       */
#define CLKCTRL_0_AHBCLKG_DMACEN_Pos      (1UL)                     /*!< CLKCTRL_0 AHBCLKG: DMACEN (Bit 1)                     */
#define CLKCTRL_0_AHBCLKG_DMACEN_Msk      (0x2UL)                   /*!< CLKCTRL_0 AHBCLKG: DMACEN (Bitfield-Mask: 0x01)       */
#define CLKCTRL_0_AHBCLKG_FLASHCEN_Pos    (2UL)                     /*!< CLKCTRL_0 AHBCLKG: FLASHCEN (Bit 2)                   */
#define CLKCTRL_0_AHBCLKG_FLASHCEN_Msk    (0x4UL)                   /*!< CLKCTRL_0 AHBCLKG: FLASHCEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_AHBCLKG_EMIF0CEN_Pos    (3UL)                     /*!< CLKCTRL_0 AHBCLKG: EMIF0CEN (Bit 3)                   */
#define CLKCTRL_0_AHBCLKG_EMIF0CEN_Msk    (0x8UL)                   /*!< CLKCTRL_0 AHBCLKG: EMIF0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_AHBCLKG_USB0BCEN_Pos    (4UL)                     /*!< CLKCTRL_0 AHBCLKG: USB0BCEN (Bit 4)                   */
#define CLKCTRL_0_AHBCLKG_USB0BCEN_Msk    (0x10UL)                  /*!< CLKCTRL_0 AHBCLKG: USB0BCEN (Bitfield-Mask: 0x01)     */
/* =======================================================  APBCLKG0  ======================================================== */
#define CLKCTRL_0_APBCLKG0_PLL0CEN_Pos    (0UL)                     /*!< CLKCTRL_0 APBCLKG0: PLL0CEN (Bit 0)                   */
#define CLKCTRL_0_APBCLKG0_PLL0CEN_Msk    (0x1UL)                   /*!< CLKCTRL_0 APBCLKG0: PLL0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_PB0CEN_Pos     (1UL)                     /*!< CLKCTRL_0 APBCLKG0: PB0CEN (Bit 1)                    */
#define CLKCTRL_0_APBCLKG0_PB0CEN_Msk     (0x2UL)                   /*!< CLKCTRL_0 APBCLKG0: PB0CEN (Bitfield-Mask: 0x01)      */
#define CLKCTRL_0_APBCLKG0_USART0CEN_Pos  (2UL)                     /*!< CLKCTRL_0 APBCLKG0: USART0CEN (Bit 2)                 */
#define CLKCTRL_0_APBCLKG0_USART0CEN_Msk  (0x4UL)                   /*!< CLKCTRL_0 APBCLKG0: USART0CEN (Bitfield-Mask: 0x01)   */
#define CLKCTRL_0_APBCLKG0_USART1CEN_Pos  (3UL)                     /*!< CLKCTRL_0 APBCLKG0: USART1CEN (Bit 3)                 */
#define CLKCTRL_0_APBCLKG0_USART1CEN_Msk  (0x8UL)                   /*!< CLKCTRL_0 APBCLKG0: USART1CEN (Bitfield-Mask: 0x01)   */
#define CLKCTRL_0_APBCLKG0_UART0CEN_Pos   (4UL)                     /*!< CLKCTRL_0 APBCLKG0: UART0CEN (Bit 4)                  */
#define CLKCTRL_0_APBCLKG0_UART0CEN_Msk   (0x10UL)                  /*!< CLKCTRL_0 APBCLKG0: UART0CEN (Bitfield-Mask: 0x01)    */
#define CLKCTRL_0_APBCLKG0_UART1CEN_Pos   (5UL)                     /*!< CLKCTRL_0 APBCLKG0: UART1CEN (Bit 5)                  */
#define CLKCTRL_0_APBCLKG0_UART1CEN_Msk   (0x20UL)                  /*!< CLKCTRL_0 APBCLKG0: UART1CEN (Bitfield-Mask: 0x01)    */
#define CLKCTRL_0_APBCLKG0_SPI0CEN_Pos    (6UL)                     /*!< CLKCTRL_0 APBCLKG0: SPI0CEN (Bit 6)                   */
#define CLKCTRL_0_APBCLKG0_SPI0CEN_Msk    (0x40UL)                  /*!< CLKCTRL_0 APBCLKG0: SPI0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_SPI1CEN_Pos    (7UL)                     /*!< CLKCTRL_0 APBCLKG0: SPI1CEN (Bit 7)                   */
#define CLKCTRL_0_APBCLKG0_SPI1CEN_Msk    (0x80UL)                  /*!< CLKCTRL_0 APBCLKG0: SPI1CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_SPI2CEN_Pos    (8UL)                     /*!< CLKCTRL_0 APBCLKG0: SPI2CEN (Bit 8)                   */
#define CLKCTRL_0_APBCLKG0_SPI2CEN_Msk    (0x100UL)                 /*!< CLKCTRL_0 APBCLKG0: SPI2CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_I2C0CEN_Pos    (9UL)                     /*!< CLKCTRL_0 APBCLKG0: I2C0CEN (Bit 9)                   */
#define CLKCTRL_0_APBCLKG0_I2C0CEN_Msk    (0x200UL)                 /*!< CLKCTRL_0 APBCLKG0: I2C0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_I2C1CEN_Pos    (10UL)                    /*!< CLKCTRL_0 APBCLKG0: I2C1CEN (Bit 10)                  */
#define CLKCTRL_0_APBCLKG0_I2C1CEN_Msk    (0x400UL)                 /*!< CLKCTRL_0 APBCLKG0: I2C1CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_EPCA0CEN_Pos   (11UL)                    /*!< CLKCTRL_0 APBCLKG0: EPCA0CEN (Bit 11)                 */
#define CLKCTRL_0_APBCLKG0_EPCA0CEN_Msk   (0x800UL)                 /*!< CLKCTRL_0 APBCLKG0: EPCA0CEN (Bitfield-Mask: 0x01)    */
#define CLKCTRL_0_APBCLKG0_PCA0CEN_Pos    (12UL)                    /*!< CLKCTRL_0 APBCLKG0: PCA0CEN (Bit 12)                  */
#define CLKCTRL_0_APBCLKG0_PCA0CEN_Msk    (0x1000UL)                /*!< CLKCTRL_0 APBCLKG0: PCA0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_PCA1CEN_Pos    (13UL)                    /*!< CLKCTRL_0 APBCLKG0: PCA1CEN (Bit 13)                  */
#define CLKCTRL_0_APBCLKG0_PCA1CEN_Msk    (0x2000UL)                /*!< CLKCTRL_0 APBCLKG0: PCA1CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_SSG0CEN_Pos    (14UL)                    /*!< CLKCTRL_0 APBCLKG0: SSG0CEN (Bit 14)                  */
#define CLKCTRL_0_APBCLKG0_SSG0CEN_Msk    (0x4000UL)                /*!< CLKCTRL_0 APBCLKG0: SSG0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_TIMER0CEN_Pos  (15UL)                    /*!< CLKCTRL_0 APBCLKG0: TIMER0CEN (Bit 15)                */
#define CLKCTRL_0_APBCLKG0_TIMER0CEN_Msk  (0x8000UL)                /*!< CLKCTRL_0 APBCLKG0: TIMER0CEN (Bitfield-Mask: 0x01)   */
#define CLKCTRL_0_APBCLKG0_TIMER1CEN_Pos  (16UL)                    /*!< CLKCTRL_0 APBCLKG0: TIMER1CEN (Bit 16)                */
#define CLKCTRL_0_APBCLKG0_TIMER1CEN_Msk  (0x10000UL)               /*!< CLKCTRL_0 APBCLKG0: TIMER1CEN (Bitfield-Mask: 0x01)   */
#define CLKCTRL_0_APBCLKG0_ADC0CEN_Pos    (17UL)                    /*!< CLKCTRL_0 APBCLKG0: ADC0CEN (Bit 17)                  */
#define CLKCTRL_0_APBCLKG0_ADC0CEN_Msk    (0x20000UL)               /*!< CLKCTRL_0 APBCLKG0: ADC0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_ADC1CEN_Pos    (18UL)                    /*!< CLKCTRL_0 APBCLKG0: ADC1CEN (Bit 18)                  */
#define CLKCTRL_0_APBCLKG0_ADC1CEN_Msk    (0x40000UL)               /*!< CLKCTRL_0 APBCLKG0: ADC1CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_CMP0CEN_Pos    (19UL)                    /*!< CLKCTRL_0 APBCLKG0: CMP0CEN (Bit 19)                  */
#define CLKCTRL_0_APBCLKG0_CMP0CEN_Msk    (0x80000UL)               /*!< CLKCTRL_0 APBCLKG0: CMP0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_CMP1CEN_Pos    (20UL)                    /*!< CLKCTRL_0 APBCLKG0: CMP1CEN (Bit 20)                  */
#define CLKCTRL_0_APBCLKG0_CMP1CEN_Msk    (0x100000UL)              /*!< CLKCTRL_0 APBCLKG0: CMP1CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_CS0CEN_Pos     (21UL)                    /*!< CLKCTRL_0 APBCLKG0: CS0CEN (Bit 21)                   */
#define CLKCTRL_0_APBCLKG0_CS0CEN_Msk     (0x200000UL)              /*!< CLKCTRL_0 APBCLKG0: CS0CEN (Bitfield-Mask: 0x01)      */
#define CLKCTRL_0_APBCLKG0_AES0CEN_Pos    (22UL)                    /*!< CLKCTRL_0 APBCLKG0: AES0CEN (Bit 22)                  */
#define CLKCTRL_0_APBCLKG0_AES0CEN_Msk    (0x400000UL)              /*!< CLKCTRL_0 APBCLKG0: AES0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_CRC0CEN_Pos    (23UL)                    /*!< CLKCTRL_0 APBCLKG0: CRC0CEN (Bit 23)                  */
#define CLKCTRL_0_APBCLKG0_CRC0CEN_Msk    (0x800000UL)              /*!< CLKCTRL_0 APBCLKG0: CRC0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_IDAC0CEN_Pos   (24UL)                    /*!< CLKCTRL_0 APBCLKG0: IDAC0CEN (Bit 24)                 */
#define CLKCTRL_0_APBCLKG0_IDAC0CEN_Msk   (0x1000000UL)             /*!< CLKCTRL_0 APBCLKG0: IDAC0CEN (Bitfield-Mask: 0x01)    */
#define CLKCTRL_0_APBCLKG0_IDAC1CEN_Pos   (25UL)                    /*!< CLKCTRL_0 APBCLKG0: IDAC1CEN (Bit 25)                 */
#define CLKCTRL_0_APBCLKG0_IDAC1CEN_Msk   (0x2000000UL)             /*!< CLKCTRL_0 APBCLKG0: IDAC1CEN (Bitfield-Mask: 0x01)    */
#define CLKCTRL_0_APBCLKG0_LPT0CEN_Pos    (26UL)                    /*!< CLKCTRL_0 APBCLKG0: LPT0CEN (Bit 26)                  */
#define CLKCTRL_0_APBCLKG0_LPT0CEN_Msk    (0x4000000UL)             /*!< CLKCTRL_0 APBCLKG0: LPT0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_I2S0CEN_Pos    (27UL)                    /*!< CLKCTRL_0 APBCLKG0: I2S0CEN (Bit 27)                  */
#define CLKCTRL_0_APBCLKG0_I2S0CEN_Msk    (0x8000000UL)             /*!< CLKCTRL_0 APBCLKG0: I2S0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_USB0CEN_Pos    (28UL)                    /*!< CLKCTRL_0 APBCLKG0: USB0CEN (Bit 28)                  */
#define CLKCTRL_0_APBCLKG0_USB0CEN_Msk    (0x10000000UL)            /*!< CLKCTRL_0 APBCLKG0: USB0CEN (Bitfield-Mask: 0x01)     */
#define CLKCTRL_0_APBCLKG0_EVREGCEN_Pos   (29UL)                    /*!< CLKCTRL_0 APBCLKG0: EVREGCEN (Bit 29)                 */
#define CLKCTRL_0_APBCLKG0_EVREGCEN_Msk   (0x20000000UL)            /*!< CLKCTRL_0 APBCLKG0: EVREGCEN (Bitfield-Mask: 0x01)    */
#define CLKCTRL_0_APBCLKG0_FLCTRLCEN_Pos  (30UL)                    /*!< CLKCTRL_0 APBCLKG0: FLCTRLCEN (Bit 30)                */
#define CLKCTRL_0_APBCLKG0_FLCTRLCEN_Msk  (0x40000000UL)            /*!< CLKCTRL_0 APBCLKG0: FLCTRLCEN (Bitfield-Mask: 0x01)   */
/* =======================================================  APBCLKG1  ======================================================== */
#define CLKCTRL_0_APBCLKG1_MISC0CEN_Pos   (0UL)                     /*!< CLKCTRL_0 APBCLKG1: MISC0CEN (Bit 0)                  */
#define CLKCTRL_0_APBCLKG1_MISC0CEN_Msk   (0x1UL)                   /*!< CLKCTRL_0 APBCLKG1: MISC0CEN (Bitfield-Mask: 0x01)    */
#define CLKCTRL_0_APBCLKG1_MISC1CEN_Pos   (1UL)                     /*!< CLKCTRL_0 APBCLKG1: MISC1CEN (Bit 1)                  */
#define CLKCTRL_0_APBCLKG1_MISC1CEN_Msk   (0x2UL)                   /*!< CLKCTRL_0 APBCLKG1: MISC1CEN (Bitfield-Mask: 0x01)    */
#define CLKCTRL_0_APBCLKG1_MISC2CEN_Pos   (2UL)                     /*!< CLKCTRL_0 APBCLKG1: MISC2CEN (Bit 2)                  */
#define CLKCTRL_0_APBCLKG1_MISC2CEN_Msk   (0x4UL)                   /*!< CLKCTRL_0 APBCLKG1: MISC2CEN (Bitfield-Mask: 0x01)    */
/* =========================================================  PM3CN  ========================================================= */
#define CLKCTRL_0_PM3CN_PM3CSEL_Pos       (0UL)                     /*!< CLKCTRL_0 PM3CN: PM3CSEL (Bit 0)                      */
#define CLKCTRL_0_PM3CN_PM3CSEL_Msk       (0x7UL)                   /*!< CLKCTRL_0 PM3CN: PM3CSEL (Bitfield-Mask: 0x07)        */
#define CLKCTRL_0_PM3CN_PM3CEN_Pos        (16UL)                    /*!< CLKCTRL_0 PM3CN: PM3CEN (Bit 16)                      */
#define CLKCTRL_0_PM3CN_PM3CEN_Msk        (0x10000UL)               /*!< CLKCTRL_0 PM3CN: PM3CEN (Bitfield-Mask: 0x01)         */


/* =========================================================================================================================== */
/* ================                                           CMP_0                                           ================ */
/* =========================================================================================================================== */

