chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define CMP_0_CONTROL_CMPFI_Pos           (13UL)                    /*!< CMP_0 CONTROL: CMPFI (Bit 13)                         */
#define CMP_0_CONTROL_CMPFI_Msk           (0x2000UL)                /*!< CMP_0 CONTROL: CMPFI (Bitfield-Mask: 0x01)            */
#define CMP_0_CONTROL_CMPRI_Pos           (14UL)                    /*!< CMP_0 CONTROL: CMPRI (Bit 14)                         */
#define CMP_0_CONTROL_CMPRI_Msk           (0x4000UL)                /*!< CMP_0 CONTROL: CMPRI (Bitfield-Mask: 0x01)            */
#define CMP_0_CONTROL_CMPOUT_Pos          (30UL)                    /*!< CMP_0 CONTROL: CMPOUT (Bit 30)                        */
#define CMP_0_CONTROL_CMPOUT_Msk          (0x40000000UL)            /*!< CMP_0 CONTROL: CMPOUT (Bitfield-Mask: 0x01)           */
#define CMP_0_CONTROL_CMPEN_Pos           (31UL)                    /*!< CMP_0 CONTROL: CMPEN (Bit 31)                         */
#define CMP_0_CONTROL_CMPEN_Msk           (0x80000000UL)            /*!< CMP_0 CONTROL: CMPEN (Bitfield-Mask: 0x01)            */
/* =========================================================  MODE  ========================================================== */
#define CMP_0_MODE_NMUX_Pos               (0UL)                     /*!< CMP_0 MODE: NMUX (Bit 0)                              */
#define CMP_0_MODE_NMUX_Msk               (0xfUL)                   /*!< CMP_0 MODE: NMUX (Bitfield-Mask: 0x0f)                */
#define CMP_0_MODE_PMUX_Pos               (4UL)                     /*!< CMP_0 MODE: PMUX (Bit 4)                              */
#define CMP_0_MODE_PMUX_Msk               (0xf0UL)                  /*!< CMP_0 MODE: PMUX (Bitfield-Mask: 0x0f)                */
#define CMP_0_MODE_INMUX_Pos              (8UL)                     /*!< CMP_0 MODE: INMUX (Bit 8)                             */
#define CMP_0_MODE_INMUX_Msk              (0x300UL)                 /*!< CMP_0 MODE: INMUX (Bitfield-Mask: 0x03)               */
#define CMP_0_MODE_CMPMD_Pos              (10UL)                    /*!< CMP_0 MODE: CMPMD (Bit 10)                            */
#define CMP_0_MODE_CMPMD_Msk              (0xc00UL)                 /*!< CMP_0 MODE: CMPMD (Bitfield-Mask: 0x03)               */
#define CMP_0_MODE_FIEN_Pos               (13UL)                    /*!< CMP_0 MODE: FIEN (Bit 13)                             */
#define CMP_0_MODE_FIEN_Msk               (0x2000UL)                /*!< CMP_0 MODE: FIEN (Bitfield-Mask: 0x01)                */
#define CMP_0_MODE_RIEN_Pos               (14UL)                    /*!< CMP_0 MODE: RIEN (Bit 14)                             */
#define CMP_0_MODE_RIEN_Msk               (0x4000UL)                /*!< CMP_0 MODE: RIEN (Bitfield-Mask: 0x01)                */
#define CMP_0_MODE_DACLVL_Pos             (16UL)                    /*!< CMP_0 MODE: DACLVL (Bit 16)                           */
#define CMP_0_MODE_DACLVL_Msk             (0x3f0000UL)              /*!< CMP_0 MODE: DACLVL (Bitfield-Mask: 0x3f)              */
#define CMP_0_MODE_NWPUEN_Pos             (22UL)                    /*!< CMP_0 MODE: NWPUEN (Bit 22)                           */
#define CMP_0_MODE_NWPUEN_Msk             (0x400000UL)              /*!< CMP_0 MODE: NWPUEN (Bitfield-Mask: 0x01)              */
#define CMP_0_MODE_PWPUEN_Pos             (23UL)                    /*!< CMP_0 MODE: PWPUEN (Bit 23)                           */
#define CMP_0_MODE_PWPUEN_Msk             (0x800000UL)              /*!< CMP_0 MODE: PWPUEN (Bitfield-Mask: 0x01)              */
#define CMP_0_MODE_CMPHYN_Pos             (24UL)                    /*!< CMP_0 MODE: CMPHYN (Bit 24)                           */
#define CMP_0_MODE_CMPHYN_Msk             (0x3000000UL)             /*!< CMP_0 MODE: CMPHYN (Bitfield-Mask: 0x03)              */
#define CMP_0_MODE_CMPHYP_Pos             (26UL)                    /*!< CMP_0 MODE: CMPHYP (Bit 26)                           */
#define CMP_0_MODE_CMPHYP_Msk             (0xc000000UL)             /*!< CMP_0 MODE: CMPHYP (Bitfield-Mask: 0x03)              */
#define CMP_0_MODE_INVEN_Pos              (30UL)                    /*!< CMP_0 MODE: INVEN (Bit 30)                            */
#define CMP_0_MODE_INVEN_Msk              (0x40000000UL)            /*!< CMP_0 MODE: INVEN (Bitfield-Mask: 0x01)               */


/* =========================================================================================================================== */
/* ================                                           CMP_1                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
#define CMP_1_CONTROL_CMPFI_Pos           (13UL)                    /*!< CMP_1 CONTROL: CMPFI (Bit 13)                         */
#define CMP_1_CONTROL_CMPFI_Msk           (0x2000UL)                /*!< CMP_1 CONTROL: CMPFI (Bitfield-Mask: 0x01)            */
#define CMP_1_CONTROL_CMPRI_Pos           (14UL)                    /*!< CMP_1 CONTROL: CMPRI (Bit 14)                         */
#define CMP_1_CONTROL_CMPRI_Msk           (0x4000UL)                /*!< CMP_1 CONTROL: CMPRI (Bitfield-Mask: 0x01)            */
#define CMP_1_CONTROL_CMPOUT_Pos          (30UL)                    /*!< CMP_1 CONTROL: CMPOUT (Bit 30)                        */
#define CMP_1_CONTROL_CMPOUT_Msk          (0x40000000UL)            /*!< CMP_1 CONTROL: CMPOUT (Bitfield-Mask: 0x01)           */
#define CMP_1_CONTROL_CMPEN_Pos           (31UL)                    /*!< CMP_1 CONTROL: CMPEN (Bit 31)                         */
#define CMP_1_CONTROL_CMPEN_Msk           (0x80000000UL)            /*!< CMP_1 CONTROL: CMPEN (Bitfield-Mask: 0x01)            */
/* =========================================================  MODE  ========================================================== */
#define CMP_1_MODE_NMUX_Pos               (0UL)                     /*!< CMP_1 MODE: NMUX (Bit 0)                              */
#define CMP_1_MODE_NMUX_Msk               (0xfUL)                   /*!< CMP_1 MODE: NMUX (Bitfield-Mask: 0x0f)                */
#define CMP_1_MODE_PMUX_Pos               (4UL)                     /*!< CMP_1 MODE: PMUX (Bit 4)                              */
#define CMP_1_MODE_PMUX_Msk               (0xf0UL)                  /*!< CMP_1 MODE: PMUX (Bitfield-Mask: 0x0f)                */
#define CMP_1_MODE_INMUX_Pos              (8UL)                     /*!< CMP_1 MODE: INMUX (Bit 8)                             */
#define CMP_1_MODE_INMUX_Msk              (0x300UL)                 /*!< CMP_1 MODE: INMUX (Bitfield-Mask: 0x03)               */
#define CMP_1_MODE_CMPMD_Pos              (10UL)                    /*!< CMP_1 MODE: CMPMD (Bit 10)                            */
#define CMP_1_MODE_CMPMD_Msk              (0xc00UL)                 /*!< CMP_1 MODE: CMPMD (Bitfield-Mask: 0x03)               */
#define CMP_1_MODE_FIEN_Pos               (13UL)                    /*!< CMP_1 MODE: FIEN (Bit 13)                             */
#define CMP_1_MODE_FIEN_Msk               (0x2000UL)                /*!< CMP_1 MODE: FIEN (Bitfield-Mask: 0x01)                */
#define CMP_1_MODE_RIEN_Pos               (14UL)                    /*!< CMP_1 MODE: RIEN (Bit 14)                             */
#define CMP_1_MODE_RIEN_Msk               (0x4000UL)                /*!< CMP_1 MODE: RIEN (Bitfield-Mask: 0x01)                */
#define CMP_1_MODE_DACLVL_Pos             (16UL)                    /*!< CMP_1 MODE: DACLVL (Bit 16)                           */
#define CMP_1_MODE_DACLVL_Msk             (0x3f0000UL)              /*!< CMP_1 MODE: DACLVL (Bitfield-Mask: 0x3f)              */
#define CMP_1_MODE_NWPUEN_Pos             (22UL)                    /*!< CMP_1 MODE: NWPUEN (Bit 22)                           */
#define CMP_1_MODE_NWPUEN_Msk             (0x400000UL)              /*!< CMP_1 MODE: NWPUEN (Bitfield-Mask: 0x01)              */
#define CMP_1_MODE_PWPUEN_Pos             (23UL)                    /*!< CMP_1 MODE: PWPUEN (Bit 23)                           */
#define CMP_1_MODE_PWPUEN_Msk             (0x800000UL)              /*!< CMP_1 MODE: PWPUEN (Bitfield-Mask: 0x01)              */
#define CMP_1_MODE_CMPHYN_Pos             (24UL)                    /*!< CMP_1 MODE: CMPHYN (Bit 24)                           */
#define CMP_1_MODE_CMPHYN_Msk             (0x3000000UL)             /*!< CMP_1 MODE: CMPHYN (Bitfield-Mask: 0x03)              */
#define CMP_1_MODE_CMPHYP_Pos             (26UL)                    /*!< CMP_1 MODE: CMPHYP (Bit 26)                           */
#define CMP_1_MODE_CMPHYP_Msk             (0xc000000UL)             /*!< CMP_1 MODE: CMPHYP (Bitfield-Mask: 0x03)              */
#define CMP_1_MODE_INVEN_Pos              (30UL)                    /*!< CMP_1 MODE: INVEN (Bit 30)                            */
#define CMP_1_MODE_INVEN_Msk              (0x40000000UL)            /*!< CMP_1 MODE: INVEN (Bitfield-Mask: 0x01)               */


/* =========================================================================================================================== */
/* ================                                         DMACTRL_0                                         ================ */
/* =========================================================================================================================== */

