chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  STATUS  ========================================================= */
#define DMACTRL_0_STATUS_DMAENSTS_Pos     (0UL)                     /*!< DMACTRL_0 STATUS: DMAENSTS (Bit 0)                    */
#define DMACTRL_0_STATUS_DMAENSTS_Msk     (0x1UL)                   /*!< DMACTRL_0 STATUS: DMAENSTS (Bitfield-Mask: 0x01)      */
#define DMACTRL_0_STATUS_STATE_Pos        (4UL)                     /*!< DMACTRL_0 STATUS: STATE (Bit 4)                       */
#define DMACTRL_0_STATUS_STATE_Msk        (0xf0UL)                  /*!< DMACTRL_0 STATUS: STATE (Bitfield-Mask: 0x0f)         */
#define DMACTRL_0_STATUS_NUMCHAN_Pos      (16UL)                    /*!< DMACTRL_0 STATUS: NUMCHAN (Bit 16)                    */
#define DMACTRL_0_STATUS_NUMCHAN_Msk      (0x1f0000UL)              /*!< DMACTRL_0 STATUS: NUMCHAN (Bitfield-Mask: 0x1f)       */
/* ========================================================  CONFIG  ========================================================= */
#define DMACTRL_0_CONFIG_DMAEN_Pos        (0UL)                     /*!< DMACTRL_0 CONFIG: DMAEN (Bit 0)                       */
#define DMACTRL_0_CONFIG_DMAEN_Msk        (0x1UL)                   /*!< DMACTRL_0 CONFIG: DMAEN (Bitfield-Mask: 0x01)         */
/* ========================================================  BASEPTR  ======================================================== */
#define DMACTRL_0_BASEPTR_BASEPTR_Pos     (5UL)                     /*!< DMACTRL_0 BASEPTR: BASEPTR (Bit 5)                    */
#define DMACTRL_0_BASEPTR_BASEPTR_Msk     (0xffffffe0UL)            /*!< DMACTRL_0 BASEPTR: BASEPTR (Bitfield-Mask: 0x7ffffff) */
/* =======================================================  ABASEPTR  ======================================================== */
#define DMACTRL_0_ABASEPTR_ABASEPTR_Pos   (0UL)                     /*!< DMACTRL_0 ABASEPTR: ABASEPTR (Bit 0)                  */
#define DMACTRL_0_ABASEPTR_ABASEPTR_Msk   (0xffffffffUL)            /*!< DMACTRL_0 ABASEPTR: ABASEPTR (Bitfield-Mask: 0xffffffff) */
/* =======================================================  CHSTATUS  ======================================================== */
#define DMACTRL_0_CHSTATUS_CH0_Pos        (0UL)                     /*!< DMACTRL_0 CHSTATUS: CH0 (Bit 0)                       */
#define DMACTRL_0_CHSTATUS_CH0_Msk        (0x1UL)                   /*!< DMACTRL_0 CHSTATUS: CH0 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH1_Pos        (1UL)                     /*!< DMACTRL_0 CHSTATUS: CH1 (Bit 1)                       */
#define DMACTRL_0_CHSTATUS_CH1_Msk        (0x2UL)                   /*!< DMACTRL_0 CHSTATUS: CH1 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH2_Pos        (2UL)                     /*!< DMACTRL_0 CHSTATUS: CH2 (Bit 2)                       */
#define DMACTRL_0_CHSTATUS_CH2_Msk        (0x4UL)                   /*!< DMACTRL_0 CHSTATUS: CH2 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH3_Pos        (3UL)                     /*!< DMACTRL_0 CHSTATUS: CH3 (Bit 3)                       */
#define DMACTRL_0_CHSTATUS_CH3_Msk        (0x8UL)                   /*!< DMACTRL_0 CHSTATUS: CH3 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH4_Pos        (4UL)                     /*!< DMACTRL_0 CHSTATUS: CH4 (Bit 4)                       */
#define DMACTRL_0_CHSTATUS_CH4_Msk        (0x10UL)                  /*!< DMACTRL_0 CHSTATUS: CH4 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH5_Pos        (5UL)                     /*!< DMACTRL_0 CHSTATUS: CH5 (Bit 5)                       */
#define DMACTRL_0_CHSTATUS_CH5_Msk        (0x20UL)                  /*!< DMACTRL_0 CHSTATUS: CH5 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH6_Pos        (6UL)                     /*!< DMACTRL_0 CHSTATUS: CH6 (Bit 6)                       */
#define DMACTRL_0_CHSTATUS_CH6_Msk        (0x40UL)                  /*!< DMACTRL_0 CHSTATUS: CH6 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH7_Pos        (7UL)                     /*!< DMACTRL_0 CHSTATUS: CH7 (Bit 7)                       */
#define DMACTRL_0_CHSTATUS_CH7_Msk        (0x80UL)                  /*!< DMACTRL_0 CHSTATUS: CH7 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH8_Pos        (8UL)                     /*!< DMACTRL_0 CHSTATUS: CH8 (Bit 8)                       */
#define DMACTRL_0_CHSTATUS_CH8_Msk        (0x100UL)                 /*!< DMACTRL_0 CHSTATUS: CH8 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH9_Pos        (9UL)                     /*!< DMACTRL_0 CHSTATUS: CH9 (Bit 9)                       */
#define DMACTRL_0_CHSTATUS_CH9_Msk        (0x200UL)                 /*!< DMACTRL_0 CHSTATUS: CH9 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSTATUS_CH10_Pos       (10UL)                    /*!< DMACTRL_0 CHSTATUS: CH10 (Bit 10)                     */
#define DMACTRL_0_CHSTATUS_CH10_Msk       (0x400UL)                 /*!< DMACTRL_0 CHSTATUS: CH10 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHSTATUS_CH11_Pos       (11UL)                    /*!< DMACTRL_0 CHSTATUS: CH11 (Bit 11)                     */
#define DMACTRL_0_CHSTATUS_CH11_Msk       (0x800UL)                 /*!< DMACTRL_0 CHSTATUS: CH11 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHSTATUS_CH12_Pos       (12UL)                    /*!< DMACTRL_0 CHSTATUS: CH12 (Bit 12)                     */
#define DMACTRL_0_CHSTATUS_CH12_Msk       (0x1000UL)                /*!< DMACTRL_0 CHSTATUS: CH12 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHSTATUS_CH13_Pos       (13UL)                    /*!< DMACTRL_0 CHSTATUS: CH13 (Bit 13)                     */
#define DMACTRL_0_CHSTATUS_CH13_Msk       (0x2000UL)                /*!< DMACTRL_0 CHSTATUS: CH13 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHSTATUS_CH14_Pos       (14UL)                    /*!< DMACTRL_0 CHSTATUS: CH14 (Bit 14)                     */
#define DMACTRL_0_CHSTATUS_CH14_Msk       (0x4000UL)                /*!< DMACTRL_0 CHSTATUS: CH14 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHSTATUS_CH15_Pos       (15UL)                    /*!< DMACTRL_0 CHSTATUS: CH15 (Bit 15)                     */
#define DMACTRL_0_CHSTATUS_CH15_Msk       (0x8000UL)                /*!< DMACTRL_0 CHSTATUS: CH15 (Bitfield-Mask: 0x01)        */
/* ========================================================  CHSWRCN  ======================================================== */
#define DMACTRL_0_CHSWRCN_CH0_Pos         (0UL)                     /*!< DMACTRL_0 CHSWRCN: CH0 (Bit 0)                        */
#define DMACTRL_0_CHSWRCN_CH0_Msk         (0x1UL)                   /*!< DMACTRL_0 CHSWRCN: CH0 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH1_Pos         (1UL)                     /*!< DMACTRL_0 CHSWRCN: CH1 (Bit 1)                        */
#define DMACTRL_0_CHSWRCN_CH1_Msk         (0x2UL)                   /*!< DMACTRL_0 CHSWRCN: CH1 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH2_Pos         (2UL)                     /*!< DMACTRL_0 CHSWRCN: CH2 (Bit 2)                        */
#define DMACTRL_0_CHSWRCN_CH2_Msk         (0x4UL)                   /*!< DMACTRL_0 CHSWRCN: CH2 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH3_Pos         (3UL)                     /*!< DMACTRL_0 CHSWRCN: CH3 (Bit 3)                        */
#define DMACTRL_0_CHSWRCN_CH3_Msk         (0x8UL)                   /*!< DMACTRL_0 CHSWRCN: CH3 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH4_Pos         (4UL)                     /*!< DMACTRL_0 CHSWRCN: CH4 (Bit 4)                        */
#define DMACTRL_0_CHSWRCN_CH4_Msk         (0x10UL)                  /*!< DMACTRL_0 CHSWRCN: CH4 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH5_Pos         (5UL)                     /*!< DMACTRL_0 CHSWRCN: CH5 (Bit 5)                        */
#define DMACTRL_0_CHSWRCN_CH5_Msk         (0x20UL)                  /*!< DMACTRL_0 CHSWRCN: CH5 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH6_Pos         (6UL)                     /*!< DMACTRL_0 CHSWRCN: CH6 (Bit 6)                        */
#define DMACTRL_0_CHSWRCN_CH6_Msk         (0x40UL)                  /*!< DMACTRL_0 CHSWRCN: CH6 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH7_Pos         (7UL)                     /*!< DMACTRL_0 CHSWRCN: CH7 (Bit 7)                        */
#define DMACTRL_0_CHSWRCN_CH7_Msk         (0x80UL)                  /*!< DMACTRL_0 CHSWRCN: CH7 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH8_Pos         (8UL)                     /*!< DMACTRL_0 CHSWRCN: CH8 (Bit 8)                        */
#define DMACTRL_0_CHSWRCN_CH8_Msk         (0x100UL)                 /*!< DMACTRL_0 CHSWRCN: CH8 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH9_Pos         (9UL)                     /*!< DMACTRL_0 CHSWRCN: CH9 (Bit 9)                        */
#define DMACTRL_0_CHSWRCN_CH9_Msk         (0x200UL)                 /*!< DMACTRL_0 CHSWRCN: CH9 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHSWRCN_CH10_Pos        (10UL)                    /*!< DMACTRL_0 CHSWRCN: CH10 (Bit 10)                      */
#define DMACTRL_0_CHSWRCN_CH10_Msk        (0x400UL)                 /*!< DMACTRL_0 CHSWRCN: CH10 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSWRCN_CH11_Pos        (11UL)                    /*!< DMACTRL_0 CHSWRCN: CH11 (Bit 11)                      */
#define DMACTRL_0_CHSWRCN_CH11_Msk        (0x800UL)                 /*!< DMACTRL_0 CHSWRCN: CH11 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSWRCN_CH12_Pos        (12UL)                    /*!< DMACTRL_0 CHSWRCN: CH12 (Bit 12)                      */
#define DMACTRL_0_CHSWRCN_CH12_Msk        (0x1000UL)                /*!< DMACTRL_0 CHSWRCN: CH12 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSWRCN_CH13_Pos        (13UL)                    /*!< DMACTRL_0 CHSWRCN: CH13 (Bit 13)                      */
#define DMACTRL_0_CHSWRCN_CH13_Msk        (0x2000UL)                /*!< DMACTRL_0 CHSWRCN: CH13 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSWRCN_CH14_Pos        (14UL)                    /*!< DMACTRL_0 CHSWRCN: CH14 (Bit 14)                      */
#define DMACTRL_0_CHSWRCN_CH14_Msk        (0x4000UL)                /*!< DMACTRL_0 CHSWRCN: CH14 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHSWRCN_CH15_Pos        (15UL)                    /*!< DMACTRL_0 CHSWRCN: CH15 (Bit 15)                      */
#define DMACTRL_0_CHSWRCN_CH15_Msk        (0x8000UL)                /*!< DMACTRL_0 CHSWRCN: CH15 (Bitfield-Mask: 0x01)         */
/* =======================================================  CHREQMSET  ======================================================= */
#define DMACTRL_0_CHREQMSET_CH0_Pos       (0UL)                     /*!< DMACTRL_0 CHREQMSET: CH0 (Bit 0)                      */
#define DMACTRL_0_CHREQMSET_CH0_Msk       (0x1UL)                   /*!< DMACTRL_0 CHREQMSET: CH0 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH1_Pos       (1UL)                     /*!< DMACTRL_0 CHREQMSET: CH1 (Bit 1)                      */
#define DMACTRL_0_CHREQMSET_CH1_Msk       (0x2UL)                   /*!< DMACTRL_0 CHREQMSET: CH1 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH2_Pos       (2UL)                     /*!< DMACTRL_0 CHREQMSET: CH2 (Bit 2)                      */
#define DMACTRL_0_CHREQMSET_CH2_Msk       (0x4UL)                   /*!< DMACTRL_0 CHREQMSET: CH2 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH3_Pos       (3UL)                     /*!< DMACTRL_0 CHREQMSET: CH3 (Bit 3)                      */
#define DMACTRL_0_CHREQMSET_CH3_Msk       (0x8UL)                   /*!< DMACTRL_0 CHREQMSET: CH3 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH4_Pos       (4UL)                     /*!< DMACTRL_0 CHREQMSET: CH4 (Bit 4)                      */
#define DMACTRL_0_CHREQMSET_CH4_Msk       (0x10UL)                  /*!< DMACTRL_0 CHREQMSET: CH4 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH5_Pos       (5UL)                     /*!< DMACTRL_0 CHREQMSET: CH5 (Bit 5)                      */
#define DMACTRL_0_CHREQMSET_CH5_Msk       (0x20UL)                  /*!< DMACTRL_0 CHREQMSET: CH5 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH6_Pos       (6UL)                     /*!< DMACTRL_0 CHREQMSET: CH6 (Bit 6)                      */
#define DMACTRL_0_CHREQMSET_CH6_Msk       (0x40UL)                  /*!< DMACTRL_0 CHREQMSET: CH6 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH7_Pos       (7UL)                     /*!< DMACTRL_0 CHREQMSET: CH7 (Bit 7)                      */
#define DMACTRL_0_CHREQMSET_CH7_Msk       (0x80UL)                  /*!< DMACTRL_0 CHREQMSET: CH7 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH8_Pos       (8UL)                     /*!< DMACTRL_0 CHREQMSET: CH8 (Bit 8)                      */
#define DMACTRL_0_CHREQMSET_CH8_Msk       (0x100UL)                 /*!< DMACTRL_0 CHREQMSET: CH8 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH9_Pos       (9UL)                     /*!< DMACTRL_0 CHREQMSET: CH9 (Bit 9)                      */
#define DMACTRL_0_CHREQMSET_CH9_Msk       (0x200UL)                 /*!< DMACTRL_0 CHREQMSET: CH9 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMSET_CH10_Pos      (10UL)                    /*!< DMACTRL_0 CHREQMSET: CH10 (Bit 10)                    */
#define DMACTRL_0_CHREQMSET_CH10_Msk      (0x400UL)                 /*!< DMACTRL_0 CHREQMSET: CH10 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMSET_CH11_Pos      (11UL)                    /*!< DMACTRL_0 CHREQMSET: CH11 (Bit 11)                    */
#define DMACTRL_0_CHREQMSET_CH11_Msk      (0x800UL)                 /*!< DMACTRL_0 CHREQMSET: CH11 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMSET_CH12_Pos      (12UL)                    /*!< DMACTRL_0 CHREQMSET: CH12 (Bit 12)                    */
#define DMACTRL_0_CHREQMSET_CH12_Msk      (0x1000UL)                /*!< DMACTRL_0 CHREQMSET: CH12 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMSET_CH13_Pos      (13UL)                    /*!< DMACTRL_0 CHREQMSET: CH13 (Bit 13)                    */
#define DMACTRL_0_CHREQMSET_CH13_Msk      (0x2000UL)                /*!< DMACTRL_0 CHREQMSET: CH13 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMSET_CH14_Pos      (14UL)                    /*!< DMACTRL_0 CHREQMSET: CH14 (Bit 14)                    */
#define DMACTRL_0_CHREQMSET_CH14_Msk      (0x4000UL)                /*!< DMACTRL_0 CHREQMSET: CH14 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMSET_CH15_Pos      (15UL)                    /*!< DMACTRL_0 CHREQMSET: CH15 (Bit 15)                    */
#define DMACTRL_0_CHREQMSET_CH15_Msk      (0x8000UL)                /*!< DMACTRL_0 CHREQMSET: CH15 (Bitfield-Mask: 0x01)       */
/* =======================================================  CHREQMCLR  ======================================================= */
#define DMACTRL_0_CHREQMCLR_CH0_Pos       (0UL)                     /*!< DMACTRL_0 CHREQMCLR: CH0 (Bit 0)                      */
#define DMACTRL_0_CHREQMCLR_CH0_Msk       (0x1UL)                   /*!< DMACTRL_0 CHREQMCLR: CH0 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH1_Pos       (1UL)                     /*!< DMACTRL_0 CHREQMCLR: CH1 (Bit 1)                      */
#define DMACTRL_0_CHREQMCLR_CH1_Msk       (0x2UL)                   /*!< DMACTRL_0 CHREQMCLR: CH1 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH2_Pos       (2UL)                     /*!< DMACTRL_0 CHREQMCLR: CH2 (Bit 2)                      */
#define DMACTRL_0_CHREQMCLR_CH2_Msk       (0x4UL)                   /*!< DMACTRL_0 CHREQMCLR: CH2 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH3_Pos       (3UL)                     /*!< DMACTRL_0 CHREQMCLR: CH3 (Bit 3)                      */
#define DMACTRL_0_CHREQMCLR_CH3_Msk       (0x8UL)                   /*!< DMACTRL_0 CHREQMCLR: CH3 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH4_Pos       (4UL)                     /*!< DMACTRL_0 CHREQMCLR: CH4 (Bit 4)                      */
#define DMACTRL_0_CHREQMCLR_CH4_Msk       (0x10UL)                  /*!< DMACTRL_0 CHREQMCLR: CH4 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH5_Pos       (5UL)                     /*!< DMACTRL_0 CHREQMCLR: CH5 (Bit 5)                      */
#define DMACTRL_0_CHREQMCLR_CH5_Msk       (0x20UL)                  /*!< DMACTRL_0 CHREQMCLR: CH5 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH6_Pos       (6UL)                     /*!< DMACTRL_0 CHREQMCLR: CH6 (Bit 6)                      */
#define DMACTRL_0_CHREQMCLR_CH6_Msk       (0x40UL)                  /*!< DMACTRL_0 CHREQMCLR: CH6 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH7_Pos       (7UL)                     /*!< DMACTRL_0 CHREQMCLR: CH7 (Bit 7)                      */
#define DMACTRL_0_CHREQMCLR_CH7_Msk       (0x80UL)                  /*!< DMACTRL_0 CHREQMCLR: CH7 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH8_Pos       (8UL)                     /*!< DMACTRL_0 CHREQMCLR: CH8 (Bit 8)                      */
#define DMACTRL_0_CHREQMCLR_CH8_Msk       (0x100UL)                 /*!< DMACTRL_0 CHREQMCLR: CH8 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH9_Pos       (9UL)                     /*!< DMACTRL_0 CHREQMCLR: CH9 (Bit 9)                      */
#define DMACTRL_0_CHREQMCLR_CH9_Msk       (0x200UL)                 /*!< DMACTRL_0 CHREQMCLR: CH9 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHREQMCLR_CH10_Pos      (10UL)                    /*!< DMACTRL_0 CHREQMCLR: CH10 (Bit 10)                    */
#define DMACTRL_0_CHREQMCLR_CH10_Msk      (0x400UL)                 /*!< DMACTRL_0 CHREQMCLR: CH10 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMCLR_CH11_Pos      (11UL)                    /*!< DMACTRL_0 CHREQMCLR: CH11 (Bit 11)                    */
#define DMACTRL_0_CHREQMCLR_CH11_Msk      (0x800UL)                 /*!< DMACTRL_0 CHREQMCLR: CH11 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMCLR_CH12_Pos      (12UL)                    /*!< DMACTRL_0 CHREQMCLR: CH12 (Bit 12)                    */
#define DMACTRL_0_CHREQMCLR_CH12_Msk      (0x1000UL)                /*!< DMACTRL_0 CHREQMCLR: CH12 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMCLR_CH13_Pos      (13UL)                    /*!< DMACTRL_0 CHREQMCLR: CH13 (Bit 13)                    */
#define DMACTRL_0_CHREQMCLR_CH13_Msk      (0x2000UL)                /*!< DMACTRL_0 CHREQMCLR: CH13 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMCLR_CH14_Pos      (14UL)                    /*!< DMACTRL_0 CHREQMCLR: CH14 (Bit 14)                    */
#define DMACTRL_0_CHREQMCLR_CH14_Msk      (0x4000UL)                /*!< DMACTRL_0 CHREQMCLR: CH14 (Bitfield-Mask: 0x01)       */
#define DMACTRL_0_CHREQMCLR_CH15_Pos      (15UL)                    /*!< DMACTRL_0 CHREQMCLR: CH15 (Bit 15)                    */
#define DMACTRL_0_CHREQMCLR_CH15_Msk      (0x8000UL)                /*!< DMACTRL_0 CHREQMCLR: CH15 (Bitfield-Mask: 0x01)       */
/* ========================================================  CHENSET  ======================================================== */
#define DMACTRL_0_CHENSET_CH0_Pos         (0UL)                     /*!< DMACTRL_0 CHENSET: CH0 (Bit 0)                        */
#define DMACTRL_0_CHENSET_CH0_Msk         (0x1UL)                   /*!< DMACTRL_0 CHENSET: CH0 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH1_Pos         (1UL)                     /*!< DMACTRL_0 CHENSET: CH1 (Bit 1)                        */
#define DMACTRL_0_CHENSET_CH1_Msk         (0x2UL)                   /*!< DMACTRL_0 CHENSET: CH1 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH2_Pos         (2UL)                     /*!< DMACTRL_0 CHENSET: CH2 (Bit 2)                        */
#define DMACTRL_0_CHENSET_CH2_Msk         (0x4UL)                   /*!< DMACTRL_0 CHENSET: CH2 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH3_Pos         (3UL)                     /*!< DMACTRL_0 CHENSET: CH3 (Bit 3)                        */
#define DMACTRL_0_CHENSET_CH3_Msk         (0x8UL)                   /*!< DMACTRL_0 CHENSET: CH3 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH4_Pos         (4UL)                     /*!< DMACTRL_0 CHENSET: CH4 (Bit 4)                        */
#define DMACTRL_0_CHENSET_CH4_Msk         (0x10UL)                  /*!< DMACTRL_0 CHENSET: CH4 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH5_Pos         (5UL)                     /*!< DMACTRL_0 CHENSET: CH5 (Bit 5)                        */
#define DMACTRL_0_CHENSET_CH5_Msk         (0x20UL)                  /*!< DMACTRL_0 CHENSET: CH5 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH6_Pos         (6UL)                     /*!< DMACTRL_0 CHENSET: CH6 (Bit 6)                        */
#define DMACTRL_0_CHENSET_CH6_Msk         (0x40UL)                  /*!< DMACTRL_0 CHENSET: CH6 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH7_Pos         (7UL)                     /*!< DMACTRL_0 CHENSET: CH7 (Bit 7)                        */
#define DMACTRL_0_CHENSET_CH7_Msk         (0x80UL)                  /*!< DMACTRL_0 CHENSET: CH7 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH8_Pos         (8UL)                     /*!< DMACTRL_0 CHENSET: CH8 (Bit 8)                        */
#define DMACTRL_0_CHENSET_CH8_Msk         (0x100UL)                 /*!< DMACTRL_0 CHENSET: CH8 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH9_Pos         (9UL)                     /*!< DMACTRL_0 CHENSET: CH9 (Bit 9)                        */
#define DMACTRL_0_CHENSET_CH9_Msk         (0x200UL)                 /*!< DMACTRL_0 CHENSET: CH9 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENSET_CH10_Pos        (10UL)                    /*!< DMACTRL_0 CHENSET: CH10 (Bit 10)                      */
#define DMACTRL_0_CHENSET_CH10_Msk        (0x400UL)                 /*!< DMACTRL_0 CHENSET: CH10 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENSET_CH11_Pos        (11UL)                    /*!< DMACTRL_0 CHENSET: CH11 (Bit 11)                      */
#define DMACTRL_0_CHENSET_CH11_Msk        (0x800UL)                 /*!< DMACTRL_0 CHENSET: CH11 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENSET_CH12_Pos        (12UL)                    /*!< DMACTRL_0 CHENSET: CH12 (Bit 12)                      */
#define DMACTRL_0_CHENSET_CH12_Msk        (0x1000UL)                /*!< DMACTRL_0 CHENSET: CH12 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENSET_CH13_Pos        (13UL)                    /*!< DMACTRL_0 CHENSET: CH13 (Bit 13)                      */
#define DMACTRL_0_CHENSET_CH13_Msk        (0x2000UL)                /*!< DMACTRL_0 CHENSET: CH13 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENSET_CH14_Pos        (14UL)                    /*!< DMACTRL_0 CHENSET: CH14 (Bit 14)                      */
#define DMACTRL_0_CHENSET_CH14_Msk        (0x4000UL)                /*!< DMACTRL_0 CHENSET: CH14 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENSET_CH15_Pos        (15UL)                    /*!< DMACTRL_0 CHENSET: CH15 (Bit 15)                      */
#define DMACTRL_0_CHENSET_CH15_Msk        (0x8000UL)                /*!< DMACTRL_0 CHENSET: CH15 (Bitfield-Mask: 0x01)         */
/* ========================================================  CHENCLR  ======================================================== */
#define DMACTRL_0_CHENCLR_CH0_Pos         (0UL)                     /*!< DMACTRL_0 CHENCLR: CH0 (Bit 0)                        */
#define DMACTRL_0_CHENCLR_CH0_Msk         (0x1UL)                   /*!< DMACTRL_0 CHENCLR: CH0 (Bitfield-Mask: 0x01)          */
