chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
#define DMACTRL_0_CHENCLR_CH1_Pos         (1UL)                     /*!< DMACTRL_0 CHENCLR: CH1 (Bit 1)                        */
#define DMACTRL_0_CHENCLR_CH1_Msk         (0x2UL)                   /*!< DMACTRL_0 CHENCLR: CH1 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH2_Pos         (2UL)                     /*!< DMACTRL_0 CHENCLR: CH2 (Bit 2)                        */
#define DMACTRL_0_CHENCLR_CH2_Msk         (0x4UL)                   /*!< DMACTRL_0 CHENCLR: CH2 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH3_Pos         (3UL)                     /*!< DMACTRL_0 CHENCLR: CH3 (Bit 3)                        */
#define DMACTRL_0_CHENCLR_CH3_Msk         (0x8UL)                   /*!< DMACTRL_0 CHENCLR: CH3 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH4_Pos         (4UL)                     /*!< DMACTRL_0 CHENCLR: CH4 (Bit 4)                        */
#define DMACTRL_0_CHENCLR_CH4_Msk         (0x10UL)                  /*!< DMACTRL_0 CHENCLR: CH4 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH5_Pos         (5UL)                     /*!< DMACTRL_0 CHENCLR: CH5 (Bit 5)                        */
#define DMACTRL_0_CHENCLR_CH5_Msk         (0x20UL)                  /*!< DMACTRL_0 CHENCLR: CH5 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH6_Pos         (6UL)                     /*!< DMACTRL_0 CHENCLR: CH6 (Bit 6)                        */
#define DMACTRL_0_CHENCLR_CH6_Msk         (0x40UL)                  /*!< DMACTRL_0 CHENCLR: CH6 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH7_Pos         (7UL)                     /*!< DMACTRL_0 CHENCLR: CH7 (Bit 7)                        */
#define DMACTRL_0_CHENCLR_CH7_Msk         (0x80UL)                  /*!< DMACTRL_0 CHENCLR: CH7 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH8_Pos         (8UL)                     /*!< DMACTRL_0 CHENCLR: CH8 (Bit 8)                        */
#define DMACTRL_0_CHENCLR_CH8_Msk         (0x100UL)                 /*!< DMACTRL_0 CHENCLR: CH8 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH9_Pos         (9UL)                     /*!< DMACTRL_0 CHENCLR: CH9 (Bit 9)                        */
#define DMACTRL_0_CHENCLR_CH9_Msk         (0x200UL)                 /*!< DMACTRL_0 CHENCLR: CH9 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHENCLR_CH10_Pos        (10UL)                    /*!< DMACTRL_0 CHENCLR: CH10 (Bit 10)                      */
#define DMACTRL_0_CHENCLR_CH10_Msk        (0x400UL)                 /*!< DMACTRL_0 CHENCLR: CH10 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENCLR_CH11_Pos        (11UL)                    /*!< DMACTRL_0 CHENCLR: CH11 (Bit 11)                      */
#define DMACTRL_0_CHENCLR_CH11_Msk        (0x800UL)                 /*!< DMACTRL_0 CHENCLR: CH11 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENCLR_CH12_Pos        (12UL)                    /*!< DMACTRL_0 CHENCLR: CH12 (Bit 12)                      */
#define DMACTRL_0_CHENCLR_CH12_Msk        (0x1000UL)                /*!< DMACTRL_0 CHENCLR: CH12 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENCLR_CH13_Pos        (13UL)                    /*!< DMACTRL_0 CHENCLR: CH13 (Bit 13)                      */
#define DMACTRL_0_CHENCLR_CH13_Msk        (0x2000UL)                /*!< DMACTRL_0 CHENCLR: CH13 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENCLR_CH14_Pos        (14UL)                    /*!< DMACTRL_0 CHENCLR: CH14 (Bit 14)                      */
#define DMACTRL_0_CHENCLR_CH14_Msk        (0x4000UL)                /*!< DMACTRL_0 CHENCLR: CH14 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHENCLR_CH15_Pos        (15UL)                    /*!< DMACTRL_0 CHENCLR: CH15 (Bit 15)                      */
#define DMACTRL_0_CHENCLR_CH15_Msk        (0x8000UL)                /*!< DMACTRL_0 CHENCLR: CH15 (Bitfield-Mask: 0x01)         */
/* =======================================================  CHALTSET  ======================================================== */
#define DMACTRL_0_CHALTSET_CH0_Pos        (0UL)                     /*!< DMACTRL_0 CHALTSET: CH0 (Bit 0)                       */
#define DMACTRL_0_CHALTSET_CH0_Msk        (0x1UL)                   /*!< DMACTRL_0 CHALTSET: CH0 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH1_Pos        (1UL)                     /*!< DMACTRL_0 CHALTSET: CH1 (Bit 1)                       */
#define DMACTRL_0_CHALTSET_CH1_Msk        (0x2UL)                   /*!< DMACTRL_0 CHALTSET: CH1 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH2_Pos        (2UL)                     /*!< DMACTRL_0 CHALTSET: CH2 (Bit 2)                       */
#define DMACTRL_0_CHALTSET_CH2_Msk        (0x4UL)                   /*!< DMACTRL_0 CHALTSET: CH2 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH3_Pos        (3UL)                     /*!< DMACTRL_0 CHALTSET: CH3 (Bit 3)                       */
#define DMACTRL_0_CHALTSET_CH3_Msk        (0x8UL)                   /*!< DMACTRL_0 CHALTSET: CH3 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH4_Pos        (4UL)                     /*!< DMACTRL_0 CHALTSET: CH4 (Bit 4)                       */
#define DMACTRL_0_CHALTSET_CH4_Msk        (0x10UL)                  /*!< DMACTRL_0 CHALTSET: CH4 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH5_Pos        (5UL)                     /*!< DMACTRL_0 CHALTSET: CH5 (Bit 5)                       */
#define DMACTRL_0_CHALTSET_CH5_Msk        (0x20UL)                  /*!< DMACTRL_0 CHALTSET: CH5 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH6_Pos        (6UL)                     /*!< DMACTRL_0 CHALTSET: CH6 (Bit 6)                       */
#define DMACTRL_0_CHALTSET_CH6_Msk        (0x40UL)                  /*!< DMACTRL_0 CHALTSET: CH6 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH7_Pos        (7UL)                     /*!< DMACTRL_0 CHALTSET: CH7 (Bit 7)                       */
#define DMACTRL_0_CHALTSET_CH7_Msk        (0x80UL)                  /*!< DMACTRL_0 CHALTSET: CH7 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH8_Pos        (8UL)                     /*!< DMACTRL_0 CHALTSET: CH8 (Bit 8)                       */
#define DMACTRL_0_CHALTSET_CH8_Msk        (0x100UL)                 /*!< DMACTRL_0 CHALTSET: CH8 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH9_Pos        (9UL)                     /*!< DMACTRL_0 CHALTSET: CH9 (Bit 9)                       */
#define DMACTRL_0_CHALTSET_CH9_Msk        (0x200UL)                 /*!< DMACTRL_0 CHALTSET: CH9 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTSET_CH10_Pos       (10UL)                    /*!< DMACTRL_0 CHALTSET: CH10 (Bit 10)                     */
#define DMACTRL_0_CHALTSET_CH10_Msk       (0x400UL)                 /*!< DMACTRL_0 CHALTSET: CH10 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTSET_CH11_Pos       (11UL)                    /*!< DMACTRL_0 CHALTSET: CH11 (Bit 11)                     */
#define DMACTRL_0_CHALTSET_CH11_Msk       (0x800UL)                 /*!< DMACTRL_0 CHALTSET: CH11 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTSET_CH12_Pos       (12UL)                    /*!< DMACTRL_0 CHALTSET: CH12 (Bit 12)                     */
#define DMACTRL_0_CHALTSET_CH12_Msk       (0x1000UL)                /*!< DMACTRL_0 CHALTSET: CH12 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTSET_CH13_Pos       (13UL)                    /*!< DMACTRL_0 CHALTSET: CH13 (Bit 13)                     */
#define DMACTRL_0_CHALTSET_CH13_Msk       (0x2000UL)                /*!< DMACTRL_0 CHALTSET: CH13 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTSET_CH14_Pos       (14UL)                    /*!< DMACTRL_0 CHALTSET: CH14 (Bit 14)                     */
#define DMACTRL_0_CHALTSET_CH14_Msk       (0x4000UL)                /*!< DMACTRL_0 CHALTSET: CH14 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTSET_CH15_Pos       (15UL)                    /*!< DMACTRL_0 CHALTSET: CH15 (Bit 15)                     */
#define DMACTRL_0_CHALTSET_CH15_Msk       (0x8000UL)                /*!< DMACTRL_0 CHALTSET: CH15 (Bitfield-Mask: 0x01)        */
/* =======================================================  CHALTCLR  ======================================================== */
#define DMACTRL_0_CHALTCLR_CH0_Pos        (0UL)                     /*!< DMACTRL_0 CHALTCLR: CH0 (Bit 0)                       */
#define DMACTRL_0_CHALTCLR_CH0_Msk        (0x1UL)                   /*!< DMACTRL_0 CHALTCLR: CH0 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH1_Pos        (1UL)                     /*!< DMACTRL_0 CHALTCLR: CH1 (Bit 1)                       */
#define DMACTRL_0_CHALTCLR_CH1_Msk        (0x2UL)                   /*!< DMACTRL_0 CHALTCLR: CH1 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH2_Pos        (2UL)                     /*!< DMACTRL_0 CHALTCLR: CH2 (Bit 2)                       */
#define DMACTRL_0_CHALTCLR_CH2_Msk        (0x4UL)                   /*!< DMACTRL_0 CHALTCLR: CH2 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH3_Pos        (3UL)                     /*!< DMACTRL_0 CHALTCLR: CH3 (Bit 3)                       */
#define DMACTRL_0_CHALTCLR_CH3_Msk        (0x8UL)                   /*!< DMACTRL_0 CHALTCLR: CH3 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH4_Pos        (4UL)                     /*!< DMACTRL_0 CHALTCLR: CH4 (Bit 4)                       */
#define DMACTRL_0_CHALTCLR_CH4_Msk        (0x10UL)                  /*!< DMACTRL_0 CHALTCLR: CH4 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH5_Pos        (5UL)                     /*!< DMACTRL_0 CHALTCLR: CH5 (Bit 5)                       */
#define DMACTRL_0_CHALTCLR_CH5_Msk        (0x20UL)                  /*!< DMACTRL_0 CHALTCLR: CH5 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH6_Pos        (6UL)                     /*!< DMACTRL_0 CHALTCLR: CH6 (Bit 6)                       */
#define DMACTRL_0_CHALTCLR_CH6_Msk        (0x40UL)                  /*!< DMACTRL_0 CHALTCLR: CH6 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH7_Pos        (7UL)                     /*!< DMACTRL_0 CHALTCLR: CH7 (Bit 7)                       */
#define DMACTRL_0_CHALTCLR_CH7_Msk        (0x80UL)                  /*!< DMACTRL_0 CHALTCLR: CH7 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH8_Pos        (8UL)                     /*!< DMACTRL_0 CHALTCLR: CH8 (Bit 8)                       */
#define DMACTRL_0_CHALTCLR_CH8_Msk        (0x100UL)                 /*!< DMACTRL_0 CHALTCLR: CH8 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH9_Pos        (9UL)                     /*!< DMACTRL_0 CHALTCLR: CH9 (Bit 9)                       */
#define DMACTRL_0_CHALTCLR_CH9_Msk        (0x200UL)                 /*!< DMACTRL_0 CHALTCLR: CH9 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHALTCLR_CH10_Pos       (10UL)                    /*!< DMACTRL_0 CHALTCLR: CH10 (Bit 10)                     */
#define DMACTRL_0_CHALTCLR_CH10_Msk       (0x400UL)                 /*!< DMACTRL_0 CHALTCLR: CH10 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTCLR_CH11_Pos       (11UL)                    /*!< DMACTRL_0 CHALTCLR: CH11 (Bit 11)                     */
#define DMACTRL_0_CHALTCLR_CH11_Msk       (0x800UL)                 /*!< DMACTRL_0 CHALTCLR: CH11 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTCLR_CH12_Pos       (12UL)                    /*!< DMACTRL_0 CHALTCLR: CH12 (Bit 12)                     */
#define DMACTRL_0_CHALTCLR_CH12_Msk       (0x1000UL)                /*!< DMACTRL_0 CHALTCLR: CH12 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTCLR_CH13_Pos       (13UL)                    /*!< DMACTRL_0 CHALTCLR: CH13 (Bit 13)                     */
#define DMACTRL_0_CHALTCLR_CH13_Msk       (0x2000UL)                /*!< DMACTRL_0 CHALTCLR: CH13 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTCLR_CH14_Pos       (14UL)                    /*!< DMACTRL_0 CHALTCLR: CH14 (Bit 14)                     */
#define DMACTRL_0_CHALTCLR_CH14_Msk       (0x4000UL)                /*!< DMACTRL_0 CHALTCLR: CH14 (Bitfield-Mask: 0x01)        */
#define DMACTRL_0_CHALTCLR_CH15_Pos       (15UL)                    /*!< DMACTRL_0 CHALTCLR: CH15 (Bit 15)                     */
#define DMACTRL_0_CHALTCLR_CH15_Msk       (0x8000UL)                /*!< DMACTRL_0 CHALTCLR: CH15 (Bitfield-Mask: 0x01)        */
/* ========================================================  CHHPSET  ======================================================== */
#define DMACTRL_0_CHHPSET_CH0_Pos         (0UL)                     /*!< DMACTRL_0 CHHPSET: CH0 (Bit 0)                        */
#define DMACTRL_0_CHHPSET_CH0_Msk         (0x1UL)                   /*!< DMACTRL_0 CHHPSET: CH0 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH1_Pos         (1UL)                     /*!< DMACTRL_0 CHHPSET: CH1 (Bit 1)                        */
#define DMACTRL_0_CHHPSET_CH1_Msk         (0x2UL)                   /*!< DMACTRL_0 CHHPSET: CH1 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH2_Pos         (2UL)                     /*!< DMACTRL_0 CHHPSET: CH2 (Bit 2)                        */
#define DMACTRL_0_CHHPSET_CH2_Msk         (0x4UL)                   /*!< DMACTRL_0 CHHPSET: CH2 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH3_Pos         (3UL)                     /*!< DMACTRL_0 CHHPSET: CH3 (Bit 3)                        */
#define DMACTRL_0_CHHPSET_CH3_Msk         (0x8UL)                   /*!< DMACTRL_0 CHHPSET: CH3 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH4_Pos         (4UL)                     /*!< DMACTRL_0 CHHPSET: CH4 (Bit 4)                        */
#define DMACTRL_0_CHHPSET_CH4_Msk         (0x10UL)                  /*!< DMACTRL_0 CHHPSET: CH4 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH5_Pos         (5UL)                     /*!< DMACTRL_0 CHHPSET: CH5 (Bit 5)                        */
#define DMACTRL_0_CHHPSET_CH5_Msk         (0x20UL)                  /*!< DMACTRL_0 CHHPSET: CH5 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH6_Pos         (6UL)                     /*!< DMACTRL_0 CHHPSET: CH6 (Bit 6)                        */
#define DMACTRL_0_CHHPSET_CH6_Msk         (0x40UL)                  /*!< DMACTRL_0 CHHPSET: CH6 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH7_Pos         (7UL)                     /*!< DMACTRL_0 CHHPSET: CH7 (Bit 7)                        */
#define DMACTRL_0_CHHPSET_CH7_Msk         (0x80UL)                  /*!< DMACTRL_0 CHHPSET: CH7 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH8_Pos         (8UL)                     /*!< DMACTRL_0 CHHPSET: CH8 (Bit 8)                        */
#define DMACTRL_0_CHHPSET_CH8_Msk         (0x100UL)                 /*!< DMACTRL_0 CHHPSET: CH8 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH9_Pos         (9UL)                     /*!< DMACTRL_0 CHHPSET: CH9 (Bit 9)                        */
#define DMACTRL_0_CHHPSET_CH9_Msk         (0x200UL)                 /*!< DMACTRL_0 CHHPSET: CH9 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPSET_CH10_Pos        (10UL)                    /*!< DMACTRL_0 CHHPSET: CH10 (Bit 10)                      */
#define DMACTRL_0_CHHPSET_CH10_Msk        (0x400UL)                 /*!< DMACTRL_0 CHHPSET: CH10 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPSET_CH11_Pos        (11UL)                    /*!< DMACTRL_0 CHHPSET: CH11 (Bit 11)                      */
#define DMACTRL_0_CHHPSET_CH11_Msk        (0x800UL)                 /*!< DMACTRL_0 CHHPSET: CH11 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPSET_CH12_Pos        (12UL)                    /*!< DMACTRL_0 CHHPSET: CH12 (Bit 12)                      */
#define DMACTRL_0_CHHPSET_CH12_Msk        (0x1000UL)                /*!< DMACTRL_0 CHHPSET: CH12 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPSET_CH13_Pos        (13UL)                    /*!< DMACTRL_0 CHHPSET: CH13 (Bit 13)                      */
#define DMACTRL_0_CHHPSET_CH13_Msk        (0x2000UL)                /*!< DMACTRL_0 CHHPSET: CH13 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPSET_CH14_Pos        (14UL)                    /*!< DMACTRL_0 CHHPSET: CH14 (Bit 14)                      */
#define DMACTRL_0_CHHPSET_CH14_Msk        (0x4000UL)                /*!< DMACTRL_0 CHHPSET: CH14 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPSET_CH15_Pos        (15UL)                    /*!< DMACTRL_0 CHHPSET: CH15 (Bit 15)                      */
#define DMACTRL_0_CHHPSET_CH15_Msk        (0x8000UL)                /*!< DMACTRL_0 CHHPSET: CH15 (Bitfield-Mask: 0x01)         */
/* ========================================================  CHHPCLR  ======================================================== */
#define DMACTRL_0_CHHPCLR_CH0_Pos         (0UL)                     /*!< DMACTRL_0 CHHPCLR: CH0 (Bit 0)                        */
#define DMACTRL_0_CHHPCLR_CH0_Msk         (0x1UL)                   /*!< DMACTRL_0 CHHPCLR: CH0 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH1_Pos         (1UL)                     /*!< DMACTRL_0 CHHPCLR: CH1 (Bit 1)                        */
#define DMACTRL_0_CHHPCLR_CH1_Msk         (0x2UL)                   /*!< DMACTRL_0 CHHPCLR: CH1 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH2_Pos         (2UL)                     /*!< DMACTRL_0 CHHPCLR: CH2 (Bit 2)                        */
#define DMACTRL_0_CHHPCLR_CH2_Msk         (0x4UL)                   /*!< DMACTRL_0 CHHPCLR: CH2 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH3_Pos         (3UL)                     /*!< DMACTRL_0 CHHPCLR: CH3 (Bit 3)                        */
#define DMACTRL_0_CHHPCLR_CH3_Msk         (0x8UL)                   /*!< DMACTRL_0 CHHPCLR: CH3 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH4_Pos         (4UL)                     /*!< DMACTRL_0 CHHPCLR: CH4 (Bit 4)                        */
#define DMACTRL_0_CHHPCLR_CH4_Msk         (0x10UL)                  /*!< DMACTRL_0 CHHPCLR: CH4 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH5_Pos         (5UL)                     /*!< DMACTRL_0 CHHPCLR: CH5 (Bit 5)                        */
#define DMACTRL_0_CHHPCLR_CH5_Msk         (0x20UL)                  /*!< DMACTRL_0 CHHPCLR: CH5 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH6_Pos         (6UL)                     /*!< DMACTRL_0 CHHPCLR: CH6 (Bit 6)                        */
#define DMACTRL_0_CHHPCLR_CH6_Msk         (0x40UL)                  /*!< DMACTRL_0 CHHPCLR: CH6 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH7_Pos         (7UL)                     /*!< DMACTRL_0 CHHPCLR: CH7 (Bit 7)                        */
#define DMACTRL_0_CHHPCLR_CH7_Msk         (0x80UL)                  /*!< DMACTRL_0 CHHPCLR: CH7 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH8_Pos         (8UL)                     /*!< DMACTRL_0 CHHPCLR: CH8 (Bit 8)                        */
#define DMACTRL_0_CHHPCLR_CH8_Msk         (0x100UL)                 /*!< DMACTRL_0 CHHPCLR: CH8 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH9_Pos         (9UL)                     /*!< DMACTRL_0 CHHPCLR: CH9 (Bit 9)                        */
#define DMACTRL_0_CHHPCLR_CH9_Msk         (0x200UL)                 /*!< DMACTRL_0 CHHPCLR: CH9 (Bitfield-Mask: 0x01)          */
#define DMACTRL_0_CHHPCLR_CH10_Pos        (10UL)                    /*!< DMACTRL_0 CHHPCLR: CH10 (Bit 10)                      */
#define DMACTRL_0_CHHPCLR_CH10_Msk        (0x400UL)                 /*!< DMACTRL_0 CHHPCLR: CH10 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPCLR_CH11_Pos        (11UL)                    /*!< DMACTRL_0 CHHPCLR: CH11 (Bit 11)                      */
#define DMACTRL_0_CHHPCLR_CH11_Msk        (0x800UL)                 /*!< DMACTRL_0 CHHPCLR: CH11 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPCLR_CH12_Pos        (12UL)                    /*!< DMACTRL_0 CHHPCLR: CH12 (Bit 12)                      */
#define DMACTRL_0_CHHPCLR_CH12_Msk        (0x1000UL)                /*!< DMACTRL_0 CHHPCLR: CH12 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPCLR_CH13_Pos        (13UL)                    /*!< DMACTRL_0 CHHPCLR: CH13 (Bit 13)                      */
#define DMACTRL_0_CHHPCLR_CH13_Msk        (0x2000UL)                /*!< DMACTRL_0 CHHPCLR: CH13 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPCLR_CH14_Pos        (14UL)                    /*!< DMACTRL_0 CHHPCLR: CH14 (Bit 14)                      */
#define DMACTRL_0_CHHPCLR_CH14_Msk        (0x4000UL)                /*!< DMACTRL_0 CHHPCLR: CH14 (Bitfield-Mask: 0x01)         */
#define DMACTRL_0_CHHPCLR_CH15_Pos        (15UL)                    /*!< DMACTRL_0 CHHPCLR: CH15 (Bit 15)                      */
#define DMACTRL_0_CHHPCLR_CH15_Msk        (0x8000UL)                /*!< DMACTRL_0 CHHPCLR: CH15 (Bitfield-Mask: 0x01)         */
/* ========================================================  BERRCLR  ======================================================== */
#define DMACTRL_0_BERRCLR_ERROR_Pos       (0UL)                     /*!< DMACTRL_0 BERRCLR: ERROR (Bit 0)                      */
#define DMACTRL_0_BERRCLR_ERROR_Msk       (0x1UL)                   /*!< DMACTRL_0 BERRCLR: ERROR (Bitfield-Mask: 0x01)        */


/* =========================================================================================================================== */
/* ================                                         DMAXBAR_0                                         ================ */
/* =========================================================================================================================== */

