chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  DMAXBAR0  ======================================================== */
#define DMAXBAR_0_DMAXBAR0_CH0SEL_Pos     (0UL)                     /*!< DMAXBAR_0 DMAXBAR0: CH0SEL (Bit 0)                    */
#define DMAXBAR_0_DMAXBAR0_CH0SEL_Msk     (0xfUL)                   /*!< DMAXBAR_0 DMAXBAR0: CH0SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR0_CH1SEL_Pos     (4UL)                     /*!< DMAXBAR_0 DMAXBAR0: CH1SEL (Bit 4)                    */
#define DMAXBAR_0_DMAXBAR0_CH1SEL_Msk     (0xf0UL)                  /*!< DMAXBAR_0 DMAXBAR0: CH1SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR0_CH2SEL_Pos     (8UL)                     /*!< DMAXBAR_0 DMAXBAR0: CH2SEL (Bit 8)                    */
#define DMAXBAR_0_DMAXBAR0_CH2SEL_Msk     (0xf00UL)                 /*!< DMAXBAR_0 DMAXBAR0: CH2SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR0_CH3SEL_Pos     (12UL)                    /*!< DMAXBAR_0 DMAXBAR0: CH3SEL (Bit 12)                   */
#define DMAXBAR_0_DMAXBAR0_CH3SEL_Msk     (0xf000UL)                /*!< DMAXBAR_0 DMAXBAR0: CH3SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR0_CH4SEL_Pos     (16UL)                    /*!< DMAXBAR_0 DMAXBAR0: CH4SEL (Bit 16)                   */
#define DMAXBAR_0_DMAXBAR0_CH4SEL_Msk     (0xf0000UL)               /*!< DMAXBAR_0 DMAXBAR0: CH4SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR0_CH5SEL_Pos     (20UL)                    /*!< DMAXBAR_0 DMAXBAR0: CH5SEL (Bit 20)                   */
#define DMAXBAR_0_DMAXBAR0_CH5SEL_Msk     (0xf00000UL)              /*!< DMAXBAR_0 DMAXBAR0: CH5SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR0_CH6SEL_Pos     (24UL)                    /*!< DMAXBAR_0 DMAXBAR0: CH6SEL (Bit 24)                   */
#define DMAXBAR_0_DMAXBAR0_CH6SEL_Msk     (0xf000000UL)             /*!< DMAXBAR_0 DMAXBAR0: CH6SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR0_CH7SEL_Pos     (28UL)                    /*!< DMAXBAR_0 DMAXBAR0: CH7SEL (Bit 28)                   */
#define DMAXBAR_0_DMAXBAR0_CH7SEL_Msk     (0xf0000000UL)            /*!< DMAXBAR_0 DMAXBAR0: CH7SEL (Bitfield-Mask: 0x0f)      */
/* =======================================================  DMAXBAR1  ======================================================== */
#define DMAXBAR_0_DMAXBAR1_CH8SEL_Pos     (0UL)                     /*!< DMAXBAR_0 DMAXBAR1: CH8SEL (Bit 0)                    */
#define DMAXBAR_0_DMAXBAR1_CH8SEL_Msk     (0xfUL)                   /*!< DMAXBAR_0 DMAXBAR1: CH8SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR1_CH9SEL_Pos     (4UL)                     /*!< DMAXBAR_0 DMAXBAR1: CH9SEL (Bit 4)                    */
#define DMAXBAR_0_DMAXBAR1_CH9SEL_Msk     (0xf0UL)                  /*!< DMAXBAR_0 DMAXBAR1: CH9SEL (Bitfield-Mask: 0x0f)      */
#define DMAXBAR_0_DMAXBAR1_CH10SEL_Pos    (8UL)                     /*!< DMAXBAR_0 DMAXBAR1: CH10SEL (Bit 8)                   */
#define DMAXBAR_0_DMAXBAR1_CH10SEL_Msk    (0xf00UL)                 /*!< DMAXBAR_0 DMAXBAR1: CH10SEL (Bitfield-Mask: 0x0f)     */
#define DMAXBAR_0_DMAXBAR1_CH11SEL_Pos    (12UL)                    /*!< DMAXBAR_0 DMAXBAR1: CH11SEL (Bit 12)                  */
#define DMAXBAR_0_DMAXBAR1_CH11SEL_Msk    (0xf000UL)                /*!< DMAXBAR_0 DMAXBAR1: CH11SEL (Bitfield-Mask: 0x0f)     */
#define DMAXBAR_0_DMAXBAR1_CH12SEL_Pos    (16UL)                    /*!< DMAXBAR_0 DMAXBAR1: CH12SEL (Bit 16)                  */
#define DMAXBAR_0_DMAXBAR1_CH12SEL_Msk    (0xf0000UL)               /*!< DMAXBAR_0 DMAXBAR1: CH12SEL (Bitfield-Mask: 0x0f)     */
#define DMAXBAR_0_DMAXBAR1_CH13SEL_Pos    (20UL)                    /*!< DMAXBAR_0 DMAXBAR1: CH13SEL (Bit 20)                  */
#define DMAXBAR_0_DMAXBAR1_CH13SEL_Msk    (0xf00000UL)              /*!< DMAXBAR_0 DMAXBAR1: CH13SEL (Bitfield-Mask: 0x0f)     */
#define DMAXBAR_0_DMAXBAR1_CH14SEL_Pos    (24UL)                    /*!< DMAXBAR_0 DMAXBAR1: CH14SEL (Bit 24)                  */
#define DMAXBAR_0_DMAXBAR1_CH14SEL_Msk    (0xf000000UL)             /*!< DMAXBAR_0 DMAXBAR1: CH14SEL (Bitfield-Mask: 0x0f)     */
#define DMAXBAR_0_DMAXBAR1_CH15SEL_Pos    (28UL)                    /*!< DMAXBAR_0 DMAXBAR1: CH15SEL (Bit 28)                  */
#define DMAXBAR_0_DMAXBAR1_CH15SEL_Msk    (0xf0000000UL)            /*!< DMAXBAR_0 DMAXBAR1: CH15SEL (Bitfield-Mask: 0x0f)     */


/* =========================================================================================================================== */
/* ================                                        DEVICEID_0                                         ================ */
/* =========================================================================================================================== */

/* =======================================================  DEVICEID0  ======================================================= */
#define DEVICEID_0_DEVICEID0_REVID_Pos    (0UL)                     /*!< DEVICEID_0 DEVICEID0: REVID (Bit 0)                   */
#define DEVICEID_0_DEVICEID0_REVID_Msk    (0xfUL)                   /*!< DEVICEID_0 DEVICEID0: REVID (Bitfield-Mask: 0x0f)     */
#define DEVICEID_0_DEVICEID0_DEVICEID0_Pos (4UL)                    /*!< DEVICEID_0 DEVICEID0: DEVICEID0 (Bit 4)               */
#define DEVICEID_0_DEVICEID0_DEVICEID0_Msk (0xfffffff0UL)           /*!< DEVICEID_0 DEVICEID0: DEVICEID0 (Bitfield-Mask: 0xfffffff) */
/* =======================================================  DEVICEID1  ======================================================= */
#define DEVICEID_0_DEVICEID1_DEVICEID1_Pos (0UL)                    /*!< DEVICEID_0 DEVICEID1: DEVICEID1 (Bit 0)               */
#define DEVICEID_0_DEVICEID1_DEVICEID1_Msk (0xffffffffUL)           /*!< DEVICEID_0 DEVICEID1: DEVICEID1 (Bitfield-Mask: 0xffffffff) */
/* =======================================================  DEVICEID2  ======================================================= */
#define DEVICEID_0_DEVICEID2_DEVICEID2_Pos (0UL)                    /*!< DEVICEID_0 DEVICEID2: DEVICEID2 (Bit 0)               */
#define DEVICEID_0_DEVICEID2_DEVICEID2_Msk (0xffffffffUL)           /*!< DEVICEID_0 DEVICEID2: DEVICEID2 (Bitfield-Mask: 0xffffffff) */
/* =======================================================  DEVICEID3  ======================================================= */
#define DEVICEID_0_DEVICEID3_DEVICEID3_Pos (0UL)                    /*!< DEVICEID_0 DEVICEID3: DEVICEID3 (Bit 0)               */
#define DEVICEID_0_DEVICEID3_DEVICEID3_Msk (0xffffffffUL)           /*!< DEVICEID_0 DEVICEID3: DEVICEID3 (Bitfield-Mask: 0xffffffff) */


/* =========================================================================================================================== */
/* ================                                          EMIF_0                                           ================ */
/* =========================================================================================================================== */

