chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define EMIF_0_CONTROL_IF0EN_Pos          (0UL)                     /*!< EMIF_0 CONTROL: IF0EN (Bit 0)                         */
#define EMIF_0_CONTROL_IF0EN_Msk          (0x1UL)                   /*!< EMIF_0 CONTROL: IF0EN (Bitfield-Mask: 0x01)           */
#define EMIF_0_CONTROL_IF1EN_Pos          (1UL)                     /*!< EMIF_0 CONTROL: IF1EN (Bit 1)                         */
#define EMIF_0_CONTROL_IF1EN_Msk          (0x2UL)                   /*!< EMIF_0 CONTROL: IF1EN (Bitfield-Mask: 0x01)           */
#define EMIF_0_CONTROL_OFFSTEN_Pos        (4UL)                     /*!< EMIF_0 CONTROL: OFFSTEN (Bit 4)                       */
#define EMIF_0_CONTROL_OFFSTEN_Msk        (0x10UL)                  /*!< EMIF_0 CONTROL: OFFSTEN (Bitfield-Mask: 0x01)         */
/* ========================================================  STATUS  ========================================================= */
#define EMIF_0_STATUS_OFFSTS_Pos          (0UL)                     /*!< EMIF_0 STATUS: OFFSTS (Bit 0)                         */
#define EMIF_0_STATUS_OFFSTS_Msk          (0x1UL)                   /*!< EMIF_0 STATUS: OFFSTS (Bitfield-Mask: 0x01)           */
#define EMIF_0_STATUS_IDLESTS_Pos         (1UL)                     /*!< EMIF_0 STATUS: IDLESTS (Bit 1)                        */
#define EMIF_0_STATUS_IDLESTS_Msk         (0x2UL)                   /*!< EMIF_0 STATUS: IDLESTS (Bitfield-Mask: 0x01)          */
/* =======================================================  CONFIG_0  ======================================================== */
#define EMIF_0_CONFIG_0_BUSWIDTH_Pos      (0UL)                     /*!< EMIF_0 CONFIG_0: BUSWIDTH (Bit 0)                     */
#define EMIF_0_CONFIG_0_BUSWIDTH_Msk      (0x1UL)                   /*!< EMIF_0 CONFIG_0: BUSWIDTH (Bitfield-Mask: 0x01)       */
#define EMIF_0_CONFIG_0_MUXMD_Pos         (2UL)                     /*!< EMIF_0 CONFIG_0: MUXMD (Bit 2)                        */
#define EMIF_0_CONFIG_0_MUXMD_Msk         (0x4UL)                   /*!< EMIF_0 CONFIG_0: MUXMD (Bitfield-Mask: 0x01)          */
#define EMIF_0_CONFIG_0_ASEN_Pos          (3UL)                     /*!< EMIF_0 CONFIG_0: ASEN (Bit 3)                         */
#define EMIF_0_CONFIG_0_ASEN_Msk          (0x8UL)                   /*!< EMIF_0 CONFIG_0: ASEN (Bitfield-Mask: 0x01)           */
#define EMIF_0_CONFIG_0_ROEN_Pos          (4UL)                     /*!< EMIF_0 CONFIG_0: ROEN (Bit 4)                         */
#define EMIF_0_CONFIG_0_ROEN_Msk          (0x10UL)                  /*!< EMIF_0 CONFIG_0: ROEN (Bitfield-Mask: 0x01)           */
#define EMIF_0_CONFIG_0_WDHINH_Pos        (8UL)                     /*!< EMIF_0 CONFIG_0: WDHINH (Bit 8)                       */
#define EMIF_0_CONFIG_0_WDHINH_Msk        (0x100UL)                 /*!< EMIF_0 CONFIG_0: WDHINH (Bitfield-Mask: 0x01)         */
#define EMIF_0_CONFIG_0_DELAYOE_Pos       (12UL)                    /*!< EMIF_0 CONFIG_0: DELAYOE (Bit 12)                     */
#define EMIF_0_CONFIG_0_DELAYOE_Msk       (0x1000UL)                /*!< EMIF_0 CONFIG_0: DELAYOE (Bitfield-Mask: 0x01)        */
#define EMIF_0_CONFIG_0_KLREN_Pos         (16UL)                    /*!< EMIF_0 CONFIG_0: KLREN (Bit 16)                       */
#define EMIF_0_CONFIG_0_KLREN_Msk         (0x10000UL)               /*!< EMIF_0 CONFIG_0: KLREN (Bitfield-Mask: 0x01)          */
/* ========================================================  IFRT_0  ========================================================= */
#define EMIF_0_IFRT_0_RASET_Pos           (0UL)                     /*!< EMIF_0 IFRT_0: RASET (Bit 0)                          */
#define EMIF_0_IFRT_0_RASET_Msk           (0xfUL)                   /*!< EMIF_0 IFRT_0: RASET (Bitfield-Mask: 0x0f)            */
#define EMIF_0_IFRT_0_RAHOLD_Pos          (4UL)                     /*!< EMIF_0 IFRT_0: RAHOLD (Bit 4)                         */
#define EMIF_0_IFRT_0_RAHOLD_Msk          (0xf0UL)                  /*!< EMIF_0 IFRT_0: RAHOLD (Bitfield-Mask: 0x0f)           */
#define EMIF_0_IFRT_0_RDHOLD_Pos          (8UL)                     /*!< EMIF_0 IFRT_0: RDHOLD (Bit 8)                         */
#define EMIF_0_IFRT_0_RDHOLD_Msk          (0xf00UL)                 /*!< EMIF_0 IFRT_0: RDHOLD (Bitfield-Mask: 0x0f)           */
#define EMIF_0_IFRT_0_RDWAIT_Pos          (16UL)                    /*!< EMIF_0 IFRT_0: RDWAIT (Bit 16)                        */
#define EMIF_0_IFRT_0_RDWAIT_Msk          (0x3f0000UL)              /*!< EMIF_0 IFRT_0: RDWAIT (Bitfield-Mask: 0x3f)           */
/* ========================================================  IFWT_0  ========================================================= */
#define EMIF_0_IFWT_0_WASET_Pos           (0UL)                     /*!< EMIF_0 IFWT_0: WASET (Bit 0)                          */
#define EMIF_0_IFWT_0_WASET_Msk           (0xfUL)                   /*!< EMIF_0 IFWT_0: WASET (Bitfield-Mask: 0x0f)            */
#define EMIF_0_IFWT_0_WAHOLD_Pos          (4UL)                     /*!< EMIF_0 IFWT_0: WAHOLD (Bit 4)                         */
#define EMIF_0_IFWT_0_WAHOLD_Msk          (0xf0UL)                  /*!< EMIF_0 IFWT_0: WAHOLD (Bitfield-Mask: 0x0f)           */
#define EMIF_0_IFWT_0_WDHOLD_Pos          (8UL)                     /*!< EMIF_0 IFWT_0: WDHOLD (Bit 8)                         */
#define EMIF_0_IFWT_0_WDHOLD_Msk          (0xf00UL)                 /*!< EMIF_0 IFWT_0: WDHOLD (Bitfield-Mask: 0x0f)           */
#define EMIF_0_IFWT_0_WDWAIT_Pos          (16UL)                    /*!< EMIF_0 IFWT_0: WDWAIT (Bit 16)                        */
#define EMIF_0_IFWT_0_WDWAIT_Msk          (0x3f0000UL)              /*!< EMIF_0 IFWT_0: WDWAIT (Bitfield-Mask: 0x3f)           */
/* =======================================================  IFRCST_0  ======================================================== */
#define EMIF_0_IFRCST_0_CSRAS_Pos         (0UL)                     /*!< EMIF_0 IFRCST_0: CSRAS (Bit 0)                        */
#define EMIF_0_IFRCST_0_CSRAS_Msk         (0x1UL)                   /*!< EMIF_0 IFRCST_0: CSRAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_CSRAH_Pos         (1UL)                     /*!< EMIF_0 IFRCST_0: CSRAH (Bit 1)                        */
#define EMIF_0_IFRCST_0_CSRAH_Msk         (0x2UL)                   /*!< EMIF_0 IFRCST_0: CSRAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_CSRDW_Pos         (2UL)                     /*!< EMIF_0 IFRCST_0: CSRDW (Bit 2)                        */
#define EMIF_0_IFRCST_0_CSRDW_Msk         (0x4UL)                   /*!< EMIF_0 IFRCST_0: CSRDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_CSRDH_Pos         (3UL)                     /*!< EMIF_0 IFRCST_0: CSRDH (Bit 3)                        */
#define EMIF_0_IFRCST_0_CSRDH_Msk         (0x8UL)                   /*!< EMIF_0 IFRCST_0: CSRDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_OERAS_Pos         (4UL)                     /*!< EMIF_0 IFRCST_0: OERAS (Bit 4)                        */
#define EMIF_0_IFRCST_0_OERAS_Msk         (0x10UL)                  /*!< EMIF_0 IFRCST_0: OERAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_OERAH_Pos         (5UL)                     /*!< EMIF_0 IFRCST_0: OERAH (Bit 5)                        */
#define EMIF_0_IFRCST_0_OERAH_Msk         (0x20UL)                  /*!< EMIF_0 IFRCST_0: OERAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_OERDW_Pos         (6UL)                     /*!< EMIF_0 IFRCST_0: OERDW (Bit 6)                        */
#define EMIF_0_IFRCST_0_OERDW_Msk         (0x40UL)                  /*!< EMIF_0 IFRCST_0: OERDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_OERDH_Pos         (7UL)                     /*!< EMIF_0 IFRCST_0: OERDH (Bit 7)                        */
#define EMIF_0_IFRCST_0_OERDH_Msk         (0x80UL)                  /*!< EMIF_0 IFRCST_0: OERDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_WRRAS_Pos         (8UL)                     /*!< EMIF_0 IFRCST_0: WRRAS (Bit 8)                        */
#define EMIF_0_IFRCST_0_WRRAS_Msk         (0x100UL)                 /*!< EMIF_0 IFRCST_0: WRRAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_WRRAH_Pos         (9UL)                     /*!< EMIF_0 IFRCST_0: WRRAH (Bit 9)                        */
#define EMIF_0_IFRCST_0_WRRAH_Msk         (0x200UL)                 /*!< EMIF_0 IFRCST_0: WRRAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_WRRDW_Pos         (10UL)                    /*!< EMIF_0 IFRCST_0: WRRDW (Bit 10)                       */
#define EMIF_0_IFRCST_0_WRRDW_Msk         (0x400UL)                 /*!< EMIF_0 IFRCST_0: WRRDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_WRRDH_Pos         (11UL)                    /*!< EMIF_0 IFRCST_0: WRRDH (Bit 11)                       */
#define EMIF_0_IFRCST_0_WRRDH_Msk         (0x800UL)                 /*!< EMIF_0 IFRCST_0: WRRDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_0_ALERAS_Pos        (12UL)                    /*!< EMIF_0 IFRCST_0: ALERAS (Bit 12)                      */
#define EMIF_0_IFRCST_0_ALERAS_Msk        (0x1000UL)                /*!< EMIF_0 IFRCST_0: ALERAS (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFRCST_0_ALERAH_Pos        (13UL)                    /*!< EMIF_0 IFRCST_0: ALERAH (Bit 13)                      */
#define EMIF_0_IFRCST_0_ALERAH_Msk        (0x2000UL)                /*!< EMIF_0 IFRCST_0: ALERAH (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFRCST_0_ALERDW_Pos        (14UL)                    /*!< EMIF_0 IFRCST_0: ALERDW (Bit 14)                      */
#define EMIF_0_IFRCST_0_ALERDW_Msk        (0x4000UL)                /*!< EMIF_0 IFRCST_0: ALERDW (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFRCST_0_ALERDH_Pos        (15UL)                    /*!< EMIF_0 IFRCST_0: ALERDH (Bit 15)                      */
#define EMIF_0_IFRCST_0_ALERDH_Msk        (0x8000UL)                /*!< EMIF_0 IFRCST_0: ALERDH (Bitfield-Mask: 0x01)         */
/* =======================================================  IFWCST_0  ======================================================== */
#define EMIF_0_IFWCST_0_CSWAS_Pos         (0UL)                     /*!< EMIF_0 IFWCST_0: CSWAS (Bit 0)                        */
#define EMIF_0_IFWCST_0_CSWAS_Msk         (0x1UL)                   /*!< EMIF_0 IFWCST_0: CSWAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_CSWAH_Pos         (1UL)                     /*!< EMIF_0 IFWCST_0: CSWAH (Bit 1)                        */
#define EMIF_0_IFWCST_0_CSWAH_Msk         (0x2UL)                   /*!< EMIF_0 IFWCST_0: CSWAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_CSWDW_Pos         (2UL)                     /*!< EMIF_0 IFWCST_0: CSWDW (Bit 2)                        */
#define EMIF_0_IFWCST_0_CSWDW_Msk         (0x4UL)                   /*!< EMIF_0 IFWCST_0: CSWDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_CSWDH_Pos         (3UL)                     /*!< EMIF_0 IFWCST_0: CSWDH (Bit 3)                        */
#define EMIF_0_IFWCST_0_CSWDH_Msk         (0x8UL)                   /*!< EMIF_0 IFWCST_0: CSWDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_OEWAS_Pos         (4UL)                     /*!< EMIF_0 IFWCST_0: OEWAS (Bit 4)                        */
#define EMIF_0_IFWCST_0_OEWAS_Msk         (0x10UL)                  /*!< EMIF_0 IFWCST_0: OEWAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_OEWAH_Pos         (5UL)                     /*!< EMIF_0 IFWCST_0: OEWAH (Bit 5)                        */
#define EMIF_0_IFWCST_0_OEWAH_Msk         (0x20UL)                  /*!< EMIF_0 IFWCST_0: OEWAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_OEWDW_Pos         (6UL)                     /*!< EMIF_0 IFWCST_0: OEWDW (Bit 6)                        */
#define EMIF_0_IFWCST_0_OEWDW_Msk         (0x40UL)                  /*!< EMIF_0 IFWCST_0: OEWDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_OEWDH_Pos         (7UL)                     /*!< EMIF_0 IFWCST_0: OEWDH (Bit 7)                        */
#define EMIF_0_IFWCST_0_OEWDH_Msk         (0x80UL)                  /*!< EMIF_0 IFWCST_0: OEWDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_WRWAS_Pos         (8UL)                     /*!< EMIF_0 IFWCST_0: WRWAS (Bit 8)                        */
#define EMIF_0_IFWCST_0_WRWAS_Msk         (0x100UL)                 /*!< EMIF_0 IFWCST_0: WRWAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_WRWAH_Pos         (9UL)                     /*!< EMIF_0 IFWCST_0: WRWAH (Bit 9)                        */
#define EMIF_0_IFWCST_0_WRWAH_Msk         (0x200UL)                 /*!< EMIF_0 IFWCST_0: WRWAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_WRWDW_Pos         (10UL)                    /*!< EMIF_0 IFWCST_0: WRWDW (Bit 10)                       */
#define EMIF_0_IFWCST_0_WRWDW_Msk         (0x400UL)                 /*!< EMIF_0 IFWCST_0: WRWDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_WRWDH_Pos         (11UL)                    /*!< EMIF_0 IFWCST_0: WRWDH (Bit 11)                       */
#define EMIF_0_IFWCST_0_WRWDH_Msk         (0x800UL)                 /*!< EMIF_0 IFWCST_0: WRWDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_0_ALEWAS_Pos        (12UL)                    /*!< EMIF_0 IFWCST_0: ALEWAS (Bit 12)                      */
#define EMIF_0_IFWCST_0_ALEWAS_Msk        (0x1000UL)                /*!< EMIF_0 IFWCST_0: ALEWAS (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFWCST_0_ALEWAH_Pos        (13UL)                    /*!< EMIF_0 IFWCST_0: ALEWAH (Bit 13)                      */
#define EMIF_0_IFWCST_0_ALEWAH_Msk        (0x2000UL)                /*!< EMIF_0 IFWCST_0: ALEWAH (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFWCST_0_ALEWDW_Pos        (14UL)                    /*!< EMIF_0 IFWCST_0: ALEWDW (Bit 14)                      */
#define EMIF_0_IFWCST_0_ALEWDW_Msk        (0x4000UL)                /*!< EMIF_0 IFWCST_0: ALEWDW (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFWCST_0_ALEWDH_Pos        (15UL)                    /*!< EMIF_0 IFWCST_0: ALEWDH (Bit 15)                      */
#define EMIF_0_IFWCST_0_ALEWDH_Msk        (0x8000UL)                /*!< EMIF_0 IFWCST_0: ALEWDH (Bitfield-Mask: 0x01)         */
/* =======================================================  CONFIG_1  ======================================================== */
#define EMIF_0_CONFIG_1_BUSWIDTH_Pos      (0UL)                     /*!< EMIF_0 CONFIG_1: BUSWIDTH (Bit 0)                     */
#define EMIF_0_CONFIG_1_BUSWIDTH_Msk      (0x1UL)                   /*!< EMIF_0 CONFIG_1: BUSWIDTH (Bitfield-Mask: 0x01)       */
#define EMIF_0_CONFIG_1_MUXMD_Pos         (2UL)                     /*!< EMIF_0 CONFIG_1: MUXMD (Bit 2)                        */
#define EMIF_0_CONFIG_1_MUXMD_Msk         (0x4UL)                   /*!< EMIF_0 CONFIG_1: MUXMD (Bitfield-Mask: 0x01)          */
#define EMIF_0_CONFIG_1_ASEN_Pos          (3UL)                     /*!< EMIF_0 CONFIG_1: ASEN (Bit 3)                         */
#define EMIF_0_CONFIG_1_ASEN_Msk          (0x8UL)                   /*!< EMIF_0 CONFIG_1: ASEN (Bitfield-Mask: 0x01)           */
#define EMIF_0_CONFIG_1_ROEN_Pos          (4UL)                     /*!< EMIF_0 CONFIG_1: ROEN (Bit 4)                         */
#define EMIF_0_CONFIG_1_ROEN_Msk          (0x10UL)                  /*!< EMIF_0 CONFIG_1: ROEN (Bitfield-Mask: 0x01)           */
#define EMIF_0_CONFIG_1_WDHINH_Pos        (8UL)                     /*!< EMIF_0 CONFIG_1: WDHINH (Bit 8)                       */
#define EMIF_0_CONFIG_1_WDHINH_Msk        (0x100UL)                 /*!< EMIF_0 CONFIG_1: WDHINH (Bitfield-Mask: 0x01)         */
#define EMIF_0_CONFIG_1_DELAYOE_Pos       (12UL)                    /*!< EMIF_0 CONFIG_1: DELAYOE (Bit 12)                     */
#define EMIF_0_CONFIG_1_DELAYOE_Msk       (0x1000UL)                /*!< EMIF_0 CONFIG_1: DELAYOE (Bitfield-Mask: 0x01)        */
#define EMIF_0_CONFIG_1_KLREN_Pos         (16UL)                    /*!< EMIF_0 CONFIG_1: KLREN (Bit 16)                       */
#define EMIF_0_CONFIG_1_KLREN_Msk         (0x10000UL)               /*!< EMIF_0 CONFIG_1: KLREN (Bitfield-Mask: 0x01)          */
/* ========================================================  IFRT_1  ========================================================= */
#define EMIF_0_IFRT_1_RASET_Pos           (0UL)                     /*!< EMIF_0 IFRT_1: RASET (Bit 0)                          */
#define EMIF_0_IFRT_1_RASET_Msk           (0xfUL)                   /*!< EMIF_0 IFRT_1: RASET (Bitfield-Mask: 0x0f)            */
#define EMIF_0_IFRT_1_RAHOLD_Pos          (4UL)                     /*!< EMIF_0 IFRT_1: RAHOLD (Bit 4)                         */
#define EMIF_0_IFRT_1_RAHOLD_Msk          (0xf0UL)                  /*!< EMIF_0 IFRT_1: RAHOLD (Bitfield-Mask: 0x0f)           */
#define EMIF_0_IFRT_1_RDHOLD_Pos          (8UL)                     /*!< EMIF_0 IFRT_1: RDHOLD (Bit 8)                         */
#define EMIF_0_IFRT_1_RDHOLD_Msk          (0xf00UL)                 /*!< EMIF_0 IFRT_1: RDHOLD (Bitfield-Mask: 0x0f)           */
#define EMIF_0_IFRT_1_RDWAIT_Pos          (16UL)                    /*!< EMIF_0 IFRT_1: RDWAIT (Bit 16)                        */
#define EMIF_0_IFRT_1_RDWAIT_Msk          (0x3f0000UL)              /*!< EMIF_0 IFRT_1: RDWAIT (Bitfield-Mask: 0x3f)           */
/* ========================================================  IFWT_1  ========================================================= */
#define EMIF_0_IFWT_1_WASET_Pos           (0UL)                     /*!< EMIF_0 IFWT_1: WASET (Bit 0)                          */
#define EMIF_0_IFWT_1_WASET_Msk           (0xfUL)                   /*!< EMIF_0 IFWT_1: WASET (Bitfield-Mask: 0x0f)            */
#define EMIF_0_IFWT_1_WAHOLD_Pos          (4UL)                     /*!< EMIF_0 IFWT_1: WAHOLD (Bit 4)                         */
#define EMIF_0_IFWT_1_WAHOLD_Msk          (0xf0UL)                  /*!< EMIF_0 IFWT_1: WAHOLD (Bitfield-Mask: 0x0f)           */
#define EMIF_0_IFWT_1_WDHOLD_Pos          (8UL)                     /*!< EMIF_0 IFWT_1: WDHOLD (Bit 8)                         */
#define EMIF_0_IFWT_1_WDHOLD_Msk          (0xf00UL)                 /*!< EMIF_0 IFWT_1: WDHOLD (Bitfield-Mask: 0x0f)           */
#define EMIF_0_IFWT_1_WDWAIT_Pos          (16UL)                    /*!< EMIF_0 IFWT_1: WDWAIT (Bit 16)                        */
#define EMIF_0_IFWT_1_WDWAIT_Msk          (0x3f0000UL)              /*!< EMIF_0 IFWT_1: WDWAIT (Bitfield-Mask: 0x3f)           */
/* =======================================================  IFRCST_1  ======================================================== */
#define EMIF_0_IFRCST_1_CSRAS_Pos         (0UL)                     /*!< EMIF_0 IFRCST_1: CSRAS (Bit 0)                        */
#define EMIF_0_IFRCST_1_CSRAS_Msk         (0x1UL)                   /*!< EMIF_0 IFRCST_1: CSRAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_CSRAH_Pos         (1UL)                     /*!< EMIF_0 IFRCST_1: CSRAH (Bit 1)                        */
#define EMIF_0_IFRCST_1_CSRAH_Msk         (0x2UL)                   /*!< EMIF_0 IFRCST_1: CSRAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_CSRDW_Pos         (2UL)                     /*!< EMIF_0 IFRCST_1: CSRDW (Bit 2)                        */
#define EMIF_0_IFRCST_1_CSRDW_Msk         (0x4UL)                   /*!< EMIF_0 IFRCST_1: CSRDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_CSRDH_Pos         (3UL)                     /*!< EMIF_0 IFRCST_1: CSRDH (Bit 3)                        */
#define EMIF_0_IFRCST_1_CSRDH_Msk         (0x8UL)                   /*!< EMIF_0 IFRCST_1: CSRDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_OERAS_Pos         (4UL)                     /*!< EMIF_0 IFRCST_1: OERAS (Bit 4)                        */
#define EMIF_0_IFRCST_1_OERAS_Msk         (0x10UL)                  /*!< EMIF_0 IFRCST_1: OERAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_OERAH_Pos         (5UL)                     /*!< EMIF_0 IFRCST_1: OERAH (Bit 5)                        */
#define EMIF_0_IFRCST_1_OERAH_Msk         (0x20UL)                  /*!< EMIF_0 IFRCST_1: OERAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_OERDW_Pos         (6UL)                     /*!< EMIF_0 IFRCST_1: OERDW (Bit 6)                        */
#define EMIF_0_IFRCST_1_OERDW_Msk         (0x40UL)                  /*!< EMIF_0 IFRCST_1: OERDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_OERDH_Pos         (7UL)                     /*!< EMIF_0 IFRCST_1: OERDH (Bit 7)                        */
#define EMIF_0_IFRCST_1_OERDH_Msk         (0x80UL)                  /*!< EMIF_0 IFRCST_1: OERDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_WRRAS_Pos         (8UL)                     /*!< EMIF_0 IFRCST_1: WRRAS (Bit 8)                        */
#define EMIF_0_IFRCST_1_WRRAS_Msk         (0x100UL)                 /*!< EMIF_0 IFRCST_1: WRRAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_WRRAH_Pos         (9UL)                     /*!< EMIF_0 IFRCST_1: WRRAH (Bit 9)                        */
#define EMIF_0_IFRCST_1_WRRAH_Msk         (0x200UL)                 /*!< EMIF_0 IFRCST_1: WRRAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_WRRDW_Pos         (10UL)                    /*!< EMIF_0 IFRCST_1: WRRDW (Bit 10)                       */
#define EMIF_0_IFRCST_1_WRRDW_Msk         (0x400UL)                 /*!< EMIF_0 IFRCST_1: WRRDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_WRRDH_Pos         (11UL)                    /*!< EMIF_0 IFRCST_1: WRRDH (Bit 11)                       */
#define EMIF_0_IFRCST_1_WRRDH_Msk         (0x800UL)                 /*!< EMIF_0 IFRCST_1: WRRDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFRCST_1_ALERAS_Pos        (12UL)                    /*!< EMIF_0 IFRCST_1: ALERAS (Bit 12)                      */
#define EMIF_0_IFRCST_1_ALERAS_Msk        (0x1000UL)                /*!< EMIF_0 IFRCST_1: ALERAS (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFRCST_1_ALERAH_Pos        (13UL)                    /*!< EMIF_0 IFRCST_1: ALERAH (Bit 13)                      */
#define EMIF_0_IFRCST_1_ALERAH_Msk        (0x2000UL)                /*!< EMIF_0 IFRCST_1: ALERAH (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFRCST_1_ALERDW_Pos        (14UL)                    /*!< EMIF_0 IFRCST_1: ALERDW (Bit 14)                      */
#define EMIF_0_IFRCST_1_ALERDW_Msk        (0x4000UL)                /*!< EMIF_0 IFRCST_1: ALERDW (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFRCST_1_ALERDH_Pos        (15UL)                    /*!< EMIF_0 IFRCST_1: ALERDH (Bit 15)                      */
#define EMIF_0_IFRCST_1_ALERDH_Msk        (0x8000UL)                /*!< EMIF_0 IFRCST_1: ALERDH (Bitfield-Mask: 0x01)         */
/* =======================================================  IFWCST_1  ======================================================== */
#define EMIF_0_IFWCST_1_CSWAS_Pos         (0UL)                     /*!< EMIF_0 IFWCST_1: CSWAS (Bit 0)                        */
#define EMIF_0_IFWCST_1_CSWAS_Msk         (0x1UL)                   /*!< EMIF_0 IFWCST_1: CSWAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_CSWAH_Pos         (1UL)                     /*!< EMIF_0 IFWCST_1: CSWAH (Bit 1)                        */
#define EMIF_0_IFWCST_1_CSWAH_Msk         (0x2UL)                   /*!< EMIF_0 IFWCST_1: CSWAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_CSWDW_Pos         (2UL)                     /*!< EMIF_0 IFWCST_1: CSWDW (Bit 2)                        */
#define EMIF_0_IFWCST_1_CSWDW_Msk         (0x4UL)                   /*!< EMIF_0 IFWCST_1: CSWDW (Bitfield-Mask: 0x01)          */
