chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
#define EMIF_0_IFWCST_1_CSWDH_Pos         (3UL)                     /*!< EMIF_0 IFWCST_1: CSWDH (Bit 3)                        */
#define EMIF_0_IFWCST_1_CSWDH_Msk         (0x8UL)                   /*!< EMIF_0 IFWCST_1: CSWDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_OEWAS_Pos         (4UL)                     /*!< EMIF_0 IFWCST_1: OEWAS (Bit 4)                        */
#define EMIF_0_IFWCST_1_OEWAS_Msk         (0x10UL)                  /*!< EMIF_0 IFWCST_1: OEWAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_OEWAH_Pos         (5UL)                     /*!< EMIF_0 IFWCST_1: OEWAH (Bit 5)                        */
#define EMIF_0_IFWCST_1_OEWAH_Msk         (0x20UL)                  /*!< EMIF_0 IFWCST_1: OEWAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_OEWDW_Pos         (6UL)                     /*!< EMIF_0 IFWCST_1: OEWDW (Bit 6)                        */
#define EMIF_0_IFWCST_1_OEWDW_Msk         (0x40UL)                  /*!< EMIF_0 IFWCST_1: OEWDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_OEWDH_Pos         (7UL)                     /*!< EMIF_0 IFWCST_1: OEWDH (Bit 7)                        */
#define EMIF_0_IFWCST_1_OEWDH_Msk         (0x80UL)                  /*!< EMIF_0 IFWCST_1: OEWDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_WRWAS_Pos         (8UL)                     /*!< EMIF_0 IFWCST_1: WRWAS (Bit 8)                        */
#define EMIF_0_IFWCST_1_WRWAS_Msk         (0x100UL)                 /*!< EMIF_0 IFWCST_1: WRWAS (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_WRWAH_Pos         (9UL)                     /*!< EMIF_0 IFWCST_1: WRWAH (Bit 9)                        */
#define EMIF_0_IFWCST_1_WRWAH_Msk         (0x200UL)                 /*!< EMIF_0 IFWCST_1: WRWAH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_WRWDW_Pos         (10UL)                    /*!< EMIF_0 IFWCST_1: WRWDW (Bit 10)                       */
#define EMIF_0_IFWCST_1_WRWDW_Msk         (0x400UL)                 /*!< EMIF_0 IFWCST_1: WRWDW (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_WRWDH_Pos         (11UL)                    /*!< EMIF_0 IFWCST_1: WRWDH (Bit 11)                       */
#define EMIF_0_IFWCST_1_WRWDH_Msk         (0x800UL)                 /*!< EMIF_0 IFWCST_1: WRWDH (Bitfield-Mask: 0x01)          */
#define EMIF_0_IFWCST_1_ALEWAS_Pos        (12UL)                    /*!< EMIF_0 IFWCST_1: ALEWAS (Bit 12)                      */
#define EMIF_0_IFWCST_1_ALEWAS_Msk        (0x1000UL)                /*!< EMIF_0 IFWCST_1: ALEWAS (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFWCST_1_ALEWAH_Pos        (13UL)                    /*!< EMIF_0 IFWCST_1: ALEWAH (Bit 13)                      */
#define EMIF_0_IFWCST_1_ALEWAH_Msk        (0x2000UL)                /*!< EMIF_0 IFWCST_1: ALEWAH (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFWCST_1_ALEWDW_Pos        (14UL)                    /*!< EMIF_0 IFWCST_1: ALEWDW (Bit 14)                      */
#define EMIF_0_IFWCST_1_ALEWDW_Msk        (0x4000UL)                /*!< EMIF_0 IFWCST_1: ALEWDW (Bitfield-Mask: 0x01)         */
#define EMIF_0_IFWCST_1_ALEWDH_Pos        (15UL)                    /*!< EMIF_0 IFWCST_1: ALEWDH (Bit 15)                      */
#define EMIF_0_IFWCST_1_ALEWDH_Msk        (0x8000UL)                /*!< EMIF_0 IFWCST_1: ALEWDH (Bitfield-Mask: 0x01)         */


/* =========================================================================================================================== */
/* ================                                          EPCA_0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  MODE  ========================================================== */
#define EPCA_0_MODE_CLKDIV_Pos            (0UL)                     /*!< EPCA_0 MODE: CLKDIV (Bit 0)                           */
#define EPCA_0_MODE_CLKDIV_Msk            (0x3ffUL)                 /*!< EPCA_0 MODE: CLKDIV (Bitfield-Mask: 0x3ff)            */
#define EPCA_0_MODE_CLKSEL_Pos            (10UL)                    /*!< EPCA_0 MODE: CLKSEL (Bit 10)                          */
#define EPCA_0_MODE_CLKSEL_Msk            (0x1c00UL)                /*!< EPCA_0 MODE: CLKSEL (Bitfield-Mask: 0x07)             */
#define EPCA_0_MODE_HDOSEL_Pos            (14UL)                    /*!< EPCA_0 MODE: HDOSEL (Bit 14)                          */
#define EPCA_0_MODE_HDOSEL_Msk            (0xc000UL)                /*!< EPCA_0 MODE: HDOSEL (Bitfield-Mask: 0x03)             */
#define EPCA_0_MODE_DEND_Pos              (16UL)                    /*!< EPCA_0 MODE: DEND (Bit 16)                            */
#define EPCA_0_MODE_DEND_Msk              (0x70000UL)               /*!< EPCA_0 MODE: DEND (Bitfield-Mask: 0x07)               */
#define EPCA_0_MODE_DPTR_Pos              (19UL)                    /*!< EPCA_0 MODE: DPTR (Bit 19)                            */
#define EPCA_0_MODE_DPTR_Msk              (0x380000UL)              /*!< EPCA_0 MODE: DPTR (Bitfield-Mask: 0x07)               */
#define EPCA_0_MODE_DSTART_Pos            (22UL)                    /*!< EPCA_0 MODE: DSTART (Bit 22)                          */
#define EPCA_0_MODE_DSTART_Msk            (0x1c00000UL)             /*!< EPCA_0 MODE: DSTART (Bitfield-Mask: 0x07)             */
#define EPCA_0_MODE_DBUSYF_Pos            (25UL)                    /*!< EPCA_0 MODE: DBUSYF (Bit 25)                          */
#define EPCA_0_MODE_DBUSYF_Msk            (0x2000000UL)             /*!< EPCA_0 MODE: DBUSYF (Bitfield-Mask: 0x01)             */
#define EPCA_0_MODE_STDOSEL_Pos           (27UL)                    /*!< EPCA_0 MODE: STDOSEL (Bit 27)                         */
#define EPCA_0_MODE_STDOSEL_Msk           (0x18000000UL)            /*!< EPCA_0 MODE: STDOSEL (Bitfield-Mask: 0x03)            */
/* ========================================================  CONTROL  ======================================================== */
#define EPCA_0_CONTROL_OVFIEN_Pos         (0UL)                     /*!< EPCA_0 CONTROL: OVFIEN (Bit 0)                        */
#define EPCA_0_CONTROL_OVFIEN_Msk         (0x1UL)                   /*!< EPCA_0 CONTROL: OVFIEN (Bitfield-Mask: 0x01)          */
#define EPCA_0_CONTROL_OVFDEN_Pos         (1UL)                     /*!< EPCA_0 CONTROL: OVFDEN (Bit 1)                        */
#define EPCA_0_CONTROL_OVFDEN_Msk         (0x2UL)                   /*!< EPCA_0 CONTROL: OVFDEN (Bitfield-Mask: 0x01)          */
#define EPCA_0_CONTROL_OVFSEN_Pos         (2UL)                     /*!< EPCA_0 CONTROL: OVFSEN (Bit 2)                        */
#define EPCA_0_CONTROL_OVFSEN_Msk         (0x4UL)                   /*!< EPCA_0 CONTROL: OVFSEN (Bitfield-Mask: 0x01)          */
#define EPCA_0_CONTROL_HALTIEN_Pos        (3UL)                     /*!< EPCA_0 CONTROL: HALTIEN (Bit 3)                       */
#define EPCA_0_CONTROL_HALTIEN_Msk        (0x8UL)                   /*!< EPCA_0 CONTROL: HALTIEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_NOUPD_Pos          (4UL)                     /*!< EPCA_0 CONTROL: NOUPD (Bit 4)                         */
#define EPCA_0_CONTROL_NOUPD_Msk          (0x10UL)                  /*!< EPCA_0 CONTROL: NOUPD (Bitfield-Mask: 0x01)           */
#define EPCA_0_CONTROL_IDLEBEN_Pos        (5UL)                     /*!< EPCA_0 CONTROL: IDLEBEN (Bit 5)                       */
#define EPCA_0_CONTROL_IDLEBEN_Msk        (0x20UL)                  /*!< EPCA_0 CONTROL: IDLEBEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_DBGMD_Pos          (6UL)                     /*!< EPCA_0 CONTROL: DBGMD (Bit 6)                         */
#define EPCA_0_CONTROL_DBGMD_Msk          (0x40UL)                  /*!< EPCA_0 CONTROL: DBGMD (Bitfield-Mask: 0x01)           */
#define EPCA_0_CONTROL_HALTEN_Pos         (9UL)                     /*!< EPCA_0 CONTROL: HALTEN (Bit 9)                        */
#define EPCA_0_CONTROL_HALTEN_Msk         (0x200UL)                 /*!< EPCA_0 CONTROL: HALTEN (Bitfield-Mask: 0x01)          */
#define EPCA_0_CONTROL_STSEL_Pos          (11UL)                    /*!< EPCA_0 CONTROL: STSEL (Bit 11)                        */
#define EPCA_0_CONTROL_STSEL_Msk          (0x1800UL)                /*!< EPCA_0 CONTROL: STSEL (Bitfield-Mask: 0x03)           */
#define EPCA_0_CONTROL_STESEL_Pos         (13UL)                    /*!< EPCA_0 CONTROL: STESEL (Bit 13)                       */
#define EPCA_0_CONTROL_STESEL_Msk         (0x2000UL)                /*!< EPCA_0 CONTROL: STESEL (Bitfield-Mask: 0x01)          */
#define EPCA_0_CONTROL_STEN_Pos           (14UL)                    /*!< EPCA_0 CONTROL: STEN (Bit 14)                         */
#define EPCA_0_CONTROL_STEN_Msk           (0x4000UL)                /*!< EPCA_0 CONTROL: STEN (Bitfield-Mask: 0x01)            */
#define EPCA_0_CONTROL_DIVST_Pos          (21UL)                    /*!< EPCA_0 CONTROL: DIVST (Bit 21)                        */
#define EPCA_0_CONTROL_DIVST_Msk          (0x200000UL)              /*!< EPCA_0 CONTROL: DIVST (Bitfield-Mask: 0x01)           */
#define EPCA_0_CONTROL_DIV_Pos            (22UL)                    /*!< EPCA_0 CONTROL: DIV (Bit 22)                          */
#define EPCA_0_CONTROL_DIV_Msk            (0xffc00000UL)            /*!< EPCA_0 CONTROL: DIV (Bitfield-Mask: 0x3ff)            */
/* ========================================================  STATUS  ========================================================= */
#define EPCA_0_STATUS_C0CCI_Pos           (0UL)                     /*!< EPCA_0 STATUS: C0CCI (Bit 0)                          */
#define EPCA_0_STATUS_C0CCI_Msk           (0x1UL)                   /*!< EPCA_0 STATUS: C0CCI (Bitfield-Mask: 0x01)            */
#define EPCA_0_STATUS_C1CCI_Pos           (1UL)                     /*!< EPCA_0 STATUS: C1CCI (Bit 1)                          */
#define EPCA_0_STATUS_C1CCI_Msk           (0x2UL)                   /*!< EPCA_0 STATUS: C1CCI (Bitfield-Mask: 0x01)            */
#define EPCA_0_STATUS_C2CCI_Pos           (2UL)                     /*!< EPCA_0 STATUS: C2CCI (Bit 2)                          */
#define EPCA_0_STATUS_C2CCI_Msk           (0x4UL)                   /*!< EPCA_0 STATUS: C2CCI (Bitfield-Mask: 0x01)            */
#define EPCA_0_STATUS_C3CCI_Pos           (3UL)                     /*!< EPCA_0 STATUS: C3CCI (Bit 3)                          */
#define EPCA_0_STATUS_C3CCI_Msk           (0x8UL)                   /*!< EPCA_0 STATUS: C3CCI (Bitfield-Mask: 0x01)            */
#define EPCA_0_STATUS_C4CCI_Pos           (4UL)                     /*!< EPCA_0 STATUS: C4CCI (Bit 4)                          */
#define EPCA_0_STATUS_C4CCI_Msk           (0x10UL)                  /*!< EPCA_0 STATUS: C4CCI (Bitfield-Mask: 0x01)            */
#define EPCA_0_STATUS_C5CCI_Pos           (5UL)                     /*!< EPCA_0 STATUS: C5CCI (Bit 5)                          */
#define EPCA_0_STATUS_C5CCI_Msk           (0x20UL)                  /*!< EPCA_0 STATUS: C5CCI (Bitfield-Mask: 0x01)            */
#define EPCA_0_STATUS_RUN_Pos             (6UL)                     /*!< EPCA_0 STATUS: RUN (Bit 6)                            */
#define EPCA_0_STATUS_RUN_Msk             (0x40UL)                  /*!< EPCA_0 STATUS: RUN (Bitfield-Mask: 0x01)              */
#define EPCA_0_STATUS_OVFI_Pos            (7UL)                     /*!< EPCA_0 STATUS: OVFI (Bit 7)                           */
#define EPCA_0_STATUS_OVFI_Msk            (0x80UL)                  /*!< EPCA_0 STATUS: OVFI (Bitfield-Mask: 0x01)             */
#define EPCA_0_STATUS_UPDCF_Pos           (8UL)                     /*!< EPCA_0 STATUS: UPDCF (Bit 8)                          */
#define EPCA_0_STATUS_UPDCF_Msk           (0x100UL)                 /*!< EPCA_0 STATUS: UPDCF (Bitfield-Mask: 0x01)            */
#define EPCA_0_STATUS_HALTI_Pos           (9UL)                     /*!< EPCA_0 STATUS: HALTI (Bit 9)                          */
#define EPCA_0_STATUS_HALTI_Msk           (0x200UL)                 /*!< EPCA_0 STATUS: HALTI (Bitfield-Mask: 0x01)            */
#define EPCA_0_STATUS_C0IOVFI_Pos         (10UL)                    /*!< EPCA_0 STATUS: C0IOVFI (Bit 10)                       */
#define EPCA_0_STATUS_C0IOVFI_Msk         (0x400UL)                 /*!< EPCA_0 STATUS: C0IOVFI (Bitfield-Mask: 0x01)          */
#define EPCA_0_STATUS_C1IOVFI_Pos         (11UL)                    /*!< EPCA_0 STATUS: C1IOVFI (Bit 11)                       */
#define EPCA_0_STATUS_C1IOVFI_Msk         (0x800UL)                 /*!< EPCA_0 STATUS: C1IOVFI (Bitfield-Mask: 0x01)          */
#define EPCA_0_STATUS_C2IOVFI_Pos         (12UL)                    /*!< EPCA_0 STATUS: C2IOVFI (Bit 12)                       */
#define EPCA_0_STATUS_C2IOVFI_Msk         (0x1000UL)                /*!< EPCA_0 STATUS: C2IOVFI (Bitfield-Mask: 0x01)          */
#define EPCA_0_STATUS_C3IOVFI_Pos         (13UL)                    /*!< EPCA_0 STATUS: C3IOVFI (Bit 13)                       */
#define EPCA_0_STATUS_C3IOVFI_Msk         (0x2000UL)                /*!< EPCA_0 STATUS: C3IOVFI (Bitfield-Mask: 0x01)          */
#define EPCA_0_STATUS_C4IOVFI_Pos         (14UL)                    /*!< EPCA_0 STATUS: C4IOVFI (Bit 14)                       */
#define EPCA_0_STATUS_C4IOVFI_Msk         (0x4000UL)                /*!< EPCA_0 STATUS: C4IOVFI (Bitfield-Mask: 0x01)          */
#define EPCA_0_STATUS_C5IOVFI_Pos         (15UL)                    /*!< EPCA_0 STATUS: C5IOVFI (Bit 15)                       */
#define EPCA_0_STATUS_C5IOVFI_Msk         (0x8000UL)                /*!< EPCA_0 STATUS: C5IOVFI (Bitfield-Mask: 0x01)          */
/* ========================================================  COUNTER  ======================================================== */
#define EPCA_0_COUNTER_COUNTER_Pos        (0UL)                     /*!< EPCA_0 COUNTER: COUNTER (Bit 0)                       */
#define EPCA_0_COUNTER_COUNTER_Msk        (0xffffUL)                /*!< EPCA_0 COUNTER: COUNTER (Bitfield-Mask: 0xffff)       */
/* =========================================================  LIMIT  ========================================================= */
#define EPCA_0_LIMIT_LIMIT_Pos            (0UL)                     /*!< EPCA_0 LIMIT: LIMIT (Bit 0)                           */
#define EPCA_0_LIMIT_LIMIT_Msk            (0xffffUL)                /*!< EPCA_0 LIMIT: LIMIT (Bitfield-Mask: 0xffff)           */
/* =======================================================  LIMITUPD  ======================================================== */
#define EPCA_0_LIMITUPD_LIMITUPD_Pos      (0UL)                     /*!< EPCA_0 LIMITUPD: LIMITUPD (Bit 0)                     */
#define EPCA_0_LIMITUPD_LIMITUPD_Msk      (0xffffUL)                /*!< EPCA_0 LIMITUPD: LIMITUPD (Bitfield-Mask: 0xffff)     */
/* =========================================================  DTIME  ========================================================= */
#define EPCA_0_DTIME_DTIMEX_Pos           (0UL)                     /*!< EPCA_0 DTIME: DTIMEX (Bit 0)                          */
#define EPCA_0_DTIME_DTIMEX_Msk           (0xffUL)                  /*!< EPCA_0 DTIME: DTIMEX (Bitfield-Mask: 0xff)            */
#define EPCA_0_DTIME_DTIMEY_Pos           (8UL)                     /*!< EPCA_0 DTIME: DTIMEY (Bit 8)                          */
#define EPCA_0_DTIME_DTIMEY_Msk           (0xff00UL)                /*!< EPCA_0 DTIME: DTIMEY (Bitfield-Mask: 0xff)            */
/* ========================================================  DTARGET  ======================================================== */
#define EPCA_0_DTARGET_DTARGET_Pos        (0UL)                     /*!< EPCA_0 DTARGET: DTARGET (Bit 0)                       */
#define EPCA_0_DTARGET_DTARGET_Msk        (0xffffffffUL)            /*!< EPCA_0 DTARGET: DTARGET (Bitfield-Mask: 0xffffffff)   */
/* ========================================================  MODE_0  ========================================================= */
#define EPCA_0_MODE_0_COSEL_Pos           (0UL)                     /*!< EPCA_0 MODE_0: COSEL (Bit 0)                          */
#define EPCA_0_MODE_0_COSEL_Msk           (0x3UL)                   /*!< EPCA_0 MODE_0: COSEL (Bitfield-Mask: 0x03)            */
#define EPCA_0_MODE_0_PWMMD_Pos           (2UL)                     /*!< EPCA_0 MODE_0: PWMMD (Bit 2)                          */
#define EPCA_0_MODE_0_PWMMD_Msk           (0x3cUL)                  /*!< EPCA_0 MODE_0: PWMMD (Bitfield-Mask: 0x0f)            */
#define EPCA_0_MODE_0_DIFGEN_Pos          (6UL)                     /*!< EPCA_0 MODE_0: DIFGEN (Bit 6)                         */
#define EPCA_0_MODE_0_DIFGEN_Msk          (0x40UL)                  /*!< EPCA_0 MODE_0: DIFGEN (Bitfield-Mask: 0x01)           */
#define EPCA_0_MODE_0_CMD_Pos             (8UL)                     /*!< EPCA_0 MODE_0: CMD (Bit 8)                            */
#define EPCA_0_MODE_0_CMD_Msk             (0x700UL)                 /*!< EPCA_0 MODE_0: CMD (Bitfield-Mask: 0x07)              */
/* =======================================================  CONTROL_0  ======================================================= */
#define EPCA_0_CONTROL_0_COUTST_Pos       (0UL)                     /*!< EPCA_0 CONTROL_0: COUTST (Bit 0)                      */
#define EPCA_0_CONTROL_0_COUTST_Msk       (0x1UL)                   /*!< EPCA_0 CONTROL_0: COUTST (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_0_CPCAPEN_Pos      (1UL)                     /*!< EPCA_0 CONTROL_0: CPCAPEN (Bit 1)                     */
#define EPCA_0_CONTROL_0_CPCAPEN_Msk      (0x2UL)                   /*!< EPCA_0 CONTROL_0: CPCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_0_CNCAPEN_Pos      (2UL)                     /*!< EPCA_0 CONTROL_0: CNCAPEN (Bit 2)                     */
#define EPCA_0_CONTROL_0_CNCAPEN_Msk      (0x4UL)                   /*!< EPCA_0 CONTROL_0: CNCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_0_CUPDCF_Pos       (3UL)                     /*!< EPCA_0 CONTROL_0: CUPDCF (Bit 3)                      */
#define EPCA_0_CONTROL_0_CUPDCF_Msk       (0x8UL)                   /*!< EPCA_0 CONTROL_0: CUPDCF (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_0_YPHST_Pos        (5UL)                     /*!< EPCA_0 CONTROL_0: YPHST (Bit 5)                       */
#define EPCA_0_CONTROL_0_YPHST_Msk        (0x20UL)                  /*!< EPCA_0 CONTROL_0: YPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_0_ACTIVEPH_Pos     (6UL)                     /*!< EPCA_0 CONTROL_0: ACTIVEPH (Bit 6)                    */
#define EPCA_0_CONTROL_0_ACTIVEPH_Msk     (0x40UL)                  /*!< EPCA_0 CONTROL_0: ACTIVEPH (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_0_XPHST_Pos        (7UL)                     /*!< EPCA_0 CONTROL_0: XPHST (Bit 7)                       */
#define EPCA_0_CONTROL_0_XPHST_Msk        (0x80UL)                  /*!< EPCA_0 CONTROL_0: XPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_0_CCIEN_Pos        (8UL)                     /*!< EPCA_0 CONTROL_0: CCIEN (Bit 8)                       */
#define EPCA_0_CONTROL_0_CCIEN_Msk        (0x100UL)                 /*!< EPCA_0 CONTROL_0: CCIEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_0_CCDEN_Pos        (9UL)                     /*!< EPCA_0 CONTROL_0: CCDEN (Bit 9)                       */
#define EPCA_0_CONTROL_0_CCDEN_Msk        (0x200UL)                 /*!< EPCA_0 CONTROL_0: CCDEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_0_CCSEN_Pos        (10UL)                    /*!< EPCA_0 CONTROL_0: CCSEN (Bit 10)                      */
#define EPCA_0_CONTROL_0_CCSEN_Msk        (0x400UL)                 /*!< EPCA_0 CONTROL_0: CCSEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_0_CIOVFIEN_Pos     (11UL)                    /*!< EPCA_0 CONTROL_0: CIOVFIEN (Bit 11)                   */
#define EPCA_0_CONTROL_0_CIOVFIEN_Msk     (0x800UL)                 /*!< EPCA_0 CONTROL_0: CIOVFIEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_0_CIOVFDEN_Pos     (12UL)                    /*!< EPCA_0 CONTROL_0: CIOVFDEN (Bit 12)                   */
#define EPCA_0_CONTROL_0_CIOVFDEN_Msk     (0x1000UL)                /*!< EPCA_0 CONTROL_0: CIOVFDEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_0_CIOVFSEN_Pos     (13UL)                    /*!< EPCA_0 CONTROL_0: CIOVFSEN (Bit 13)                   */
#define EPCA_0_CONTROL_0_CIOVFSEN_Msk     (0x2000UL)                /*!< EPCA_0 CONTROL_0: CIOVFSEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CCAPV_0  ======================================================== */
#define EPCA_0_CCAPV_0_CCAPV_Pos          (0UL)                     /*!< EPCA_0 CCAPV_0: CCAPV (Bit 0)                         */
#define EPCA_0_CCAPV_0_CCAPV_Msk          (0x3ffffUL)               /*!< EPCA_0 CCAPV_0: CCAPV (Bitfield-Mask: 0x3ffff)        */
/* ======================================================  CCAPVUPD_0  ======================================================= */
#define EPCA_0_CCAPVUPD_0_CCAPVUPD_Pos    (0UL)                     /*!< EPCA_0 CCAPVUPD_0: CCAPVUPD (Bit 0)                   */
#define EPCA_0_CCAPVUPD_0_CCAPVUPD_Msk    (0x3ffffUL)               /*!< EPCA_0 CCAPVUPD_0: CCAPVUPD (Bitfield-Mask: 0x3ffff)  */
/* ========================================================  MODE_1  ========================================================= */
#define EPCA_0_MODE_1_COSEL_Pos           (0UL)                     /*!< EPCA_0 MODE_1: COSEL (Bit 0)                          */
#define EPCA_0_MODE_1_COSEL_Msk           (0x3UL)                   /*!< EPCA_0 MODE_1: COSEL (Bitfield-Mask: 0x03)            */
#define EPCA_0_MODE_1_PWMMD_Pos           (2UL)                     /*!< EPCA_0 MODE_1: PWMMD (Bit 2)                          */
#define EPCA_0_MODE_1_PWMMD_Msk           (0x3cUL)                  /*!< EPCA_0 MODE_1: PWMMD (Bitfield-Mask: 0x0f)            */
#define EPCA_0_MODE_1_DIFGEN_Pos          (6UL)                     /*!< EPCA_0 MODE_1: DIFGEN (Bit 6)                         */
#define EPCA_0_MODE_1_DIFGEN_Msk          (0x40UL)                  /*!< EPCA_0 MODE_1: DIFGEN (Bitfield-Mask: 0x01)           */
#define EPCA_0_MODE_1_CMD_Pos             (8UL)                     /*!< EPCA_0 MODE_1: CMD (Bit 8)                            */
#define EPCA_0_MODE_1_CMD_Msk             (0x700UL)                 /*!< EPCA_0 MODE_1: CMD (Bitfield-Mask: 0x07)              */
/* =======================================================  CONTROL_1  ======================================================= */
#define EPCA_0_CONTROL_1_COUTST_Pos       (0UL)                     /*!< EPCA_0 CONTROL_1: COUTST (Bit 0)                      */
#define EPCA_0_CONTROL_1_COUTST_Msk       (0x1UL)                   /*!< EPCA_0 CONTROL_1: COUTST (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_1_CPCAPEN_Pos      (1UL)                     /*!< EPCA_0 CONTROL_1: CPCAPEN (Bit 1)                     */
#define EPCA_0_CONTROL_1_CPCAPEN_Msk      (0x2UL)                   /*!< EPCA_0 CONTROL_1: CPCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_1_CNCAPEN_Pos      (2UL)                     /*!< EPCA_0 CONTROL_1: CNCAPEN (Bit 2)                     */
#define EPCA_0_CONTROL_1_CNCAPEN_Msk      (0x4UL)                   /*!< EPCA_0 CONTROL_1: CNCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_1_CUPDCF_Pos       (3UL)                     /*!< EPCA_0 CONTROL_1: CUPDCF (Bit 3)                      */
#define EPCA_0_CONTROL_1_CUPDCF_Msk       (0x8UL)                   /*!< EPCA_0 CONTROL_1: CUPDCF (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_1_YPHST_Pos        (5UL)                     /*!< EPCA_0 CONTROL_1: YPHST (Bit 5)                       */
