chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
#define EPCA_0_CONTROL_1_YPHST_Msk        (0x20UL)                  /*!< EPCA_0 CONTROL_1: YPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_1_ACTIVEPH_Pos     (6UL)                     /*!< EPCA_0 CONTROL_1: ACTIVEPH (Bit 6)                    */
#define EPCA_0_CONTROL_1_ACTIVEPH_Msk     (0x40UL)                  /*!< EPCA_0 CONTROL_1: ACTIVEPH (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_1_XPHST_Pos        (7UL)                     /*!< EPCA_0 CONTROL_1: XPHST (Bit 7)                       */
#define EPCA_0_CONTROL_1_XPHST_Msk        (0x80UL)                  /*!< EPCA_0 CONTROL_1: XPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_1_CCIEN_Pos        (8UL)                     /*!< EPCA_0 CONTROL_1: CCIEN (Bit 8)                       */
#define EPCA_0_CONTROL_1_CCIEN_Msk        (0x100UL)                 /*!< EPCA_0 CONTROL_1: CCIEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_1_CCDEN_Pos        (9UL)                     /*!< EPCA_0 CONTROL_1: CCDEN (Bit 9)                       */
#define EPCA_0_CONTROL_1_CCDEN_Msk        (0x200UL)                 /*!< EPCA_0 CONTROL_1: CCDEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_1_CCSEN_Pos        (10UL)                    /*!< EPCA_0 CONTROL_1: CCSEN (Bit 10)                      */
#define EPCA_0_CONTROL_1_CCSEN_Msk        (0x400UL)                 /*!< EPCA_0 CONTROL_1: CCSEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_1_CIOVFIEN_Pos     (11UL)                    /*!< EPCA_0 CONTROL_1: CIOVFIEN (Bit 11)                   */
#define EPCA_0_CONTROL_1_CIOVFIEN_Msk     (0x800UL)                 /*!< EPCA_0 CONTROL_1: CIOVFIEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_1_CIOVFDEN_Pos     (12UL)                    /*!< EPCA_0 CONTROL_1: CIOVFDEN (Bit 12)                   */
#define EPCA_0_CONTROL_1_CIOVFDEN_Msk     (0x1000UL)                /*!< EPCA_0 CONTROL_1: CIOVFDEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_1_CIOVFSEN_Pos     (13UL)                    /*!< EPCA_0 CONTROL_1: CIOVFSEN (Bit 13)                   */
#define EPCA_0_CONTROL_1_CIOVFSEN_Msk     (0x2000UL)                /*!< EPCA_0 CONTROL_1: CIOVFSEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CCAPV_1  ======================================================== */
#define EPCA_0_CCAPV_1_CCAPV_Pos          (0UL)                     /*!< EPCA_0 CCAPV_1: CCAPV (Bit 0)                         */
#define EPCA_0_CCAPV_1_CCAPV_Msk          (0x3ffffUL)               /*!< EPCA_0 CCAPV_1: CCAPV (Bitfield-Mask: 0x3ffff)        */
/* ======================================================  CCAPVUPD_1  ======================================================= */
#define EPCA_0_CCAPVUPD_1_CCAPVUPD_Pos    (0UL)                     /*!< EPCA_0 CCAPVUPD_1: CCAPVUPD (Bit 0)                   */
#define EPCA_0_CCAPVUPD_1_CCAPVUPD_Msk    (0x3ffffUL)               /*!< EPCA_0 CCAPVUPD_1: CCAPVUPD (Bitfield-Mask: 0x3ffff)  */
/* ========================================================  MODE_2  ========================================================= */
#define EPCA_0_MODE_2_COSEL_Pos           (0UL)                     /*!< EPCA_0 MODE_2: COSEL (Bit 0)                          */
#define EPCA_0_MODE_2_COSEL_Msk           (0x3UL)                   /*!< EPCA_0 MODE_2: COSEL (Bitfield-Mask: 0x03)            */
#define EPCA_0_MODE_2_PWMMD_Pos           (2UL)                     /*!< EPCA_0 MODE_2: PWMMD (Bit 2)                          */
#define EPCA_0_MODE_2_PWMMD_Msk           (0x3cUL)                  /*!< EPCA_0 MODE_2: PWMMD (Bitfield-Mask: 0x0f)            */
#define EPCA_0_MODE_2_DIFGEN_Pos          (6UL)                     /*!< EPCA_0 MODE_2: DIFGEN (Bit 6)                         */
#define EPCA_0_MODE_2_DIFGEN_Msk          (0x40UL)                  /*!< EPCA_0 MODE_2: DIFGEN (Bitfield-Mask: 0x01)           */
#define EPCA_0_MODE_2_CMD_Pos             (8UL)                     /*!< EPCA_0 MODE_2: CMD (Bit 8)                            */
#define EPCA_0_MODE_2_CMD_Msk             (0x700UL)                 /*!< EPCA_0 MODE_2: CMD (Bitfield-Mask: 0x07)              */
/* =======================================================  CONTROL_2  ======================================================= */
#define EPCA_0_CONTROL_2_COUTST_Pos       (0UL)                     /*!< EPCA_0 CONTROL_2: COUTST (Bit 0)                      */
#define EPCA_0_CONTROL_2_COUTST_Msk       (0x1UL)                   /*!< EPCA_0 CONTROL_2: COUTST (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_2_CPCAPEN_Pos      (1UL)                     /*!< EPCA_0 CONTROL_2: CPCAPEN (Bit 1)                     */
#define EPCA_0_CONTROL_2_CPCAPEN_Msk      (0x2UL)                   /*!< EPCA_0 CONTROL_2: CPCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_2_CNCAPEN_Pos      (2UL)                     /*!< EPCA_0 CONTROL_2: CNCAPEN (Bit 2)                     */
#define EPCA_0_CONTROL_2_CNCAPEN_Msk      (0x4UL)                   /*!< EPCA_0 CONTROL_2: CNCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_2_CUPDCF_Pos       (3UL)                     /*!< EPCA_0 CONTROL_2: CUPDCF (Bit 3)                      */
#define EPCA_0_CONTROL_2_CUPDCF_Msk       (0x8UL)                   /*!< EPCA_0 CONTROL_2: CUPDCF (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_2_YPHST_Pos        (5UL)                     /*!< EPCA_0 CONTROL_2: YPHST (Bit 5)                       */
#define EPCA_0_CONTROL_2_YPHST_Msk        (0x20UL)                  /*!< EPCA_0 CONTROL_2: YPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_2_ACTIVEPH_Pos     (6UL)                     /*!< EPCA_0 CONTROL_2: ACTIVEPH (Bit 6)                    */
#define EPCA_0_CONTROL_2_ACTIVEPH_Msk     (0x40UL)                  /*!< EPCA_0 CONTROL_2: ACTIVEPH (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_2_XPHST_Pos        (7UL)                     /*!< EPCA_0 CONTROL_2: XPHST (Bit 7)                       */
#define EPCA_0_CONTROL_2_XPHST_Msk        (0x80UL)                  /*!< EPCA_0 CONTROL_2: XPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_2_CCIEN_Pos        (8UL)                     /*!< EPCA_0 CONTROL_2: CCIEN (Bit 8)                       */
#define EPCA_0_CONTROL_2_CCIEN_Msk        (0x100UL)                 /*!< EPCA_0 CONTROL_2: CCIEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_2_CCDEN_Pos        (9UL)                     /*!< EPCA_0 CONTROL_2: CCDEN (Bit 9)                       */
#define EPCA_0_CONTROL_2_CCDEN_Msk        (0x200UL)                 /*!< EPCA_0 CONTROL_2: CCDEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_2_CCSEN_Pos        (10UL)                    /*!< EPCA_0 CONTROL_2: CCSEN (Bit 10)                      */
#define EPCA_0_CONTROL_2_CCSEN_Msk        (0x400UL)                 /*!< EPCA_0 CONTROL_2: CCSEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_2_CIOVFIEN_Pos     (11UL)                    /*!< EPCA_0 CONTROL_2: CIOVFIEN (Bit 11)                   */
#define EPCA_0_CONTROL_2_CIOVFIEN_Msk     (0x800UL)                 /*!< EPCA_0 CONTROL_2: CIOVFIEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_2_CIOVFDEN_Pos     (12UL)                    /*!< EPCA_0 CONTROL_2: CIOVFDEN (Bit 12)                   */
#define EPCA_0_CONTROL_2_CIOVFDEN_Msk     (0x1000UL)                /*!< EPCA_0 CONTROL_2: CIOVFDEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_2_CIOVFSEN_Pos     (13UL)                    /*!< EPCA_0 CONTROL_2: CIOVFSEN (Bit 13)                   */
#define EPCA_0_CONTROL_2_CIOVFSEN_Msk     (0x2000UL)                /*!< EPCA_0 CONTROL_2: CIOVFSEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CCAPV_2  ======================================================== */
#define EPCA_0_CCAPV_2_CCAPV_Pos          (0UL)                     /*!< EPCA_0 CCAPV_2: CCAPV (Bit 0)                         */
#define EPCA_0_CCAPV_2_CCAPV_Msk          (0x3ffffUL)               /*!< EPCA_0 CCAPV_2: CCAPV (Bitfield-Mask: 0x3ffff)        */
/* ======================================================  CCAPVUPD_2  ======================================================= */
#define EPCA_0_CCAPVUPD_2_CCAPVUPD_Pos    (0UL)                     /*!< EPCA_0 CCAPVUPD_2: CCAPVUPD (Bit 0)                   */
#define EPCA_0_CCAPVUPD_2_CCAPVUPD_Msk    (0x3ffffUL)               /*!< EPCA_0 CCAPVUPD_2: CCAPVUPD (Bitfield-Mask: 0x3ffff)  */
/* ========================================================  MODE_3  ========================================================= */
#define EPCA_0_MODE_3_COSEL_Pos           (0UL)                     /*!< EPCA_0 MODE_3: COSEL (Bit 0)                          */
#define EPCA_0_MODE_3_COSEL_Msk           (0x3UL)                   /*!< EPCA_0 MODE_3: COSEL (Bitfield-Mask: 0x03)            */
#define EPCA_0_MODE_3_PWMMD_Pos           (2UL)                     /*!< EPCA_0 MODE_3: PWMMD (Bit 2)                          */
#define EPCA_0_MODE_3_PWMMD_Msk           (0x3cUL)                  /*!< EPCA_0 MODE_3: PWMMD (Bitfield-Mask: 0x0f)            */
#define EPCA_0_MODE_3_DIFGEN_Pos          (6UL)                     /*!< EPCA_0 MODE_3: DIFGEN (Bit 6)                         */
#define EPCA_0_MODE_3_DIFGEN_Msk          (0x40UL)                  /*!< EPCA_0 MODE_3: DIFGEN (Bitfield-Mask: 0x01)           */
#define EPCA_0_MODE_3_CMD_Pos             (8UL)                     /*!< EPCA_0 MODE_3: CMD (Bit 8)                            */
#define EPCA_0_MODE_3_CMD_Msk             (0x700UL)                 /*!< EPCA_0 MODE_3: CMD (Bitfield-Mask: 0x07)              */
/* =======================================================  CONTROL_3  ======================================================= */
#define EPCA_0_CONTROL_3_COUTST_Pos       (0UL)                     /*!< EPCA_0 CONTROL_3: COUTST (Bit 0)                      */
#define EPCA_0_CONTROL_3_COUTST_Msk       (0x1UL)                   /*!< EPCA_0 CONTROL_3: COUTST (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_3_CPCAPEN_Pos      (1UL)                     /*!< EPCA_0 CONTROL_3: CPCAPEN (Bit 1)                     */
#define EPCA_0_CONTROL_3_CPCAPEN_Msk      (0x2UL)                   /*!< EPCA_0 CONTROL_3: CPCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_3_CNCAPEN_Pos      (2UL)                     /*!< EPCA_0 CONTROL_3: CNCAPEN (Bit 2)                     */
#define EPCA_0_CONTROL_3_CNCAPEN_Msk      (0x4UL)                   /*!< EPCA_0 CONTROL_3: CNCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_3_CUPDCF_Pos       (3UL)                     /*!< EPCA_0 CONTROL_3: CUPDCF (Bit 3)                      */
#define EPCA_0_CONTROL_3_CUPDCF_Msk       (0x8UL)                   /*!< EPCA_0 CONTROL_3: CUPDCF (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_3_YPHST_Pos        (5UL)                     /*!< EPCA_0 CONTROL_3: YPHST (Bit 5)                       */
#define EPCA_0_CONTROL_3_YPHST_Msk        (0x20UL)                  /*!< EPCA_0 CONTROL_3: YPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_3_ACTIVEPH_Pos     (6UL)                     /*!< EPCA_0 CONTROL_3: ACTIVEPH (Bit 6)                    */
#define EPCA_0_CONTROL_3_ACTIVEPH_Msk     (0x40UL)                  /*!< EPCA_0 CONTROL_3: ACTIVEPH (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_3_XPHST_Pos        (7UL)                     /*!< EPCA_0 CONTROL_3: XPHST (Bit 7)                       */
#define EPCA_0_CONTROL_3_XPHST_Msk        (0x80UL)                  /*!< EPCA_0 CONTROL_3: XPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_3_CCIEN_Pos        (8UL)                     /*!< EPCA_0 CONTROL_3: CCIEN (Bit 8)                       */
#define EPCA_0_CONTROL_3_CCIEN_Msk        (0x100UL)                 /*!< EPCA_0 CONTROL_3: CCIEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_3_CCDEN_Pos        (9UL)                     /*!< EPCA_0 CONTROL_3: CCDEN (Bit 9)                       */
#define EPCA_0_CONTROL_3_CCDEN_Msk        (0x200UL)                 /*!< EPCA_0 CONTROL_3: CCDEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_3_CCSEN_Pos        (10UL)                    /*!< EPCA_0 CONTROL_3: CCSEN (Bit 10)                      */
#define EPCA_0_CONTROL_3_CCSEN_Msk        (0x400UL)                 /*!< EPCA_0 CONTROL_3: CCSEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_3_CIOVFIEN_Pos     (11UL)                    /*!< EPCA_0 CONTROL_3: CIOVFIEN (Bit 11)                   */
#define EPCA_0_CONTROL_3_CIOVFIEN_Msk     (0x800UL)                 /*!< EPCA_0 CONTROL_3: CIOVFIEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_3_CIOVFDEN_Pos     (12UL)                    /*!< EPCA_0 CONTROL_3: CIOVFDEN (Bit 12)                   */
#define EPCA_0_CONTROL_3_CIOVFDEN_Msk     (0x1000UL)                /*!< EPCA_0 CONTROL_3: CIOVFDEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_3_CIOVFSEN_Pos     (13UL)                    /*!< EPCA_0 CONTROL_3: CIOVFSEN (Bit 13)                   */
#define EPCA_0_CONTROL_3_CIOVFSEN_Msk     (0x2000UL)                /*!< EPCA_0 CONTROL_3: CIOVFSEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CCAPV_3  ======================================================== */
#define EPCA_0_CCAPV_3_CCAPV_Pos          (0UL)                     /*!< EPCA_0 CCAPV_3: CCAPV (Bit 0)                         */
#define EPCA_0_CCAPV_3_CCAPV_Msk          (0x3ffffUL)               /*!< EPCA_0 CCAPV_3: CCAPV (Bitfield-Mask: 0x3ffff)        */
/* ======================================================  CCAPVUPD_3  ======================================================= */
#define EPCA_0_CCAPVUPD_3_CCAPVUPD_Pos    (0UL)                     /*!< EPCA_0 CCAPVUPD_3: CCAPVUPD (Bit 0)                   */
#define EPCA_0_CCAPVUPD_3_CCAPVUPD_Msk    (0x3ffffUL)               /*!< EPCA_0 CCAPVUPD_3: CCAPVUPD (Bitfield-Mask: 0x3ffff)  */
/* ========================================================  MODE_4  ========================================================= */
#define EPCA_0_MODE_4_COSEL_Pos           (0UL)                     /*!< EPCA_0 MODE_4: COSEL (Bit 0)                          */
#define EPCA_0_MODE_4_COSEL_Msk           (0x3UL)                   /*!< EPCA_0 MODE_4: COSEL (Bitfield-Mask: 0x03)            */
#define EPCA_0_MODE_4_PWMMD_Pos           (2UL)                     /*!< EPCA_0 MODE_4: PWMMD (Bit 2)                          */
#define EPCA_0_MODE_4_PWMMD_Msk           (0x3cUL)                  /*!< EPCA_0 MODE_4: PWMMD (Bitfield-Mask: 0x0f)            */
#define EPCA_0_MODE_4_DIFGEN_Pos          (6UL)                     /*!< EPCA_0 MODE_4: DIFGEN (Bit 6)                         */
#define EPCA_0_MODE_4_DIFGEN_Msk          (0x40UL)                  /*!< EPCA_0 MODE_4: DIFGEN (Bitfield-Mask: 0x01)           */
#define EPCA_0_MODE_4_CMD_Pos             (8UL)                     /*!< EPCA_0 MODE_4: CMD (Bit 8)                            */
#define EPCA_0_MODE_4_CMD_Msk             (0x700UL)                 /*!< EPCA_0 MODE_4: CMD (Bitfield-Mask: 0x07)              */
/* =======================================================  CONTROL_4  ======================================================= */
#define EPCA_0_CONTROL_4_COUTST_Pos       (0UL)                     /*!< EPCA_0 CONTROL_4: COUTST (Bit 0)                      */
#define EPCA_0_CONTROL_4_COUTST_Msk       (0x1UL)                   /*!< EPCA_0 CONTROL_4: COUTST (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_4_CPCAPEN_Pos      (1UL)                     /*!< EPCA_0 CONTROL_4: CPCAPEN (Bit 1)                     */
#define EPCA_0_CONTROL_4_CPCAPEN_Msk      (0x2UL)                   /*!< EPCA_0 CONTROL_4: CPCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_4_CNCAPEN_Pos      (2UL)                     /*!< EPCA_0 CONTROL_4: CNCAPEN (Bit 2)                     */
#define EPCA_0_CONTROL_4_CNCAPEN_Msk      (0x4UL)                   /*!< EPCA_0 CONTROL_4: CNCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_4_CUPDCF_Pos       (3UL)                     /*!< EPCA_0 CONTROL_4: CUPDCF (Bit 3)                      */
#define EPCA_0_CONTROL_4_CUPDCF_Msk       (0x8UL)                   /*!< EPCA_0 CONTROL_4: CUPDCF (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_4_YPHST_Pos        (5UL)                     /*!< EPCA_0 CONTROL_4: YPHST (Bit 5)                       */
#define EPCA_0_CONTROL_4_YPHST_Msk        (0x20UL)                  /*!< EPCA_0 CONTROL_4: YPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_4_ACTIVEPH_Pos     (6UL)                     /*!< EPCA_0 CONTROL_4: ACTIVEPH (Bit 6)                    */
#define EPCA_0_CONTROL_4_ACTIVEPH_Msk     (0x40UL)                  /*!< EPCA_0 CONTROL_4: ACTIVEPH (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_4_XPHST_Pos        (7UL)                     /*!< EPCA_0 CONTROL_4: XPHST (Bit 7)                       */
#define EPCA_0_CONTROL_4_XPHST_Msk        (0x80UL)                  /*!< EPCA_0 CONTROL_4: XPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_4_CCIEN_Pos        (8UL)                     /*!< EPCA_0 CONTROL_4: CCIEN (Bit 8)                       */
#define EPCA_0_CONTROL_4_CCIEN_Msk        (0x100UL)                 /*!< EPCA_0 CONTROL_4: CCIEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_4_CCDEN_Pos        (9UL)                     /*!< EPCA_0 CONTROL_4: CCDEN (Bit 9)                       */
#define EPCA_0_CONTROL_4_CCDEN_Msk        (0x200UL)                 /*!< EPCA_0 CONTROL_4: CCDEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_4_CCSEN_Pos        (10UL)                    /*!< EPCA_0 CONTROL_4: CCSEN (Bit 10)                      */
#define EPCA_0_CONTROL_4_CCSEN_Msk        (0x400UL)                 /*!< EPCA_0 CONTROL_4: CCSEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_4_CIOVFIEN_Pos     (11UL)                    /*!< EPCA_0 CONTROL_4: CIOVFIEN (Bit 11)                   */
#define EPCA_0_CONTROL_4_CIOVFIEN_Msk     (0x800UL)                 /*!< EPCA_0 CONTROL_4: CIOVFIEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_4_CIOVFDEN_Pos     (12UL)                    /*!< EPCA_0 CONTROL_4: CIOVFDEN (Bit 12)                   */
#define EPCA_0_CONTROL_4_CIOVFDEN_Msk     (0x1000UL)                /*!< EPCA_0 CONTROL_4: CIOVFDEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_4_CIOVFSEN_Pos     (13UL)                    /*!< EPCA_0 CONTROL_4: CIOVFSEN (Bit 13)                   */
#define EPCA_0_CONTROL_4_CIOVFSEN_Msk     (0x2000UL)                /*!< EPCA_0 CONTROL_4: CIOVFSEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CCAPV_4  ======================================================== */
#define EPCA_0_CCAPV_4_CCAPV_Pos          (0UL)                     /*!< EPCA_0 CCAPV_4: CCAPV (Bit 0)                         */
#define EPCA_0_CCAPV_4_CCAPV_Msk          (0x3ffffUL)               /*!< EPCA_0 CCAPV_4: CCAPV (Bitfield-Mask: 0x3ffff)        */
/* ======================================================  CCAPVUPD_4  ======================================================= */
#define EPCA_0_CCAPVUPD_4_CCAPVUPD_Pos    (0UL)                     /*!< EPCA_0 CCAPVUPD_4: CCAPVUPD (Bit 0)                   */
#define EPCA_0_CCAPVUPD_4_CCAPVUPD_Msk    (0x3ffffUL)               /*!< EPCA_0 CCAPVUPD_4: CCAPVUPD (Bitfield-Mask: 0x3ffff)  */
/* ========================================================  MODE_5  ========================================================= */
#define EPCA_0_MODE_5_COSEL_Pos           (0UL)                     /*!< EPCA_0 MODE_5: COSEL (Bit 0)                          */
#define EPCA_0_MODE_5_COSEL_Msk           (0x3UL)                   /*!< EPCA_0 MODE_5: COSEL (Bitfield-Mask: 0x03)            */
#define EPCA_0_MODE_5_PWMMD_Pos           (2UL)                     /*!< EPCA_0 MODE_5: PWMMD (Bit 2)                          */
#define EPCA_0_MODE_5_PWMMD_Msk           (0x3cUL)                  /*!< EPCA_0 MODE_5: PWMMD (Bitfield-Mask: 0x0f)            */
#define EPCA_0_MODE_5_DIFGEN_Pos          (6UL)                     /*!< EPCA_0 MODE_5: DIFGEN (Bit 6)                         */
#define EPCA_0_MODE_5_DIFGEN_Msk          (0x40UL)                  /*!< EPCA_0 MODE_5: DIFGEN (Bitfield-Mask: 0x01)           */
#define EPCA_0_MODE_5_CMD_Pos             (8UL)                     /*!< EPCA_0 MODE_5: CMD (Bit 8)                            */
#define EPCA_0_MODE_5_CMD_Msk             (0x700UL)                 /*!< EPCA_0 MODE_5: CMD (Bitfield-Mask: 0x07)              */
/* =======================================================  CONTROL_5  ======================================================= */
#define EPCA_0_CONTROL_5_COUTST_Pos       (0UL)                     /*!< EPCA_0 CONTROL_5: COUTST (Bit 0)                      */
#define EPCA_0_CONTROL_5_COUTST_Msk       (0x1UL)                   /*!< EPCA_0 CONTROL_5: COUTST (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_5_CPCAPEN_Pos      (1UL)                     /*!< EPCA_0 CONTROL_5: CPCAPEN (Bit 1)                     */
#define EPCA_0_CONTROL_5_CPCAPEN_Msk      (0x2UL)                   /*!< EPCA_0 CONTROL_5: CPCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_5_CNCAPEN_Pos      (2UL)                     /*!< EPCA_0 CONTROL_5: CNCAPEN (Bit 2)                     */
#define EPCA_0_CONTROL_5_CNCAPEN_Msk      (0x4UL)                   /*!< EPCA_0 CONTROL_5: CNCAPEN (Bitfield-Mask: 0x01)       */
#define EPCA_0_CONTROL_5_CUPDCF_Pos       (3UL)                     /*!< EPCA_0 CONTROL_5: CUPDCF (Bit 3)                      */
#define EPCA_0_CONTROL_5_CUPDCF_Msk       (0x8UL)                   /*!< EPCA_0 CONTROL_5: CUPDCF (Bitfield-Mask: 0x01)        */
#define EPCA_0_CONTROL_5_YPHST_Pos        (5UL)                     /*!< EPCA_0 CONTROL_5: YPHST (Bit 5)                       */
#define EPCA_0_CONTROL_5_YPHST_Msk        (0x20UL)                  /*!< EPCA_0 CONTROL_5: YPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_5_ACTIVEPH_Pos     (6UL)                     /*!< EPCA_0 CONTROL_5: ACTIVEPH (Bit 6)                    */
#define EPCA_0_CONTROL_5_ACTIVEPH_Msk     (0x40UL)                  /*!< EPCA_0 CONTROL_5: ACTIVEPH (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_5_XPHST_Pos        (7UL)                     /*!< EPCA_0 CONTROL_5: XPHST (Bit 7)                       */
#define EPCA_0_CONTROL_5_XPHST_Msk        (0x80UL)                  /*!< EPCA_0 CONTROL_5: XPHST (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_5_CCIEN_Pos        (8UL)                     /*!< EPCA_0 CONTROL_5: CCIEN (Bit 8)                       */
#define EPCA_0_CONTROL_5_CCIEN_Msk        (0x100UL)                 /*!< EPCA_0 CONTROL_5: CCIEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_5_CCDEN_Pos        (9UL)                     /*!< EPCA_0 CONTROL_5: CCDEN (Bit 9)                       */
#define EPCA_0_CONTROL_5_CCDEN_Msk        (0x200UL)                 /*!< EPCA_0 CONTROL_5: CCDEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_5_CCSEN_Pos        (10UL)                    /*!< EPCA_0 CONTROL_5: CCSEN (Bit 10)                      */
#define EPCA_0_CONTROL_5_CCSEN_Msk        (0x400UL)                 /*!< EPCA_0 CONTROL_5: CCSEN (Bitfield-Mask: 0x01)         */
#define EPCA_0_CONTROL_5_CIOVFIEN_Pos     (11UL)                    /*!< EPCA_0 CONTROL_5: CIOVFIEN (Bit 11)                   */
#define EPCA_0_CONTROL_5_CIOVFIEN_Msk     (0x800UL)                 /*!< EPCA_0 CONTROL_5: CIOVFIEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_5_CIOVFDEN_Pos     (12UL)                    /*!< EPCA_0 CONTROL_5: CIOVFDEN (Bit 12)                   */
#define EPCA_0_CONTROL_5_CIOVFDEN_Msk     (0x1000UL)                /*!< EPCA_0 CONTROL_5: CIOVFDEN (Bitfield-Mask: 0x01)      */
#define EPCA_0_CONTROL_5_CIOVFSEN_Pos     (13UL)                    /*!< EPCA_0 CONTROL_5: CIOVFSEN (Bit 13)                   */
