chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
#define EPCA_0_CONTROL_5_CIOVFSEN_Msk     (0x2000UL)                /*!< EPCA_0 CONTROL_5: CIOVFSEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CCAPV_5  ======================================================== */
#define EPCA_0_CCAPV_5_CCAPV_Pos          (0UL)                     /*!< EPCA_0 CCAPV_5: CCAPV (Bit 0)                         */
#define EPCA_0_CCAPV_5_CCAPV_Msk          (0x3ffffUL)               /*!< EPCA_0 CCAPV_5: CCAPV (Bitfield-Mask: 0x3ffff)        */
/* ======================================================  CCAPVUPD_5  ======================================================= */
#define EPCA_0_CCAPVUPD_5_CCAPVUPD_Pos    (0UL)                     /*!< EPCA_0 CCAPVUPD_5: CCAPVUPD (Bit 0)                   */
#define EPCA_0_CCAPVUPD_5_CCAPVUPD_Msk    (0x3ffffUL)               /*!< EPCA_0 CCAPVUPD_5: CCAPVUPD (Bitfield-Mask: 0x3ffff)  */


/* =========================================================================================================================== */
/* ================                                        FLASHCTRL_0                                        ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
#define FLASHCTRL_0_CONFIG_SPMD_Pos       (0UL)                     /*!< FLASHCTRL_0 CONFIG: SPMD (Bit 0)                      */
#define FLASHCTRL_0_CONFIG_SPMD_Msk       (0x3UL)                   /*!< FLASHCTRL_0 CONFIG: SPMD (Bitfield-Mask: 0x03)        */
#define FLASHCTRL_0_CONFIG_RDSEN_Pos      (4UL)                     /*!< FLASHCTRL_0 CONFIG: RDSEN (Bit 4)                     */
#define FLASHCTRL_0_CONFIG_RDSEN_Msk      (0x10UL)                  /*!< FLASHCTRL_0 CONFIG: RDSEN (Bitfield-Mask: 0x01)       */
#define FLASHCTRL_0_CONFIG_DPFEN_Pos      (6UL)                     /*!< FLASHCTRL_0 CONFIG: DPFEN (Bit 6)                     */
#define FLASHCTRL_0_CONFIG_DPFEN_Msk      (0x40UL)                  /*!< FLASHCTRL_0 CONFIG: DPFEN (Bitfield-Mask: 0x01)       */
#define FLASHCTRL_0_CONFIG_PFINH_Pos      (7UL)                     /*!< FLASHCTRL_0 CONFIG: PFINH (Bit 7)                     */
#define FLASHCTRL_0_CONFIG_PFINH_Msk      (0x80UL)                  /*!< FLASHCTRL_0 CONFIG: PFINH (Bitfield-Mask: 0x01)       */
#define FLASHCTRL_0_CONFIG_SQWEN_Pos      (16UL)                    /*!< FLASHCTRL_0 CONFIG: SQWEN (Bit 16)                    */
#define FLASHCTRL_0_CONFIG_SQWEN_Msk      (0x10000UL)               /*!< FLASHCTRL_0 CONFIG: SQWEN (Bitfield-Mask: 0x01)       */
#define FLASHCTRL_0_CONFIG_ERASEEN_Pos    (18UL)                    /*!< FLASHCTRL_0 CONFIG: ERASEEN (Bit 18)                  */
#define FLASHCTRL_0_CONFIG_ERASEEN_Msk    (0x40000UL)               /*!< FLASHCTRL_0 CONFIG: ERASEEN (Bitfield-Mask: 0x01)     */
#define FLASHCTRL_0_CONFIG_BUFSTS_Pos     (19UL)                    /*!< FLASHCTRL_0 CONFIG: BUFSTS (Bit 19)                   */
#define FLASHCTRL_0_CONFIG_BUFSTS_Msk     (0x80000UL)               /*!< FLASHCTRL_0 CONFIG: BUFSTS (Bitfield-Mask: 0x01)      */
#define FLASHCTRL_0_CONFIG_BUSYF_Pos      (20UL)                    /*!< FLASHCTRL_0 CONFIG: BUSYF (Bit 20)                    */
#define FLASHCTRL_0_CONFIG_BUSYF_Msk      (0x100000UL)              /*!< FLASHCTRL_0 CONFIG: BUSYF (Bitfield-Mask: 0x01)       */
/* ========================================================  WRADDR  ========================================================= */
#define FLASHCTRL_0_WRADDR_WRADDR_Pos     (0UL)                     /*!< FLASHCTRL_0 WRADDR: WRADDR (Bit 0)                    */
#define FLASHCTRL_0_WRADDR_WRADDR_Msk     (0xffffffffUL)            /*!< FLASHCTRL_0 WRADDR: WRADDR (Bitfield-Mask: 0xffffffff) */
/* ========================================================  WRDATA  ========================================================= */
#define FLASHCTRL_0_WRDATA_WRDATA_Pos     (0UL)                     /*!< FLASHCTRL_0 WRDATA: WRDATA (Bit 0)                    */
#define FLASHCTRL_0_WRDATA_WRDATA_Msk     (0xffffffffUL)            /*!< FLASHCTRL_0 WRDATA: WRDATA (Bitfield-Mask: 0xffffffff) */
/* ==========================================================  KEY  ========================================================== */
#define FLASHCTRL_0_KEY_KEY_Pos           (0UL)                     /*!< FLASHCTRL_0 KEY: KEY (Bit 0)                          */
#define FLASHCTRL_0_KEY_KEY_Msk           (0xffUL)                  /*!< FLASHCTRL_0 KEY: KEY (Bitfield-Mask: 0xff)            */
/* =======================================================  TCONTROL  ======================================================== */
#define FLASHCTRL_0_TCONTROL_FLRTMD_Pos   (6UL)                     /*!< FLASHCTRL_0 TCONTROL: FLRTMD (Bit 6)                  */
#define FLASHCTRL_0_TCONTROL_FLRTMD_Msk   (0x40UL)                  /*!< FLASHCTRL_0 TCONTROL: FLRTMD (Bitfield-Mask: 0x01)    */


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
#define I2C_CONTROL_BUSYF_Pos             (0UL)                     /*!< I2C CONTROL: BUSYF (Bit 0)                            */
#define I2C_CONTROL_BUSYF_Msk             (0x1UL)                   /*!< I2C CONTROL: BUSYF (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_ACK_Pos               (1UL)                     /*!< I2C CONTROL: ACK (Bit 1)                              */
#define I2C_CONTROL_ACK_Msk               (0x2UL)                   /*!< I2C CONTROL: ACK (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_ARBLF_Pos             (2UL)                     /*!< I2C CONTROL: ARBLF (Bit 2)                            */
#define I2C_CONTROL_ARBLF_Msk             (0x4UL)                   /*!< I2C CONTROL: ARBLF (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_ACKRQF_Pos            (3UL)                     /*!< I2C CONTROL: ACKRQF (Bit 3)                           */
#define I2C_CONTROL_ACKRQF_Msk            (0x8UL)                   /*!< I2C CONTROL: ACKRQF (Bitfield-Mask: 0x01)             */
#define I2C_CONTROL_STO_Pos               (4UL)                     /*!< I2C CONTROL: STO (Bit 4)                              */
#define I2C_CONTROL_STO_Msk               (0x10UL)                  /*!< I2C CONTROL: STO (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_STA_Pos               (5UL)                     /*!< I2C CONTROL: STA (Bit 5)                              */
#define I2C_CONTROL_STA_Msk               (0x20UL)                  /*!< I2C CONTROL: STA (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_TXMDF_Pos             (6UL)                     /*!< I2C CONTROL: TXMDF (Bit 6)                            */
#define I2C_CONTROL_TXMDF_Msk             (0x40UL)                  /*!< I2C CONTROL: TXMDF (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_MSMDF_Pos             (7UL)                     /*!< I2C CONTROL: MSMDF (Bit 7)                            */
#define I2C_CONTROL_MSMDF_Msk             (0x80UL)                  /*!< I2C CONTROL: MSMDF (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_STOI_Pos              (8UL)                     /*!< I2C CONTROL: STOI (Bit 8)                             */
#define I2C_CONTROL_STOI_Msk              (0x100UL)                 /*!< I2C CONTROL: STOI (Bitfield-Mask: 0x01)               */
#define I2C_CONTROL_ACKI_Pos              (9UL)                     /*!< I2C CONTROL: ACKI (Bit 9)                             */
#define I2C_CONTROL_ACKI_Msk              (0x200UL)                 /*!< I2C CONTROL: ACKI (Bitfield-Mask: 0x01)               */
#define I2C_CONTROL_RXI_Pos               (10UL)                    /*!< I2C CONTROL: RXI (Bit 10)                             */
#define I2C_CONTROL_RXI_Msk               (0x400UL)                 /*!< I2C CONTROL: RXI (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_TXI_Pos               (11UL)                    /*!< I2C CONTROL: TXI (Bit 11)                             */
#define I2C_CONTROL_TXI_Msk               (0x800UL)                 /*!< I2C CONTROL: TXI (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_STAI_Pos              (12UL)                    /*!< I2C CONTROL: STAI (Bit 12)                            */
#define I2C_CONTROL_STAI_Msk              (0x1000UL)                /*!< I2C CONTROL: STAI (Bitfield-Mask: 0x01)               */
#define I2C_CONTROL_ARBLI_Pos             (13UL)                    /*!< I2C CONTROL: ARBLI (Bit 13)                           */
#define I2C_CONTROL_ARBLI_Msk             (0x2000UL)                /*!< I2C CONTROL: ARBLI (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_T0I_Pos               (14UL)                    /*!< I2C CONTROL: T0I (Bit 14)                             */
#define I2C_CONTROL_T0I_Msk               (0x4000UL)                /*!< I2C CONTROL: T0I (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_T1I_Pos               (15UL)                    /*!< I2C CONTROL: T1I (Bit 15)                             */
#define I2C_CONTROL_T1I_Msk               (0x8000UL)                /*!< I2C CONTROL: T1I (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_T2I_Pos               (16UL)                    /*!< I2C CONTROL: T2I (Bit 16)                             */
#define I2C_CONTROL_T2I_Msk               (0x10000UL)               /*!< I2C CONTROL: T2I (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_T3I_Pos               (17UL)                    /*!< I2C CONTROL: T3I (Bit 17)                             */
#define I2C_CONTROL_T3I_Msk               (0x20000UL)               /*!< I2C CONTROL: T3I (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_RXARM_Pos             (18UL)                    /*!< I2C CONTROL: RXARM (Bit 18)                           */
#define I2C_CONTROL_RXARM_Msk             (0x40000UL)               /*!< I2C CONTROL: RXARM (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_TXARM_Pos             (19UL)                    /*!< I2C CONTROL: TXARM (Bit 19)                           */
#define I2C_CONTROL_TXARM_Msk             (0x80000UL)               /*!< I2C CONTROL: TXARM (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_SLVAF_Pos             (20UL)                    /*!< I2C CONTROL: SLVAF (Bit 20)                           */
#define I2C_CONTROL_SLVAF_Msk             (0x100000UL)              /*!< I2C CONTROL: SLVAF (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_ATXRXEN_Pos           (21UL)                    /*!< I2C CONTROL: ATXRXEN (Bit 21)                         */
#define I2C_CONTROL_ATXRXEN_Msk           (0x200000UL)              /*!< I2C CONTROL: ATXRXEN (Bitfield-Mask: 0x01)            */
#define I2C_CONTROL_FMD_Pos               (22UL)                    /*!< I2C CONTROL: FMD (Bit 22)                             */
#define I2C_CONTROL_FMD_Msk               (0x400000UL)              /*!< I2C CONTROL: FMD (Bitfield-Mask: 0x01)                */
#define I2C_CONTROL_DBGMD_Pos             (23UL)                    /*!< I2C CONTROL: DBGMD (Bit 23)                           */
#define I2C_CONTROL_DBGMD_Msk             (0x800000UL)              /*!< I2C CONTROL: DBGMD (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_SMINH_Pos             (24UL)                    /*!< I2C CONTROL: SMINH (Bit 24)                           */
#define I2C_CONTROL_SMINH_Msk             (0x1000000UL)             /*!< I2C CONTROL: SMINH (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_HACKEN_Pos            (25UL)                    /*!< I2C CONTROL: HACKEN (Bit 25)                          */
#define I2C_CONTROL_HACKEN_Msk            (0x2000000UL)             /*!< I2C CONTROL: HACKEN (Bitfield-Mask: 0x01)             */
#define I2C_CONTROL_SLVAMD_Pos            (26UL)                    /*!< I2C CONTROL: SLVAMD (Bit 26)                          */
#define I2C_CONTROL_SLVAMD_Msk            (0x4000000UL)             /*!< I2C CONTROL: SLVAMD (Bitfield-Mask: 0x01)             */
#define I2C_CONTROL_LBACKEN_Pos           (27UL)                    /*!< I2C CONTROL: LBACKEN (Bit 27)                         */
#define I2C_CONTROL_LBACKEN_Msk           (0x8000000UL)             /*!< I2C CONTROL: LBACKEN (Bitfield-Mask: 0x01)            */
#define I2C_CONTROL_GCEN_Pos              (29UL)                    /*!< I2C CONTROL: GCEN (Bit 29)                            */
#define I2C_CONTROL_GCEN_Msk              (0x20000000UL)            /*!< I2C CONTROL: GCEN (Bitfield-Mask: 0x01)               */
#define I2C_CONTROL_RESET_Pos             (30UL)                    /*!< I2C CONTROL: RESET (Bit 30)                           */
#define I2C_CONTROL_RESET_Msk             (0x40000000UL)            /*!< I2C CONTROL: RESET (Bitfield-Mask: 0x01)              */
#define I2C_CONTROL_I2CEN_Pos             (31UL)                    /*!< I2C CONTROL: I2CEN (Bit 31)                           */
#define I2C_CONTROL_I2CEN_Msk             (0x80000000UL)            /*!< I2C CONTROL: I2CEN (Bitfield-Mask: 0x01)              */
/* ========================================================  CONFIG  ========================================================= */
#define I2C_CONFIG_SCALER_Pos             (0UL)                     /*!< I2C CONFIG: SCALER (Bit 0)                            */
#define I2C_CONFIG_SCALER_Msk             (0x3fUL)                  /*!< I2C CONFIG: SCALER (Bitfield-Mask: 0x3f)              */
#define I2C_CONFIG_STOIEN_Pos             (8UL)                     /*!< I2C CONFIG: STOIEN (Bit 8)                            */
#define I2C_CONFIG_STOIEN_Msk             (0x100UL)                 /*!< I2C CONFIG: STOIEN (Bitfield-Mask: 0x01)              */
#define I2C_CONFIG_ACKIEN_Pos             (9UL)                     /*!< I2C CONFIG: ACKIEN (Bit 9)                            */
#define I2C_CONFIG_ACKIEN_Msk             (0x200UL)                 /*!< I2C CONFIG: ACKIEN (Bitfield-Mask: 0x01)              */
#define I2C_CONFIG_RXIEN_Pos              (10UL)                    /*!< I2C CONFIG: RXIEN (Bit 10)                            */
#define I2C_CONFIG_RXIEN_Msk              (0x400UL)                 /*!< I2C CONFIG: RXIEN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_TXIEN_Pos              (11UL)                    /*!< I2C CONFIG: TXIEN (Bit 11)                            */
#define I2C_CONFIG_TXIEN_Msk              (0x800UL)                 /*!< I2C CONFIG: TXIEN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_STAIEN_Pos             (12UL)                    /*!< I2C CONFIG: STAIEN (Bit 12)                           */
#define I2C_CONFIG_STAIEN_Msk             (0x1000UL)                /*!< I2C CONFIG: STAIEN (Bitfield-Mask: 0x01)              */
#define I2C_CONFIG_ARBLIEN_Pos            (13UL)                    /*!< I2C CONFIG: ARBLIEN (Bit 13)                          */
#define I2C_CONFIG_ARBLIEN_Msk            (0x2000UL)                /*!< I2C CONFIG: ARBLIEN (Bitfield-Mask: 0x01)             */
#define I2C_CONFIG_T0IEN_Pos              (14UL)                    /*!< I2C CONFIG: T0IEN (Bit 14)                            */
#define I2C_CONFIG_T0IEN_Msk              (0x4000UL)                /*!< I2C CONFIG: T0IEN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_T1IEN_Pos              (15UL)                    /*!< I2C CONFIG: T1IEN (Bit 15)                            */
#define I2C_CONFIG_T1IEN_Msk              (0x8000UL)                /*!< I2C CONFIG: T1IEN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_T2IEN_Pos              (16UL)                    /*!< I2C CONFIG: T2IEN (Bit 16)                            */
#define I2C_CONFIG_T2IEN_Msk              (0x10000UL)               /*!< I2C CONFIG: T2IEN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_T3IEN_Pos              (17UL)                    /*!< I2C CONFIG: T3IEN (Bit 17)                            */
#define I2C_CONFIG_T3IEN_Msk              (0x20000UL)               /*!< I2C CONFIG: T3IEN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_BC_Pos                 (20UL)                    /*!< I2C CONFIG: BC (Bit 20)                               */
#define I2C_CONFIG_BC_Msk                 (0x300000UL)              /*!< I2C CONFIG: BC (Bitfield-Mask: 0x03)                  */
#define I2C_CONFIG_BP_Pos                 (22UL)                    /*!< I2C CONFIG: BP (Bit 22)                               */
#define I2C_CONFIG_BP_Msk                 (0xc00000UL)              /*!< I2C CONFIG: BP (Bitfield-Mask: 0x03)                  */
#define I2C_CONFIG_T0RUN_Pos              (24UL)                    /*!< I2C CONFIG: T0RUN (Bit 24)                            */
#define I2C_CONFIG_T0RUN_Msk              (0x1000000UL)             /*!< I2C CONFIG: T0RUN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_T1RUN_Pos              (25UL)                    /*!< I2C CONFIG: T1RUN (Bit 25)                            */
#define I2C_CONFIG_T1RUN_Msk              (0x2000000UL)             /*!< I2C CONFIG: T1RUN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_T2RUN_Pos              (26UL)                    /*!< I2C CONFIG: T2RUN (Bit 26)                            */
#define I2C_CONFIG_T2RUN_Msk              (0x4000000UL)             /*!< I2C CONFIG: T2RUN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_T3RUN_Pos              (27UL)                    /*!< I2C CONFIG: T3RUN (Bit 27)                            */
#define I2C_CONFIG_T3RUN_Msk              (0x8000000UL)             /*!< I2C CONFIG: T3RUN (Bitfield-Mask: 0x01)               */
#define I2C_CONFIG_TMD_Pos                (28UL)                    /*!< I2C CONFIG: TMD (Bit 28)                              */
#define I2C_CONFIG_TMD_Msk                (0x30000000UL)            /*!< I2C CONFIG: TMD (Bitfield-Mask: 0x03)                 */
#define I2C_CONFIG_TIMEREN_Pos            (31UL)                    /*!< I2C CONFIG: TIMEREN (Bit 31)                          */
#define I2C_CONFIG_TIMEREN_Msk            (0x80000000UL)            /*!< I2C CONFIG: TIMEREN (Bitfield-Mask: 0x01)             */
/* =======================================================  SADDRESS  ======================================================== */
#define I2C_SADDRESS_ADDRESS_Pos          (1UL)                     /*!< I2C SADDRESS: ADDRESS (Bit 1)                         */
#define I2C_SADDRESS_ADDRESS_Msk          (0x7feUL)                 /*!< I2C SADDRESS: ADDRESS (Bitfield-Mask: 0x3ff)          */
/* =========================================================  SMASK  ========================================================= */
#define I2C_SMASK_MASK_Pos                (1UL)                     /*!< I2C SMASK: MASK (Bit 1)                               */
#define I2C_SMASK_MASK_Msk                (0x7feUL)                 /*!< I2C SMASK: MASK (Bitfield-Mask: 0x3ff)                */
/* =========================================================  DATA  ========================================================== */
#define I2C_DATA_DATA_Pos                 (0UL)                     /*!< I2C DATA: DATA (Bit 0)                                */
#define I2C_DATA_DATA_Msk                 (0xffffffffUL)            /*!< I2C DATA: DATA (Bitfield-Mask: 0xffffffff)            */
/* =========================================================  TIMER  ========================================================= */
#define I2C_TIMER_T0_Pos                  (0UL)                     /*!< I2C TIMER: T0 (Bit 0)                                 */
#define I2C_TIMER_T0_Msk                  (0xffUL)                  /*!< I2C TIMER: T0 (Bitfield-Mask: 0xff)                   */
#define I2C_TIMER_T1_Pos                  (8UL)                     /*!< I2C TIMER: T1 (Bit 8)                                 */
#define I2C_TIMER_T1_Msk                  (0xff00UL)                /*!< I2C TIMER: T1 (Bitfield-Mask: 0xff)                   */
#define I2C_TIMER_T2_Pos                  (16UL)                    /*!< I2C TIMER: T2 (Bit 16)                                */
#define I2C_TIMER_T2_Msk                  (0xff0000UL)              /*!< I2C TIMER: T2 (Bitfield-Mask: 0xff)                   */
#define I2C_TIMER_T3_Pos                  (24UL)                    /*!< I2C TIMER: T3 (Bit 24)                                */
#define I2C_TIMER_T3_Msk                  (0xff000000UL)            /*!< I2C TIMER: T3 (Bitfield-Mask: 0xff)                   */
/* ========================================================  TIMERRL  ======================================================== */
#define I2C_TIMERRL_T0RL_Pos              (0UL)                     /*!< I2C TIMERRL: T0RL (Bit 0)                             */
#define I2C_TIMERRL_T0RL_Msk              (0xffUL)                  /*!< I2C TIMERRL: T0RL (Bitfield-Mask: 0xff)               */
#define I2C_TIMERRL_T1RL_Pos              (8UL)                     /*!< I2C TIMERRL: T1RL (Bit 8)                             */
#define I2C_TIMERRL_T1RL_Msk              (0xff00UL)                /*!< I2C TIMERRL: T1RL (Bitfield-Mask: 0xff)               */
#define I2C_TIMERRL_T2RL_Pos              (16UL)                    /*!< I2C TIMERRL: T2RL (Bit 16)                            */
#define I2C_TIMERRL_T2RL_Msk              (0xff0000UL)              /*!< I2C TIMERRL: T2RL (Bitfield-Mask: 0xff)               */
#define I2C_TIMERRL_T3RL_Pos              (24UL)                    /*!< I2C TIMERRL: T3RL (Bit 24)                            */
#define I2C_TIMERRL_T3RL_Msk              (0xff000000UL)            /*!< I2C TIMERRL: T3RL (Bitfield-Mask: 0xff)               */
/* ========================================================  SCONFIG  ======================================================== */
#define I2C_SCONFIG_SETUP_Pos             (0UL)                     /*!< I2C SCONFIG: SETUP (Bit 0)                            */
#define I2C_SCONFIG_SETUP_Msk             (0xfUL)                   /*!< I2C SCONFIG: SETUP (Bitfield-Mask: 0x0f)              */
#define I2C_SCONFIG_HOLD_Pos              (4UL)                     /*!< I2C SCONFIG: HOLD (Bit 4)                             */
#define I2C_SCONFIG_HOLD_Msk              (0xf0UL)                  /*!< I2C SCONFIG: HOLD (Bitfield-Mask: 0x0f)               */
#define I2C_SCONFIG_SCLL_Pos              (8UL)                     /*!< I2C SCONFIG: SCLL (Bit 8)                             */
#define I2C_SCONFIG_SCLL_Msk              (0xff00UL)                /*!< I2C SCONFIG: SCLL (Bitfield-Mask: 0xff)               */
#define I2C_SCONFIG_SCLLTIMER_Pos         (16UL)                    /*!< I2C SCONFIG: SCLLTIMER (Bit 16)                       */
#define I2C_SCONFIG_SCLLTIMER_Msk         (0xf0000UL)               /*!< I2C SCONFIG: SCLLTIMER (Bitfield-Mask: 0x0f)          */
/* ========================================================  I2CDMA  ========================================================= */
#define I2C_I2CDMA_DMALEN_Pos             (0UL)                     /*!< I2C I2CDMA: DMALEN (Bit 0)                            */
#define I2C_I2CDMA_DMALEN_Msk             (0xffUL)                  /*!< I2C I2CDMA: DMALEN (Bitfield-Mask: 0xff)              */
#define I2C_I2CDMA_DMAEN_Pos              (31UL)                    /*!< I2C I2CDMA: DMAEN (Bit 31)                            */
