chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
#define I2C_I2CDMA_DMAEN_Msk              (0x80000000UL)            /*!< I2C I2CDMA: DMAEN (Bitfield-Mask: 0x01)               */


/* =========================================================================================================================== */
/* ================                                           I2S_0                                           ================ */
/* =========================================================================================================================== */

/* =======================================================  TXCONTROL  ======================================================= */
#define I2S_0_TXCONTROL_FSGEN_Pos         (0UL)                     /*!< I2S_0 TXCONTROL: FSGEN (Bit 0)                        */
#define I2S_0_TXCONTROL_FSGEN_Msk         (0x1UL)                   /*!< I2S_0 TXCONTROL: FSGEN (Bitfield-Mask: 0x01)          */
#define I2S_0_TXCONTROL_FSSEN_Pos         (1UL)                     /*!< I2S_0 TXCONTROL: FSSEN (Bit 1)                        */
#define I2S_0_TXCONTROL_FSSEN_Msk         (0x2UL)                   /*!< I2S_0 TXCONTROL: FSSEN (Bitfield-Mask: 0x01)          */
#define I2S_0_TXCONTROL_DDIS_Pos          (5UL)                     /*!< I2S_0 TXCONTROL: DDIS (Bit 5)                         */
#define I2S_0_TXCONTROL_DDIS_Msk          (0x20UL)                  /*!< I2S_0 TXCONTROL: DDIS (Bitfield-Mask: 0x01)           */
#define I2S_0_TXCONTROL_FSDEL_Pos         (6UL)                     /*!< I2S_0 TXCONTROL: FSDEL (Bit 6)                        */
#define I2S_0_TXCONTROL_FSDEL_Msk         (0x3fc0UL)                /*!< I2S_0 TXCONTROL: FSDEL (Bitfield-Mask: 0xff)          */
#define I2S_0_TXCONTROL_FSSRCSEL_Pos      (14UL)                    /*!< I2S_0 TXCONTROL: FSSRCSEL (Bit 14)                    */
#define I2S_0_TXCONTROL_FSSRCSEL_Msk      (0x4000UL)                /*!< I2S_0 TXCONTROL: FSSRCSEL (Bitfield-Mask: 0x01)       */
#define I2S_0_TXCONTROL_FILLSEL_Pos       (15UL)                    /*!< I2S_0 TXCONTROL: FILLSEL (Bit 15)                     */
#define I2S_0_TXCONTROL_FILLSEL_Msk       (0x18000UL)               /*!< I2S_0 TXCONTROL: FILLSEL (Bitfield-Mask: 0x03)        */
#define I2S_0_TXCONTROL_JSEL_Pos          (17UL)                    /*!< I2S_0 TXCONTROL: JSEL (Bit 17)                        */
#define I2S_0_TXCONTROL_JSEL_Msk          (0x20000UL)               /*!< I2S_0 TXCONTROL: JSEL (Bitfield-Mask: 0x01)           */
#define I2S_0_TXCONTROL_FSINVEN_Pos       (20UL)                    /*!< I2S_0 TXCONTROL: FSINVEN (Bit 20)                     */
#define I2S_0_TXCONTROL_FSINVEN_Msk       (0x100000UL)              /*!< I2S_0 TXCONTROL: FSINVEN (Bitfield-Mask: 0x01)        */
#define I2S_0_TXCONTROL_SCLKINVEN_Pos     (21UL)                    /*!< I2S_0 TXCONTROL: SCLKINVEN (Bit 21)                   */
#define I2S_0_TXCONTROL_SCLKINVEN_Msk     (0x200000UL)              /*!< I2S_0 TXCONTROL: SCLKINVEN (Bitfield-Mask: 0x01)      */
#define I2S_0_TXCONTROL_ORDER_Pos         (22UL)                    /*!< I2S_0 TXCONTROL: ORDER (Bit 22)                       */
#define I2S_0_TXCONTROL_ORDER_Msk         (0x400000UL)              /*!< I2S_0 TXCONTROL: ORDER (Bitfield-Mask: 0x01)          */
#define I2S_0_TXCONTROL_MBSEL_Pos         (24UL)                    /*!< I2S_0 TXCONTROL: MBSEL (Bit 24)                       */
#define I2S_0_TXCONTROL_MBSEL_Msk         (0x7000000UL)             /*!< I2S_0 TXCONTROL: MBSEL (Bitfield-Mask: 0x07)          */
#define I2S_0_TXCONTROL_TXEN_Pos          (29UL)                    /*!< I2S_0 TXCONTROL: TXEN (Bit 29)                        */
#define I2S_0_TXCONTROL_TXEN_Msk          (0x20000000UL)            /*!< I2S_0 TXCONTROL: TXEN (Bitfield-Mask: 0x01)           */
/* ========================================================  TXMODE  ========================================================= */
#define I2S_0_TXMODE_CYCLE_Pos            (0UL)                     /*!< I2S_0 TXMODE: CYCLE (Bit 0)                           */
#define I2S_0_TXMODE_CYCLE_Msk            (0xfffUL)                 /*!< I2S_0 TXMODE: CYCLE (Bitfield-Mask: 0xfff)            */
#define I2S_0_TXMODE_START_Pos            (12UL)                    /*!< I2S_0 TXMODE: START (Bit 12)                          */
#define I2S_0_TXMODE_START_Msk            (0xff000UL)               /*!< I2S_0 TXMODE: START (Bitfield-Mask: 0xff)             */
#define I2S_0_TXMODE_SLOTS_Pos            (20UL)                    /*!< I2S_0 TXMODE: SLOTS (Bit 20)                          */
#define I2S_0_TXMODE_SLOTS_Msk            (0x1f00000UL)             /*!< I2S_0 TXMODE: SLOTS (Bitfield-Mask: 0x1f)             */
#define I2S_0_TXMODE_DEDIS_Pos            (25UL)                    /*!< I2S_0 TXMODE: DEDIS (Bit 25)                          */
#define I2S_0_TXMODE_DEDIS_Msk            (0x2000000UL)             /*!< I2S_0 TXMODE: DEDIS (Bitfield-Mask: 0x01)             */
#define I2S_0_TXMODE_DIMD_Pos             (26UL)                    /*!< I2S_0 TXMODE: DIMD (Bit 26)                           */
#define I2S_0_TXMODE_DIMD_Msk             (0x4000000UL)             /*!< I2S_0 TXMODE: DIMD (Bitfield-Mask: 0x01)              */
#define I2S_0_TXMODE_TDMEN_Pos            (27UL)                    /*!< I2S_0 TXMODE: TDMEN (Bit 27)                          */
#define I2S_0_TXMODE_TDMEN_Msk            (0x8000000UL)             /*!< I2S_0 TXMODE: TDMEN (Bitfield-Mask: 0x01)             */
/* ========================================================  FSDUTY  ========================================================= */
#define I2S_0_FSDUTY_FSLOW_Pos            (0UL)                     /*!< I2S_0 FSDUTY: FSLOW (Bit 0)                           */
#define I2S_0_FSDUTY_FSLOW_Msk            (0xffffUL)                /*!< I2S_0 FSDUTY: FSLOW (Bitfield-Mask: 0xffff)           */
#define I2S_0_FSDUTY_FSHIGH_Pos           (16UL)                    /*!< I2S_0 FSDUTY: FSHIGH (Bit 16)                         */
#define I2S_0_FSDUTY_FSHIGH_Msk           (0xffff0000UL)            /*!< I2S_0 FSDUTY: FSHIGH (Bitfield-Mask: 0xffff)          */
/* =======================================================  RXCONTROL  ======================================================= */
#define I2S_0_RXCONTROL_FSDEL_Pos         (0UL)                     /*!< I2S_0 RXCONTROL: FSDEL (Bit 0)                        */
#define I2S_0_RXCONTROL_FSDEL_Msk         (0xffUL)                  /*!< I2S_0 RXCONTROL: FSDEL (Bitfield-Mask: 0xff)          */
#define I2S_0_RXCONTROL_JSEL_Pos          (8UL)                     /*!< I2S_0 RXCONTROL: JSEL (Bit 8)                         */
#define I2S_0_RXCONTROL_JSEL_Msk          (0x100UL)                 /*!< I2S_0 RXCONTROL: JSEL (Bitfield-Mask: 0x01)           */
#define I2S_0_RXCONTROL_DDIS_Pos          (9UL)                     /*!< I2S_0 RXCONTROL: DDIS (Bit 9)                         */
#define I2S_0_RXCONTROL_DDIS_Msk          (0x200UL)                 /*!< I2S_0 RXCONTROL: DDIS (Bitfield-Mask: 0x01)           */
#define I2S_0_RXCONTROL_FSINVEN_Pos       (11UL)                    /*!< I2S_0 RXCONTROL: FSINVEN (Bit 11)                     */
#define I2S_0_RXCONTROL_FSINVEN_Msk       (0x800UL)                 /*!< I2S_0 RXCONTROL: FSINVEN (Bitfield-Mask: 0x01)        */
#define I2S_0_RXCONTROL_SCLKINVEN_Pos     (12UL)                    /*!< I2S_0 RXCONTROL: SCLKINVEN (Bit 12)                   */
#define I2S_0_RXCONTROL_SCLKINVEN_Msk     (0x1000UL)                /*!< I2S_0 RXCONTROL: SCLKINVEN (Bitfield-Mask: 0x01)      */
#define I2S_0_RXCONTROL_ORDER_Pos         (13UL)                    /*!< I2S_0 RXCONTROL: ORDER (Bit 13)                       */
#define I2S_0_RXCONTROL_ORDER_Msk         (0x2000UL)                /*!< I2S_0 RXCONTROL: ORDER (Bitfield-Mask: 0x01)          */
#define I2S_0_RXCONTROL_MBSEL_Pos         (15UL)                    /*!< I2S_0 RXCONTROL: MBSEL (Bit 15)                       */
#define I2S_0_RXCONTROL_MBSEL_Msk         (0x38000UL)               /*!< I2S_0 RXCONTROL: MBSEL (Bitfield-Mask: 0x07)          */
#define I2S_0_RXCONTROL_FSSRCSEL_Pos      (20UL)                    /*!< I2S_0 RXCONTROL: FSSRCSEL (Bit 20)                    */
#define I2S_0_RXCONTROL_FSSRCSEL_Msk      (0x100000UL)              /*!< I2S_0 RXCONTROL: FSSRCSEL (Bitfield-Mask: 0x01)       */
#define I2S_0_RXCONTROL_RXEN_Pos          (21UL)                    /*!< I2S_0 RXCONTROL: RXEN (Bit 21)                        */
#define I2S_0_RXCONTROL_RXEN_Msk          (0x200000UL)              /*!< I2S_0 RXCONTROL: RXEN (Bitfield-Mask: 0x01)           */
/* ========================================================  RXMODE  ========================================================= */
#define I2S_0_RXMODE_CYCLE_Pos            (0UL)                     /*!< I2S_0 RXMODE: CYCLE (Bit 0)                           */
#define I2S_0_RXMODE_CYCLE_Msk            (0xfffUL)                 /*!< I2S_0 RXMODE: CYCLE (Bitfield-Mask: 0xfff)            */
#define I2S_0_RXMODE_START_Pos            (12UL)                    /*!< I2S_0 RXMODE: START (Bit 12)                          */
#define I2S_0_RXMODE_START_Msk            (0xff000UL)               /*!< I2S_0 RXMODE: START (Bitfield-Mask: 0xff)             */
#define I2S_0_RXMODE_SLOTS_Pos            (20UL)                    /*!< I2S_0 RXMODE: SLOTS (Bit 20)                          */
#define I2S_0_RXMODE_SLOTS_Msk            (0x3f00000UL)             /*!< I2S_0 RXMODE: SLOTS (Bitfield-Mask: 0x3f)             */
#define I2S_0_RXMODE_TDMEN_Pos            (27UL)                    /*!< I2S_0 RXMODE: TDMEN (Bit 27)                          */
#define I2S_0_RXMODE_TDMEN_Msk            (0x8000000UL)             /*!< I2S_0 RXMODE: TDMEN (Bitfield-Mask: 0x01)             */
/* ======================================================  CLKCONTROL  ======================================================= */
#define I2S_0_CLKCONTROL_INTDIV_Pos       (0UL)                     /*!< I2S_0 CLKCONTROL: INTDIV (Bit 0)                      */
#define I2S_0_CLKCONTROL_INTDIV_Msk       (0x3ffUL)                 /*!< I2S_0 CLKCONTROL: INTDIV (Bitfield-Mask: 0x3ff)       */
#define I2S_0_CLKCONTROL_FRACDIV_Pos      (10UL)                    /*!< I2S_0 CLKCONTROL: FRACDIV (Bit 10)                    */
#define I2S_0_CLKCONTROL_FRACDIV_Msk      (0x3fc00UL)               /*!< I2S_0 CLKCONTROL: FRACDIV (Bitfield-Mask: 0xff)       */
#define I2S_0_CLKCONTROL_DUTYMD_Pos       (18UL)                    /*!< I2S_0 CLKCONTROL: DUTYMD (Bit 18)                     */
#define I2S_0_CLKCONTROL_DUTYMD_Msk       (0x40000UL)               /*!< I2S_0 CLKCONTROL: DUTYMD (Bitfield-Mask: 0x01)        */
#define I2S_0_CLKCONTROL_CLKUPD_Pos       (19UL)                    /*!< I2S_0 CLKCONTROL: CLKUPD (Bit 19)                     */
#define I2S_0_CLKCONTROL_CLKUPD_Msk       (0x80000UL)               /*!< I2S_0 CLKCONTROL: CLKUPD (Bitfield-Mask: 0x01)        */
#define I2S_0_CLKCONTROL_DIVEN_Pos        (20UL)                    /*!< I2S_0 CLKCONTROL: DIVEN (Bit 20)                      */
#define I2S_0_CLKCONTROL_DIVEN_Msk        (0x100000UL)              /*!< I2S_0 CLKCONTROL: DIVEN (Bitfield-Mask: 0x01)         */
#define I2S_0_CLKCONTROL_TXCLKSEL_Pos     (21UL)                    /*!< I2S_0 CLKCONTROL: TXCLKSEL (Bit 21)                   */
#define I2S_0_CLKCONTROL_TXCLKSEL_Msk     (0x200000UL)              /*!< I2S_0 CLKCONTROL: TXCLKSEL (Bitfield-Mask: 0x01)      */
#define I2S_0_CLKCONTROL_RXCLKSEL_Pos     (22UL)                    /*!< I2S_0 CLKCONTROL: RXCLKSEL (Bit 22)                   */
#define I2S_0_CLKCONTROL_RXCLKSEL_Msk     (0x400000UL)              /*!< I2S_0 CLKCONTROL: RXCLKSEL (Bitfield-Mask: 0x01)      */
#define I2S_0_CLKCONTROL_RESET_Pos        (23UL)                    /*!< I2S_0 CLKCONTROL: RESET (Bit 23)                      */
#define I2S_0_CLKCONTROL_RESET_Msk        (0x800000UL)              /*!< I2S_0 CLKCONTROL: RESET (Bitfield-Mask: 0x01)         */
#define I2S_0_CLKCONTROL_RXCLKEN_Pos      (24UL)                    /*!< I2S_0 CLKCONTROL: RXCLKEN (Bit 24)                    */
#define I2S_0_CLKCONTROL_RXCLKEN_Msk      (0x1000000UL)             /*!< I2S_0 CLKCONTROL: RXCLKEN (Bitfield-Mask: 0x01)       */
#define I2S_0_CLKCONTROL_TXCLKEN_Pos      (25UL)                    /*!< I2S_0 CLKCONTROL: TXCLKEN (Bit 25)                    */
#define I2S_0_CLKCONTROL_TXCLKEN_Msk      (0x2000000UL)             /*!< I2S_0 CLKCONTROL: TXCLKEN (Bitfield-Mask: 0x01)       */
#define I2S_0_CLKCONTROL_RXSCLKMD_Pos     (26UL)                    /*!< I2S_0 CLKCONTROL: RXSCLKMD (Bit 26)                   */
#define I2S_0_CLKCONTROL_RXSCLKMD_Msk     (0x4000000UL)             /*!< I2S_0 CLKCONTROL: RXSCLKMD (Bitfield-Mask: 0x01)      */
#define I2S_0_CLKCONTROL_TXSCLKMD_Pos     (27UL)                    /*!< I2S_0 CLKCONTROL: TXSCLKMD (Bit 27)                   */
#define I2S_0_CLKCONTROL_TXSCLKMD_Msk     (0x8000000UL)             /*!< I2S_0 CLKCONTROL: TXSCLKMD (Bitfield-Mask: 0x01)      */
/* ========================================================  TXFIFO  ========================================================= */
#define I2S_0_TXFIFO_TXFIFO_Pos           (0UL)                     /*!< I2S_0 TXFIFO: TXFIFO (Bit 0)                          */
#define I2S_0_TXFIFO_TXFIFO_Msk           (0xffffffffUL)            /*!< I2S_0 TXFIFO: TXFIFO (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  RXFIFO  ========================================================= */
#define I2S_0_RXFIFO_RXFIFO_Pos           (0UL)                     /*!< I2S_0 RXFIFO: RXFIFO (Bit 0)                          */
#define I2S_0_RXFIFO_RXFIFO_Msk           (0xffffffffUL)            /*!< I2S_0 RXFIFO: RXFIFO (Bitfield-Mask: 0xffffffff)      */
/* ======================================================  FIFOSTATUS  ======================================================= */
#define I2S_0_FIFOSTATUS_TXFIFONUM_Pos    (0UL)                     /*!< I2S_0 FIFOSTATUS: TXFIFONUM (Bit 0)                   */
#define I2S_0_FIFOSTATUS_TXFIFONUM_Msk    (0xfUL)                   /*!< I2S_0 FIFOSTATUS: TXFIFONUM (Bitfield-Mask: 0x0f)     */
#define I2S_0_FIFOSTATUS_RXFIFONUM_Pos    (16UL)                    /*!< I2S_0 FIFOSTATUS: RXFIFONUM (Bit 16)                  */
#define I2S_0_FIFOSTATUS_RXFIFONUM_Msk    (0xf0000UL)               /*!< I2S_0 FIFOSTATUS: RXFIFONUM (Bitfield-Mask: 0x0f)     */
/* ======================================================  FIFOCONTROL  ====================================================== */
#define I2S_0_FIFOCONTROL_TXFIFOWM_Pos    (0UL)                     /*!< I2S_0 FIFOCONTROL: TXFIFOWM (Bit 0)                   */
#define I2S_0_FIFOCONTROL_TXFIFOWM_Msk    (0xfUL)                   /*!< I2S_0 FIFOCONTROL: TXFIFOWM (Bitfield-Mask: 0x0f)     */
#define I2S_0_FIFOCONTROL_RXFIFOWM_Pos    (16UL)                    /*!< I2S_0 FIFOCONTROL: RXFIFOWM (Bit 16)                  */
#define I2S_0_FIFOCONTROL_RXFIFOWM_Msk    (0xf0000UL)               /*!< I2S_0 FIFOCONTROL: RXFIFOWM (Bitfield-Mask: 0x0f)     */
#define I2S_0_FIFOCONTROL_TXFIFOFL_Pos    (21UL)                    /*!< I2S_0 FIFOCONTROL: TXFIFOFL (Bit 21)                  */
#define I2S_0_FIFOCONTROL_TXFIFOFL_Msk    (0x200000UL)              /*!< I2S_0 FIFOCONTROL: TXFIFOFL (Bitfield-Mask: 0x01)     */
#define I2S_0_FIFOCONTROL_RXFIFOFL_Pos    (22UL)                    /*!< I2S_0 FIFOCONTROL: RXFIFOFL (Bit 22)                  */
#define I2S_0_FIFOCONTROL_RXFIFOFL_Msk    (0x400000UL)              /*!< I2S_0 FIFOCONTROL: RXFIFOFL (Bitfield-Mask: 0x01)     */
/* ======================================================  INTCONTROL  ======================================================= */
#define I2S_0_INTCONTROL_TXUFIEN_Pos      (0UL)                     /*!< I2S_0 INTCONTROL: TXUFIEN (Bit 0)                     */
#define I2S_0_INTCONTROL_TXUFIEN_Msk      (0x1UL)                   /*!< I2S_0 INTCONTROL: TXUFIEN (Bitfield-Mask: 0x01)       */
#define I2S_0_INTCONTROL_RXOFIEN_Pos      (1UL)                     /*!< I2S_0 INTCONTROL: RXOFIEN (Bit 1)                     */
#define I2S_0_INTCONTROL_RXOFIEN_Msk      (0x2UL)                   /*!< I2S_0 INTCONTROL: RXOFIEN (Bitfield-Mask: 0x01)       */
#define I2S_0_INTCONTROL_TXLWMIEN_Pos     (2UL)                     /*!< I2S_0 INTCONTROL: TXLWMIEN (Bit 2)                    */
#define I2S_0_INTCONTROL_TXLWMIEN_Msk     (0x4UL)                   /*!< I2S_0 INTCONTROL: TXLWMIEN (Bitfield-Mask: 0x01)      */
#define I2S_0_INTCONTROL_RXHWMIEN_Pos     (3UL)                     /*!< I2S_0 INTCONTROL: RXHWMIEN (Bit 3)                    */
#define I2S_0_INTCONTROL_RXHWMIEN_Msk     (0x8UL)                   /*!< I2S_0 INTCONTROL: RXHWMIEN (Bitfield-Mask: 0x01)      */
/* ========================================================  STATUS  ========================================================= */
#define I2S_0_STATUS_TXUFI_Pos            (0UL)                     /*!< I2S_0 STATUS: TXUFI (Bit 0)                           */
#define I2S_0_STATUS_TXUFI_Msk            (0x1UL)                   /*!< I2S_0 STATUS: TXUFI (Bitfield-Mask: 0x01)             */
#define I2S_0_STATUS_RXOFI_Pos            (1UL)                     /*!< I2S_0 STATUS: RXOFI (Bit 1)                           */
#define I2S_0_STATUS_RXOFI_Msk            (0x2UL)                   /*!< I2S_0 STATUS: RXOFI (Bitfield-Mask: 0x01)             */
#define I2S_0_STATUS_TXLWMI_Pos           (2UL)                     /*!< I2S_0 STATUS: TXLWMI (Bit 2)                          */
#define I2S_0_STATUS_TXLWMI_Msk           (0x4UL)                   /*!< I2S_0 STATUS: TXLWMI (Bitfield-Mask: 0x01)            */
#define I2S_0_STATUS_RXHWMI_Pos           (3UL)                     /*!< I2S_0 STATUS: RXHWMI (Bit 3)                          */
#define I2S_0_STATUS_RXHWMI_Msk           (0x8UL)                   /*!< I2S_0 STATUS: RXHWMI (Bitfield-Mask: 0x01)            */
#define I2S_0_STATUS_CDBUSYF_Pos          (4UL)                     /*!< I2S_0 STATUS: CDBUSYF (Bit 4)                         */
#define I2S_0_STATUS_CDBUSYF_Msk          (0x10UL)                  /*!< I2S_0 STATUS: CDBUSYF (Bitfield-Mask: 0x01)           */
#define I2S_0_STATUS_CDSTS_Pos            (5UL)                     /*!< I2S_0 STATUS: CDSTS (Bit 5)                           */
#define I2S_0_STATUS_CDSTS_Msk            (0x20UL)                  /*!< I2S_0 STATUS: CDSTS (Bitfield-Mask: 0x01)             */
#define I2S_0_STATUS_TXCLKSELRF_Pos       (6UL)                     /*!< I2S_0 STATUS: TXCLKSELRF (Bit 6)                      */
#define I2S_0_STATUS_TXCLKSELRF_Msk       (0x40UL)                  /*!< I2S_0 STATUS: TXCLKSELRF (Bitfield-Mask: 0x01)        */
#define I2S_0_STATUS_RXCLKSELRF_Pos       (7UL)                     /*!< I2S_0 STATUS: RXCLKSELRF (Bit 7)                      */
#define I2S_0_STATUS_RXCLKSELRF_Msk       (0x80UL)                  /*!< I2S_0 STATUS: RXCLKSELRF (Bitfield-Mask: 0x01)        */
#define I2S_0_STATUS_TXCLKENRF_Pos        (8UL)                     /*!< I2S_0 STATUS: TXCLKENRF (Bit 8)                       */
#define I2S_0_STATUS_TXCLKENRF_Msk        (0x100UL)                 /*!< I2S_0 STATUS: TXCLKENRF (Bitfield-Mask: 0x01)         */
#define I2S_0_STATUS_RXCLKENRF_Pos        (9UL)                     /*!< I2S_0 STATUS: RXCLKENRF (Bit 9)                       */
#define I2S_0_STATUS_RXCLKENRF_Msk        (0x200UL)                 /*!< I2S_0 STATUS: RXCLKENRF (Bitfield-Mask: 0x01)         */
/* ======================================================  DMACONTROL  ======================================================= */
#define I2S_0_DMACONTROL_TXDMAEN_Pos      (0UL)                     /*!< I2S_0 DMACONTROL: TXDMAEN (Bit 0)                     */
#define I2S_0_DMACONTROL_TXDMAEN_Msk      (0x1UL)                   /*!< I2S_0 DMACONTROL: TXDMAEN (Bitfield-Mask: 0x01)       */
#define I2S_0_DMACONTROL_RXDMAEN_Pos      (1UL)                     /*!< I2S_0 DMACONTROL: RXDMAEN (Bit 1)                     */
#define I2S_0_DMACONTROL_RXDMAEN_Msk      (0x2UL)                   /*!< I2S_0 DMACONTROL: RXDMAEN (Bitfield-Mask: 0x01)       */
#define I2S_0_DMACONTROL_TXDMABMD_Pos     (2UL)                     /*!< I2S_0 DMACONTROL: TXDMABMD (Bit 2)                    */
#define I2S_0_DMACONTROL_TXDMABMD_Msk     (0x4UL)                   /*!< I2S_0 DMACONTROL: TXDMABMD (Bitfield-Mask: 0x01)      */
#define I2S_0_DMACONTROL_RXDMABMD_Pos     (3UL)                     /*!< I2S_0 DMACONTROL: RXDMABMD (Bit 3)                    */
#define I2S_0_DMACONTROL_RXDMABMD_Msk     (0x8UL)                   /*!< I2S_0 DMACONTROL: RXDMABMD (Bitfield-Mask: 0x01)      */
/* ======================================================  DBGCONTROL  ======================================================= */
#define I2S_0_DBGCONTROL_TXDBGHEN_Pos     (0UL)                     /*!< I2S_0 DBGCONTROL: TXDBGHEN (Bit 0)                    */
#define I2S_0_DBGCONTROL_TXDBGHEN_Msk     (0x1UL)                   /*!< I2S_0 DBGCONTROL: TXDBGHEN (Bitfield-Mask: 0x01)      */
#define I2S_0_DBGCONTROL_RXDBGHEN_Pos     (1UL)                     /*!< I2S_0 DBGCONTROL: RXDBGHEN (Bit 1)                    */
#define I2S_0_DBGCONTROL_RXDBGHEN_Msk     (0x2UL)                   /*!< I2S_0 DBGCONTROL: RXDBGHEN (Bitfield-Mask: 0x01)      */
#define I2S_0_DBGCONTROL_TXDBGMD_Pos      (2UL)                     /*!< I2S_0 DBGCONTROL: TXDBGMD (Bit 2)                     */
#define I2S_0_DBGCONTROL_TXDBGMD_Msk      (0x4UL)                   /*!< I2S_0 DBGCONTROL: TXDBGMD (Bitfield-Mask: 0x01)       */
#define I2S_0_DBGCONTROL_RXDBGMD_Pos      (3UL)                     /*!< I2S_0 DBGCONTROL: RXDBGMD (Bit 3)                     */
#define I2S_0_DBGCONTROL_RXDBGMD_Msk      (0x8UL)                   /*!< I2S_0 DBGCONTROL: RXDBGMD (Bitfield-Mask: 0x01)       */


/* =========================================================================================================================== */
/* ================                                          IDAC_0                                           ================ */
/* =========================================================================================================================== */

