chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define IDAC_1_CONTROL_OUPDT_Pos          (0UL)                     /*!< IDAC_1 CONTROL: OUPDT (Bit 0)                         */
#define IDAC_1_CONTROL_OUPDT_Msk          (0x7UL)                   /*!< IDAC_1 CONTROL: OUPDT (Bitfield-Mask: 0x07)           */
#define IDAC_1_CONTROL_ETRIG_Pos          (3UL)                     /*!< IDAC_1 CONTROL: ETRIG (Bit 3)                         */
#define IDAC_1_CONTROL_ETRIG_Msk          (0x38UL)                  /*!< IDAC_1 CONTROL: ETRIG (Bitfield-Mask: 0x07)           */
#define IDAC_1_CONTROL_OUTMD_Pos          (6UL)                     /*!< IDAC_1 CONTROL: OUTMD (Bit 6)                         */
#define IDAC_1_CONTROL_OUTMD_Msk          (0xc0UL)                  /*!< IDAC_1 CONTROL: OUTMD (Bitfield-Mask: 0x03)           */
#define IDAC_1_CONTROL_INFMT_Pos          (8UL)                     /*!< IDAC_1 CONTROL: INFMT (Bit 8)                         */
#define IDAC_1_CONTROL_INFMT_Msk          (0x300UL)                 /*!< IDAC_1 CONTROL: INFMT (Bitfield-Mask: 0x03)           */
#define IDAC_1_CONTROL_DMARUN_Pos         (10UL)                    /*!< IDAC_1 CONTROL: DMARUN (Bit 10)                       */
#define IDAC_1_CONTROL_DMARUN_Msk         (0x400UL)                 /*!< IDAC_1 CONTROL: DMARUN (Bitfield-Mask: 0x01)          */
#define IDAC_1_CONTROL_JSEL_Pos           (11UL)                    /*!< IDAC_1 CONTROL: JSEL (Bit 11)                         */
#define IDAC_1_CONTROL_JSEL_Msk           (0x800UL)                 /*!< IDAC_1 CONTROL: JSEL (Bitfield-Mask: 0x01)            */
#define IDAC_1_CONTROL_BUFRESET_Pos       (12UL)                    /*!< IDAC_1 CONTROL: BUFRESET (Bit 12)                     */
#define IDAC_1_CONTROL_BUFRESET_Msk       (0x1000UL)                /*!< IDAC_1 CONTROL: BUFRESET (Bitfield-Mask: 0x01)        */
#define IDAC_1_CONTROL_TRIGINH_Pos        (13UL)                    /*!< IDAC_1 CONTROL: TRIGINH (Bit 13)                      */
#define IDAC_1_CONTROL_TRIGINH_Msk        (0x2000UL)                /*!< IDAC_1 CONTROL: TRIGINH (Bitfield-Mask: 0x01)         */
#define IDAC_1_CONTROL_WRAPEN_Pos         (16UL)                    /*!< IDAC_1 CONTROL: WRAPEN (Bit 16)                       */
#define IDAC_1_CONTROL_WRAPEN_Msk         (0x10000UL)               /*!< IDAC_1 CONTROL: WRAPEN (Bitfield-Mask: 0x01)          */
#define IDAC_1_CONTROL_ORIEN_Pos          (20UL)                    /*!< IDAC_1 CONTROL: ORIEN (Bit 20)                        */
#define IDAC_1_CONTROL_ORIEN_Msk          (0x100000UL)              /*!< IDAC_1 CONTROL: ORIEN (Bitfield-Mask: 0x01)           */
#define IDAC_1_CONTROL_URIEN_Pos          (21UL)                    /*!< IDAC_1 CONTROL: URIEN (Bit 21)                        */
#define IDAC_1_CONTROL_URIEN_Msk          (0x200000UL)              /*!< IDAC_1 CONTROL: URIEN (Bitfield-Mask: 0x01)           */
#define IDAC_1_CONTROL_WEIEN_Pos          (22UL)                    /*!< IDAC_1 CONTROL: WEIEN (Bit 22)                        */
#define IDAC_1_CONTROL_WEIEN_Msk          (0x400000UL)              /*!< IDAC_1 CONTROL: WEIEN (Bitfield-Mask: 0x01)           */
#define IDAC_1_CONTROL_DBGMD_Pos          (29UL)                    /*!< IDAC_1 CONTROL: DBGMD (Bit 29)                        */
#define IDAC_1_CONTROL_DBGMD_Msk          (0x20000000UL)            /*!< IDAC_1 CONTROL: DBGMD (Bitfield-Mask: 0x01)           */
#define IDAC_1_CONTROL_LOADEN_Pos         (30UL)                    /*!< IDAC_1 CONTROL: LOADEN (Bit 30)                       */
#define IDAC_1_CONTROL_LOADEN_Msk         (0x40000000UL)            /*!< IDAC_1 CONTROL: LOADEN (Bitfield-Mask: 0x01)          */
#define IDAC_1_CONTROL_IDACEN_Pos         (31UL)                    /*!< IDAC_1 CONTROL: IDACEN (Bit 31)                       */
#define IDAC_1_CONTROL_IDACEN_Msk         (0x80000000UL)            /*!< IDAC_1 CONTROL: IDACEN (Bitfield-Mask: 0x01)          */
/* =========================================================  DATA  ========================================================== */
#define IDAC_1_DATA_DATA_Pos              (0UL)                     /*!< IDAC_1 DATA: DATA (Bit 0)                             */
#define IDAC_1_DATA_DATA_Msk              (0xffffffffUL)            /*!< IDAC_1 DATA: DATA (Bitfield-Mask: 0xffffffff)         */
/* =======================================================  BUFSTATUS  ======================================================= */
#define IDAC_1_BUFSTATUS_LEVEL_Pos        (0UL)                     /*!< IDAC_1 BUFSTATUS: LEVEL (Bit 0)                       */
#define IDAC_1_BUFSTATUS_LEVEL_Msk        (0x7UL)                   /*!< IDAC_1 BUFSTATUS: LEVEL (Bitfield-Mask: 0x07)         */
#define IDAC_1_BUFSTATUS_ORI_Pos          (4UL)                     /*!< IDAC_1 BUFSTATUS: ORI (Bit 4)                         */
#define IDAC_1_BUFSTATUS_ORI_Msk          (0x10UL)                  /*!< IDAC_1 BUFSTATUS: ORI (Bitfield-Mask: 0x01)           */
#define IDAC_1_BUFSTATUS_URI_Pos          (5UL)                     /*!< IDAC_1 BUFSTATUS: URI (Bit 5)                         */
#define IDAC_1_BUFSTATUS_URI_Msk          (0x20UL)                  /*!< IDAC_1 BUFSTATUS: URI (Bitfield-Mask: 0x01)           */
#define IDAC_1_BUFSTATUS_WEI_Pos          (6UL)                     /*!< IDAC_1 BUFSTATUS: WEI (Bit 6)                         */
#define IDAC_1_BUFSTATUS_WEI_Msk          (0x40UL)                  /*!< IDAC_1 BUFSTATUS: WEI (Bitfield-Mask: 0x01)           */
/* =======================================================  BUFFER10  ======================================================== */
#define IDAC_1_BUFFER10_BUFFER0_Pos       (0UL)                     /*!< IDAC_1 BUFFER10: BUFFER0 (Bit 0)                      */
#define IDAC_1_BUFFER10_BUFFER0_Msk       (0xffffUL)                /*!< IDAC_1 BUFFER10: BUFFER0 (Bitfield-Mask: 0xffff)      */
#define IDAC_1_BUFFER10_BUFFER1_Pos       (16UL)                    /*!< IDAC_1 BUFFER10: BUFFER1 (Bit 16)                     */
#define IDAC_1_BUFFER10_BUFFER1_Msk       (0xffff0000UL)            /*!< IDAC_1 BUFFER10: BUFFER1 (Bitfield-Mask: 0xffff)      */
/* =======================================================  BUFFER32  ======================================================== */
#define IDAC_1_BUFFER32_BUFFER2_Pos       (0UL)                     /*!< IDAC_1 BUFFER32: BUFFER2 (Bit 0)                      */
#define IDAC_1_BUFFER32_BUFFER2_Msk       (0xffffUL)                /*!< IDAC_1 BUFFER32: BUFFER2 (Bitfield-Mask: 0xffff)      */
#define IDAC_1_BUFFER32_BUFFER3_Pos       (16UL)                    /*!< IDAC_1 BUFFER32: BUFFER3 (Bit 16)                     */
#define IDAC_1_BUFFER32_BUFFER3_Msk       (0xffff0000UL)            /*!< IDAC_1 BUFFER32: BUFFER3 (Bitfield-Mask: 0xffff)      */
/* ========================================================  GAINADJ  ======================================================== */
#define IDAC_1_GAINADJ_GAINADJ_Pos        (0UL)                     /*!< IDAC_1 GAINADJ: GAINADJ (Bit 0)                       */
#define IDAC_1_GAINADJ_GAINADJ_Msk        (0x1fUL)                  /*!< IDAC_1 GAINADJ: GAINADJ (Bitfield-Mask: 0x1f)         */


/* =========================================================================================================================== */
/* ================                                           IVC_0                                           ================ */
/* =========================================================================================================================== */

