chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define IVC_0_CONTROL_IN0RANGE_Pos        (0UL)                     /*!< IVC_0 CONTROL: IN0RANGE (Bit 0)                       */
#define IVC_0_CONTROL_IN0RANGE_Msk        (0x7UL)                   /*!< IVC_0 CONTROL: IN0RANGE (Bitfield-Mask: 0x07)         */
#define IVC_0_CONTROL_IN1RANGE_Pos        (4UL)                     /*!< IVC_0 CONTROL: IN1RANGE (Bit 4)                       */
#define IVC_0_CONTROL_IN1RANGE_Msk        (0x70UL)                  /*!< IVC_0 CONTROL: IN1RANGE (Bitfield-Mask: 0x07)         */
#define IVC_0_CONTROL_C0EN_Pos            (30UL)                    /*!< IVC_0 CONTROL: C0EN (Bit 30)                          */
#define IVC_0_CONTROL_C0EN_Msk            (0x40000000UL)            /*!< IVC_0 CONTROL: C0EN (Bitfield-Mask: 0x01)             */
#define IVC_0_CONTROL_C1EN_Pos            (31UL)                    /*!< IVC_0 CONTROL: C1EN (Bit 31)                          */
#define IVC_0_CONTROL_C1EN_Msk            (0x80000000UL)            /*!< IVC_0 CONTROL: C1EN (Bitfield-Mask: 0x01)             */


/* =========================================================================================================================== */
/* ================                                          LOCK_0                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  KEY  ========================================================== */
#define LOCK_0_KEY_KEY_Pos                (0UL)                     /*!< LOCK_0 KEY: KEY (Bit 0)                               */
#define LOCK_0_KEY_KEY_Msk                (0xffUL)                  /*!< LOCK_0 KEY: KEY (Bitfield-Mask: 0xff)                 */
/* ======================================================  PERIPHLOCK0  ====================================================== */
#define LOCK_0_PERIPHLOCK0_USARTL_Pos     (0UL)                     /*!< LOCK_0 PERIPHLOCK0: USARTL (Bit 0)                    */
#define LOCK_0_PERIPHLOCK0_USARTL_Msk     (0x1UL)                   /*!< LOCK_0 PERIPHLOCK0: USARTL (Bitfield-Mask: 0x01)      */
#define LOCK_0_PERIPHLOCK0_SPIL_Pos       (1UL)                     /*!< LOCK_0 PERIPHLOCK0: SPIL (Bit 1)                      */
#define LOCK_0_PERIPHLOCK0_SPIL_Msk       (0x2UL)                   /*!< LOCK_0 PERIPHLOCK0: SPIL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_I2CL_Pos       (2UL)                     /*!< LOCK_0 PERIPHLOCK0: I2CL (Bit 2)                      */
#define LOCK_0_PERIPHLOCK0_I2CL_Msk       (0x4UL)                   /*!< LOCK_0 PERIPHLOCK0: I2CL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_PCAL_Pos       (3UL)                     /*!< LOCK_0 PERIPHLOCK0: PCAL (Bit 3)                      */
#define LOCK_0_PERIPHLOCK0_PCAL_Msk       (0x8UL)                   /*!< LOCK_0 PERIPHLOCK0: PCAL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_TIMERL_Pos     (4UL)                     /*!< LOCK_0 PERIPHLOCK0: TIMERL (Bit 4)                    */
#define LOCK_0_PERIPHLOCK0_TIMERL_Msk     (0x10UL)                  /*!< LOCK_0 PERIPHLOCK0: TIMERL (Bitfield-Mask: 0x01)      */
#define LOCK_0_PERIPHLOCK0_USBL_Pos       (5UL)                     /*!< LOCK_0 PERIPHLOCK0: USBL (Bit 5)                      */
#define LOCK_0_PERIPHLOCK0_USBL_Msk       (0x20UL)                  /*!< LOCK_0 PERIPHLOCK0: USBL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_SARADCL_Pos    (6UL)                     /*!< LOCK_0 PERIPHLOCK0: SARADCL (Bit 6)                   */
#define LOCK_0_PERIPHLOCK0_SARADCL_Msk    (0x40UL)                  /*!< LOCK_0 PERIPHLOCK0: SARADCL (Bitfield-Mask: 0x01)     */
#define LOCK_0_PERIPHLOCK0_SSGL_Pos       (7UL)                     /*!< LOCK_0 PERIPHLOCK0: SSGL (Bit 7)                      */
#define LOCK_0_PERIPHLOCK0_SSGL_Msk       (0x80UL)                  /*!< LOCK_0 PERIPHLOCK0: SSGL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_CMPL_Pos       (8UL)                     /*!< LOCK_0 PERIPHLOCK0: CMPL (Bit 8)                      */
#define LOCK_0_PERIPHLOCK0_CMPL_Msk       (0x100UL)                 /*!< LOCK_0 PERIPHLOCK0: CMPL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_CSL_Pos        (9UL)                     /*!< LOCK_0 PERIPHLOCK0: CSL (Bit 9)                       */
#define LOCK_0_PERIPHLOCK0_CSL_Msk        (0x200UL)                 /*!< LOCK_0 PERIPHLOCK0: CSL (Bitfield-Mask: 0x01)         */
#define LOCK_0_PERIPHLOCK0_EMIFL_Pos      (10UL)                    /*!< LOCK_0 PERIPHLOCK0: EMIFL (Bit 10)                    */
#define LOCK_0_PERIPHLOCK0_EMIFL_Msk      (0x400UL)                 /*!< LOCK_0 PERIPHLOCK0: EMIFL (Bitfield-Mask: 0x01)       */
#define LOCK_0_PERIPHLOCK0_AESL_Pos       (11UL)                    /*!< LOCK_0 PERIPHLOCK0: AESL (Bit 11)                     */
#define LOCK_0_PERIPHLOCK0_AESL_Msk       (0x800UL)                 /*!< LOCK_0 PERIPHLOCK0: AESL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_CRCL_Pos       (12UL)                    /*!< LOCK_0 PERIPHLOCK0: CRCL (Bit 12)                     */
#define LOCK_0_PERIPHLOCK0_CRCL_Msk       (0x1000UL)                /*!< LOCK_0 PERIPHLOCK0: CRCL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_RTCL_Pos       (13UL)                    /*!< LOCK_0 PERIPHLOCK0: RTCL (Bit 13)                     */
#define LOCK_0_PERIPHLOCK0_RTCL_Msk       (0x2000UL)                /*!< LOCK_0 PERIPHLOCK0: RTCL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_CLKRSTL_Pos    (14UL)                    /*!< LOCK_0 PERIPHLOCK0: CLKRSTL (Bit 14)                  */
#define LOCK_0_PERIPHLOCK0_CLKRSTL_Msk    (0x4000UL)                /*!< LOCK_0 PERIPHLOCK0: CLKRSTL (Bitfield-Mask: 0x01)     */
#define LOCK_0_PERIPHLOCK0_VMONL_Pos      (15UL)                    /*!< LOCK_0 PERIPHLOCK0: VMONL (Bit 15)                    */
#define LOCK_0_PERIPHLOCK0_VMONL_Msk      (0x8000UL)                /*!< LOCK_0 PERIPHLOCK0: VMONL (Bitfield-Mask: 0x01)       */
#define LOCK_0_PERIPHLOCK0_IDACL_Pos      (16UL)                    /*!< LOCK_0 PERIPHLOCK0: IDACL (Bit 16)                    */
#define LOCK_0_PERIPHLOCK0_IDACL_Msk      (0x10000UL)               /*!< LOCK_0 PERIPHLOCK0: IDACL (Bitfield-Mask: 0x01)       */
#define LOCK_0_PERIPHLOCK0_DMACTRLL_Pos   (17UL)                    /*!< LOCK_0 PERIPHLOCK0: DMACTRLL (Bit 17)                 */
#define LOCK_0_PERIPHLOCK0_DMACTRLL_Msk   (0x20000UL)               /*!< LOCK_0 PERIPHLOCK0: DMACTRLL (Bitfield-Mask: 0x01)    */
#define LOCK_0_PERIPHLOCK0_DMAXBARL_Pos   (18UL)                    /*!< LOCK_0 PERIPHLOCK0: DMAXBARL (Bit 18)                 */
#define LOCK_0_PERIPHLOCK0_DMAXBARL_Msk   (0x40000UL)               /*!< LOCK_0 PERIPHLOCK0: DMAXBARL (Bitfield-Mask: 0x01)    */
#define LOCK_0_PERIPHLOCK0_LPTL_Pos       (19UL)                    /*!< LOCK_0 PERIPHLOCK0: LPTL (Bit 19)                     */
#define LOCK_0_PERIPHLOCK0_LPTL_Msk       (0x80000UL)               /*!< LOCK_0 PERIPHLOCK0: LPTL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_VREFL_Pos      (20UL)                    /*!< LOCK_0 PERIPHLOCK0: VREFL (Bit 20)                    */
#define LOCK_0_PERIPHLOCK0_VREFL_Msk      (0x100000UL)              /*!< LOCK_0 PERIPHLOCK0: VREFL (Bitfield-Mask: 0x01)       */
#define LOCK_0_PERIPHLOCK0_I2SL_Pos       (21UL)                    /*!< LOCK_0 PERIPHLOCK0: I2SL (Bit 21)                     */
#define LOCK_0_PERIPHLOCK0_I2SL_Msk       (0x200000UL)              /*!< LOCK_0 PERIPHLOCK0: I2SL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_PLLL_Pos       (22UL)                    /*!< LOCK_0 PERIPHLOCK0: PLLL (Bit 22)                     */
#define LOCK_0_PERIPHLOCK0_PLLL_Msk       (0x400000UL)              /*!< LOCK_0 PERIPHLOCK0: PLLL (Bitfield-Mask: 0x01)        */
#define LOCK_0_PERIPHLOCK0_EXTOSCL_Pos    (23UL)                    /*!< LOCK_0 PERIPHLOCK0: EXTOSCL (Bit 23)                  */
#define LOCK_0_PERIPHLOCK0_EXTOSCL_Msk    (0x800000UL)              /*!< LOCK_0 PERIPHLOCK0: EXTOSCL (Bitfield-Mask: 0x01)     */
#define LOCK_0_PERIPHLOCK0_VREGL_Pos      (24UL)                    /*!< LOCK_0 PERIPHLOCK0: VREGL (Bit 24)                    */
#define LOCK_0_PERIPHLOCK0_VREGL_Msk      (0x1000000UL)             /*!< LOCK_0 PERIPHLOCK0: VREGL (Bitfield-Mask: 0x01)       */
#define LOCK_0_PERIPHLOCK0_LPOSCL_Pos     (25UL)                    /*!< LOCK_0 PERIPHLOCK0: LPOSCL (Bit 25)                   */
#define LOCK_0_PERIPHLOCK0_LPOSCL_Msk     (0x2000000UL)             /*!< LOCK_0 PERIPHLOCK0: LPOSCL (Bitfield-Mask: 0x01)      */
#define LOCK_0_PERIPHLOCK0_EVREGL_Pos     (26UL)                    /*!< LOCK_0 PERIPHLOCK0: EVREGL (Bit 26)                   */
#define LOCK_0_PERIPHLOCK0_EVREGL_Msk     (0x4000000UL)             /*!< LOCK_0 PERIPHLOCK0: EVREGL (Bitfield-Mask: 0x01)      */
#define LOCK_0_PERIPHLOCK0_IVCL_Pos       (28UL)                    /*!< LOCK_0 PERIPHLOCK0: IVCL (Bit 28)                     */
#define LOCK_0_PERIPHLOCK0_IVCL_Msk       (0x10000000UL)            /*!< LOCK_0 PERIPHLOCK0: IVCL (Bitfield-Mask: 0x01)        */
/* ======================================================  PERIPHLOCK1  ====================================================== */
#define LOCK_0_PERIPHLOCK1_PMUL_Pos       (0UL)                     /*!< LOCK_0 PERIPHLOCK1: PMUL (Bit 0)                      */
#define LOCK_0_PERIPHLOCK1_PMUL_Msk       (0x1UL)                   /*!< LOCK_0 PERIPHLOCK1: PMUL (Bitfield-Mask: 0x01)        */


/* =========================================================================================================================== */
/* ================                                         LPTIMER_0                                         ================ */
/* =========================================================================================================================== */

