chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define LPTIMER_0_CONTROL_CMD_Pos         (0UL)                     /*!< LPTIMER_0 CONTROL: CMD (Bit 0)                        */
#define LPTIMER_0_CONTROL_CMD_Msk         (0x3UL)                   /*!< LPTIMER_0 CONTROL: CMD (Bitfield-Mask: 0x03)          */
#define LPTIMER_0_CONTROL_EXTSEL_Pos      (4UL)                     /*!< LPTIMER_0 CONTROL: EXTSEL (Bit 4)                     */
#define LPTIMER_0_CONTROL_EXTSEL_Msk      (0xf0UL)                  /*!< LPTIMER_0 CONTROL: EXTSEL (Bitfield-Mask: 0x0f)       */
#define LPTIMER_0_CONTROL_TMRSET_Pos      (8UL)                     /*!< LPTIMER_0 CONTROL: TMRSET (Bit 8)                     */
#define LPTIMER_0_CONTROL_TMRSET_Msk      (0x100UL)                 /*!< LPTIMER_0 CONTROL: TMRSET (Bitfield-Mask: 0x01)       */
#define LPTIMER_0_CONTROL_TMRCAP_Pos      (9UL)                     /*!< LPTIMER_0 CONTROL: TMRCAP (Bit 9)                     */
#define LPTIMER_0_CONTROL_TMRCAP_Msk      (0x200UL)                 /*!< LPTIMER_0 CONTROL: TMRCAP (Bitfield-Mask: 0x01)       */
#define LPTIMER_0_CONTROL_CMPSET_Pos      (10UL)                    /*!< LPTIMER_0 CONTROL: CMPSET (Bit 10)                    */
#define LPTIMER_0_CONTROL_CMPSET_Msk      (0x400UL)                 /*!< LPTIMER_0 CONTROL: CMPSET (Bitfield-Mask: 0x01)       */
#define LPTIMER_0_CONTROL_CMPCAP_Pos      (11UL)                    /*!< LPTIMER_0 CONTROL: CMPCAP (Bit 11)                    */
#define LPTIMER_0_CONTROL_CMPCAP_Msk      (0x800UL)                 /*!< LPTIMER_0 CONTROL: CMPCAP (Bitfield-Mask: 0x01)       */
#define LPTIMER_0_CONTROL_OVFIEN_Pos      (16UL)                    /*!< LPTIMER_0 CONTROL: OVFIEN (Bit 16)                    */
#define LPTIMER_0_CONTROL_OVFIEN_Msk      (0x10000UL)               /*!< LPTIMER_0 CONTROL: OVFIEN (Bitfield-Mask: 0x01)       */
#define LPTIMER_0_CONTROL_CMPIEN_Pos      (17UL)                    /*!< LPTIMER_0 CONTROL: CMPIEN (Bit 17)                    */
#define LPTIMER_0_CONTROL_CMPIEN_Msk      (0x20000UL)               /*!< LPTIMER_0 CONTROL: CMPIEN (Bitfield-Mask: 0x01)       */
#define LPTIMER_0_CONTROL_OVFTMD_Pos      (18UL)                    /*!< LPTIMER_0 CONTROL: OVFTMD (Bit 18)                    */
#define LPTIMER_0_CONTROL_OVFTMD_Msk      (0x40000UL)               /*!< LPTIMER_0 CONTROL: OVFTMD (Bitfield-Mask: 0x01)       */
#define LPTIMER_0_CONTROL_CMPTMD_Pos      (19UL)                    /*!< LPTIMER_0 CONTROL: CMPTMD (Bit 19)                    */
#define LPTIMER_0_CONTROL_CMPTMD_Msk      (0x80000UL)               /*!< LPTIMER_0 CONTROL: CMPTMD (Bitfield-Mask: 0x01)       */
#define LPTIMER_0_CONTROL_CMPRSTEN_Pos    (24UL)                    /*!< LPTIMER_0 CONTROL: CMPRSTEN (Bit 24)                  */
#define LPTIMER_0_CONTROL_CMPRSTEN_Msk    (0x1000000UL)             /*!< LPTIMER_0 CONTROL: CMPRSTEN (Bitfield-Mask: 0x01)     */
#define LPTIMER_0_CONTROL_DBGMD_Pos       (30UL)                    /*!< LPTIMER_0 CONTROL: DBGMD (Bit 30)                     */
#define LPTIMER_0_CONTROL_DBGMD_Msk       (0x40000000UL)            /*!< LPTIMER_0 CONTROL: DBGMD (Bitfield-Mask: 0x01)        */
#define LPTIMER_0_CONTROL_RUN_Pos         (31UL)                    /*!< LPTIMER_0 CONTROL: RUN (Bit 31)                       */
#define LPTIMER_0_CONTROL_RUN_Msk         (0x80000000UL)            /*!< LPTIMER_0 CONTROL: RUN (Bitfield-Mask: 0x01)          */
/* =========================================================  DATA  ========================================================== */
#define LPTIMER_0_DATA_DATA_Pos           (0UL)                     /*!< LPTIMER_0 DATA: DATA (Bit 0)                          */
#define LPTIMER_0_DATA_DATA_Msk           (0xffffUL)                /*!< LPTIMER_0 DATA: DATA (Bitfield-Mask: 0xffff)          */
/* ========================================================  STATUS  ========================================================= */
#define LPTIMER_0_STATUS_OVFI_Pos         (0UL)                     /*!< LPTIMER_0 STATUS: OVFI (Bit 0)                        */
#define LPTIMER_0_STATUS_OVFI_Msk         (0x1UL)                   /*!< LPTIMER_0 STATUS: OVFI (Bitfield-Mask: 0x01)          */
#define LPTIMER_0_STATUS_CMPI_Pos         (1UL)                     /*!< LPTIMER_0 STATUS: CMPI (Bit 1)                        */
#define LPTIMER_0_STATUS_CMPI_Msk         (0x2UL)                   /*!< LPTIMER_0 STATUS: CMPI (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                           PLL_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  DIVIDER  ======================================================== */
#define PLL_0_DIVIDER_M_Pos               (0UL)                     /*!< PLL_0 DIVIDER: M (Bit 0)                              */
#define PLL_0_DIVIDER_M_Msk               (0xfffUL)                 /*!< PLL_0 DIVIDER: M (Bitfield-Mask: 0xfff)               */
#define PLL_0_DIVIDER_N_Pos               (16UL)                    /*!< PLL_0 DIVIDER: N (Bit 16)                             */
#define PLL_0_DIVIDER_N_Msk               (0xfff0000UL)             /*!< PLL_0 DIVIDER: N (Bitfield-Mask: 0xfff)               */
/* ========================================================  CONTROL  ======================================================== */
#define PLL_0_CONTROL_LLMTF_Pos           (0UL)                     /*!< PLL_0 CONTROL: LLMTF (Bit 0)                          */
#define PLL_0_CONTROL_LLMTF_Msk           (0x1UL)                   /*!< PLL_0 CONTROL: LLMTF (Bitfield-Mask: 0x01)            */
#define PLL_0_CONTROL_HLMTF_Pos           (1UL)                     /*!< PLL_0 CONTROL: HLMTF (Bit 1)                          */
#define PLL_0_CONTROL_HLMTF_Msk           (0x2UL)                   /*!< PLL_0 CONTROL: HLMTF (Bitfield-Mask: 0x01)            */
#define PLL_0_CONTROL_LCKI_Pos            (2UL)                     /*!< PLL_0 CONTROL: LCKI (Bit 2)                           */
#define PLL_0_CONTROL_LCKI_Msk            (0x4UL)                   /*!< PLL_0 CONTROL: LCKI (Bitfield-Mask: 0x01)             */
#define PLL_0_CONTROL_LMTIEN_Pos          (9UL)                     /*!< PLL_0 CONTROL: LMTIEN (Bit 9)                         */
#define PLL_0_CONTROL_LMTIEN_Msk          (0x200UL)                 /*!< PLL_0 CONTROL: LMTIEN (Bitfield-Mask: 0x01)           */
#define PLL_0_CONTROL_LCKIEN_Pos          (10UL)                    /*!< PLL_0 CONTROL: LCKIEN (Bit 10)                        */
#define PLL_0_CONTROL_LCKIEN_Msk          (0x400UL)                 /*!< PLL_0 CONTROL: LCKIEN (Bitfield-Mask: 0x01)           */
#define PLL_0_CONTROL_LCKPOL_Pos          (11UL)                    /*!< PLL_0 CONTROL: LCKPOL (Bit 11)                        */
#define PLL_0_CONTROL_LCKPOL_Msk          (0x800UL)                 /*!< PLL_0 CONTROL: LCKPOL (Bitfield-Mask: 0x01)           */
#define PLL_0_CONTROL_REFSEL_Pos          (16UL)                    /*!< PLL_0 CONTROL: REFSEL (Bit 16)                        */
#define PLL_0_CONTROL_REFSEL_Msk          (0x30000UL)               /*!< PLL_0 CONTROL: REFSEL (Bitfield-Mask: 0x03)           */
#define PLL_0_CONTROL_LOCKTH_Pos          (20UL)                    /*!< PLL_0 CONTROL: LOCKTH (Bit 20)                        */
#define PLL_0_CONTROL_LOCKTH_Msk          (0x300000UL)              /*!< PLL_0 CONTROL: LOCKTH (Bitfield-Mask: 0x03)           */
#define PLL_0_CONTROL_STALL_Pos           (26UL)                    /*!< PLL_0 CONTROL: STALL (Bit 26)                         */
#define PLL_0_CONTROL_STALL_Msk           (0x4000000UL)             /*!< PLL_0 CONTROL: STALL (Bitfield-Mask: 0x01)            */
#define PLL_0_CONTROL_DITHEN_Pos          (28UL)                    /*!< PLL_0 CONTROL: DITHEN (Bit 28)                        */
#define PLL_0_CONTROL_DITHEN_Msk          (0x10000000UL)            /*!< PLL_0 CONTROL: DITHEN (Bitfield-Mask: 0x01)           */
#define PLL_0_CONTROL_EDGSEL_Pos          (29UL)                    /*!< PLL_0 CONTROL: EDGSEL (Bit 29)                        */
#define PLL_0_CONTROL_EDGSEL_Msk          (0x20000000UL)            /*!< PLL_0 CONTROL: EDGSEL (Bitfield-Mask: 0x01)           */
#define PLL_0_CONTROL_OUTMD_Pos           (30UL)                    /*!< PLL_0 CONTROL: OUTMD (Bit 30)                         */
#define PLL_0_CONTROL_OUTMD_Msk           (0xc0000000UL)            /*!< PLL_0 CONTROL: OUTMD (Bitfield-Mask: 0x03)            */
/* =========================================================  SSPR  ========================================================== */
#define PLL_0_SSPR_SSAMP_Pos              (0UL)                     /*!< PLL_0 SSPR: SSAMP (Bit 0)                             */
#define PLL_0_SSPR_SSAMP_Msk              (0x7UL)                   /*!< PLL_0 SSPR: SSAMP (Bitfield-Mask: 0x07)               */
#define PLL_0_SSPR_SSUINV_Pos             (8UL)                     /*!< PLL_0 SSPR: SSUINV (Bit 8)                            */
#define PLL_0_SSPR_SSUINV_Msk             (0x1f00UL)                /*!< PLL_0 SSPR: SSUINV (Bitfield-Mask: 0x1f)              */
/* =======================================================  CALCONFIG  ======================================================= */
#define PLL_0_CALCONFIG_DITHER_Pos        (0UL)                     /*!< PLL_0 CALCONFIG: DITHER (Bit 0)                       */
#define PLL_0_CALCONFIG_DITHER_Msk        (0xfUL)                   /*!< PLL_0 CALCONFIG: DITHER (Bitfield-Mask: 0x0f)         */
#define PLL_0_CALCONFIG_CAL_Pos           (4UL)                     /*!< PLL_0 CALCONFIG: CAL (Bit 4)                          */
#define PLL_0_CALCONFIG_CAL_Msk           (0xfff0UL)                /*!< PLL_0 CALCONFIG: CAL (Bitfield-Mask: 0xfff)           */
#define PLL_0_CALCONFIG_RANGE_Pos         (16UL)                    /*!< PLL_0 CALCONFIG: RANGE (Bit 16)                       */
#define PLL_0_CALCONFIG_RANGE_Msk         (0x70000UL)               /*!< PLL_0 CALCONFIG: RANGE (Bitfield-Mask: 0x07)          */


/* =========================================================================================================================== */
/* ================                                         EXTOSC_0                                          ================ */
/* =========================================================================================================================== */

