chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define EXTOSC_0_CONTROL_FREQCN_Pos       (0UL)                     /*!< EXTOSC_0 CONTROL: FREQCN (Bit 0)                      */
#define EXTOSC_0_CONTROL_FREQCN_Msk       (0x7UL)                   /*!< EXTOSC_0 CONTROL: FREQCN (Bitfield-Mask: 0x07)        */
#define EXTOSC_0_CONTROL_OSCVLDF_Pos      (3UL)                     /*!< EXTOSC_0 CONTROL: OSCVLDF (Bit 3)                     */
#define EXTOSC_0_CONTROL_OSCVLDF_Msk      (0x8UL)                   /*!< EXTOSC_0 CONTROL: OSCVLDF (Bitfield-Mask: 0x01)       */
#define EXTOSC_0_CONTROL_OSCMD_Pos        (4UL)                     /*!< EXTOSC_0 CONTROL: OSCMD (Bit 4)                       */
#define EXTOSC_0_CONTROL_OSCMD_Msk        (0x70UL)                  /*!< EXTOSC_0 CONTROL: OSCMD (Bitfield-Mask: 0x07)         */


/* =========================================================================================================================== */
/* ================                                          LPOSC_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  OSCVAL  ========================================================= */
#define LPOSC_0_OSCVAL_OSCVAL_Pos         (0UL)                     /*!< LPOSC_0 OSCVAL: OSCVAL (Bit 0)                        */
#define LPOSC_0_OSCVAL_OSCVAL_Msk         (0xfUL)                   /*!< LPOSC_0 OSCVAL: OSCVAL (Bitfield-Mask: 0x0f)          */


/* =========================================================================================================================== */
/* ================                                           PCA_0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  MODE  ========================================================== */
#define PCA_0_MODE_CLKDIV_Pos             (0UL)                     /*!< PCA_0 MODE: CLKDIV (Bit 0)                            */
#define PCA_0_MODE_CLKDIV_Msk             (0x3ffUL)                 /*!< PCA_0 MODE: CLKDIV (Bitfield-Mask: 0x3ff)             */
#define PCA_0_MODE_CLKSEL_Pos             (10UL)                    /*!< PCA_0 MODE: CLKSEL (Bit 10)                           */
#define PCA_0_MODE_CLKSEL_Msk             (0x1c00UL)                /*!< PCA_0 MODE: CLKSEL (Bitfield-Mask: 0x07)              */
/* ========================================================  CONTROL  ======================================================== */
#define PCA_0_CONTROL_OVFIEN_Pos          (0UL)                     /*!< PCA_0 CONTROL: OVFIEN (Bit 0)                         */
#define PCA_0_CONTROL_OVFIEN_Msk          (0x1UL)                   /*!< PCA_0 CONTROL: OVFIEN (Bitfield-Mask: 0x01)           */
#define PCA_0_CONTROL_DBGMD_Pos           (6UL)                     /*!< PCA_0 CONTROL: DBGMD (Bit 6)                          */
#define PCA_0_CONTROL_DBGMD_Msk           (0x40UL)                  /*!< PCA_0 CONTROL: DBGMD (Bitfield-Mask: 0x01)            */
#define PCA_0_CONTROL_DIVST_Pos           (21UL)                    /*!< PCA_0 CONTROL: DIVST (Bit 21)                         */
#define PCA_0_CONTROL_DIVST_Msk           (0x200000UL)              /*!< PCA_0 CONTROL: DIVST (Bitfield-Mask: 0x01)            */
#define PCA_0_CONTROL_DIV_Pos             (22UL)                    /*!< PCA_0 CONTROL: DIV (Bit 22)                           */
#define PCA_0_CONTROL_DIV_Msk             (0xffc00000UL)            /*!< PCA_0 CONTROL: DIV (Bitfield-Mask: 0x3ff)             */
/* ========================================================  STATUS  ========================================================= */
#define PCA_0_STATUS_C0CCI_Pos            (0UL)                     /*!< PCA_0 STATUS: C0CCI (Bit 0)                           */
#define PCA_0_STATUS_C0CCI_Msk            (0x1UL)                   /*!< PCA_0 STATUS: C0CCI (Bitfield-Mask: 0x01)             */
#define PCA_0_STATUS_C1CCI_Pos            (1UL)                     /*!< PCA_0 STATUS: C1CCI (Bit 1)                           */
#define PCA_0_STATUS_C1CCI_Msk            (0x2UL)                   /*!< PCA_0 STATUS: C1CCI (Bitfield-Mask: 0x01)             */
#define PCA_0_STATUS_RUN_Pos              (6UL)                     /*!< PCA_0 STATUS: RUN (Bit 6)                             */
#define PCA_0_STATUS_RUN_Msk              (0x40UL)                  /*!< PCA_0 STATUS: RUN (Bitfield-Mask: 0x01)               */
#define PCA_0_STATUS_OVFI_Pos             (7UL)                     /*!< PCA_0 STATUS: OVFI (Bit 7)                            */
#define PCA_0_STATUS_OVFI_Msk             (0x80UL)                  /*!< PCA_0 STATUS: OVFI (Bitfield-Mask: 0x01)              */
#define PCA_0_STATUS_C0IOVFI_Pos          (10UL)                    /*!< PCA_0 STATUS: C0IOVFI (Bit 10)                        */
#define PCA_0_STATUS_C0IOVFI_Msk          (0x400UL)                 /*!< PCA_0 STATUS: C0IOVFI (Bitfield-Mask: 0x01)           */
#define PCA_0_STATUS_C1IOVFI_Pos          (11UL)                    /*!< PCA_0 STATUS: C1IOVFI (Bit 11)                        */
#define PCA_0_STATUS_C1IOVFI_Msk          (0x800UL)                 /*!< PCA_0 STATUS: C1IOVFI (Bitfield-Mask: 0x01)           */
/* ========================================================  COUNTER  ======================================================== */
#define PCA_0_COUNTER_COUNTER_Pos         (0UL)                     /*!< PCA_0 COUNTER: COUNTER (Bit 0)                        */
#define PCA_0_COUNTER_COUNTER_Msk         (0xffffUL)                /*!< PCA_0 COUNTER: COUNTER (Bitfield-Mask: 0xffff)        */
/* =========================================================  LIMIT  ========================================================= */
#define PCA_0_LIMIT_LIMIT_Pos             (0UL)                     /*!< PCA_0 LIMIT: LIMIT (Bit 0)                            */
#define PCA_0_LIMIT_LIMIT_Msk             (0xffffUL)                /*!< PCA_0 LIMIT: LIMIT (Bitfield-Mask: 0xffff)            */
/* ========================================================  MODE_0  ========================================================= */
#define PCA_0_MODE_0_COSEL_Pos            (0UL)                     /*!< PCA_0 MODE_0: COSEL (Bit 0)                           */
#define PCA_0_MODE_0_COSEL_Msk            (0x3UL)                   /*!< PCA_0 MODE_0: COSEL (Bitfield-Mask: 0x03)             */
#define PCA_0_MODE_0_PWMMD_Pos            (2UL)                     /*!< PCA_0 MODE_0: PWMMD (Bit 2)                           */
#define PCA_0_MODE_0_PWMMD_Msk            (0x3cUL)                  /*!< PCA_0 MODE_0: PWMMD (Bitfield-Mask: 0x0f)             */
#define PCA_0_MODE_0_CMD_Pos              (8UL)                     /*!< PCA_0 MODE_0: CMD (Bit 8)                             */
#define PCA_0_MODE_0_CMD_Msk              (0x700UL)                 /*!< PCA_0 MODE_0: CMD (Bitfield-Mask: 0x07)               */
/* =======================================================  CONTROL_0  ======================================================= */
#define PCA_0_CONTROL_0_COUTST_Pos        (0UL)                     /*!< PCA_0 CONTROL_0: COUTST (Bit 0)                       */
#define PCA_0_CONTROL_0_COUTST_Msk        (0x1UL)                   /*!< PCA_0 CONTROL_0: COUTST (Bitfield-Mask: 0x01)         */
#define PCA_0_CONTROL_0_CPCAPEN_Pos       (1UL)                     /*!< PCA_0 CONTROL_0: CPCAPEN (Bit 1)                      */
#define PCA_0_CONTROL_0_CPCAPEN_Msk       (0x2UL)                   /*!< PCA_0 CONTROL_0: CPCAPEN (Bitfield-Mask: 0x01)        */
#define PCA_0_CONTROL_0_CNCAPEN_Pos       (2UL)                     /*!< PCA_0 CONTROL_0: CNCAPEN (Bit 2)                      */
#define PCA_0_CONTROL_0_CNCAPEN_Msk       (0x4UL)                   /*!< PCA_0 CONTROL_0: CNCAPEN (Bitfield-Mask: 0x01)        */
#define PCA_0_CONTROL_0_CUPDCF_Pos        (3UL)                     /*!< PCA_0 CONTROL_0: CUPDCF (Bit 3)                       */
#define PCA_0_CONTROL_0_CUPDCF_Msk        (0x8UL)                   /*!< PCA_0 CONTROL_0: CUPDCF (Bitfield-Mask: 0x01)         */
#define PCA_0_CONTROL_0_CCIEN_Pos         (8UL)                     /*!< PCA_0 CONTROL_0: CCIEN (Bit 8)                        */
#define PCA_0_CONTROL_0_CCIEN_Msk         (0x100UL)                 /*!< PCA_0 CONTROL_0: CCIEN (Bitfield-Mask: 0x01)          */
#define PCA_0_CONTROL_0_CIOVFIEN_Pos      (11UL)                    /*!< PCA_0 CONTROL_0: CIOVFIEN (Bit 11)                    */
#define PCA_0_CONTROL_0_CIOVFIEN_Msk      (0x800UL)                 /*!< PCA_0 CONTROL_0: CIOVFIEN (Bitfield-Mask: 0x01)       */
/* ========================================================  CCAPV_0  ======================================================== */
#define PCA_0_CCAPV_0_CCAPV_Pos           (0UL)                     /*!< PCA_0 CCAPV_0: CCAPV (Bit 0)                          */
#define PCA_0_CCAPV_0_CCAPV_Msk           (0x3ffffUL)               /*!< PCA_0 CCAPV_0: CCAPV (Bitfield-Mask: 0x3ffff)         */
/* ======================================================  CCAPVUPD_0  ======================================================= */
#define PCA_0_CCAPVUPD_0_CCAPVUPD_Pos     (0UL)                     /*!< PCA_0 CCAPVUPD_0: CCAPVUPD (Bit 0)                    */
#define PCA_0_CCAPVUPD_0_CCAPVUPD_Msk     (0x3ffffUL)               /*!< PCA_0 CCAPVUPD_0: CCAPVUPD (Bitfield-Mask: 0x3ffff)   */
/* ========================================================  MODE_1  ========================================================= */
#define PCA_0_MODE_1_COSEL_Pos            (0UL)                     /*!< PCA_0 MODE_1: COSEL (Bit 0)                           */
#define PCA_0_MODE_1_COSEL_Msk            (0x3UL)                   /*!< PCA_0 MODE_1: COSEL (Bitfield-Mask: 0x03)             */
#define PCA_0_MODE_1_PWMMD_Pos            (2UL)                     /*!< PCA_0 MODE_1: PWMMD (Bit 2)                           */
#define PCA_0_MODE_1_PWMMD_Msk            (0x3cUL)                  /*!< PCA_0 MODE_1: PWMMD (Bitfield-Mask: 0x0f)             */
#define PCA_0_MODE_1_CMD_Pos              (8UL)                     /*!< PCA_0 MODE_1: CMD (Bit 8)                             */
#define PCA_0_MODE_1_CMD_Msk              (0x700UL)                 /*!< PCA_0 MODE_1: CMD (Bitfield-Mask: 0x07)               */
/* =======================================================  CONTROL_1  ======================================================= */
#define PCA_0_CONTROL_1_COUTST_Pos        (0UL)                     /*!< PCA_0 CONTROL_1: COUTST (Bit 0)                       */
#define PCA_0_CONTROL_1_COUTST_Msk        (0x1UL)                   /*!< PCA_0 CONTROL_1: COUTST (Bitfield-Mask: 0x01)         */
#define PCA_0_CONTROL_1_CPCAPEN_Pos       (1UL)                     /*!< PCA_0 CONTROL_1: CPCAPEN (Bit 1)                      */
#define PCA_0_CONTROL_1_CPCAPEN_Msk       (0x2UL)                   /*!< PCA_0 CONTROL_1: CPCAPEN (Bitfield-Mask: 0x01)        */
#define PCA_0_CONTROL_1_CNCAPEN_Pos       (2UL)                     /*!< PCA_0 CONTROL_1: CNCAPEN (Bit 2)                      */
#define PCA_0_CONTROL_1_CNCAPEN_Msk       (0x4UL)                   /*!< PCA_0 CONTROL_1: CNCAPEN (Bitfield-Mask: 0x01)        */
#define PCA_0_CONTROL_1_CUPDCF_Pos        (3UL)                     /*!< PCA_0 CONTROL_1: CUPDCF (Bit 3)                       */
#define PCA_0_CONTROL_1_CUPDCF_Msk        (0x8UL)                   /*!< PCA_0 CONTROL_1: CUPDCF (Bitfield-Mask: 0x01)         */
#define PCA_0_CONTROL_1_CCIEN_Pos         (8UL)                     /*!< PCA_0 CONTROL_1: CCIEN (Bit 8)                        */
#define PCA_0_CONTROL_1_CCIEN_Msk         (0x100UL)                 /*!< PCA_0 CONTROL_1: CCIEN (Bitfield-Mask: 0x01)          */
#define PCA_0_CONTROL_1_CIOVFIEN_Pos      (11UL)                    /*!< PCA_0 CONTROL_1: CIOVFIEN (Bit 11)                    */
#define PCA_0_CONTROL_1_CIOVFIEN_Msk      (0x800UL)                 /*!< PCA_0 CONTROL_1: CIOVFIEN (Bitfield-Mask: 0x01)       */
/* ========================================================  CCAPV_1  ======================================================== */
#define PCA_0_CCAPV_1_CCAPV_Pos           (0UL)                     /*!< PCA_0 CCAPV_1: CCAPV (Bit 0)                          */
#define PCA_0_CCAPV_1_CCAPV_Msk           (0x3ffffUL)               /*!< PCA_0 CCAPV_1: CCAPV (Bitfield-Mask: 0x3ffff)         */
/* ======================================================  CCAPVUPD_1  ======================================================= */
#define PCA_0_CCAPVUPD_1_CCAPVUPD_Pos     (0UL)                     /*!< PCA_0 CCAPVUPD_1: CCAPVUPD (Bit 0)                    */
#define PCA_0_CCAPVUPD_1_CCAPVUPD_Msk     (0x3ffffUL)               /*!< PCA_0 CCAPVUPD_1: CCAPVUPD (Bitfield-Mask: 0x3ffff)   */


/* =========================================================================================================================== */
/* ================                                           PCA_1                                           ================ */
/* =========================================================================================================================== */

