chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define PMU_0_CONTROL_WAKECLR_Pos         (0UL)                     /*!< PMU_0 CONTROL: WAKECLR (Bit 0)                        */
#define PMU_0_CONTROL_WAKECLR_Msk         (0x1UL)                   /*!< PMU_0 CONTROL: WAKECLR (Bitfield-Mask: 0x01)          */
#define PMU_0_CONTROL_PERILPEN_Pos        (1UL)                     /*!< PMU_0 CONTROL: PERILPEN (Bit 1)                       */
#define PMU_0_CONTROL_PERILPEN_Msk        (0x2UL)                   /*!< PMU_0 CONTROL: PERILPEN (Bitfield-Mask: 0x01)         */
#define PMU_0_CONTROL_PINLPEN_Pos         (2UL)                     /*!< PMU_0 CONTROL: PINLPEN (Bit 2)                        */
#define PMU_0_CONTROL_PINLPEN_Msk         (0x4UL)                   /*!< PMU_0 CONTROL: PINLPEN (Bitfield-Mask: 0x01)          */
#define PMU_0_CONTROL_PWAKEEN_Pos         (3UL)                     /*!< PMU_0 CONTROL: PWAKEEN (Bit 3)                        */
#define PMU_0_CONTROL_PWAKEEN_Msk         (0x8UL)                   /*!< PMU_0 CONTROL: PWAKEEN (Bitfield-Mask: 0x01)          */
#define PMU_0_CONTROL_PMUASLPEN_Pos       (4UL)                     /*!< PMU_0 CONTROL: PMUASLPEN (Bit 4)                      */
#define PMU_0_CONTROL_PMUASLPEN_Msk       (0x10UL)                  /*!< PMU_0 CONTROL: PMUASLPEN (Bitfield-Mask: 0x01)        */
/* ========================================================  CONFIG  ========================================================= */
#define PMU_0_CONFIG_RTC0FREN_Pos         (8UL)                     /*!< PMU_0 CONFIG: RTC0FREN (Bit 8)                        */
#define PMU_0_CONFIG_RTC0FREN_Msk         (0x100UL)                 /*!< PMU_0 CONFIG: RTC0FREN (Bitfield-Mask: 0x01)          */
#define PMU_0_CONFIG_RTC0AREN_Pos         (9UL)                     /*!< PMU_0 CONFIG: RTC0AREN (Bit 9)                        */
#define PMU_0_CONFIG_RTC0AREN_Msk         (0x200UL)                 /*!< PMU_0 CONFIG: RTC0AREN (Bitfield-Mask: 0x01)          */
#define PMU_0_CONFIG_CMP0REN_Pos          (13UL)                    /*!< PMU_0 CONFIG: CMP0REN (Bit 13)                        */
#define PMU_0_CONFIG_CMP0REN_Msk          (0x2000UL)                /*!< PMU_0 CONFIG: CMP0REN (Bitfield-Mask: 0x01)           */
#define PMU_0_CONFIG_PWAKEREN_Pos         (14UL)                    /*!< PMU_0 CONFIG: PWAKEREN (Bit 14)                       */
#define PMU_0_CONFIG_PWAKEREN_Msk         (0x4000UL)                /*!< PMU_0 CONFIG: PWAKEREN (Bitfield-Mask: 0x01)          */
#define PMU_0_CONFIG_LPT0REN_Pos          (15UL)                    /*!< PMU_0 CONFIG: LPT0REN (Bit 15)                        */
#define PMU_0_CONFIG_LPT0REN_Msk          (0x8000UL)                /*!< PMU_0 CONFIG: LPT0REN (Bitfield-Mask: 0x01)           */
/* ========================================================  STATUS  ========================================================= */
#define PMU_0_STATUS_PM9EF_Pos            (0UL)                     /*!< PMU_0 STATUS: PM9EF (Bit 0)                           */
#define PMU_0_STATUS_PM9EF_Msk            (0x1UL)                   /*!< PMU_0 STATUS: PM9EF (Bitfield-Mask: 0x01)             */
#define PMU_0_STATUS_PWAKEF_Pos           (1UL)                     /*!< PMU_0 STATUS: PWAKEF (Bit 1)                          */
#define PMU_0_STATUS_PWAKEF_Msk           (0x2UL)                   /*!< PMU_0 STATUS: PWAKEF (Bitfield-Mask: 0x01)            */
#define PMU_0_STATUS_PORF_Pos             (2UL)                     /*!< PMU_0 STATUS: PORF (Bit 2)                            */
#define PMU_0_STATUS_PORF_Msk             (0x4UL)                   /*!< PMU_0 STATUS: PORF (Bitfield-Mask: 0x01)              */
/* ========================================================  WAKEEN  ========================================================= */
#define PMU_0_WAKEEN_RTC0FWEN_Pos         (0UL)                     /*!< PMU_0 WAKEEN: RTC0FWEN (Bit 0)                        */
#define PMU_0_WAKEEN_RTC0FWEN_Msk         (0x1UL)                   /*!< PMU_0 WAKEEN: RTC0FWEN (Bitfield-Mask: 0x01)          */
#define PMU_0_WAKEEN_RTC0AWEN_Pos         (1UL)                     /*!< PMU_0 WAKEEN: RTC0AWEN (Bit 1)                        */
#define PMU_0_WAKEEN_RTC0AWEN_Msk         (0x2UL)                   /*!< PMU_0 WAKEEN: RTC0AWEN (Bitfield-Mask: 0x01)          */
#define PMU_0_WAKEEN_CMP0WEN_Pos          (5UL)                     /*!< PMU_0 WAKEEN: CMP0WEN (Bit 5)                         */
#define PMU_0_WAKEEN_CMP0WEN_Msk          (0x20UL)                  /*!< PMU_0 WAKEEN: CMP0WEN (Bitfield-Mask: 0x01)           */
#define PMU_0_WAKEEN_PWAKEWEN_Pos         (6UL)                     /*!< PMU_0 WAKEEN: PWAKEWEN (Bit 6)                        */
#define PMU_0_WAKEEN_PWAKEWEN_Msk         (0x40UL)                  /*!< PMU_0 WAKEEN: PWAKEWEN (Bitfield-Mask: 0x01)          */
#define PMU_0_WAKEEN_LPT0WEN_Pos          (7UL)                     /*!< PMU_0 WAKEEN: LPT0WEN (Bit 7)                         */
#define PMU_0_WAKEEN_LPT0WEN_Msk          (0x80UL)                  /*!< PMU_0 WAKEEN: LPT0WEN (Bitfield-Mask: 0x01)           */
#define PMU_0_WAKEEN_RSTWEN_Pos           (8UL)                     /*!< PMU_0 WAKEEN: RSTWEN (Bit 8)                          */
#define PMU_0_WAKEEN_RSTWEN_Msk           (0x100UL)                 /*!< PMU_0 WAKEEN: RSTWEN (Bitfield-Mask: 0x01)            */
/* ======================================================  WAKESTATUS  ======================================================= */
#define PMU_0_WAKESTATUS_RTC0FWF_Pos      (0UL)                     /*!< PMU_0 WAKESTATUS: RTC0FWF (Bit 0)                     */
#define PMU_0_WAKESTATUS_RTC0FWF_Msk      (0x1UL)                   /*!< PMU_0 WAKESTATUS: RTC0FWF (Bitfield-Mask: 0x01)       */
#define PMU_0_WAKESTATUS_RTC0AWF_Pos      (1UL)                     /*!< PMU_0 WAKESTATUS: RTC0AWF (Bit 1)                     */
#define PMU_0_WAKESTATUS_RTC0AWF_Msk      (0x2UL)                   /*!< PMU_0 WAKESTATUS: RTC0AWF (Bitfield-Mask: 0x01)       */
#define PMU_0_WAKESTATUS_CMP0WF_Pos       (5UL)                     /*!< PMU_0 WAKESTATUS: CMP0WF (Bit 5)                      */
#define PMU_0_WAKESTATUS_CMP0WF_Msk       (0x20UL)                  /*!< PMU_0 WAKESTATUS: CMP0WF (Bitfield-Mask: 0x01)        */
#define PMU_0_WAKESTATUS_PWAKEWF_Pos      (6UL)                     /*!< PMU_0 WAKESTATUS: PWAKEWF (Bit 6)                     */
#define PMU_0_WAKESTATUS_PWAKEWF_Msk      (0x40UL)                  /*!< PMU_0 WAKESTATUS: PWAKEWF (Bitfield-Mask: 0x01)       */
#define PMU_0_WAKESTATUS_LPT0WF_Pos       (7UL)                     /*!< PMU_0 WAKESTATUS: LPT0WF (Bit 7)                      */
#define PMU_0_WAKESTATUS_LPT0WF_Msk       (0x80UL)                  /*!< PMU_0 WAKESTATUS: LPT0WF (Bitfield-Mask: 0x01)        */
#define PMU_0_WAKESTATUS_RSTWF_Pos        (8UL)                     /*!< PMU_0 WAKESTATUS: RSTWF (Bit 8)                       */
#define PMU_0_WAKESTATUS_RSTWF_Msk        (0x100UL)                 /*!< PMU_0 WAKESTATUS: RSTWF (Bitfield-Mask: 0x01)         */
/* =========================================================  PWEN  ========================================================== */
#define PMU_0_PWEN_PW0EN_Pos              (0UL)                     /*!< PMU_0 PWEN: PW0EN (Bit 0)                             */
#define PMU_0_PWEN_PW0EN_Msk              (0x1UL)                   /*!< PMU_0 PWEN: PW0EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW1EN_Pos              (1UL)                     /*!< PMU_0 PWEN: PW1EN (Bit 1)                             */
#define PMU_0_PWEN_PW1EN_Msk              (0x2UL)                   /*!< PMU_0 PWEN: PW1EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW2EN_Pos              (2UL)                     /*!< PMU_0 PWEN: PW2EN (Bit 2)                             */
#define PMU_0_PWEN_PW2EN_Msk              (0x4UL)                   /*!< PMU_0 PWEN: PW2EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW3EN_Pos              (3UL)                     /*!< PMU_0 PWEN: PW3EN (Bit 3)                             */
#define PMU_0_PWEN_PW3EN_Msk              (0x8UL)                   /*!< PMU_0 PWEN: PW3EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW4EN_Pos              (4UL)                     /*!< PMU_0 PWEN: PW4EN (Bit 4)                             */
#define PMU_0_PWEN_PW4EN_Msk              (0x10UL)                  /*!< PMU_0 PWEN: PW4EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW5EN_Pos              (5UL)                     /*!< PMU_0 PWEN: PW5EN (Bit 5)                             */
#define PMU_0_PWEN_PW5EN_Msk              (0x20UL)                  /*!< PMU_0 PWEN: PW5EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW6EN_Pos              (6UL)                     /*!< PMU_0 PWEN: PW6EN (Bit 6)                             */
#define PMU_0_PWEN_PW6EN_Msk              (0x40UL)                  /*!< PMU_0 PWEN: PW6EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW7EN_Pos              (7UL)                     /*!< PMU_0 PWEN: PW7EN (Bit 7)                             */
#define PMU_0_PWEN_PW7EN_Msk              (0x80UL)                  /*!< PMU_0 PWEN: PW7EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW8EN_Pos              (8UL)                     /*!< PMU_0 PWEN: PW8EN (Bit 8)                             */
#define PMU_0_PWEN_PW8EN_Msk              (0x100UL)                 /*!< PMU_0 PWEN: PW8EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW9EN_Pos              (9UL)                     /*!< PMU_0 PWEN: PW9EN (Bit 9)                             */
#define PMU_0_PWEN_PW9EN_Msk              (0x200UL)                 /*!< PMU_0 PWEN: PW9EN (Bitfield-Mask: 0x01)               */
#define PMU_0_PWEN_PW10EN_Pos             (10UL)                    /*!< PMU_0 PWEN: PW10EN (Bit 10)                           */
#define PMU_0_PWEN_PW10EN_Msk             (0x400UL)                 /*!< PMU_0 PWEN: PW10EN (Bitfield-Mask: 0x01)              */
#define PMU_0_PWEN_PW11EN_Pos             (11UL)                    /*!< PMU_0 PWEN: PW11EN (Bit 11)                           */
#define PMU_0_PWEN_PW11EN_Msk             (0x800UL)                 /*!< PMU_0 PWEN: PW11EN (Bitfield-Mask: 0x01)              */
#define PMU_0_PWEN_PW12EN_Pos             (12UL)                    /*!< PMU_0 PWEN: PW12EN (Bit 12)                           */
#define PMU_0_PWEN_PW12EN_Msk             (0x1000UL)                /*!< PMU_0 PWEN: PW12EN (Bitfield-Mask: 0x01)              */
#define PMU_0_PWEN_PW13EN_Pos             (13UL)                    /*!< PMU_0 PWEN: PW13EN (Bit 13)                           */
#define PMU_0_PWEN_PW13EN_Msk             (0x2000UL)                /*!< PMU_0 PWEN: PW13EN (Bitfield-Mask: 0x01)              */
#define PMU_0_PWEN_PW14EN_Pos             (14UL)                    /*!< PMU_0 PWEN: PW14EN (Bit 14)                           */
#define PMU_0_PWEN_PW14EN_Msk             (0x4000UL)                /*!< PMU_0 PWEN: PW14EN (Bitfield-Mask: 0x01)              */
#define PMU_0_PWEN_PW15EN_Pos             (15UL)                    /*!< PMU_0 PWEN: PW15EN (Bit 15)                           */
#define PMU_0_PWEN_PW15EN_Msk             (0x8000UL)                /*!< PMU_0 PWEN: PW15EN (Bitfield-Mask: 0x01)              */
/* =========================================================  PWPOL  ========================================================= */
#define PMU_0_PWPOL_PW0POL_Pos            (0UL)                     /*!< PMU_0 PWPOL: PW0POL (Bit 0)                           */
#define PMU_0_PWPOL_PW0POL_Msk            (0x1UL)                   /*!< PMU_0 PWPOL: PW0POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW1POL_Pos            (1UL)                     /*!< PMU_0 PWPOL: PW1POL (Bit 1)                           */
#define PMU_0_PWPOL_PW1POL_Msk            (0x2UL)                   /*!< PMU_0 PWPOL: PW1POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW2POL_Pos            (2UL)                     /*!< PMU_0 PWPOL: PW2POL (Bit 2)                           */
#define PMU_0_PWPOL_PW2POL_Msk            (0x4UL)                   /*!< PMU_0 PWPOL: PW2POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW3POL_Pos            (3UL)                     /*!< PMU_0 PWPOL: PW3POL (Bit 3)                           */
#define PMU_0_PWPOL_PW3POL_Msk            (0x8UL)                   /*!< PMU_0 PWPOL: PW3POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW4POL_Pos            (4UL)                     /*!< PMU_0 PWPOL: PW4POL (Bit 4)                           */
#define PMU_0_PWPOL_PW4POL_Msk            (0x10UL)                  /*!< PMU_0 PWPOL: PW4POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW5POL_Pos            (5UL)                     /*!< PMU_0 PWPOL: PW5POL (Bit 5)                           */
#define PMU_0_PWPOL_PW5POL_Msk            (0x20UL)                  /*!< PMU_0 PWPOL: PW5POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW6POL_Pos            (6UL)                     /*!< PMU_0 PWPOL: PW6POL (Bit 6)                           */
#define PMU_0_PWPOL_PW6POL_Msk            (0x40UL)                  /*!< PMU_0 PWPOL: PW6POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW7POL_Pos            (7UL)                     /*!< PMU_0 PWPOL: PW7POL (Bit 7)                           */
#define PMU_0_PWPOL_PW7POL_Msk            (0x80UL)                  /*!< PMU_0 PWPOL: PW7POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW8POL_Pos            (8UL)                     /*!< PMU_0 PWPOL: PW8POL (Bit 8)                           */
#define PMU_0_PWPOL_PW8POL_Msk            (0x100UL)                 /*!< PMU_0 PWPOL: PW8POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW9POL_Pos            (9UL)                     /*!< PMU_0 PWPOL: PW9POL (Bit 9)                           */
#define PMU_0_PWPOL_PW9POL_Msk            (0x200UL)                 /*!< PMU_0 PWPOL: PW9POL (Bitfield-Mask: 0x01)             */
#define PMU_0_PWPOL_PW10POL_Pos           (10UL)                    /*!< PMU_0 PWPOL: PW10POL (Bit 10)                         */
#define PMU_0_PWPOL_PW10POL_Msk           (0x400UL)                 /*!< PMU_0 PWPOL: PW10POL (Bitfield-Mask: 0x01)            */
#define PMU_0_PWPOL_PW11POL_Pos           (11UL)                    /*!< PMU_0 PWPOL: PW11POL (Bit 11)                         */
#define PMU_0_PWPOL_PW11POL_Msk           (0x800UL)                 /*!< PMU_0 PWPOL: PW11POL (Bitfield-Mask: 0x01)            */
#define PMU_0_PWPOL_PW12POL_Pos           (12UL)                    /*!< PMU_0 PWPOL: PW12POL (Bit 12)                         */
#define PMU_0_PWPOL_PW12POL_Msk           (0x1000UL)                /*!< PMU_0 PWPOL: PW12POL (Bitfield-Mask: 0x01)            */
#define PMU_0_PWPOL_PW13POL_Pos           (13UL)                    /*!< PMU_0 PWPOL: PW13POL (Bit 13)                         */
#define PMU_0_PWPOL_PW13POL_Msk           (0x2000UL)                /*!< PMU_0 PWPOL: PW13POL (Bitfield-Mask: 0x01)            */
#define PMU_0_PWPOL_PW14POL_Pos           (14UL)                    /*!< PMU_0 PWPOL: PW14POL (Bit 14)                         */
#define PMU_0_PWPOL_PW14POL_Msk           (0x4000UL)                /*!< PMU_0 PWPOL: PW14POL (Bitfield-Mask: 0x01)            */
#define PMU_0_PWPOL_PW15POL_Pos           (15UL)                    /*!< PMU_0 PWPOL: PW15POL (Bit 15)                         */
#define PMU_0_PWPOL_PW15POL_Msk           (0x8000UL)                /*!< PMU_0 PWPOL: PW15POL (Bitfield-Mask: 0x01)            */


/* =========================================================================================================================== */
/* ================                                          PBCFG_0                                          ================ */
/* =========================================================================================================================== */

