chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  CONTROL0  ======================================================== */
#define PBCFG_0_CONTROL0_INT0SEL_Pos      (0UL)                     /*!< PBCFG_0 CONTROL0: INT0SEL (Bit 0)                     */
#define PBCFG_0_CONTROL0_INT0SEL_Msk      (0xfUL)                   /*!< PBCFG_0 CONTROL0: INT0SEL (Bitfield-Mask: 0x0f)       */
#define PBCFG_0_CONTROL0_INT0POL_Pos      (4UL)                     /*!< PBCFG_0 CONTROL0: INT0POL (Bit 4)                     */
#define PBCFG_0_CONTROL0_INT0POL_Msk      (0x10UL)                  /*!< PBCFG_0 CONTROL0: INT0POL (Bitfield-Mask: 0x01)       */
#define PBCFG_0_CONTROL0_INT0MD_Pos       (5UL)                     /*!< PBCFG_0 CONTROL0: INT0MD (Bit 5)                      */
#define PBCFG_0_CONTROL0_INT0MD_Msk       (0x20UL)                  /*!< PBCFG_0 CONTROL0: INT0MD (Bitfield-Mask: 0x01)        */
#define PBCFG_0_CONTROL0_INT0EN_Pos       (7UL)                     /*!< PBCFG_0 CONTROL0: INT0EN (Bit 7)                      */
#define PBCFG_0_CONTROL0_INT0EN_Msk       (0x80UL)                  /*!< PBCFG_0 CONTROL0: INT0EN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_CONTROL0_INT1SEL_Pos      (8UL)                     /*!< PBCFG_0 CONTROL0: INT1SEL (Bit 8)                     */
#define PBCFG_0_CONTROL0_INT1SEL_Msk      (0xf00UL)                 /*!< PBCFG_0 CONTROL0: INT1SEL (Bitfield-Mask: 0x0f)       */
#define PBCFG_0_CONTROL0_INT1POL_Pos      (12UL)                    /*!< PBCFG_0 CONTROL0: INT1POL (Bit 12)                    */
#define PBCFG_0_CONTROL0_INT1POL_Msk      (0x1000UL)                /*!< PBCFG_0 CONTROL0: INT1POL (Bitfield-Mask: 0x01)       */
#define PBCFG_0_CONTROL0_INT1MD_Pos       (13UL)                    /*!< PBCFG_0 CONTROL0: INT1MD (Bit 13)                     */
#define PBCFG_0_CONTROL0_INT1MD_Msk       (0x2000UL)                /*!< PBCFG_0 CONTROL0: INT1MD (Bitfield-Mask: 0x01)        */
#define PBCFG_0_CONTROL0_INT1EN_Pos       (15UL)                    /*!< PBCFG_0 CONTROL0: INT1EN (Bit 15)                     */
#define PBCFG_0_CONTROL0_INT1EN_Msk       (0x8000UL)                /*!< PBCFG_0 CONTROL0: INT1EN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_CONTROL0_PGTIMER_Pos      (24UL)                    /*!< PBCFG_0 CONTROL0: PGTIMER (Bit 24)                    */
#define PBCFG_0_CONTROL0_PGTIMER_Msk      (0x1f000000UL)            /*!< PBCFG_0 CONTROL0: PGTIMER (Bitfield-Mask: 0x1f)       */
#define PBCFG_0_CONTROL0_PGDONEF_Pos      (31UL)                    /*!< PBCFG_0 CONTROL0: PGDONEF (Bit 31)                    */
#define PBCFG_0_CONTROL0_PGDONEF_Msk      (0x80000000UL)            /*!< PBCFG_0 CONTROL0: PGDONEF (Bitfield-Mask: 0x01)       */
/* =====================================================  CONTROL0_SET  ====================================================== */
/* =====================================================  CONTROL0_CLR  ====================================================== */
/* =======================================================  CONTROL1  ======================================================== */
#define PBCFG_0_CONTROL1_JTAGEN_Pos       (0UL)                     /*!< PBCFG_0 CONTROL1: JTAGEN (Bit 0)                      */
#define PBCFG_0_CONTROL1_JTAGEN_Msk       (0x1UL)                   /*!< PBCFG_0 CONTROL1: JTAGEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_CONTROL1_ETMEN_Pos        (1UL)                     /*!< PBCFG_0 CONTROL1: ETMEN (Bit 1)                       */
#define PBCFG_0_CONTROL1_ETMEN_Msk        (0x2UL)                   /*!< PBCFG_0 CONTROL1: ETMEN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_CONTROL1_EMIFBE0BEN_Pos   (7UL)                     /*!< PBCFG_0 CONTROL1: EMIFBE0BEN (Bit 7)                  */
#define PBCFG_0_CONTROL1_EMIFBE0BEN_Msk   (0x80UL)                  /*!< PBCFG_0 CONTROL1: EMIFBE0BEN (Bitfield-Mask: 0x01)    */
#define PBCFG_0_CONTROL1_EMIFCS1EN_Pos    (8UL)                     /*!< PBCFG_0 CONTROL1: EMIFCS1EN (Bit 8)                   */
#define PBCFG_0_CONTROL1_EMIFCS1EN_Msk    (0x100UL)                 /*!< PBCFG_0 CONTROL1: EMIFCS1EN (Bitfield-Mask: 0x01)     */
#define PBCFG_0_CONTROL1_EMIFEN_Pos       (9UL)                     /*!< PBCFG_0 CONTROL1: EMIFEN (Bit 9)                      */
#define PBCFG_0_CONTROL1_EMIFEN_Msk       (0x200UL)                 /*!< PBCFG_0 CONTROL1: EMIFEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_CONTROL1_EMIFWIDTH_Pos    (10UL)                    /*!< PBCFG_0 CONTROL1: EMIFWIDTH (Bit 10)                  */
#define PBCFG_0_CONTROL1_EMIFWIDTH_Msk    (0xfc00UL)                /*!< PBCFG_0 CONTROL1: EMIFWIDTH (Bitfield-Mask: 0x3f)     */
#define PBCFG_0_CONTROL1_MATMD_Pos        (16UL)                    /*!< PBCFG_0 CONTROL1: MATMD (Bit 16)                      */
#define PBCFG_0_CONTROL1_MATMD_Msk        (0x30000UL)               /*!< PBCFG_0 CONTROL1: MATMD (Bitfield-Mask: 0x03)         */
#define PBCFG_0_CONTROL1_EVREGRMD_Pos     (23UL)                    /*!< PBCFG_0 CONTROL1: EVREGRMD (Bit 23)                   */
#define PBCFG_0_CONTROL1_EVREGRMD_Msk     (0x800000UL)              /*!< PBCFG_0 CONTROL1: EVREGRMD (Bitfield-Mask: 0x01)      */
#define PBCFG_0_CONTROL1_LOCK_Pos         (31UL)                    /*!< PBCFG_0 CONTROL1: LOCK (Bit 31)                       */
#define PBCFG_0_CONTROL1_LOCK_Msk         (0x80000000UL)            /*!< PBCFG_0 CONTROL1: LOCK (Bitfield-Mask: 0x01)          */
/* =====================================================  CONTROL1_SET  ====================================================== */
/* =====================================================  CONTROL1_CLR  ====================================================== */
/* ========================================================  XBAR0L  ========================================================= */
#define PBCFG_0_XBAR0L_USART0EN_Pos       (0UL)                     /*!< PBCFG_0 XBAR0L: USART0EN (Bit 0)                      */
#define PBCFG_0_XBAR0L_USART0EN_Msk       (0x1UL)                   /*!< PBCFG_0 XBAR0L: USART0EN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR0L_USART0FCEN_Pos     (1UL)                     /*!< PBCFG_0 XBAR0L: USART0FCEN (Bit 1)                    */
#define PBCFG_0_XBAR0L_USART0FCEN_Msk     (0x2UL)                   /*!< PBCFG_0 XBAR0L: USART0FCEN (Bitfield-Mask: 0x01)      */
#define PBCFG_0_XBAR0L_USART0CEN_Pos      (2UL)                     /*!< PBCFG_0 XBAR0L: USART0CEN (Bit 2)                     */
#define PBCFG_0_XBAR0L_USART0CEN_Msk      (0x4UL)                   /*!< PBCFG_0 XBAR0L: USART0CEN (Bitfield-Mask: 0x01)       */
#define PBCFG_0_XBAR0L_SPI0EN_Pos         (3UL)                     /*!< PBCFG_0 XBAR0L: SPI0EN (Bit 3)                        */
#define PBCFG_0_XBAR0L_SPI0EN_Msk         (0x8UL)                   /*!< PBCFG_0 XBAR0L: SPI0EN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR0L_SPI0NSSEN_Pos      (4UL)                     /*!< PBCFG_0 XBAR0L: SPI0NSSEN (Bit 4)                     */
#define PBCFG_0_XBAR0L_SPI0NSSEN_Msk      (0x10UL)                  /*!< PBCFG_0 XBAR0L: SPI0NSSEN (Bitfield-Mask: 0x01)       */
#define PBCFG_0_XBAR0L_USART1EN_Pos       (5UL)                     /*!< PBCFG_0 XBAR0L: USART1EN (Bit 5)                      */
#define PBCFG_0_XBAR0L_USART1EN_Msk       (0x20UL)                  /*!< PBCFG_0 XBAR0L: USART1EN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR0L_USART1FCEN_Pos     (6UL)                     /*!< PBCFG_0 XBAR0L: USART1FCEN (Bit 6)                    */
#define PBCFG_0_XBAR0L_USART1FCEN_Msk     (0x40UL)                  /*!< PBCFG_0 XBAR0L: USART1FCEN (Bitfield-Mask: 0x01)      */
#define PBCFG_0_XBAR0L_USART1CEN_Pos      (7UL)                     /*!< PBCFG_0 XBAR0L: USART1CEN (Bit 7)                     */
#define PBCFG_0_XBAR0L_USART1CEN_Msk      (0x80UL)                  /*!< PBCFG_0 XBAR0L: USART1CEN (Bitfield-Mask: 0x01)       */
#define PBCFG_0_XBAR0L_EPCA0EN_Pos        (8UL)                     /*!< PBCFG_0 XBAR0L: EPCA0EN (Bit 8)                       */
#define PBCFG_0_XBAR0L_EPCA0EN_Msk        (0x700UL)                 /*!< PBCFG_0 XBAR0L: EPCA0EN (Bitfield-Mask: 0x07)         */
#define PBCFG_0_XBAR0L_PCA0EN_Pos         (14UL)                    /*!< PBCFG_0 XBAR0L: PCA0EN (Bit 14)                       */
#define PBCFG_0_XBAR0L_PCA0EN_Msk         (0xc000UL)                /*!< PBCFG_0 XBAR0L: PCA0EN (Bitfield-Mask: 0x03)          */
#define PBCFG_0_XBAR0L_PCA1EN_Pos         (16UL)                    /*!< PBCFG_0 XBAR0L: PCA1EN (Bit 16)                       */
#define PBCFG_0_XBAR0L_PCA1EN_Msk         (0x30000UL)               /*!< PBCFG_0 XBAR0L: PCA1EN (Bitfield-Mask: 0x03)          */
#define PBCFG_0_XBAR0L_EECI0EN_Pos        (18UL)                    /*!< PBCFG_0 XBAR0L: EECI0EN (Bit 18)                      */
#define PBCFG_0_XBAR0L_EECI0EN_Msk        (0x40000UL)               /*!< PBCFG_0 XBAR0L: EECI0EN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR0L_ECI0EN_Pos         (19UL)                    /*!< PBCFG_0 XBAR0L: ECI0EN (Bit 19)                       */
#define PBCFG_0_XBAR0L_ECI0EN_Msk         (0x80000UL)               /*!< PBCFG_0 XBAR0L: ECI0EN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR0L_ECI1EN_Pos         (20UL)                    /*!< PBCFG_0 XBAR0L: ECI1EN (Bit 20)                       */
#define PBCFG_0_XBAR0L_ECI1EN_Msk         (0x100000UL)              /*!< PBCFG_0 XBAR0L: ECI1EN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR0L_I2S0TXEN_Pos       (21UL)                    /*!< PBCFG_0 XBAR0L: I2S0TXEN (Bit 21)                     */
#define PBCFG_0_XBAR0L_I2S0TXEN_Msk       (0x200000UL)              /*!< PBCFG_0 XBAR0L: I2S0TXEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR0L_I2C0EN_Pos         (22UL)                    /*!< PBCFG_0 XBAR0L: I2C0EN (Bit 22)                       */
#define PBCFG_0_XBAR0L_I2C0EN_Msk         (0x400000UL)              /*!< PBCFG_0 XBAR0L: I2C0EN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR0L_CMP0SEN_Pos        (23UL)                    /*!< PBCFG_0 XBAR0L: CMP0SEN (Bit 23)                      */
#define PBCFG_0_XBAR0L_CMP0SEN_Msk        (0x800000UL)              /*!< PBCFG_0 XBAR0L: CMP0SEN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR0L_CMP0AEN_Pos        (24UL)                    /*!< PBCFG_0 XBAR0L: CMP0AEN (Bit 24)                      */
#define PBCFG_0_XBAR0L_CMP0AEN_Msk        (0x1000000UL)             /*!< PBCFG_0 XBAR0L: CMP0AEN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR0L_CMP1SEN_Pos        (25UL)                    /*!< PBCFG_0 XBAR0L: CMP1SEN (Bit 25)                      */
#define PBCFG_0_XBAR0L_CMP1SEN_Msk        (0x2000000UL)             /*!< PBCFG_0 XBAR0L: CMP1SEN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR0L_CMP1AEN_Pos        (26UL)                    /*!< PBCFG_0 XBAR0L: CMP1AEN (Bit 26)                      */
#define PBCFG_0_XBAR0L_CMP1AEN_Msk        (0x4000000UL)             /*!< PBCFG_0 XBAR0L: CMP1AEN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR0L_TMR0CTEN_Pos       (27UL)                    /*!< PBCFG_0 XBAR0L: TMR0CTEN (Bit 27)                     */
#define PBCFG_0_XBAR0L_TMR0CTEN_Msk       (0x8000000UL)             /*!< PBCFG_0 XBAR0L: TMR0CTEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR0L_TMR0EXEN_Pos       (28UL)                    /*!< PBCFG_0 XBAR0L: TMR0EXEN (Bit 28)                     */
#define PBCFG_0_XBAR0L_TMR0EXEN_Msk       (0x10000000UL)            /*!< PBCFG_0 XBAR0L: TMR0EXEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR0L_TMR1CTEN_Pos       (29UL)                    /*!< PBCFG_0 XBAR0L: TMR1CTEN (Bit 29)                     */
#define PBCFG_0_XBAR0L_TMR1CTEN_Msk       (0x20000000UL)            /*!< PBCFG_0 XBAR0L: TMR1CTEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR0L_TMR1EXEN_Pos       (30UL)                    /*!< PBCFG_0 XBAR0L: TMR1EXEN (Bit 30)                     */
#define PBCFG_0_XBAR0L_TMR1EXEN_Msk       (0x40000000UL)            /*!< PBCFG_0 XBAR0L: TMR1EXEN (Bitfield-Mask: 0x01)        */
/* ======================================================  XBAR0L_SET  ======================================================= */
/* ======================================================  XBAR0L_CLR  ======================================================= */
/* ========================================================  XBAR0H  ========================================================= */
#define PBCFG_0_XBAR0H_UART0EN_Pos        (0UL)                     /*!< PBCFG_0 XBAR0H: UART0EN (Bit 0)                       */
#define PBCFG_0_XBAR0H_UART0EN_Msk        (0x1UL)                   /*!< PBCFG_0 XBAR0H: UART0EN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR0H_UART0FCEN_Pos      (1UL)                     /*!< PBCFG_0 XBAR0H: UART0FCEN (Bit 1)                     */
#define PBCFG_0_XBAR0H_UART0FCEN_Msk      (0x2UL)                   /*!< PBCFG_0 XBAR0H: UART0FCEN (Bitfield-Mask: 0x01)       */
#define PBCFG_0_XBAR0H_UART1EN_Pos        (2UL)                     /*!< PBCFG_0 XBAR0H: UART1EN (Bit 2)                       */
#define PBCFG_0_XBAR0H_UART1EN_Msk        (0x4UL)                   /*!< PBCFG_0 XBAR0H: UART1EN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR0H_SPI1EN_Pos         (3UL)                     /*!< PBCFG_0 XBAR0H: SPI1EN (Bit 3)                        */
#define PBCFG_0_XBAR0H_SPI1EN_Msk         (0x8UL)                   /*!< PBCFG_0 XBAR0H: SPI1EN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR0H_SPI1NSSEN_Pos      (4UL)                     /*!< PBCFG_0 XBAR0H: SPI1NSSEN (Bit 4)                     */
#define PBCFG_0_XBAR0H_SPI1NSSEN_Msk      (0x10UL)                  /*!< PBCFG_0 XBAR0H: SPI1NSSEN (Bitfield-Mask: 0x01)       */
#define PBCFG_0_XBAR0H_SPI2EN_Pos         (5UL)                     /*!< PBCFG_0 XBAR0H: SPI2EN (Bit 5)                        */
#define PBCFG_0_XBAR0H_SPI2EN_Msk         (0x20UL)                  /*!< PBCFG_0 XBAR0H: SPI2EN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR0H_SPI2NSSEN_Pos      (6UL)                     /*!< PBCFG_0 XBAR0H: SPI2NSSEN (Bit 6)                     */
#define PBCFG_0_XBAR0H_SPI2NSSEN_Msk      (0x40UL)                  /*!< PBCFG_0 XBAR0H: SPI2NSSEN (Bitfield-Mask: 0x01)       */
#define PBCFG_0_XBAR0H_AHBEN_Pos          (7UL)                     /*!< PBCFG_0 XBAR0H: AHBEN (Bit 7)                         */
#define PBCFG_0_XBAR0H_AHBEN_Msk          (0x80UL)                  /*!< PBCFG_0 XBAR0H: AHBEN (Bitfield-Mask: 0x01)           */
#define PBCFG_0_XBAR0H_XBAR0EN_Pos        (31UL)                    /*!< PBCFG_0 XBAR0H: XBAR0EN (Bit 31)                      */
#define PBCFG_0_XBAR0H_XBAR0EN_Msk        (0x80000000UL)            /*!< PBCFG_0 XBAR0H: XBAR0EN (Bitfield-Mask: 0x01)         */
/* ======================================================  XBAR0H_SET  ======================================================= */
/* ======================================================  XBAR0H_CLR  ======================================================= */
/* =========================================================  XBAR1  ========================================================= */
#define PBCFG_0_XBAR1_SSG0EN_Pos          (0UL)                     /*!< PBCFG_0 XBAR1: SSG0EN (Bit 0)                         */
#define PBCFG_0_XBAR1_SSG0EN_Msk          (0x3UL)                   /*!< PBCFG_0 XBAR1: SSG0EN (Bitfield-Mask: 0x03)           */
#define PBCFG_0_XBAR1_CMP0SEN_Pos         (2UL)                     /*!< PBCFG_0 XBAR1: CMP0SEN (Bit 2)                        */
#define PBCFG_0_XBAR1_CMP0SEN_Msk         (0x4UL)                   /*!< PBCFG_0 XBAR1: CMP0SEN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR1_CMP1SEN_Pos         (3UL)                     /*!< PBCFG_0 XBAR1: CMP1SEN (Bit 3)                        */
#define PBCFG_0_XBAR1_CMP1SEN_Msk         (0x8UL)                   /*!< PBCFG_0 XBAR1: CMP1SEN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR1_SPI1EN_Pos          (4UL)                     /*!< PBCFG_0 XBAR1: SPI1EN (Bit 4)                         */
#define PBCFG_0_XBAR1_SPI1EN_Msk          (0x10UL)                  /*!< PBCFG_0 XBAR1: SPI1EN (Bitfield-Mask: 0x01)           */
#define PBCFG_0_XBAR1_SPI1NSSEN_Pos       (5UL)                     /*!< PBCFG_0 XBAR1: SPI1NSSEN (Bit 5)                      */
#define PBCFG_0_XBAR1_SPI1NSSEN_Msk       (0x20UL)                  /*!< PBCFG_0 XBAR1: SPI1NSSEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR1_RTC0EN_Pos          (6UL)                     /*!< PBCFG_0 XBAR1: RTC0EN (Bit 6)                         */
#define PBCFG_0_XBAR1_RTC0EN_Msk          (0x40UL)                  /*!< PBCFG_0 XBAR1: RTC0EN (Bitfield-Mask: 0x01)           */
#define PBCFG_0_XBAR1_SPI2EN_Pos          (7UL)                     /*!< PBCFG_0 XBAR1: SPI2EN (Bit 7)                         */
#define PBCFG_0_XBAR1_SPI2EN_Msk          (0x80UL)                  /*!< PBCFG_0 XBAR1: SPI2EN (Bitfield-Mask: 0x01)           */
#define PBCFG_0_XBAR1_SPI2NSSEN_Pos       (8UL)                     /*!< PBCFG_0 XBAR1: SPI2NSSEN (Bit 8)                      */
#define PBCFG_0_XBAR1_SPI2NSSEN_Msk       (0x100UL)                 /*!< PBCFG_0 XBAR1: SPI2NSSEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR1_USART1EN_Pos        (9UL)                     /*!< PBCFG_0 XBAR1: USART1EN (Bit 9)                       */
#define PBCFG_0_XBAR1_USART1EN_Msk        (0x200UL)                 /*!< PBCFG_0 XBAR1: USART1EN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR1_USART1FCEN_Pos      (10UL)                    /*!< PBCFG_0 XBAR1: USART1FCEN (Bit 10)                    */
#define PBCFG_0_XBAR1_USART1FCEN_Msk      (0x400UL)                 /*!< PBCFG_0 XBAR1: USART1FCEN (Bitfield-Mask: 0x01)       */
#define PBCFG_0_XBAR1_USART1CEN_Pos       (11UL)                    /*!< PBCFG_0 XBAR1: USART1CEN (Bit 11)                     */
#define PBCFG_0_XBAR1_USART1CEN_Msk       (0x800UL)                 /*!< PBCFG_0 XBAR1: USART1CEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR1_UART0EN_Pos         (12UL)                    /*!< PBCFG_0 XBAR1: UART0EN (Bit 12)                       */
#define PBCFG_0_XBAR1_UART0EN_Msk         (0x1000UL)                /*!< PBCFG_0 XBAR1: UART0EN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR1_UART0FCEN_Pos       (13UL)                    /*!< PBCFG_0 XBAR1: UART0FCEN (Bit 13)                     */
#define PBCFG_0_XBAR1_UART0FCEN_Msk       (0x2000UL)                /*!< PBCFG_0 XBAR1: UART0FCEN (Bitfield-Mask: 0x01)        */
#define PBCFG_0_XBAR1_I2S0TXEN_Pos        (14UL)                    /*!< PBCFG_0 XBAR1: I2S0TXEN (Bit 14)                      */
#define PBCFG_0_XBAR1_I2S0TXEN_Msk        (0x4000UL)                /*!< PBCFG_0 XBAR1: I2S0TXEN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR1_I2C0EN_Pos          (15UL)                    /*!< PBCFG_0 XBAR1: I2C0EN (Bit 15)                        */
#define PBCFG_0_XBAR1_I2C0EN_Msk          (0x8000UL)                /*!< PBCFG_0 XBAR1: I2C0EN (Bitfield-Mask: 0x01)           */
#define PBCFG_0_XBAR1_UART1EN_Pos         (16UL)                    /*!< PBCFG_0 XBAR1: UART1EN (Bit 16)                       */
#define PBCFG_0_XBAR1_UART1EN_Msk         (0x10000UL)               /*!< PBCFG_0 XBAR1: UART1EN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR1_I2S0RXEN_Pos        (17UL)                    /*!< PBCFG_0 XBAR1: I2S0RXEN (Bit 17)                      */
#define PBCFG_0_XBAR1_I2S0RXEN_Msk        (0x20000UL)               /*!< PBCFG_0 XBAR1: I2S0RXEN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR1_LPT0OEN_Pos         (19UL)                    /*!< PBCFG_0 XBAR1: LPT0OEN (Bit 19)                       */
#define PBCFG_0_XBAR1_LPT0OEN_Msk         (0x80000UL)               /*!< PBCFG_0 XBAR1: LPT0OEN (Bitfield-Mask: 0x01)          */
#define PBCFG_0_XBAR1_I2C1EN_Pos          (20UL)                    /*!< PBCFG_0 XBAR1: I2C1EN (Bit 20)                        */
#define PBCFG_0_XBAR1_I2C1EN_Msk          (0x100000UL)              /*!< PBCFG_0 XBAR1: I2C1EN (Bitfield-Mask: 0x01)           */
#define PBCFG_0_XBAR1_KILLHDEN_Pos        (21UL)                    /*!< PBCFG_0 XBAR1: KILLHDEN (Bit 21)                      */
#define PBCFG_0_XBAR1_KILLHDEN_Msk        (0x200000UL)              /*!< PBCFG_0 XBAR1: KILLHDEN (Bitfield-Mask: 0x01)         */
#define PBCFG_0_XBAR1_XBAR1EN_Pos         (31UL)                    /*!< PBCFG_0 XBAR1: XBAR1EN (Bit 31)                       */
#define PBCFG_0_XBAR1_XBAR1EN_Msk         (0x80000000UL)            /*!< PBCFG_0 XBAR1: XBAR1EN (Bitfield-Mask: 0x01)          */
/* =======================================================  XBAR1_SET  ======================================================= */
/* =======================================================  XBAR1_CLR  ======================================================= */
/* =========================================================  PBKEY  ========================================================= */
#define PBCFG_0_PBKEY_KEY_Pos             (0UL)                     /*!< PBCFG_0 PBKEY: KEY (Bit 0)                            */
#define PBCFG_0_PBKEY_KEY_Msk             (0xffUL)                  /*!< PBCFG_0 PBKEY: KEY (Bitfield-Mask: 0xff)              */


/* =========================================================================================================================== */
/* ================                                          PBHD_4                                           ================ */
/* =========================================================================================================================== */

