chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==========================================================  PB  =========================================================== */
#define PBHD_4_PB_PB_Pos                  (0UL)                     /*!< PBHD_4 PB: PB (Bit 0)                                 */
#define PBHD_4_PB_PB_Msk                  (0x3fUL)                  /*!< PBHD_4 PB: PB (Bitfield-Mask: 0x3f)                   */
/* =========================================================  PBPIN  ========================================================= */
#define PBHD_4_PBPIN_PBPIN_Pos            (0UL)                     /*!< PBHD_4 PBPIN: PBPIN (Bit 0)                           */
#define PBHD_4_PBPIN_PBPIN_Msk            (0x3fUL)                  /*!< PBHD_4 PBPIN: PBPIN (Bitfield-Mask: 0x3f)             */
/* ========================================================  PBMDSEL  ======================================================== */
#define PBHD_4_PBMDSEL_PBMDSEL_Pos        (0UL)                     /*!< PBHD_4 PBMDSEL: PBMDSEL (Bit 0)                       */
#define PBHD_4_PBMDSEL_PBMDSEL_Msk        (0x3fUL)                  /*!< PBHD_4 PBMDSEL: PBMDSEL (Bitfield-Mask: 0x3f)         */
/* =========================================================  PBDEN  ========================================================= */
#define PBHD_4_PBDEN_PBNDEN_Pos           (0UL)                     /*!< PBHD_4 PBDEN: PBNDEN (Bit 0)                          */
#define PBHD_4_PBDEN_PBNDEN_Msk           (0x3fUL)                  /*!< PBHD_4 PBDEN: PBNDEN (Bitfield-Mask: 0x3f)            */
#define PBHD_4_PBDEN_PBPDEN_Pos           (16UL)                    /*!< PBHD_4 PBDEN: PBPDEN (Bit 16)                         */
#define PBHD_4_PBDEN_PBPDEN_Msk           (0x3f0000UL)              /*!< PBHD_4 PBDEN: PBPDEN (Bitfield-Mask: 0x3f)            */
/* =========================================================  PBDRV  ========================================================= */
#define PBHD_4_PBDRV_PBDRV_Pos            (0UL)                     /*!< PBHD_4 PBDRV: PBDRV (Bit 0)                           */
#define PBHD_4_PBDRV_PBDRV_Msk            (0x3fUL)                  /*!< PBHD_4 PBDRV: PBDRV (Bitfield-Mask: 0x3f)             */
#define PBHD_4_PBDRV_PBPUEN_Pos           (16UL)                    /*!< PBHD_4 PBDRV: PBPUEN (Bit 16)                         */
#define PBHD_4_PBDRV_PBPUEN_Msk           (0x10000UL)               /*!< PBHD_4 PBDRV: PBPUEN (Bitfield-Mask: 0x01)            */
#define PBHD_4_PBDRV_PBLVMD_Pos           (17UL)                    /*!< PBHD_4 PBDRV: PBLVMD (Bit 17)                         */
#define PBHD_4_PBDRV_PBLVMD_Msk           (0x20000UL)               /*!< PBHD_4 PBDRV: PBLVMD (Bitfield-Mask: 0x01)            */
#define PBHD_4_PBDRV_PBSLEW_Pos           (18UL)                    /*!< PBHD_4 PBDRV: PBSLEW (Bit 18)                         */
#define PBHD_4_PBDRV_PBSLEW_Msk           (0xc0000UL)               /*!< PBHD_4 PBDRV: PBSLEW (Bitfield-Mask: 0x03)            */
#define PBHD_4_PBDRV_PBBIASEN_Pos         (21UL)                    /*!< PBHD_4 PBDRV: PBBIASEN (Bit 21)                       */
#define PBHD_4_PBDRV_PBBIASEN_Msk         (0x200000UL)              /*!< PBHD_4 PBDRV: PBBIASEN (Bitfield-Mask: 0x01)          */
#define PBHD_4_PBDRV_PBDRVEN_Pos          (22UL)                    /*!< PBHD_4 PBDRV: PBDRVEN (Bit 22)                        */
#define PBHD_4_PBDRV_PBDRVEN_Msk          (0x400000UL)              /*!< PBHD_4 PBDRV: PBDRVEN (Bitfield-Mask: 0x01)           */
#define PBHD_4_PBDRV_PBVTRKEN_Pos         (23UL)                    /*!< PBHD_4 PBDRV: PBVTRKEN (Bit 23)                       */
#define PBHD_4_PBDRV_PBVTRKEN_Msk         (0x800000UL)              /*!< PBHD_4 PBDRV: PBVTRKEN (Bitfield-Mask: 0x01)          */
/* =======================================================  PBILIMIT  ======================================================== */
#define PBHD_4_PBILIMIT_PBILEN_Pos        (0UL)                     /*!< PBHD_4 PBILIMIT: PBILEN (Bit 0)                       */
#define PBHD_4_PBILIMIT_PBILEN_Msk        (0x3fUL)                  /*!< PBHD_4 PBILIMIT: PBILEN (Bitfield-Mask: 0x3f)         */
#define PBHD_4_PBILIMIT_NILIMIT_Pos       (16UL)                    /*!< PBHD_4 PBILIMIT: NILIMIT (Bit 16)                     */
#define PBHD_4_PBILIMIT_NILIMIT_Msk       (0xf0000UL)               /*!< PBHD_4 PBILIMIT: NILIMIT (Bitfield-Mask: 0x0f)        */
#define PBHD_4_PBILIMIT_PILIMIT_Pos       (20UL)                    /*!< PBHD_4 PBILIMIT: PILIMIT (Bit 20)                     */
#define PBHD_4_PBILIMIT_PILIMIT_Msk       (0xf00000UL)              /*!< PBHD_4 PBILIMIT: PILIMIT (Bitfield-Mask: 0x0f)        */
/* ========================================================  PBFSEL  ========================================================= */
#define PBHD_4_PBFSEL_PB0SEL_Pos          (0UL)                     /*!< PBHD_4 PBFSEL: PB0SEL (Bit 0)                         */
#define PBHD_4_PBFSEL_PB0SEL_Msk          (0x3UL)                   /*!< PBHD_4 PBFSEL: PB0SEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBFSEL_PB1SEL_Pos          (2UL)                     /*!< PBHD_4 PBFSEL: PB1SEL (Bit 2)                         */
#define PBHD_4_PBFSEL_PB1SEL_Msk          (0xcUL)                   /*!< PBHD_4 PBFSEL: PB1SEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBFSEL_PB2SEL_Pos          (4UL)                     /*!< PBHD_4 PBFSEL: PB2SEL (Bit 4)                         */
#define PBHD_4_PBFSEL_PB2SEL_Msk          (0x30UL)                  /*!< PBHD_4 PBFSEL: PB2SEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBFSEL_PB3SEL_Pos          (6UL)                     /*!< PBHD_4 PBFSEL: PB3SEL (Bit 6)                         */
#define PBHD_4_PBFSEL_PB3SEL_Msk          (0xc0UL)                  /*!< PBHD_4 PBFSEL: PB3SEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBFSEL_PB4SEL_Pos          (8UL)                     /*!< PBHD_4 PBFSEL: PB4SEL (Bit 8)                         */
#define PBHD_4_PBFSEL_PB4SEL_Msk          (0x300UL)                 /*!< PBHD_4 PBFSEL: PB4SEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBFSEL_PB5SEL_Pos          (10UL)                    /*!< PBHD_4 PBFSEL: PB5SEL (Bit 10)                        */
#define PBHD_4_PBFSEL_PB5SEL_Msk          (0x1c00UL)                /*!< PBHD_4 PBFSEL: PB5SEL (Bitfield-Mask: 0x07)           */
/* =========================================================  PBSS  ========================================================== */
#define PBHD_4_PBSS_PB0SSSEL_Pos          (0UL)                     /*!< PBHD_4 PBSS: PB0SSSEL (Bit 0)                         */
#define PBHD_4_PBSS_PB0SSSEL_Msk          (0x3UL)                   /*!< PBHD_4 PBSS: PB0SSSEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBSS_PB1SSSEL_Pos          (2UL)                     /*!< PBHD_4 PBSS: PB1SSSEL (Bit 2)                         */
#define PBHD_4_PBSS_PB1SSSEL_Msk          (0xcUL)                   /*!< PBHD_4 PBSS: PB1SSSEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBSS_PB2SSSEL_Pos          (4UL)                     /*!< PBHD_4 PBSS: PB2SSSEL (Bit 4)                         */
#define PBHD_4_PBSS_PB2SSSEL_Msk          (0x30UL)                  /*!< PBHD_4 PBSS: PB2SSSEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBSS_PB3SSSEL_Pos          (6UL)                     /*!< PBHD_4 PBSS: PB3SSSEL (Bit 6)                         */
#define PBHD_4_PBSS_PB3SSSEL_Msk          (0xc0UL)                  /*!< PBHD_4 PBSS: PB3SSSEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBSS_PB4SSSEL_Pos          (8UL)                     /*!< PBHD_4 PBSS: PB4SSSEL (Bit 8)                         */
#define PBHD_4_PBSS_PB4SSSEL_Msk          (0x300UL)                 /*!< PBHD_4 PBSS: PB4SSSEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBSS_PB5SSSEL_Pos          (10UL)                    /*!< PBHD_4 PBSS: PB5SSSEL (Bit 10)                        */
#define PBHD_4_PBSS_PB5SSSEL_Msk          (0xc00UL)                 /*!< PBHD_4 PBSS: PB5SSSEL (Bitfield-Mask: 0x03)           */
#define PBHD_4_PBSS_SSMDEN_Pos            (16UL)                    /*!< PBHD_4 PBSS: SSMDEN (Bit 16)                          */
#define PBHD_4_PBSS_SSMDEN_Msk            (0x10000UL)               /*!< PBHD_4 PBSS: SSMDEN (Bitfield-Mask: 0x01)             */
#define PBHD_4_PBSS_PBSSSMD_Pos           (17UL)                    /*!< PBHD_4 PBSS: PBSSSMD (Bit 17)                         */
#define PBHD_4_PBSS_PBSSSMD_Msk           (0x20000UL)               /*!< PBHD_4 PBSS: PBSSSMD (Bitfield-Mask: 0x01)            */
/* ========================================================  PBLOCK  ========================================================= */
#define PBHD_4_PBLOCK_PBLOCK_Pos          (0UL)                     /*!< PBHD_4 PBLOCK: PBLOCK (Bit 0)                         */
#define PBHD_4_PBLOCK_PBLOCK_Msk          (0x3fUL)                  /*!< PBHD_4 PBLOCK: PBLOCK (Bitfield-Mask: 0x3f)           */


/* =========================================================================================================================== */
/* ================                                           PBSTD                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  PB  =========================================================== */
#define PBSTD_PB_PB_Pos                   (0UL)                     /*!< PBSTD PB: PB (Bit 0)                                  */
#define PBSTD_PB_PB_Msk                   (0xffffUL)                /*!< PBSTD PB: PB (Bitfield-Mask: 0xffff)                  */
/* ========================================================  PB_SET  ========================================================= */
/* ========================================================  PB_CLR  ========================================================= */
/* ========================================================  PB_MSK  ========================================================= */
/* =========================================================  PBPIN  ========================================================= */
#define PBSTD_PBPIN_PBPIN_Pos             (0UL)                     /*!< PBSTD PBPIN: PBPIN (Bit 0)                            */
#define PBSTD_PBPIN_PBPIN_Msk             (0xffffUL)                /*!< PBSTD PBPIN: PBPIN (Bitfield-Mask: 0xffff)            */
/* ========================================================  PBMDSEL  ======================================================== */
#define PBSTD_PBMDSEL_PBMDSEL_Pos         (0UL)                     /*!< PBSTD PBMDSEL: PBMDSEL (Bit 0)                        */
#define PBSTD_PBMDSEL_PBMDSEL_Msk         (0xffffUL)                /*!< PBSTD PBMDSEL: PBMDSEL (Bitfield-Mask: 0xffff)        */
/* ======================================================  PBMDSEL_SET  ====================================================== */
/* ======================================================  PBMDSEL_CLR  ====================================================== */
/* =======================================================  PBSKIPEN  ======================================================== */
#define PBSTD_PBSKIPEN_PBSKIPEN_Pos       (0UL)                     /*!< PBSTD PBSKIPEN: PBSKIPEN (Bit 0)                      */
#define PBSTD_PBSKIPEN_PBSKIPEN_Msk       (0xffffUL)                /*!< PBSTD PBSKIPEN: PBSKIPEN (Bitfield-Mask: 0xffff)      */
/* =====================================================  PBSKIPEN_SET  ====================================================== */
/* =====================================================  PBSKIPEN_CLR  ====================================================== */
/* ========================================================  PBOUTMD  ======================================================== */
#define PBSTD_PBOUTMD_PBOUTMD_Pos         (0UL)                     /*!< PBSTD PBOUTMD: PBOUTMD (Bit 0)                        */
#define PBSTD_PBOUTMD_PBOUTMD_Msk         (0xffffUL)                /*!< PBSTD PBOUTMD: PBOUTMD (Bitfield-Mask: 0xffff)        */
/* ======================================================  PBOUTMD_SET  ====================================================== */
/* ======================================================  PBOUTMD_CLR  ====================================================== */
/* =========================================================  PBDRV  ========================================================= */
#define PBSTD_PBDRV_PBDRV_Pos             (0UL)                     /*!< PBSTD PBDRV: PBDRV (Bit 0)                            */
#define PBSTD_PBDRV_PBDRV_Msk             (0xffffUL)                /*!< PBSTD PBDRV: PBDRV (Bitfield-Mask: 0xffff)            */
#define PBSTD_PBDRV_PBPUEN_Pos            (16UL)                    /*!< PBSTD PBDRV: PBPUEN (Bit 16)                          */
#define PBSTD_PBDRV_PBPUEN_Msk            (0x10000UL)               /*!< PBSTD PBDRV: PBPUEN (Bitfield-Mask: 0x01)             */
/* =======================================================  PBDRV_SET  ======================================================= */
/* =======================================================  PBDRV_CLR  ======================================================= */
/* ==========================================================  PM  =========================================================== */
#define PBSTD_PM_PM_Pos                   (0UL)                     /*!< PBSTD PM: PM (Bit 0)                                  */
#define PBSTD_PM_PM_Msk                   (0xffffUL)                /*!< PBSTD PM: PM (Bitfield-Mask: 0xffff)                  */
/* ========================================================  PM_SET  ========================================================= */
/* ========================================================  PM_CLR  ========================================================= */
/* =========================================================  PMEN  ========================================================== */
#define PBSTD_PMEN_PMEN_Pos               (0UL)                     /*!< PBSTD PMEN: PMEN (Bit 0)                              */
#define PBSTD_PMEN_PMEN_Msk               (0xffffUL)                /*!< PBSTD PMEN: PMEN (Bitfield-Mask: 0xffff)              */
/* =======================================================  PMEN_SET  ======================================================== */
/* =======================================================  PMEN_CLR  ======================================================== */
/* ========================================================  PBLOCK  ========================================================= */
#define PBSTD_PBLOCK_PBLOCK_Pos           (0UL)                     /*!< PBSTD PBLOCK: PBLOCK (Bit 0)                          */
#define PBSTD_PBLOCK_PBLOCK_Msk           (0xffffUL)                /*!< PBSTD PBLOCK: PBLOCK (Bitfield-Mask: 0xffff)          */
/* ========================================================  PBPGEN  ========================================================= */
#define PBSTD_PBPGEN_PBPGEN_Pos           (0UL)                     /*!< PBSTD PBPGEN: PBPGEN (Bit 0)                          */
#define PBSTD_PBPGEN_PBPGEN_Msk           (0xffffUL)                /*!< PBSTD PBPGEN: PBPGEN (Bitfield-Mask: 0xffff)          */
/* =======================================================  PBPGPHASE  ======================================================= */
#define PBSTD_PBPGPHASE_PBPGPH0_Pos       (0UL)                     /*!< PBSTD PBPGPHASE: PBPGPH0 (Bit 0)                      */
#define PBSTD_PBPGPHASE_PBPGPH0_Msk       (0xffffUL)                /*!< PBSTD PBPGPHASE: PBPGPH0 (Bitfield-Mask: 0xffff)      */
#define PBSTD_PBPGPHASE_PBPGPH1_Pos       (16UL)                    /*!< PBSTD PBPGPHASE: PBPGPH1 (Bit 16)                     */
#define PBSTD_PBPGPHASE_PBPGPH1_Msk       (0xffff0000UL)            /*!< PBSTD PBPGPHASE: PBPGPH1 (Bitfield-Mask: 0xffff)      */


/* =========================================================================================================================== */
/* ================                                           RTC_0                                           ================ */
/* =========================================================================================================================== */

