chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONFIG  ========================================================= */
#define RTC_0_CONFIG_ALM0AREN_Pos         (0UL)                     /*!< RTC_0 CONFIG: ALM0AREN (Bit 0)                        */
#define RTC_0_CONFIG_ALM0AREN_Msk         (0x1UL)                   /*!< RTC_0 CONFIG: ALM0AREN (Bitfield-Mask: 0x01)          */
#define RTC_0_CONFIG_RUN_Pos              (1UL)                     /*!< RTC_0 CONFIG: RUN (Bit 1)                             */
#define RTC_0_CONFIG_RUN_Msk              (0x2UL)                   /*!< RTC_0 CONFIG: RUN (Bitfield-Mask: 0x01)               */
#define RTC_0_CONFIG_MCLKEN_Pos           (2UL)                     /*!< RTC_0 CONFIG: MCLKEN (Bit 2)                          */
#define RTC_0_CONFIG_MCLKEN_Msk           (0x4UL)                   /*!< RTC_0 CONFIG: MCLKEN (Bitfield-Mask: 0x01)            */
#define RTC_0_CONFIG_ASEN_Pos             (3UL)                     /*!< RTC_0 CONFIG: ASEN (Bit 3)                            */
#define RTC_0_CONFIG_ASEN_Msk             (0x8UL)                   /*!< RTC_0 CONFIG: ASEN (Bitfield-Mask: 0x01)              */
#define RTC_0_CONFIG_RTCLC_Pos            (4UL)                     /*!< RTC_0 CONFIG: RTCLC (Bit 4)                           */
#define RTC_0_CONFIG_RTCLC_Msk            (0xf0UL)                  /*!< RTC_0 CONFIG: RTCLC (Bitfield-Mask: 0x0f)             */
#define RTC_0_CONFIG_BDEN_Pos             (16UL)                    /*!< RTC_0 CONFIG: BDEN (Bit 16)                           */
#define RTC_0_CONFIG_BDEN_Msk             (0x10000UL)               /*!< RTC_0 CONFIG: BDEN (Bitfield-Mask: 0x01)              */
#define RTC_0_CONFIG_CRYSEN_Pos           (17UL)                    /*!< RTC_0 CONFIG: CRYSEN (Bit 17)                         */
#define RTC_0_CONFIG_CRYSEN_Msk           (0x20000UL)               /*!< RTC_0 CONFIG: CRYSEN (Bitfield-Mask: 0x01)            */
#define RTC_0_CONFIG_AGCEN_Pos            (18UL)                    /*!< RTC_0 CONFIG: AGCEN (Bit 18)                          */
#define RTC_0_CONFIG_AGCEN_Msk            (0x40000UL)               /*!< RTC_0 CONFIG: AGCEN (Bitfield-Mask: 0x01)             */
#define RTC_0_CONFIG_ALM0EN_Pos           (24UL)                    /*!< RTC_0 CONFIG: ALM0EN (Bit 24)                         */
#define RTC_0_CONFIG_ALM0EN_Msk           (0x1000000UL)             /*!< RTC_0 CONFIG: ALM0EN (Bitfield-Mask: 0x01)            */
#define RTC_0_CONFIG_ALM1EN_Pos           (25UL)                    /*!< RTC_0 CONFIG: ALM1EN (Bit 25)                         */
#define RTC_0_CONFIG_ALM1EN_Msk           (0x2000000UL)             /*!< RTC_0 CONFIG: ALM1EN (Bitfield-Mask: 0x01)            */
#define RTC_0_CONFIG_ALM2EN_Pos           (26UL)                    /*!< RTC_0 CONFIG: ALM2EN (Bit 26)                         */
#define RTC_0_CONFIG_ALM2EN_Msk           (0x4000000UL)             /*!< RTC_0 CONFIG: ALM2EN (Bitfield-Mask: 0x01)            */
#define RTC_0_CONFIG_RTCOEN_Pos           (29UL)                    /*!< RTC_0 CONFIG: RTCOEN (Bit 29)                         */
#define RTC_0_CONFIG_RTCOEN_Msk           (0x20000000UL)            /*!< RTC_0 CONFIG: RTCOEN (Bitfield-Mask: 0x01)            */
#define RTC_0_CONFIG_CLKSEL_Pos           (30UL)                    /*!< RTC_0 CONFIG: CLKSEL (Bit 30)                         */
#define RTC_0_CONFIG_CLKSEL_Msk           (0x40000000UL)            /*!< RTC_0 CONFIG: CLKSEL (Bitfield-Mask: 0x01)            */
#define RTC_0_CONFIG_RTCEN_Pos            (31UL)                    /*!< RTC_0 CONFIG: RTCEN (Bit 31)                          */
#define RTC_0_CONFIG_RTCEN_Msk            (0x80000000UL)            /*!< RTC_0 CONFIG: RTCEN (Bitfield-Mask: 0x01)             */
/* ========================================================  CONTROL  ======================================================== */
#define RTC_0_CONTROL_ALM0I_Pos           (0UL)                     /*!< RTC_0 CONTROL: ALM0I (Bit 0)                          */
#define RTC_0_CONTROL_ALM0I_Msk           (0x1UL)                   /*!< RTC_0 CONTROL: ALM0I (Bitfield-Mask: 0x01)            */
#define RTC_0_CONTROL_ALM1I_Pos           (1UL)                     /*!< RTC_0 CONTROL: ALM1I (Bit 1)                          */
#define RTC_0_CONTROL_ALM1I_Msk           (0x2UL)                   /*!< RTC_0 CONTROL: ALM1I (Bitfield-Mask: 0x01)            */
#define RTC_0_CONTROL_ALM2I_Pos           (2UL)                     /*!< RTC_0 CONTROL: ALM2I (Bit 2)                          */
#define RTC_0_CONTROL_ALM2I_Msk           (0x4UL)                   /*!< RTC_0 CONTROL: ALM2I (Bitfield-Mask: 0x01)            */
#define RTC_0_CONTROL_TMRCAP_Pos          (3UL)                     /*!< RTC_0 CONTROL: TMRCAP (Bit 3)                         */
#define RTC_0_CONTROL_TMRCAP_Msk          (0x8UL)                   /*!< RTC_0 CONTROL: TMRCAP (Bitfield-Mask: 0x01)           */
#define RTC_0_CONTROL_TMRSET_Pos          (4UL)                     /*!< RTC_0 CONTROL: TMRSET (Bit 4)                         */
#define RTC_0_CONTROL_TMRSET_Msk          (0x10UL)                  /*!< RTC_0 CONTROL: TMRSET (Bitfield-Mask: 0x01)           */
#define RTC_0_CONTROL_CLKVF_Pos           (5UL)                     /*!< RTC_0 CONTROL: CLKVF (Bit 5)                          */
#define RTC_0_CONTROL_CLKVF_Msk           (0x20UL)                  /*!< RTC_0 CONTROL: CLKVF (Bitfield-Mask: 0x01)            */
#define RTC_0_CONTROL_OSCFI_Pos           (6UL)                     /*!< RTC_0 CONTROL: OSCFI (Bit 6)                          */
#define RTC_0_CONTROL_OSCFI_Msk           (0x40UL)                  /*!< RTC_0 CONTROL: OSCFI (Bitfield-Mask: 0x01)            */
#define RTC_0_CONTROL_HSMDEN_Pos          (7UL)                     /*!< RTC_0 CONTROL: HSMDEN (Bit 7)                         */
#define RTC_0_CONTROL_HSMDEN_Msk          (0x80UL)                  /*!< RTC_0 CONTROL: HSMDEN (Bitfield-Mask: 0x01)           */
#define RTC_0_CONTROL_LRDYF_Pos           (8UL)                     /*!< RTC_0 CONTROL: LRDYF (Bit 8)                          */
#define RTC_0_CONTROL_LRDYF_Msk           (0x100UL)                 /*!< RTC_0 CONTROL: LRDYF (Bitfield-Mask: 0x01)            */
/* ========================================================  ALARM0  ========================================================= */
#define RTC_0_ALARM0_ALARM0_Pos           (0UL)                     /*!< RTC_0 ALARM0: ALARM0 (Bit 0)                          */
#define RTC_0_ALARM0_ALARM0_Msk           (0xffffffffUL)            /*!< RTC_0 ALARM0: ALARM0 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  ALARM1  ========================================================= */
#define RTC_0_ALARM1_ALARM1_Pos           (0UL)                     /*!< RTC_0 ALARM1: ALARM1 (Bit 0)                          */
#define RTC_0_ALARM1_ALARM1_Msk           (0xffffffffUL)            /*!< RTC_0 ALARM1: ALARM1 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  ALARM2  ========================================================= */
#define RTC_0_ALARM2_ALARM2_Pos           (0UL)                     /*!< RTC_0 ALARM2: ALARM2 (Bit 0)                          */
#define RTC_0_ALARM2_ALARM2_Msk           (0xffffffffUL)            /*!< RTC_0 ALARM2: ALARM2 (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  SETCAP  ========================================================= */
#define RTC_0_SETCAP_SETCAP_Pos           (0UL)                     /*!< RTC_0 SETCAP: SETCAP (Bit 0)                          */
#define RTC_0_SETCAP_SETCAP_Msk           (0xffffffffUL)            /*!< RTC_0 SETCAP: SETCAP (Bitfield-Mask: 0xffffffff)      */
/* ======================================================  LFOCONTROL  ======================================================= */
#define RTC_0_LFOCONTROL_LFOSCEN_Pos      (31UL)                    /*!< RTC_0 LFOCONTROL: LFOSCEN (Bit 31)                    */
#define RTC_0_LFOCONTROL_LFOSCEN_Msk      (0x80000000UL)            /*!< RTC_0 LFOCONTROL: LFOSCEN (Bitfield-Mask: 0x01)       */
/* =======================================================  LFOSCADJ  ======================================================== */
#define RTC_0_LFOSCADJ_LFOSCADJ_Pos       (0UL)                     /*!< RTC_0 LFOSCADJ: LFOSCADJ (Bit 0)                      */
#define RTC_0_LFOSCADJ_LFOSCADJ_Msk       (0xfUL)                   /*!< RTC_0 LFOSCADJ: LFOSCADJ (Bitfield-Mask: 0x0f)        */


/* =========================================================================================================================== */
/* ================                                         RSTSRC_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  RESETEN  ======================================================== */
#define RSTSRC_0_RESETEN_VMONREN_Pos      (2UL)                     /*!< RSTSRC_0 RESETEN: VMONREN (Bit 2)                     */
#define RSTSRC_0_RESETEN_VMONREN_Msk      (0x4UL)                   /*!< RSTSRC_0 RESETEN: VMONREN (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETEN_MCDREN_Pos       (4UL)                     /*!< RSTSRC_0 RESETEN: MCDREN (Bit 4)                      */
#define RSTSRC_0_RESETEN_MCDREN_Msk       (0x10UL)                  /*!< RSTSRC_0 RESETEN: MCDREN (Bitfield-Mask: 0x01)        */
#define RSTSRC_0_RESETEN_WDTREN_Pos       (5UL)                     /*!< RSTSRC_0 RESETEN: WDTREN (Bit 5)                      */
#define RSTSRC_0_RESETEN_WDTREN_Msk       (0x20UL)                  /*!< RSTSRC_0 RESETEN: WDTREN (Bitfield-Mask: 0x01)        */
#define RSTSRC_0_RESETEN_SWREN_Pos        (6UL)                     /*!< RSTSRC_0 RESETEN: SWREN (Bit 6)                       */
#define RSTSRC_0_RESETEN_SWREN_Msk        (0x40UL)                  /*!< RSTSRC_0 RESETEN: SWREN (Bitfield-Mask: 0x01)         */
#define RSTSRC_0_RESETEN_CMP0REN_Pos      (7UL)                     /*!< RSTSRC_0 RESETEN: CMP0REN (Bit 7)                     */
#define RSTSRC_0_RESETEN_CMP0REN_Msk      (0x80UL)                  /*!< RSTSRC_0 RESETEN: CMP0REN (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETEN_CMP1REN_Pos      (8UL)                     /*!< RSTSRC_0 RESETEN: CMP1REN (Bit 8)                     */
#define RSTSRC_0_RESETEN_CMP1REN_Msk      (0x100UL)                 /*!< RSTSRC_0 RESETEN: CMP1REN (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETEN_USB0REN_Pos      (9UL)                     /*!< RSTSRC_0 RESETEN: USB0REN (Bit 9)                     */
#define RSTSRC_0_RESETEN_USB0REN_Msk      (0x200UL)                 /*!< RSTSRC_0 RESETEN: USB0REN (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETEN_RTC0REN_Pos      (10UL)                    /*!< RSTSRC_0 RESETEN: RTC0REN (Bit 10)                    */
#define RSTSRC_0_RESETEN_RTC0REN_Msk      (0x400UL)                 /*!< RSTSRC_0 RESETEN: RTC0REN (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETEN_WAKEREN_Pos      (11UL)                    /*!< RSTSRC_0 RESETEN: WAKEREN (Bit 11)                    */
#define RSTSRC_0_RESETEN_WAKEREN_Msk      (0x800UL)                 /*!< RSTSRC_0 RESETEN: WAKEREN (Bitfield-Mask: 0x01)       */
/* =======================================================  RESETFLAG  ======================================================= */
#define RSTSRC_0_RESETFLAG_PINRF_Pos      (0UL)                     /*!< RSTSRC_0 RESETFLAG: PINRF (Bit 0)                     */
#define RSTSRC_0_RESETFLAG_PINRF_Msk      (0x1UL)                   /*!< RSTSRC_0 RESETFLAG: PINRF (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETFLAG_PORRF_Pos      (1UL)                     /*!< RSTSRC_0 RESETFLAG: PORRF (Bit 1)                     */
#define RSTSRC_0_RESETFLAG_PORRF_Msk      (0x2UL)                   /*!< RSTSRC_0 RESETFLAG: PORRF (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETFLAG_VMONRF_Pos     (2UL)                     /*!< RSTSRC_0 RESETFLAG: VMONRF (Bit 2)                    */
#define RSTSRC_0_RESETFLAG_VMONRF_Msk     (0x4UL)                   /*!< RSTSRC_0 RESETFLAG: VMONRF (Bitfield-Mask: 0x01)      */
#define RSTSRC_0_RESETFLAG_CORERF_Pos     (3UL)                     /*!< RSTSRC_0 RESETFLAG: CORERF (Bit 3)                    */
#define RSTSRC_0_RESETFLAG_CORERF_Msk     (0x8UL)                   /*!< RSTSRC_0 RESETFLAG: CORERF (Bitfield-Mask: 0x01)      */
#define RSTSRC_0_RESETFLAG_MCDRF_Pos      (4UL)                     /*!< RSTSRC_0 RESETFLAG: MCDRF (Bit 4)                     */
#define RSTSRC_0_RESETFLAG_MCDRF_Msk      (0x10UL)                  /*!< RSTSRC_0 RESETFLAG: MCDRF (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETFLAG_WDTRF_Pos      (5UL)                     /*!< RSTSRC_0 RESETFLAG: WDTRF (Bit 5)                     */
#define RSTSRC_0_RESETFLAG_WDTRF_Msk      (0x20UL)                  /*!< RSTSRC_0 RESETFLAG: WDTRF (Bitfield-Mask: 0x01)       */
#define RSTSRC_0_RESETFLAG_SWRF_Pos       (6UL)                     /*!< RSTSRC_0 RESETFLAG: SWRF (Bit 6)                      */
#define RSTSRC_0_RESETFLAG_SWRF_Msk       (0x40UL)                  /*!< RSTSRC_0 RESETFLAG: SWRF (Bitfield-Mask: 0x01)        */
#define RSTSRC_0_RESETFLAG_CMP0RF_Pos     (7UL)                     /*!< RSTSRC_0 RESETFLAG: CMP0RF (Bit 7)                    */
#define RSTSRC_0_RESETFLAG_CMP0RF_Msk     (0x80UL)                  /*!< RSTSRC_0 RESETFLAG: CMP0RF (Bitfield-Mask: 0x01)      */
#define RSTSRC_0_RESETFLAG_CMP1RF_Pos     (8UL)                     /*!< RSTSRC_0 RESETFLAG: CMP1RF (Bit 8)                    */
#define RSTSRC_0_RESETFLAG_CMP1RF_Msk     (0x100UL)                 /*!< RSTSRC_0 RESETFLAG: CMP1RF (Bitfield-Mask: 0x01)      */
#define RSTSRC_0_RESETFLAG_USB0RF_Pos     (9UL)                     /*!< RSTSRC_0 RESETFLAG: USB0RF (Bit 9)                    */
#define RSTSRC_0_RESETFLAG_USB0RF_Msk     (0x200UL)                 /*!< RSTSRC_0 RESETFLAG: USB0RF (Bitfield-Mask: 0x01)      */
#define RSTSRC_0_RESETFLAG_RTC0RF_Pos     (10UL)                    /*!< RSTSRC_0 RESETFLAG: RTC0RF (Bit 10)                   */
#define RSTSRC_0_RESETFLAG_RTC0RF_Msk     (0x400UL)                 /*!< RSTSRC_0 RESETFLAG: RTC0RF (Bitfield-Mask: 0x01)      */
#define RSTSRC_0_RESETFLAG_WAKERF_Pos     (11UL)                    /*!< RSTSRC_0 RESETFLAG: WAKERF (Bit 11)                   */
#define RSTSRC_0_RESETFLAG_WAKERF_Msk     (0x800UL)                 /*!< RSTSRC_0 RESETFLAG: WAKERF (Bitfield-Mask: 0x01)      */
/* ========================================================  CONFIG  ========================================================= */
#define RSTSRC_0_CONFIG_PMSEL_Pos         (0UL)                     /*!< RSTSRC_0 CONFIG: PMSEL (Bit 0)                        */
#define RSTSRC_0_CONFIG_PMSEL_Msk         (0x1UL)                   /*!< RSTSRC_0 CONFIG: PMSEL (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */

