chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =========================================================  DATA  ========================================================== */
#define SPI_DATA_DATA_Pos                 (0UL)                     /*!< SPI DATA: DATA (Bit 0)                                */
#define SPI_DATA_DATA_Msk                 (0xffffffffUL)            /*!< SPI DATA: DATA (Bitfield-Mask: 0xffffffff)            */
/* ========================================================  CONTROL  ======================================================== */
#define SPI_CONTROL_RFRQI_Pos             (0UL)                     /*!< SPI CONTROL: RFRQI (Bit 0)                            */
#define SPI_CONTROL_RFRQI_Msk             (0x1UL)                   /*!< SPI CONTROL: RFRQI (Bitfield-Mask: 0x01)              */
#define SPI_CONTROL_RFORI_Pos             (1UL)                     /*!< SPI CONTROL: RFORI (Bit 1)                            */
#define SPI_CONTROL_RFORI_Msk             (0x2UL)                   /*!< SPI CONTROL: RFORI (Bitfield-Mask: 0x01)              */
#define SPI_CONTROL_TFRQI_Pos             (2UL)                     /*!< SPI CONTROL: TFRQI (Bit 2)                            */
#define SPI_CONTROL_TFRQI_Msk             (0x4UL)                   /*!< SPI CONTROL: TFRQI (Bitfield-Mask: 0x01)              */
#define SPI_CONTROL_TFORI_Pos             (3UL)                     /*!< SPI CONTROL: TFORI (Bit 3)                            */
#define SPI_CONTROL_TFORI_Msk             (0x8UL)                   /*!< SPI CONTROL: TFORI (Bitfield-Mask: 0x01)              */
#define SPI_CONTROL_SLVSELI_Pos           (4UL)                     /*!< SPI CONTROL: SLVSELI (Bit 4)                          */
#define SPI_CONTROL_SLVSELI_Msk           (0x10UL)                  /*!< SPI CONTROL: SLVSELI (Bitfield-Mask: 0x01)            */
#define SPI_CONTROL_MDFI_Pos              (5UL)                     /*!< SPI CONTROL: MDFI (Bit 5)                             */
#define SPI_CONTROL_MDFI_Msk              (0x20UL)                  /*!< SPI CONTROL: MDFI (Bitfield-Mask: 0x01)               */
#define SPI_CONTROL_URI_Pos               (6UL)                     /*!< SPI CONTROL: URI (Bit 6)                              */
#define SPI_CONTROL_URI_Msk               (0x40UL)                  /*!< SPI CONTROL: URI (Bitfield-Mask: 0x01)                */
#define SPI_CONTROL_SREI_Pos              (7UL)                     /*!< SPI CONTROL: SREI (Bit 7)                             */
#define SPI_CONTROL_SREI_Msk              (0x80UL)                  /*!< SPI CONTROL: SREI (Bitfield-Mask: 0x01)               */
#define SPI_CONTROL_RFILI_Pos             (8UL)                     /*!< SPI CONTROL: RFILI (Bit 8)                            */
#define SPI_CONTROL_RFILI_Msk             (0x100UL)                 /*!< SPI CONTROL: RFILI (Bitfield-Mask: 0x01)              */
#define SPI_CONTROL_TFILI_Pos             (9UL)                     /*!< SPI CONTROL: TFILI (Bit 9)                            */
#define SPI_CONTROL_TFILI_Msk             (0x200UL)                 /*!< SPI CONTROL: TFILI (Bitfield-Mask: 0x01)              */
#define SPI_CONTROL_NSSSTS_Pos            (14UL)                    /*!< SPI CONTROL: NSSSTS (Bit 14)                          */
#define SPI_CONTROL_NSSSTS_Msk            (0x4000UL)                /*!< SPI CONTROL: NSSSTS (Bitfield-Mask: 0x01)             */
#define SPI_CONTROL_BUSYF_Pos             (15UL)                    /*!< SPI CONTROL: BUSYF (Bit 15)                           */
#define SPI_CONTROL_BUSYF_Msk             (0x8000UL)                /*!< SPI CONTROL: BUSYF (Bitfield-Mask: 0x01)              */
#define SPI_CONTROL_RFCNT_Pos             (16UL)                    /*!< SPI CONTROL: RFCNT (Bit 16)                           */
#define SPI_CONTROL_RFCNT_Msk             (0xf0000UL)               /*!< SPI CONTROL: RFCNT (Bitfield-Mask: 0x0f)              */
#define SPI_CONTROL_TFCNT_Pos             (20UL)                    /*!< SPI CONTROL: TFCNT (Bit 20)                           */
#define SPI_CONTROL_TFCNT_Msk             (0xf00000UL)              /*!< SPI CONTROL: TFCNT (Bitfield-Mask: 0x0f)              */
#define SPI_CONTROL_DBGMD_Pos             (24UL)                    /*!< SPI CONTROL: DBGMD (Bit 24)                           */
#define SPI_CONTROL_DBGMD_Msk             (0x1000000UL)             /*!< SPI CONTROL: DBGMD (Bitfield-Mask: 0x01)              */
/* ========================================================  CONFIG  ========================================================= */
#define SPI_CONFIG_RFRQIEN_Pos            (0UL)                     /*!< SPI CONFIG: RFRQIEN (Bit 0)                           */
#define SPI_CONFIG_RFRQIEN_Msk            (0x1UL)                   /*!< SPI CONFIG: RFRQIEN (Bitfield-Mask: 0x01)             */
#define SPI_CONFIG_RFORIEN_Pos            (1UL)                     /*!< SPI CONFIG: RFORIEN (Bit 1)                           */
#define SPI_CONFIG_RFORIEN_Msk            (0x2UL)                   /*!< SPI CONFIG: RFORIEN (Bitfield-Mask: 0x01)             */
#define SPI_CONFIG_TFRQIEN_Pos            (2UL)                     /*!< SPI CONFIG: TFRQIEN (Bit 2)                           */
#define SPI_CONFIG_TFRQIEN_Msk            (0x4UL)                   /*!< SPI CONFIG: TFRQIEN (Bitfield-Mask: 0x01)             */
#define SPI_CONFIG_TFORIEN_Pos            (3UL)                     /*!< SPI CONFIG: TFORIEN (Bit 3)                           */
#define SPI_CONFIG_TFORIEN_Msk            (0x8UL)                   /*!< SPI CONFIG: TFORIEN (Bitfield-Mask: 0x01)             */
#define SPI_CONFIG_SLVSELIEN_Pos          (4UL)                     /*!< SPI CONFIG: SLVSELIEN (Bit 4)                         */
#define SPI_CONFIG_SLVSELIEN_Msk          (0x10UL)                  /*!< SPI CONFIG: SLVSELIEN (Bitfield-Mask: 0x01)           */
#define SPI_CONFIG_MDFIEN_Pos             (5UL)                     /*!< SPI CONFIG: MDFIEN (Bit 5)                            */
#define SPI_CONFIG_MDFIEN_Msk             (0x20UL)                  /*!< SPI CONFIG: MDFIEN (Bitfield-Mask: 0x01)              */
#define SPI_CONFIG_URIEN_Pos              (6UL)                     /*!< SPI CONFIG: URIEN (Bit 6)                             */
#define SPI_CONFIG_URIEN_Msk              (0x40UL)                  /*!< SPI CONFIG: URIEN (Bitfield-Mask: 0x01)               */
#define SPI_CONFIG_SREIEN_Pos             (7UL)                     /*!< SPI CONFIG: SREIEN (Bit 7)                            */
#define SPI_CONFIG_SREIEN_Msk             (0x80UL)                  /*!< SPI CONFIG: SREIEN (Bitfield-Mask: 0x01)              */
#define SPI_CONFIG_SPIEN_Pos              (8UL)                     /*!< SPI CONFIG: SPIEN (Bit 8)                             */
#define SPI_CONFIG_SPIEN_Msk              (0x100UL)                 /*!< SPI CONFIG: SPIEN (Bitfield-Mask: 0x01)               */
#define SPI_CONFIG_MSTEN_Pos              (9UL)                     /*!< SPI CONFIG: MSTEN (Bit 9)                             */
#define SPI_CONFIG_MSTEN_Msk              (0x200UL)                 /*!< SPI CONFIG: MSTEN (Bitfield-Mask: 0x01)               */
#define SPI_CONFIG_CLKPOL_Pos             (10UL)                    /*!< SPI CONFIG: CLKPOL (Bit 10)                           */
#define SPI_CONFIG_CLKPOL_Msk             (0x400UL)                 /*!< SPI CONFIG: CLKPOL (Bitfield-Mask: 0x01)              */
#define SPI_CONFIG_CLKPHA_Pos             (11UL)                    /*!< SPI CONFIG: CLKPHA (Bit 11)                           */
#define SPI_CONFIG_CLKPHA_Msk             (0x800UL)                 /*!< SPI CONFIG: CLKPHA (Bitfield-Mask: 0x01)              */
#define SPI_CONFIG_NSSPOL_Pos             (12UL)                    /*!< SPI CONFIG: NSSPOL (Bit 12)                           */
#define SPI_CONFIG_NSSPOL_Msk             (0x1000UL)                /*!< SPI CONFIG: NSSPOL (Bitfield-Mask: 0x01)              */
#define SPI_CONFIG_DDIRSEL_Pos            (13UL)                    /*!< SPI CONFIG: DDIRSEL (Bit 13)                          */
#define SPI_CONFIG_DDIRSEL_Msk            (0x2000UL)                /*!< SPI CONFIG: DDIRSEL (Bitfield-Mask: 0x01)             */
#define SPI_CONFIG_NSSMD_Pos              (14UL)                    /*!< SPI CONFIG: NSSMD (Bit 14)                            */
#define SPI_CONFIG_NSSMD_Msk              (0xc000UL)                /*!< SPI CONFIG: NSSMD (Bitfield-Mask: 0x03)               */
#define SPI_CONFIG_RFTH_Pos               (16UL)                    /*!< SPI CONFIG: RFTH (Bit 16)                             */
#define SPI_CONFIG_RFTH_Msk               (0x30000UL)               /*!< SPI CONFIG: RFTH (Bitfield-Mask: 0x03)                */
#define SPI_CONFIG_TFTH_Pos               (18UL)                    /*!< SPI CONFIG: TFTH (Bit 18)                             */
#define SPI_CONFIG_TFTH_Msk               (0xc0000UL)               /*!< SPI CONFIG: TFTH (Bitfield-Mask: 0x03)                */
#define SPI_CONFIG_DSIZE_Pos              (20UL)                    /*!< SPI CONFIG: DSIZE (Bit 20)                            */
#define SPI_CONFIG_DSIZE_Msk              (0xf00000UL)              /*!< SPI CONFIG: DSIZE (Bitfield-Mask: 0x0f)               */
#define SPI_CONFIG_DMAEN_Pos              (24UL)                    /*!< SPI CONFIG: DMAEN (Bit 24)                            */
#define SPI_CONFIG_DMAEN_Msk              (0x1000000UL)             /*!< SPI CONFIG: DMAEN (Bitfield-Mask: 0x01)               */
#define SPI_CONFIG_RFIFOFL_Pos            (29UL)                    /*!< SPI CONFIG: RFIFOFL (Bit 29)                          */
#define SPI_CONFIG_RFIFOFL_Msk            (0x20000000UL)            /*!< SPI CONFIG: RFIFOFL (Bitfield-Mask: 0x01)             */
#define SPI_CONFIG_TFIFOFL_Pos            (30UL)                    /*!< SPI CONFIG: TFIFOFL (Bit 30)                          */
#define SPI_CONFIG_TFIFOFL_Msk            (0x40000000UL)            /*!< SPI CONFIG: TFIFOFL (Bitfield-Mask: 0x01)             */
#define SPI_CONFIG_RESET_Pos              (31UL)                    /*!< SPI CONFIG: RESET (Bit 31)                            */
#define SPI_CONFIG_RESET_Msk              (0x80000000UL)            /*!< SPI CONFIG: RESET (Bitfield-Mask: 0x01)               */
/* ========================================================  CLKRATE  ======================================================== */
#define SPI_CLKRATE_CLKDIV_Pos            (0UL)                     /*!< SPI CLKRATE: CLKDIV (Bit 0)                           */
#define SPI_CLKRATE_CLKDIV_Msk            (0xffffUL)                /*!< SPI CLKRATE: CLKDIV (Bitfield-Mask: 0xffff)           */
/* ========================================================  FSTATUS  ======================================================== */
#define SPI_FSTATUS_RFRPTR_Pos            (0UL)                     /*!< SPI FSTATUS: RFRPTR (Bit 0)                           */
#define SPI_FSTATUS_RFRPTR_Msk            (0xfUL)                   /*!< SPI FSTATUS: RFRPTR (Bitfield-Mask: 0x0f)             */
#define SPI_FSTATUS_RFWPTR_Pos            (4UL)                     /*!< SPI FSTATUS: RFWPTR (Bit 4)                           */
#define SPI_FSTATUS_RFWPTR_Msk            (0xf0UL)                  /*!< SPI FSTATUS: RFWPTR (Bitfield-Mask: 0x0f)             */
#define SPI_FSTATUS_TFRPTR_Pos            (8UL)                     /*!< SPI FSTATUS: TFRPTR (Bit 8)                           */
#define SPI_FSTATUS_TFRPTR_Msk            (0xf00UL)                 /*!< SPI FSTATUS: TFRPTR (Bitfield-Mask: 0x0f)             */
#define SPI_FSTATUS_TFWPTR_Pos            (12UL)                    /*!< SPI FSTATUS: TFWPTR (Bit 12)                          */
#define SPI_FSTATUS_TFWPTR_Msk            (0xf000UL)                /*!< SPI FSTATUS: TFWPTR (Bitfield-Mask: 0x0f)             */


/* =========================================================================================================================== */
/* ================                                           SSG_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
#define SSG_0_CONFIG_COUNT_Pos            (0UL)                     /*!< SSG_0 CONFIG: COUNT (Bit 0)                           */
#define SSG_0_CONFIG_COUNT_Msk            (0xfffUL)                 /*!< SSG_0 CONFIG: COUNT (Bitfield-Mask: 0xfff)            */
#define SSG_0_CONFIG_SSEL_Pos             (12UL)                    /*!< SSG_0 CONFIG: SSEL (Bit 12)                           */
#define SSG_0_CONFIG_SSEL_Msk             (0x1000UL)                /*!< SSG_0 CONFIG: SSEL (Bitfield-Mask: 0x01)              */
#define SSG_0_CONFIG_PHGFREN_Pos          (13UL)                    /*!< SSG_0 CONFIG: PHGFREN (Bit 13)                        */
#define SSG_0_CONFIG_PHGFREN_Msk          (0x2000UL)                /*!< SSG_0 CONFIG: PHGFREN (Bitfield-Mask: 0x01)           */
#define SSG_0_CONFIG_PUGFREN_Pos          (14UL)                    /*!< SSG_0 CONFIG: PUGFREN (Bit 14)                        */
#define SSG_0_CONFIG_PUGFREN_Msk          (0x4000UL)                /*!< SSG_0 CONFIG: PUGFREN (Bitfield-Mask: 0x01)           */
/* ========================================================  CONTROL  ======================================================== */
#define SSG_0_CONTROL_EX0INVEN_Pos        (0UL)                     /*!< SSG_0 CONTROL: EX0INVEN (Bit 0)                       */
#define SSG_0_CONTROL_EX0INVEN_Msk        (0x1UL)                   /*!< SSG_0 CONTROL: EX0INVEN (Bitfield-Mask: 0x01)         */
#define SSG_0_CONTROL_EX1INVEN_Pos        (1UL)                     /*!< SSG_0 CONTROL: EX1INVEN (Bit 1)                       */
#define SSG_0_CONTROL_EX1INVEN_Msk        (0x2UL)                   /*!< SSG_0 CONTROL: EX1INVEN (Bitfield-Mask: 0x01)         */
#define SSG_0_CONTROL_EX2INVEN_Pos        (2UL)                     /*!< SSG_0 CONTROL: EX2INVEN (Bit 2)                       */
#define SSG_0_CONTROL_EX2INVEN_Msk        (0x4UL)                   /*!< SSG_0 CONTROL: EX2INVEN (Bitfield-Mask: 0x01)         */
#define SSG_0_CONTROL_EX3INVEN_Pos        (3UL)                     /*!< SSG_0 CONTROL: EX3INVEN (Bit 3)                       */
#define SSG_0_CONTROL_EX3INVEN_Msk        (0x8UL)                   /*!< SSG_0 CONTROL: EX3INVEN (Bitfield-Mask: 0x01)         */
#define SSG_0_CONTROL_EX0EN_Pos           (4UL)                     /*!< SSG_0 CONTROL: EX0EN (Bit 4)                          */
#define SSG_0_CONTROL_EX0EN_Msk           (0x10UL)                  /*!< SSG_0 CONTROL: EX0EN (Bitfield-Mask: 0x01)            */
#define SSG_0_CONTROL_EX1EN_Pos           (5UL)                     /*!< SSG_0 CONTROL: EX1EN (Bit 5)                          */
#define SSG_0_CONTROL_EX1EN_Msk           (0x20UL)                  /*!< SSG_0 CONTROL: EX1EN (Bitfield-Mask: 0x01)            */
#define SSG_0_CONTROL_EX2EN_Pos           (6UL)                     /*!< SSG_0 CONTROL: EX2EN (Bit 6)                          */
#define SSG_0_CONTROL_EX2EN_Msk           (0x40UL)                  /*!< SSG_0 CONTROL: EX2EN (Bitfield-Mask: 0x01)            */
#define SSG_0_CONTROL_EX3EN_Pos           (7UL)                     /*!< SSG_0 CONTROL: EX3EN (Bit 7)                          */
#define SSG_0_CONTROL_EX3EN_Msk           (0x80UL)                  /*!< SSG_0 CONTROL: EX3EN (Bitfield-Mask: 0x01)            */
#define SSG_0_CONTROL_STATUS_Pos          (8UL)                     /*!< SSG_0 CONTROL: STATUS (Bit 8)                         */
#define SSG_0_CONTROL_STATUS_Msk          (0x100UL)                 /*!< SSG_0 CONTROL: STATUS (Bitfield-Mask: 0x01)           */


/* =========================================================================================================================== */
/* ================                                          TIMER_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
#define TIMER_0_CONFIG_LCLK_Pos           (0UL)                     /*!< TIMER_0 CONFIG: LCLK (Bit 0)                          */
#define TIMER_0_CONFIG_LCLK_Msk           (0x3UL)                   /*!< TIMER_0 CONFIG: LCLK (Bitfield-Mask: 0x03)            */
#define TIMER_0_CONFIG_LMSTREN_Pos        (4UL)                     /*!< TIMER_0 CONFIG: LMSTREN (Bit 4)                       */
#define TIMER_0_CONFIG_LMSTREN_Msk        (0x10UL)                  /*!< TIMER_0 CONFIG: LMSTREN (Bitfield-Mask: 0x01)         */
#define TIMER_0_CONFIG_SPLITEN_Pos        (5UL)                     /*!< TIMER_0 CONFIG: SPLITEN (Bit 5)                       */
#define TIMER_0_CONFIG_SPLITEN_Msk        (0x20UL)                  /*!< TIMER_0 CONFIG: SPLITEN (Bitfield-Mask: 0x01)         */
#define TIMER_0_CONFIG_LEXIEN_Pos         (6UL)                     /*!< TIMER_0 CONFIG: LEXIEN (Bit 6)                        */
#define TIMER_0_CONFIG_LEXIEN_Msk         (0x40UL)                  /*!< TIMER_0 CONFIG: LEXIEN (Bitfield-Mask: 0x01)          */
#define TIMER_0_CONFIG_LOVFIEN_Pos        (7UL)                     /*!< TIMER_0 CONFIG: LOVFIEN (Bit 7)                       */
#define TIMER_0_CONFIG_LOVFIEN_Msk        (0x80UL)                  /*!< TIMER_0 CONFIG: LOVFIEN (Bitfield-Mask: 0x01)         */
#define TIMER_0_CONFIG_LMD_Pos            (8UL)                     /*!< TIMER_0 CONFIG: LMD (Bit 8)                           */
#define TIMER_0_CONFIG_LMD_Msk            (0x700UL)                 /*!< TIMER_0 CONFIG: LMD (Bitfield-Mask: 0x07)             */
#define TIMER_0_CONFIG_LSTATE_Pos         (12UL)                    /*!< TIMER_0 CONFIG: LSTATE (Bit 12)                       */
#define TIMER_0_CONFIG_LSTATE_Msk         (0x1000UL)                /*!< TIMER_0 CONFIG: LSTATE (Bitfield-Mask: 0x01)          */
#define TIMER_0_CONFIG_LRUN_Pos           (13UL)                    /*!< TIMER_0 CONFIG: LRUN (Bit 13)                         */
#define TIMER_0_CONFIG_LRUN_Msk           (0x2000UL)                /*!< TIMER_0 CONFIG: LRUN (Bitfield-Mask: 0x01)            */
#define TIMER_0_CONFIG_LEXI_Pos           (14UL)                    /*!< TIMER_0 CONFIG: LEXI (Bit 14)                         */
#define TIMER_0_CONFIG_LEXI_Msk           (0x4000UL)                /*!< TIMER_0 CONFIG: LEXI (Bitfield-Mask: 0x01)            */
#define TIMER_0_CONFIG_LOVFI_Pos          (15UL)                    /*!< TIMER_0 CONFIG: LOVFI (Bit 15)                        */
#define TIMER_0_CONFIG_LOVFI_Msk          (0x8000UL)                /*!< TIMER_0 CONFIG: LOVFI (Bitfield-Mask: 0x01)           */
#define TIMER_0_CONFIG_HCLK_Pos           (16UL)                    /*!< TIMER_0 CONFIG: HCLK (Bit 16)                         */
#define TIMER_0_CONFIG_HCLK_Msk           (0x30000UL)               /*!< TIMER_0 CONFIG: HCLK (Bitfield-Mask: 0x03)            */
#define TIMER_0_CONFIG_MSTRUN_Pos         (19UL)                    /*!< TIMER_0 CONFIG: MSTRUN (Bit 19)                       */
#define TIMER_0_CONFIG_MSTRUN_Msk         (0x80000UL)               /*!< TIMER_0 CONFIG: MSTRUN (Bitfield-Mask: 0x01)          */
#define TIMER_0_CONFIG_HMSTREN_Pos        (20UL)                    /*!< TIMER_0 CONFIG: HMSTREN (Bit 20)                      */
#define TIMER_0_CONFIG_HMSTREN_Msk        (0x100000UL)              /*!< TIMER_0 CONFIG: HMSTREN (Bitfield-Mask: 0x01)         */
#define TIMER_0_CONFIG_DBGMD_Pos          (21UL)                    /*!< TIMER_0 CONFIG: DBGMD (Bit 21)                        */
#define TIMER_0_CONFIG_DBGMD_Msk          (0x200000UL)              /*!< TIMER_0 CONFIG: DBGMD (Bitfield-Mask: 0x01)           */
#define TIMER_0_CONFIG_HEXIEN_Pos         (22UL)                    /*!< TIMER_0 CONFIG: HEXIEN (Bit 22)                       */
#define TIMER_0_CONFIG_HEXIEN_Msk         (0x400000UL)              /*!< TIMER_0 CONFIG: HEXIEN (Bitfield-Mask: 0x01)          */
#define TIMER_0_CONFIG_HOVFIEN_Pos        (23UL)                    /*!< TIMER_0 CONFIG: HOVFIEN (Bit 23)                      */
#define TIMER_0_CONFIG_HOVFIEN_Msk        (0x800000UL)              /*!< TIMER_0 CONFIG: HOVFIEN (Bitfield-Mask: 0x01)         */
#define TIMER_0_CONFIG_HMD_Pos            (24UL)                    /*!< TIMER_0 CONFIG: HMD (Bit 24)                          */
#define TIMER_0_CONFIG_HMD_Msk            (0xf000000UL)             /*!< TIMER_0 CONFIG: HMD (Bitfield-Mask: 0x0f)             */
#define TIMER_0_CONFIG_HSTATE_Pos         (28UL)                    /*!< TIMER_0 CONFIG: HSTATE (Bit 28)                       */
#define TIMER_0_CONFIG_HSTATE_Msk         (0x10000000UL)            /*!< TIMER_0 CONFIG: HSTATE (Bitfield-Mask: 0x01)          */
#define TIMER_0_CONFIG_HRUN_Pos           (29UL)                    /*!< TIMER_0 CONFIG: HRUN (Bit 29)                         */
#define TIMER_0_CONFIG_HRUN_Msk           (0x20000000UL)            /*!< TIMER_0 CONFIG: HRUN (Bitfield-Mask: 0x01)            */
#define TIMER_0_CONFIG_HEXI_Pos           (30UL)                    /*!< TIMER_0 CONFIG: HEXI (Bit 30)                         */
#define TIMER_0_CONFIG_HEXI_Msk           (0x40000000UL)            /*!< TIMER_0 CONFIG: HEXI (Bitfield-Mask: 0x01)            */
#define TIMER_0_CONFIG_HOVFI_Pos          (31UL)                    /*!< TIMER_0 CONFIG: HOVFI (Bit 31)                        */
#define TIMER_0_CONFIG_HOVFI_Msk          (0x80000000UL)            /*!< TIMER_0 CONFIG: HOVFI (Bitfield-Mask: 0x01)           */
/* ========================================================  CLKDIV  ========================================================= */
#define TIMER_0_CLKDIV_CLKDIVRL_Pos       (0UL)                     /*!< TIMER_0 CLKDIV: CLKDIVRL (Bit 0)                      */
#define TIMER_0_CLKDIV_CLKDIVRL_Msk       (0xffUL)                  /*!< TIMER_0 CLKDIV: CLKDIVRL (Bitfield-Mask: 0xff)        */
#define TIMER_0_CLKDIV_CLKDIVCT_Pos       (16UL)                    /*!< TIMER_0 CLKDIV: CLKDIVCT (Bit 16)                     */
#define TIMER_0_CLKDIV_CLKDIVCT_Msk       (0xff0000UL)              /*!< TIMER_0 CLKDIV: CLKDIVCT (Bitfield-Mask: 0xff)        */
/* =========================================================  COUNT  ========================================================= */
#define TIMER_0_COUNT_LCOUNT_Pos          (0UL)                     /*!< TIMER_0 COUNT: LCOUNT (Bit 0)                         */
#define TIMER_0_COUNT_LCOUNT_Msk          (0xffffUL)                /*!< TIMER_0 COUNT: LCOUNT (Bitfield-Mask: 0xffff)         */
#define TIMER_0_COUNT_HCOUNT_Pos          (16UL)                    /*!< TIMER_0 COUNT: HCOUNT (Bit 16)                        */
#define TIMER_0_COUNT_HCOUNT_Msk          (0xffff0000UL)            /*!< TIMER_0 COUNT: HCOUNT (Bitfield-Mask: 0xffff)         */
/* ========================================================  CAPTURE  ======================================================== */
#define TIMER_0_CAPTURE_LCCR_Pos          (0UL)                     /*!< TIMER_0 CAPTURE: LCCR (Bit 0)                         */
#define TIMER_0_CAPTURE_LCCR_Msk          (0xffffUL)                /*!< TIMER_0 CAPTURE: LCCR (Bitfield-Mask: 0xffff)         */
#define TIMER_0_CAPTURE_HCCR_Pos          (16UL)                    /*!< TIMER_0 CAPTURE: HCCR (Bit 16)                        */
#define TIMER_0_CAPTURE_HCCR_Msk          (0xffff0000UL)            /*!< TIMER_0 CAPTURE: HCCR (Bitfield-Mask: 0xffff)         */


