chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =========================================================================================================================== */
/* ================                                          TIMER_1                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
#define TIMER_1_CONFIG_LCLK_Pos           (0UL)                     /*!< TIMER_1 CONFIG: LCLK (Bit 0)                          */
#define TIMER_1_CONFIG_LCLK_Msk           (0x3UL)                   /*!< TIMER_1 CONFIG: LCLK (Bitfield-Mask: 0x03)            */
#define TIMER_1_CONFIG_LMSTREN_Pos        (4UL)                     /*!< TIMER_1 CONFIG: LMSTREN (Bit 4)                       */
#define TIMER_1_CONFIG_LMSTREN_Msk        (0x10UL)                  /*!< TIMER_1 CONFIG: LMSTREN (Bitfield-Mask: 0x01)         */
#define TIMER_1_CONFIG_SPLITEN_Pos        (5UL)                     /*!< TIMER_1 CONFIG: SPLITEN (Bit 5)                       */
#define TIMER_1_CONFIG_SPLITEN_Msk        (0x20UL)                  /*!< TIMER_1 CONFIG: SPLITEN (Bitfield-Mask: 0x01)         */
#define TIMER_1_CONFIG_LEXIEN_Pos         (6UL)                     /*!< TIMER_1 CONFIG: LEXIEN (Bit 6)                        */
#define TIMER_1_CONFIG_LEXIEN_Msk         (0x40UL)                  /*!< TIMER_1 CONFIG: LEXIEN (Bitfield-Mask: 0x01)          */
#define TIMER_1_CONFIG_LOVFIEN_Pos        (7UL)                     /*!< TIMER_1 CONFIG: LOVFIEN (Bit 7)                       */
#define TIMER_1_CONFIG_LOVFIEN_Msk        (0x80UL)                  /*!< TIMER_1 CONFIG: LOVFIEN (Bitfield-Mask: 0x01)         */
#define TIMER_1_CONFIG_LMD_Pos            (8UL)                     /*!< TIMER_1 CONFIG: LMD (Bit 8)                           */
#define TIMER_1_CONFIG_LMD_Msk            (0x700UL)                 /*!< TIMER_1 CONFIG: LMD (Bitfield-Mask: 0x07)             */
#define TIMER_1_CONFIG_LSTATE_Pos         (12UL)                    /*!< TIMER_1 CONFIG: LSTATE (Bit 12)                       */
#define TIMER_1_CONFIG_LSTATE_Msk         (0x1000UL)                /*!< TIMER_1 CONFIG: LSTATE (Bitfield-Mask: 0x01)          */
#define TIMER_1_CONFIG_LRUN_Pos           (13UL)                    /*!< TIMER_1 CONFIG: LRUN (Bit 13)                         */
#define TIMER_1_CONFIG_LRUN_Msk           (0x2000UL)                /*!< TIMER_1 CONFIG: LRUN (Bitfield-Mask: 0x01)            */
#define TIMER_1_CONFIG_LEXI_Pos           (14UL)                    /*!< TIMER_1 CONFIG: LEXI (Bit 14)                         */
#define TIMER_1_CONFIG_LEXI_Msk           (0x4000UL)                /*!< TIMER_1 CONFIG: LEXI (Bitfield-Mask: 0x01)            */
#define TIMER_1_CONFIG_LOVFI_Pos          (15UL)                    /*!< TIMER_1 CONFIG: LOVFI (Bit 15)                        */
#define TIMER_1_CONFIG_LOVFI_Msk          (0x8000UL)                /*!< TIMER_1 CONFIG: LOVFI (Bitfield-Mask: 0x01)           */
#define TIMER_1_CONFIG_HCLK_Pos           (16UL)                    /*!< TIMER_1 CONFIG: HCLK (Bit 16)                         */
#define TIMER_1_CONFIG_HCLK_Msk           (0x30000UL)               /*!< TIMER_1 CONFIG: HCLK (Bitfield-Mask: 0x03)            */
#define TIMER_1_CONFIG_MSTRUN_Pos         (19UL)                    /*!< TIMER_1 CONFIG: MSTRUN (Bit 19)                       */
#define TIMER_1_CONFIG_MSTRUN_Msk         (0x80000UL)               /*!< TIMER_1 CONFIG: MSTRUN (Bitfield-Mask: 0x01)          */
#define TIMER_1_CONFIG_HMSTREN_Pos        (20UL)                    /*!< TIMER_1 CONFIG: HMSTREN (Bit 20)                      */
#define TIMER_1_CONFIG_HMSTREN_Msk        (0x100000UL)              /*!< TIMER_1 CONFIG: HMSTREN (Bitfield-Mask: 0x01)         */
#define TIMER_1_CONFIG_DBGMD_Pos          (21UL)                    /*!< TIMER_1 CONFIG: DBGMD (Bit 21)                        */
#define TIMER_1_CONFIG_DBGMD_Msk          (0x200000UL)              /*!< TIMER_1 CONFIG: DBGMD (Bitfield-Mask: 0x01)           */
#define TIMER_1_CONFIG_HEXIEN_Pos         (22UL)                    /*!< TIMER_1 CONFIG: HEXIEN (Bit 22)                       */
#define TIMER_1_CONFIG_HEXIEN_Msk         (0x400000UL)              /*!< TIMER_1 CONFIG: HEXIEN (Bitfield-Mask: 0x01)          */
#define TIMER_1_CONFIG_HOVFIEN_Pos        (23UL)                    /*!< TIMER_1 CONFIG: HOVFIEN (Bit 23)                      */
#define TIMER_1_CONFIG_HOVFIEN_Msk        (0x800000UL)              /*!< TIMER_1 CONFIG: HOVFIEN (Bitfield-Mask: 0x01)         */
#define TIMER_1_CONFIG_HMD_Pos            (24UL)                    /*!< TIMER_1 CONFIG: HMD (Bit 24)                          */
#define TIMER_1_CONFIG_HMD_Msk            (0xf000000UL)             /*!< TIMER_1 CONFIG: HMD (Bitfield-Mask: 0x0f)             */
#define TIMER_1_CONFIG_HSTATE_Pos         (28UL)                    /*!< TIMER_1 CONFIG: HSTATE (Bit 28)                       */
#define TIMER_1_CONFIG_HSTATE_Msk         (0x10000000UL)            /*!< TIMER_1 CONFIG: HSTATE (Bitfield-Mask: 0x01)          */
#define TIMER_1_CONFIG_HRUN_Pos           (29UL)                    /*!< TIMER_1 CONFIG: HRUN (Bit 29)                         */
#define TIMER_1_CONFIG_HRUN_Msk           (0x20000000UL)            /*!< TIMER_1 CONFIG: HRUN (Bitfield-Mask: 0x01)            */
#define TIMER_1_CONFIG_HEXI_Pos           (30UL)                    /*!< TIMER_1 CONFIG: HEXI (Bit 30)                         */
#define TIMER_1_CONFIG_HEXI_Msk           (0x40000000UL)            /*!< TIMER_1 CONFIG: HEXI (Bitfield-Mask: 0x01)            */
#define TIMER_1_CONFIG_HOVFI_Pos          (31UL)                    /*!< TIMER_1 CONFIG: HOVFI (Bit 31)                        */
#define TIMER_1_CONFIG_HOVFI_Msk          (0x80000000UL)            /*!< TIMER_1 CONFIG: HOVFI (Bitfield-Mask: 0x01)           */
/* ========================================================  CLKDIV  ========================================================= */
#define TIMER_1_CLKDIV_CLKDIVRL_Pos       (0UL)                     /*!< TIMER_1 CLKDIV: CLKDIVRL (Bit 0)                      */
#define TIMER_1_CLKDIV_CLKDIVRL_Msk       (0xffUL)                  /*!< TIMER_1 CLKDIV: CLKDIVRL (Bitfield-Mask: 0xff)        */
#define TIMER_1_CLKDIV_CLKDIVCT_Pos       (16UL)                    /*!< TIMER_1 CLKDIV: CLKDIVCT (Bit 16)                     */
#define TIMER_1_CLKDIV_CLKDIVCT_Msk       (0xff0000UL)              /*!< TIMER_1 CLKDIV: CLKDIVCT (Bitfield-Mask: 0xff)        */
/* =========================================================  COUNT  ========================================================= */
#define TIMER_1_COUNT_LCOUNT_Pos          (0UL)                     /*!< TIMER_1 COUNT: LCOUNT (Bit 0)                         */
#define TIMER_1_COUNT_LCOUNT_Msk          (0xffffUL)                /*!< TIMER_1 COUNT: LCOUNT (Bitfield-Mask: 0xffff)         */
#define TIMER_1_COUNT_HCOUNT_Pos          (16UL)                    /*!< TIMER_1 COUNT: HCOUNT (Bit 16)                        */
#define TIMER_1_COUNT_HCOUNT_Msk          (0xffff0000UL)            /*!< TIMER_1 COUNT: HCOUNT (Bitfield-Mask: 0xffff)         */
/* ========================================================  CAPTURE  ======================================================== */
#define TIMER_1_CAPTURE_LCCR_Pos          (0UL)                     /*!< TIMER_1 CAPTURE: LCCR (Bit 0)                         */
#define TIMER_1_CAPTURE_LCCR_Msk          (0xffffUL)                /*!< TIMER_1 CAPTURE: LCCR (Bitfield-Mask: 0xffff)         */
#define TIMER_1_CAPTURE_HCCR_Pos          (16UL)                    /*!< TIMER_1 CAPTURE: HCCR (Bit 16)                        */
#define TIMER_1_CAPTURE_HCCR_Msk          (0xffff0000UL)            /*!< TIMER_1 CAPTURE: HCCR (Bitfield-Mask: 0xffff)         */


/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */

