chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONFIG  ========================================================= */
#define UART_CONFIG_RSTRTEN_Pos           (0UL)                     /*!< UART CONFIG: RSTRTEN (Bit 0)                          */
#define UART_CONFIG_RSTRTEN_Msk           (0x1UL)                   /*!< UART CONFIG: RSTRTEN (Bitfield-Mask: 0x01)            */
#define UART_CONFIG_RPAREN_Pos            (1UL)                     /*!< UART CONFIG: RPAREN (Bit 1)                           */
#define UART_CONFIG_RPAREN_Msk            (0x2UL)                   /*!< UART CONFIG: RPAREN (Bitfield-Mask: 0x01)             */
#define UART_CONFIG_RSTPEN_Pos            (2UL)                     /*!< UART CONFIG: RSTPEN (Bit 2)                           */
#define UART_CONFIG_RSTPEN_Msk            (0x4UL)                   /*!< UART CONFIG: RSTPEN (Bitfield-Mask: 0x01)             */
#define UART_CONFIG_RSTPMD_Pos            (3UL)                     /*!< UART CONFIG: RSTPMD (Bit 3)                           */
#define UART_CONFIG_RSTPMD_Msk            (0x18UL)                  /*!< UART CONFIG: RSTPMD (Bitfield-Mask: 0x03)             */
#define UART_CONFIG_RPARMD_Pos            (5UL)                     /*!< UART CONFIG: RPARMD (Bit 5)                           */
#define UART_CONFIG_RPARMD_Msk            (0x60UL)                  /*!< UART CONFIG: RPARMD (Bitfield-Mask: 0x03)             */
#define UART_CONFIG_RDATLN_Pos            (8UL)                     /*!< UART CONFIG: RDATLN (Bit 8)                           */
#define UART_CONFIG_RDATLN_Msk            (0x700UL)                 /*!< UART CONFIG: RDATLN (Bitfield-Mask: 0x07)             */
#define UART_CONFIG_RSCEN_Pos             (12UL)                    /*!< UART CONFIG: RSCEN (Bit 12)                           */
#define UART_CONFIG_RSCEN_Msk             (0x1000UL)                /*!< UART CONFIG: RSCEN (Bitfield-Mask: 0x01)              */
#define UART_CONFIG_RIRDAEN_Pos           (13UL)                    /*!< UART CONFIG: RIRDAEN (Bit 13)                         */
#define UART_CONFIG_RIRDAEN_Msk           (0x2000UL)                /*!< UART CONFIG: RIRDAEN (Bitfield-Mask: 0x01)            */
#define UART_CONFIG_RINVEN_Pos            (14UL)                    /*!< UART CONFIG: RINVEN (Bit 14)                          */
#define UART_CONFIG_RINVEN_Msk            (0x4000UL)                /*!< UART CONFIG: RINVEN (Bitfield-Mask: 0x01)             */
#define UART_CONFIG_TSTRTEN_Pos           (16UL)                    /*!< UART CONFIG: TSTRTEN (Bit 16)                         */
#define UART_CONFIG_TSTRTEN_Msk           (0x10000UL)               /*!< UART CONFIG: TSTRTEN (Bitfield-Mask: 0x01)            */
#define UART_CONFIG_TPAREN_Pos            (17UL)                    /*!< UART CONFIG: TPAREN (Bit 17)                          */
#define UART_CONFIG_TPAREN_Msk            (0x20000UL)               /*!< UART CONFIG: TPAREN (Bitfield-Mask: 0x01)             */
#define UART_CONFIG_TSTPEN_Pos            (18UL)                    /*!< UART CONFIG: TSTPEN (Bit 18)                          */
#define UART_CONFIG_TSTPEN_Msk            (0x40000UL)               /*!< UART CONFIG: TSTPEN (Bitfield-Mask: 0x01)             */
#define UART_CONFIG_TSTPMD_Pos            (19UL)                    /*!< UART CONFIG: TSTPMD (Bit 19)                          */
#define UART_CONFIG_TSTPMD_Msk            (0x180000UL)              /*!< UART CONFIG: TSTPMD (Bitfield-Mask: 0x03)             */
#define UART_CONFIG_TPARMD_Pos            (21UL)                    /*!< UART CONFIG: TPARMD (Bit 21)                          */
#define UART_CONFIG_TPARMD_Msk            (0x600000UL)              /*!< UART CONFIG: TPARMD (Bitfield-Mask: 0x03)             */
#define UART_CONFIG_TDATLN_Pos            (24UL)                    /*!< UART CONFIG: TDATLN (Bit 24)                          */
#define UART_CONFIG_TDATLN_Msk            (0x7000000UL)             /*!< UART CONFIG: TDATLN (Bitfield-Mask: 0x07)             */
#define UART_CONFIG_TSCEN_Pos             (28UL)                    /*!< UART CONFIG: TSCEN (Bit 28)                           */
#define UART_CONFIG_TSCEN_Msk             (0x10000000UL)            /*!< UART CONFIG: TSCEN (Bitfield-Mask: 0x01)              */
#define UART_CONFIG_TIRDAEN_Pos           (29UL)                    /*!< UART CONFIG: TIRDAEN (Bit 29)                         */
#define UART_CONFIG_TIRDAEN_Msk           (0x20000000UL)            /*!< UART CONFIG: TIRDAEN (Bitfield-Mask: 0x01)            */
#define UART_CONFIG_TINVEN_Pos            (30UL)                    /*!< UART CONFIG: TINVEN (Bit 30)                          */
#define UART_CONFIG_TINVEN_Msk            (0x40000000UL)            /*!< UART CONFIG: TINVEN (Bitfield-Mask: 0x01)             */
/* ======================================================  CONFIG_SET  ======================================================= */
/* ======================================================  CONFIG_CLR  ======================================================= */
/* =========================================================  MODE  ========================================================== */
#define UART_MODE_DBGMD_Pos               (16UL)                    /*!< UART MODE: DBGMD (Bit 16)                             */
#define UART_MODE_DBGMD_Msk               (0x10000UL)               /*!< UART MODE: DBGMD (Bitfield-Mask: 0x01)                */
#define UART_MODE_LBMD_Pos                (18UL)                    /*!< UART MODE: LBMD (Bit 18)                              */
#define UART_MODE_LBMD_Msk                (0xc0000UL)               /*!< UART MODE: LBMD (Bitfield-Mask: 0x03)                 */
#define UART_MODE_DUPLEXMD_Pos            (27UL)                    /*!< UART MODE: DUPLEXMD (Bit 27)                          */
#define UART_MODE_DUPLEXMD_Msk            (0x8000000UL)             /*!< UART MODE: DUPLEXMD (Bitfield-Mask: 0x01)             */
#define UART_MODE_ITSEN_Pos               (30UL)                    /*!< UART MODE: ITSEN (Bit 30)                             */
#define UART_MODE_ITSEN_Msk               (0x40000000UL)            /*!< UART MODE: ITSEN (Bitfield-Mask: 0x01)                */
/* =======================================================  MODE_SET  ======================================================== */
/* =======================================================  MODE_CLR  ======================================================== */
/* ========================================================  FLOWCN  ========================================================= */
#define UART_FLOWCN_RTS_Pos               (0UL)                     /*!< UART FLOWCN: RTS (Bit 0)                              */
#define UART_FLOWCN_RTS_Msk               (0x1UL)                   /*!< UART FLOWCN: RTS (Bitfield-Mask: 0x01)                */
#define UART_FLOWCN_RX_Pos                (1UL)                     /*!< UART FLOWCN: RX (Bit 1)                               */
#define UART_FLOWCN_RX_Msk                (0x2UL)                   /*!< UART FLOWCN: RX (Bitfield-Mask: 0x01)                 */
#define UART_FLOWCN_RTSINVEN_Pos          (5UL)                     /*!< UART FLOWCN: RTSINVEN (Bit 5)                         */
#define UART_FLOWCN_RTSINVEN_Msk          (0x20UL)                  /*!< UART FLOWCN: RTSINVEN (Bitfield-Mask: 0x01)           */
#define UART_FLOWCN_RTSTH_Pos             (6UL)                     /*!< UART FLOWCN: RTSTH (Bit 6)                            */
#define UART_FLOWCN_RTSTH_Msk             (0x40UL)                  /*!< UART FLOWCN: RTSTH (Bitfield-Mask: 0x01)              */
#define UART_FLOWCN_RTSEN_Pos             (7UL)                     /*!< UART FLOWCN: RTSEN (Bit 7)                            */
#define UART_FLOWCN_RTSEN_Msk             (0x80UL)                  /*!< UART FLOWCN: RTSEN (Bitfield-Mask: 0x01)              */
#define UART_FLOWCN_CTS_Pos               (16UL)                    /*!< UART FLOWCN: CTS (Bit 16)                             */
#define UART_FLOWCN_CTS_Msk               (0x10000UL)               /*!< UART FLOWCN: CTS (Bitfield-Mask: 0x01)                */
#define UART_FLOWCN_TX_Pos                (17UL)                    /*!< UART FLOWCN: TX (Bit 17)                              */
#define UART_FLOWCN_TX_Msk                (0x20000UL)               /*!< UART FLOWCN: TX (Bitfield-Mask: 0x01)                 */
#define UART_FLOWCN_CTSINVEN_Pos          (21UL)                    /*!< UART FLOWCN: CTSINVEN (Bit 21)                        */
#define UART_FLOWCN_CTSINVEN_Msk          (0x200000UL)              /*!< UART FLOWCN: CTSINVEN (Bitfield-Mask: 0x01)           */
#define UART_FLOWCN_CTSEN_Pos             (23UL)                    /*!< UART FLOWCN: CTSEN (Bit 23)                           */
#define UART_FLOWCN_CTSEN_Msk             (0x800000UL)              /*!< UART FLOWCN: CTSEN (Bitfield-Mask: 0x01)              */
#define UART_FLOWCN_TIRDAPW_Pos           (28UL)                    /*!< UART FLOWCN: TIRDAPW (Bit 28)                         */
#define UART_FLOWCN_TIRDAPW_Msk           (0x30000000UL)            /*!< UART FLOWCN: TIRDAPW (Bitfield-Mask: 0x03)            */
/* ======================================================  FLOWCN_SET  ======================================================= */
/* ======================================================  FLOWCN_CLR  ======================================================= */
/* ========================================================  CONTROL  ======================================================== */
#define UART_CONTROL_RFRMERI_Pos          (0UL)                     /*!< UART CONTROL: RFRMERI (Bit 0)                         */
#define UART_CONTROL_RFRMERI_Msk          (0x1UL)                   /*!< UART CONTROL: RFRMERI (Bitfield-Mask: 0x01)           */
#define UART_CONTROL_RPARERI_Pos          (1UL)                     /*!< UART CONTROL: RPARERI (Bit 1)                         */
#define UART_CONTROL_RPARERI_Msk          (0x2UL)                   /*!< UART CONTROL: RPARERI (Bitfield-Mask: 0x01)           */
#define UART_CONTROL_ROREI_Pos            (2UL)                     /*!< UART CONTROL: ROREI (Bit 2)                           */
#define UART_CONTROL_ROREI_Msk            (0x4UL)                   /*!< UART CONTROL: ROREI (Bitfield-Mask: 0x01)             */
#define UART_CONTROL_RDREQI_Pos           (3UL)                     /*!< UART CONTROL: RDREQI (Bit 3)                          */
#define UART_CONTROL_RDREQI_Msk           (0x8UL)                   /*!< UART CONTROL: RDREQI (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_RERIEN_Pos           (5UL)                     /*!< UART CONTROL: RERIEN (Bit 5)                          */
#define UART_CONTROL_RERIEN_Msk           (0x20UL)                  /*!< UART CONTROL: RERIEN (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_RDREQIEN_Pos         (6UL)                     /*!< UART CONTROL: RDREQIEN (Bit 6)                        */
#define UART_CONTROL_RDREQIEN_Msk         (0x40UL)                  /*!< UART CONTROL: RDREQIEN (Bitfield-Mask: 0x01)          */
#define UART_CONTROL_MATMD_Pos            (8UL)                     /*!< UART CONTROL: MATMD (Bit 8)                           */
#define UART_CONTROL_MATMD_Msk            (0x300UL)                 /*!< UART CONTROL: MATMD (Bitfield-Mask: 0x03)             */
#define UART_CONTROL_RABDEN_Pos           (10UL)                    /*!< UART CONTROL: RABDEN (Bit 10)                         */
#define UART_CONTROL_RABDEN_Msk           (0x400UL)                 /*!< UART CONTROL: RABDEN (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_RBUSYF_Pos           (11UL)                    /*!< UART CONTROL: RBUSYF (Bit 11)                         */
#define UART_CONTROL_RBUSYF_Msk           (0x800UL)                 /*!< UART CONTROL: RBUSYF (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_RBIT_Pos             (12UL)                    /*!< UART CONTROL: RBIT (Bit 12)                           */
#define UART_CONTROL_RBIT_Msk             (0x1000UL)                /*!< UART CONTROL: RBIT (Bitfield-Mask: 0x01)              */
#define UART_CONTROL_ROSEN_Pos            (13UL)                    /*!< UART CONTROL: ROSEN (Bit 13)                          */
#define UART_CONTROL_ROSEN_Msk            (0x2000UL)                /*!< UART CONTROL: ROSEN (Bitfield-Mask: 0x01)             */
#define UART_CONTROL_RINH_Pos             (14UL)                    /*!< UART CONTROL: RINH (Bit 14)                           */
#define UART_CONTROL_RINH_Msk             (0x4000UL)                /*!< UART CONTROL: RINH (Bitfield-Mask: 0x01)              */
#define UART_CONTROL_REN_Pos              (15UL)                    /*!< UART CONTROL: REN (Bit 15)                            */
#define UART_CONTROL_REN_Msk              (0x8000UL)                /*!< UART CONTROL: REN (Bitfield-Mask: 0x01)               */
#define UART_CONTROL_TSCERI_Pos           (16UL)                    /*!< UART CONTROL: TSCERI (Bit 16)                         */
#define UART_CONTROL_TSCERI_Msk           (0x10000UL)               /*!< UART CONTROL: TSCERI (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_TDREQI_Pos           (18UL)                    /*!< UART CONTROL: TDREQI (Bit 18)                         */
#define UART_CONTROL_TDREQI_Msk           (0x40000UL)               /*!< UART CONTROL: TDREQI (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_TCPTI_Pos            (19UL)                    /*!< UART CONTROL: TCPTI (Bit 19)                          */
#define UART_CONTROL_TCPTI_Msk            (0x80000UL)               /*!< UART CONTROL: TCPTI (Bitfield-Mask: 0x01)             */
#define UART_CONTROL_TCPTTH_Pos           (20UL)                    /*!< UART CONTROL: TCPTTH (Bit 20)                         */
#define UART_CONTROL_TCPTTH_Msk           (0x100000UL)              /*!< UART CONTROL: TCPTTH (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_TERIEN_Pos           (21UL)                    /*!< UART CONTROL: TERIEN (Bit 21)                         */
#define UART_CONTROL_TERIEN_Msk           (0x200000UL)              /*!< UART CONTROL: TERIEN (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_TDREQIEN_Pos         (22UL)                    /*!< UART CONTROL: TDREQIEN (Bit 22)                       */
#define UART_CONTROL_TDREQIEN_Msk         (0x400000UL)              /*!< UART CONTROL: TDREQIEN (Bitfield-Mask: 0x01)          */
#define UART_CONTROL_TCPTIEN_Pos          (23UL)                    /*!< UART CONTROL: TCPTIEN (Bit 23)                        */
#define UART_CONTROL_TCPTIEN_Msk          (0x800000UL)              /*!< UART CONTROL: TCPTIEN (Bitfield-Mask: 0x01)           */
#define UART_CONTROL_TBUSYF_Pos           (27UL)                    /*!< UART CONTROL: TBUSYF (Bit 27)                         */
#define UART_CONTROL_TBUSYF_Msk           (0x8000000UL)             /*!< UART CONTROL: TBUSYF (Bitfield-Mask: 0x01)            */
#define UART_CONTROL_TBIT_Pos             (28UL)                    /*!< UART CONTROL: TBIT (Bit 28)                           */
#define UART_CONTROL_TBIT_Msk             (0x10000000UL)            /*!< UART CONTROL: TBIT (Bitfield-Mask: 0x01)              */
#define UART_CONTROL_TINH_Pos             (30UL)                    /*!< UART CONTROL: TINH (Bit 30)                           */
#define UART_CONTROL_TINH_Msk             (0x40000000UL)            /*!< UART CONTROL: TINH (Bitfield-Mask: 0x01)              */
#define UART_CONTROL_TEN_Pos              (31UL)                    /*!< UART CONTROL: TEN (Bit 31)                            */
#define UART_CONTROL_TEN_Msk              (0x80000000UL)            /*!< UART CONTROL: TEN (Bitfield-Mask: 0x01)               */
/* ======================================================  CONTROL_SET  ====================================================== */
/* ======================================================  CONTROL_CLR  ====================================================== */
/* ========================================================  IPDELAY  ======================================================== */
#define UART_IPDELAY_IPDELAY_Pos          (16UL)                    /*!< UART IPDELAY: IPDELAY (Bit 16)                        */
#define UART_IPDELAY_IPDELAY_Msk          (0xff0000UL)              /*!< UART IPDELAY: IPDELAY (Bitfield-Mask: 0xff)           */
/* =======================================================  BAUDRATE  ======================================================== */
#define UART_BAUDRATE_RBAUD_Pos           (0UL)                     /*!< UART BAUDRATE: RBAUD (Bit 0)                          */
#define UART_BAUDRATE_RBAUD_Msk           (0xffffUL)                /*!< UART BAUDRATE: RBAUD (Bitfield-Mask: 0xffff)          */
#define UART_BAUDRATE_TBAUD_Pos           (16UL)                    /*!< UART BAUDRATE: TBAUD (Bit 16)                         */
#define UART_BAUDRATE_TBAUD_Msk           (0xffff0000UL)            /*!< UART BAUDRATE: TBAUD (Bitfield-Mask: 0xffff)          */
/* ========================================================  FIFOCN  ========================================================= */
#define UART_FIFOCN_RCNT_Pos              (0UL)                     /*!< UART FIFOCN: RCNT (Bit 0)                             */
#define UART_FIFOCN_RCNT_Msk              (0x7UL)                   /*!< UART FIFOCN: RCNT (Bitfield-Mask: 0x07)               */
#define UART_FIFOCN_RFTH_Pos              (4UL)                     /*!< UART FIFOCN: RFTH (Bit 4)                             */
#define UART_FIFOCN_RFTH_Msk              (0x30UL)                  /*!< UART FIFOCN: RFTH (Bitfield-Mask: 0x03)               */
#define UART_FIFOCN_RFIFOFL_Pos           (8UL)                     /*!< UART FIFOCN: RFIFOFL (Bit 8)                          */
#define UART_FIFOCN_RFIFOFL_Msk           (0x100UL)                 /*!< UART FIFOCN: RFIFOFL (Bitfield-Mask: 0x01)            */
#define UART_FIFOCN_RFERI_Pos             (9UL)                     /*!< UART FIFOCN: RFERI (Bit 9)                            */
#define UART_FIFOCN_RFERI_Msk             (0x200UL)                 /*!< UART FIFOCN: RFERI (Bitfield-Mask: 0x01)              */
#define UART_FIFOCN_RSRFULLF_Pos          (10UL)                    /*!< UART FIFOCN: RSRFULLF (Bit 10)                        */
#define UART_FIFOCN_RSRFULLF_Msk          (0x400UL)                 /*!< UART FIFOCN: RSRFULLF (Bitfield-Mask: 0x01)           */
#define UART_FIFOCN_TCNT_Pos              (16UL)                    /*!< UART FIFOCN: TCNT (Bit 16)                            */
#define UART_FIFOCN_TCNT_Msk              (0x70000UL)               /*!< UART FIFOCN: TCNT (Bitfield-Mask: 0x07)               */
#define UART_FIFOCN_TFTH_Pos              (20UL)                    /*!< UART FIFOCN: TFTH (Bit 20)                            */
#define UART_FIFOCN_TFTH_Msk              (0x300000UL)              /*!< UART FIFOCN: TFTH (Bitfield-Mask: 0x03)               */
#define UART_FIFOCN_TFIFOFL_Pos           (24UL)                    /*!< UART FIFOCN: TFIFOFL (Bit 24)                         */
#define UART_FIFOCN_TFIFOFL_Msk           (0x1000000UL)             /*!< UART FIFOCN: TFIFOFL (Bitfield-Mask: 0x01)            */
#define UART_FIFOCN_TFERI_Pos             (25UL)                    /*!< UART FIFOCN: TFERI (Bit 25)                           */
#define UART_FIFOCN_TFERI_Msk             (0x2000000UL)             /*!< UART FIFOCN: TFERI (Bitfield-Mask: 0x01)              */
#define UART_FIFOCN_TSRFULLF_Pos          (26UL)                    /*!< UART FIFOCN: TSRFULLF (Bit 26)                        */
#define UART_FIFOCN_TSRFULLF_Msk          (0x4000000UL)             /*!< UART FIFOCN: TSRFULLF (Bitfield-Mask: 0x01)           */
/* ======================================================  FIFOCN_SET  ======================================================= */
/* ======================================================  FIFOCN_CLR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           USART                                           ================ */
/* =========================================================================================================================== */

