chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONFIG  ========================================================= */
#define USART_CONFIG_RSTRTEN_Pos          (0UL)                     /*!< USART CONFIG: RSTRTEN (Bit 0)                         */
#define USART_CONFIG_RSTRTEN_Msk          (0x1UL)                   /*!< USART CONFIG: RSTRTEN (Bitfield-Mask: 0x01)           */
#define USART_CONFIG_RPAREN_Pos           (1UL)                     /*!< USART CONFIG: RPAREN (Bit 1)                          */
#define USART_CONFIG_RPAREN_Msk           (0x2UL)                   /*!< USART CONFIG: RPAREN (Bitfield-Mask: 0x01)            */
#define USART_CONFIG_RSTPEN_Pos           (2UL)                     /*!< USART CONFIG: RSTPEN (Bit 2)                          */
#define USART_CONFIG_RSTPEN_Msk           (0x4UL)                   /*!< USART CONFIG: RSTPEN (Bitfield-Mask: 0x01)            */
#define USART_CONFIG_RSTPMD_Pos           (3UL)                     /*!< USART CONFIG: RSTPMD (Bit 3)                          */
#define USART_CONFIG_RSTPMD_Msk           (0x18UL)                  /*!< USART CONFIG: RSTPMD (Bitfield-Mask: 0x03)            */
#define USART_CONFIG_RPARMD_Pos           (5UL)                     /*!< USART CONFIG: RPARMD (Bit 5)                          */
#define USART_CONFIG_RPARMD_Msk           (0x60UL)                  /*!< USART CONFIG: RPARMD (Bitfield-Mask: 0x03)            */
#define USART_CONFIG_RDATLN_Pos           (8UL)                     /*!< USART CONFIG: RDATLN (Bit 8)                          */
#define USART_CONFIG_RDATLN_Msk           (0x700UL)                 /*!< USART CONFIG: RDATLN (Bitfield-Mask: 0x07)            */
#define USART_CONFIG_RSCEN_Pos            (12UL)                    /*!< USART CONFIG: RSCEN (Bit 12)                          */
#define USART_CONFIG_RSCEN_Msk            (0x1000UL)                /*!< USART CONFIG: RSCEN (Bitfield-Mask: 0x01)             */
#define USART_CONFIG_RIRDAEN_Pos          (13UL)                    /*!< USART CONFIG: RIRDAEN (Bit 13)                        */
#define USART_CONFIG_RIRDAEN_Msk          (0x2000UL)                /*!< USART CONFIG: RIRDAEN (Bitfield-Mask: 0x01)           */
#define USART_CONFIG_RINVEN_Pos           (14UL)                    /*!< USART CONFIG: RINVEN (Bit 14)                         */
#define USART_CONFIG_RINVEN_Msk           (0x4000UL)                /*!< USART CONFIG: RINVEN (Bitfield-Mask: 0x01)            */
#define USART_CONFIG_RSYNCEN_Pos          (15UL)                    /*!< USART CONFIG: RSYNCEN (Bit 15)                        */
#define USART_CONFIG_RSYNCEN_Msk          (0x8000UL)                /*!< USART CONFIG: RSYNCEN (Bitfield-Mask: 0x01)           */
#define USART_CONFIG_TSTRTEN_Pos          (16UL)                    /*!< USART CONFIG: TSTRTEN (Bit 16)                        */
#define USART_CONFIG_TSTRTEN_Msk          (0x10000UL)               /*!< USART CONFIG: TSTRTEN (Bitfield-Mask: 0x01)           */
#define USART_CONFIG_TPAREN_Pos           (17UL)                    /*!< USART CONFIG: TPAREN (Bit 17)                         */
#define USART_CONFIG_TPAREN_Msk           (0x20000UL)               /*!< USART CONFIG: TPAREN (Bitfield-Mask: 0x01)            */
#define USART_CONFIG_TSTPEN_Pos           (18UL)                    /*!< USART CONFIG: TSTPEN (Bit 18)                         */
#define USART_CONFIG_TSTPEN_Msk           (0x40000UL)               /*!< USART CONFIG: TSTPEN (Bitfield-Mask: 0x01)            */
#define USART_CONFIG_TSTPMD_Pos           (19UL)                    /*!< USART CONFIG: TSTPMD (Bit 19)                         */
#define USART_CONFIG_TSTPMD_Msk           (0x180000UL)              /*!< USART CONFIG: TSTPMD (Bitfield-Mask: 0x03)            */
#define USART_CONFIG_TPARMD_Pos           (21UL)                    /*!< USART CONFIG: TPARMD (Bit 21)                         */
#define USART_CONFIG_TPARMD_Msk           (0x600000UL)              /*!< USART CONFIG: TPARMD (Bitfield-Mask: 0x03)            */
#define USART_CONFIG_TDATLN_Pos           (24UL)                    /*!< USART CONFIG: TDATLN (Bit 24)                         */
#define USART_CONFIG_TDATLN_Msk           (0x7000000UL)             /*!< USART CONFIG: TDATLN (Bitfield-Mask: 0x07)            */
#define USART_CONFIG_TSCEN_Pos            (28UL)                    /*!< USART CONFIG: TSCEN (Bit 28)                          */
#define USART_CONFIG_TSCEN_Msk            (0x10000000UL)            /*!< USART CONFIG: TSCEN (Bitfield-Mask: 0x01)             */
#define USART_CONFIG_TIRDAEN_Pos          (29UL)                    /*!< USART CONFIG: TIRDAEN (Bit 29)                        */
#define USART_CONFIG_TIRDAEN_Msk          (0x20000000UL)            /*!< USART CONFIG: TIRDAEN (Bitfield-Mask: 0x01)           */
#define USART_CONFIG_TINVEN_Pos           (30UL)                    /*!< USART CONFIG: TINVEN (Bit 30)                         */
#define USART_CONFIG_TINVEN_Msk           (0x40000000UL)            /*!< USART CONFIG: TINVEN (Bitfield-Mask: 0x01)            */
#define USART_CONFIG_TSYNCEN_Pos          (31UL)                    /*!< USART CONFIG: TSYNCEN (Bit 31)                        */
#define USART_CONFIG_TSYNCEN_Msk          (0x80000000UL)            /*!< USART CONFIG: TSYNCEN (Bitfield-Mask: 0x01)           */
/* =========================================================  MODE  ========================================================== */
#define USART_MODE_DBGMD_Pos              (16UL)                    /*!< USART MODE: DBGMD (Bit 16)                            */
#define USART_MODE_DBGMD_Msk              (0x10000UL)               /*!< USART MODE: DBGMD (Bitfield-Mask: 0x01)               */
#define USART_MODE_LBMD_Pos               (18UL)                    /*!< USART MODE: LBMD (Bit 18)                             */
#define USART_MODE_LBMD_Msk               (0xc0000UL)               /*!< USART MODE: LBMD (Bitfield-Mask: 0x03)                */
#define USART_MODE_STPSTCLK_Pos           (21UL)                    /*!< USART MODE: STPSTCLK (Bit 21)                         */
#define USART_MODE_STPSTCLK_Msk           (0x200000UL)              /*!< USART MODE: STPSTCLK (Bitfield-Mask: 0x01)            */
#define USART_MODE_STRTSTCLK_Pos          (22UL)                    /*!< USART MODE: STRTSTCLK (Bit 22)                        */
#define USART_MODE_STRTSTCLK_Msk          (0x400000UL)              /*!< USART MODE: STRTSTCLK (Bitfield-Mask: 0x01)           */
#define USART_MODE_ISTCLK_Pos             (23UL)                    /*!< USART MODE: ISTCLK (Bit 23)                           */
#define USART_MODE_ISTCLK_Msk             (0x800000UL)              /*!< USART MODE: ISTCLK (Bitfield-Mask: 0x01)              */
#define USART_MODE_DUPLEXMD_Pos           (27UL)                    /*!< USART MODE: DUPLEXMD (Bit 27)                         */
#define USART_MODE_DUPLEXMD_Msk           (0x8000000UL)             /*!< USART MODE: DUPLEXMD (Bitfield-Mask: 0x01)            */
#define USART_MODE_CLKIDLE_Pos            (28UL)                    /*!< USART MODE: CLKIDLE (Bit 28)                          */
#define USART_MODE_CLKIDLE_Msk            (0x10000000UL)            /*!< USART MODE: CLKIDLE (Bitfield-Mask: 0x01)             */
#define USART_MODE_CLKESEL_Pos            (29UL)                    /*!< USART MODE: CLKESEL (Bit 29)                          */
#define USART_MODE_CLKESEL_Msk            (0x20000000UL)            /*!< USART MODE: CLKESEL (Bitfield-Mask: 0x01)             */
#define USART_MODE_ITSEN_Pos              (30UL)                    /*!< USART MODE: ITSEN (Bit 30)                            */
#define USART_MODE_ITSEN_Msk              (0x40000000UL)            /*!< USART MODE: ITSEN (Bitfield-Mask: 0x01)               */
#define USART_MODE_OPMD_Pos               (31UL)                    /*!< USART MODE: OPMD (Bit 31)                             */
#define USART_MODE_OPMD_Msk               (0x80000000UL)            /*!< USART MODE: OPMD (Bitfield-Mask: 0x01)                */
/* ========================================================  FLOWCN  ========================================================= */
#define USART_FLOWCN_RTS_Pos              (0UL)                     /*!< USART FLOWCN: RTS (Bit 0)                             */
#define USART_FLOWCN_RTS_Msk              (0x1UL)                   /*!< USART FLOWCN: RTS (Bitfield-Mask: 0x01)               */
#define USART_FLOWCN_RX_Pos               (1UL)                     /*!< USART FLOWCN: RX (Bit 1)                              */
#define USART_FLOWCN_RX_Msk               (0x2UL)                   /*!< USART FLOWCN: RX (Bitfield-Mask: 0x01)                */
#define USART_FLOWCN_RTSINVEN_Pos         (5UL)                     /*!< USART FLOWCN: RTSINVEN (Bit 5)                        */
#define USART_FLOWCN_RTSINVEN_Msk         (0x20UL)                  /*!< USART FLOWCN: RTSINVEN (Bitfield-Mask: 0x01)          */
#define USART_FLOWCN_RTSTH_Pos            (6UL)                     /*!< USART FLOWCN: RTSTH (Bit 6)                           */
#define USART_FLOWCN_RTSTH_Msk            (0x40UL)                  /*!< USART FLOWCN: RTSTH (Bitfield-Mask: 0x01)             */
#define USART_FLOWCN_RTSEN_Pos            (7UL)                     /*!< USART FLOWCN: RTSEN (Bit 7)                           */
#define USART_FLOWCN_RTSEN_Msk            (0x80UL)                  /*!< USART FLOWCN: RTSEN (Bitfield-Mask: 0x01)             */
#define USART_FLOWCN_CTS_Pos              (16UL)                    /*!< USART FLOWCN: CTS (Bit 16)                            */
#define USART_FLOWCN_CTS_Msk              (0x10000UL)               /*!< USART FLOWCN: CTS (Bitfield-Mask: 0x01)               */
#define USART_FLOWCN_TX_Pos               (17UL)                    /*!< USART FLOWCN: TX (Bit 17)                             */
#define USART_FLOWCN_TX_Msk               (0x20000UL)               /*!< USART FLOWCN: TX (Bitfield-Mask: 0x01)                */
#define USART_FLOWCN_UCLK_Pos             (18UL)                    /*!< USART FLOWCN: UCLK (Bit 18)                           */
#define USART_FLOWCN_UCLK_Msk             (0x40000UL)               /*!< USART FLOWCN: UCLK (Bitfield-Mask: 0x01)              */
#define USART_FLOWCN_CTSINVEN_Pos         (21UL)                    /*!< USART FLOWCN: CTSINVEN (Bit 21)                       */
#define USART_FLOWCN_CTSINVEN_Msk         (0x200000UL)              /*!< USART FLOWCN: CTSINVEN (Bitfield-Mask: 0x01)          */
#define USART_FLOWCN_CTSEN_Pos            (23UL)                    /*!< USART FLOWCN: CTSEN (Bit 23)                          */
#define USART_FLOWCN_CTSEN_Msk            (0x800000UL)              /*!< USART FLOWCN: CTSEN (Bitfield-Mask: 0x01)             */
#define USART_FLOWCN_TIRDAPW_Pos          (28UL)                    /*!< USART FLOWCN: TIRDAPW (Bit 28)                        */
#define USART_FLOWCN_TIRDAPW_Msk          (0x30000000UL)            /*!< USART FLOWCN: TIRDAPW (Bitfield-Mask: 0x03)           */
/* ========================================================  CONTROL  ======================================================== */
#define USART_CONTROL_RFRMERI_Pos         (0UL)                     /*!< USART CONTROL: RFRMERI (Bit 0)                        */
#define USART_CONTROL_RFRMERI_Msk         (0x1UL)                   /*!< USART CONTROL: RFRMERI (Bitfield-Mask: 0x01)          */
#define USART_CONTROL_RPARERI_Pos         (1UL)                     /*!< USART CONTROL: RPARERI (Bit 1)                        */
#define USART_CONTROL_RPARERI_Msk         (0x2UL)                   /*!< USART CONTROL: RPARERI (Bitfield-Mask: 0x01)          */
#define USART_CONTROL_ROREI_Pos           (2UL)                     /*!< USART CONTROL: ROREI (Bit 2)                          */
#define USART_CONTROL_ROREI_Msk           (0x4UL)                   /*!< USART CONTROL: ROREI (Bitfield-Mask: 0x01)            */
#define USART_CONTROL_RDREQI_Pos          (3UL)                     /*!< USART CONTROL: RDREQI (Bit 3)                         */
#define USART_CONTROL_RDREQI_Msk          (0x8UL)                   /*!< USART CONTROL: RDREQI (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_RERIEN_Pos          (5UL)                     /*!< USART CONTROL: RERIEN (Bit 5)                         */
#define USART_CONTROL_RERIEN_Msk          (0x20UL)                  /*!< USART CONTROL: RERIEN (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_RDREQIEN_Pos        (6UL)                     /*!< USART CONTROL: RDREQIEN (Bit 6)                       */
#define USART_CONTROL_RDREQIEN_Msk        (0x40UL)                  /*!< USART CONTROL: RDREQIEN (Bitfield-Mask: 0x01)         */
#define USART_CONTROL_MATMD_Pos           (8UL)                     /*!< USART CONTROL: MATMD (Bit 8)                          */
#define USART_CONTROL_MATMD_Msk           (0x300UL)                 /*!< USART CONTROL: MATMD (Bitfield-Mask: 0x03)            */
#define USART_CONTROL_RABDEN_Pos          (10UL)                    /*!< USART CONTROL: RABDEN (Bit 10)                        */
#define USART_CONTROL_RABDEN_Msk          (0x400UL)                 /*!< USART CONTROL: RABDEN (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_RBUSYF_Pos          (11UL)                    /*!< USART CONTROL: RBUSYF (Bit 11)                        */
#define USART_CONTROL_RBUSYF_Msk          (0x800UL)                 /*!< USART CONTROL: RBUSYF (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_RBIT_Pos            (12UL)                    /*!< USART CONTROL: RBIT (Bit 12)                          */
#define USART_CONTROL_RBIT_Msk            (0x1000UL)                /*!< USART CONTROL: RBIT (Bitfield-Mask: 0x01)             */
#define USART_CONTROL_ROSEN_Pos           (13UL)                    /*!< USART CONTROL: ROSEN (Bit 13)                         */
#define USART_CONTROL_ROSEN_Msk           (0x2000UL)                /*!< USART CONTROL: ROSEN (Bitfield-Mask: 0x01)            */
#define USART_CONTROL_RINH_Pos            (14UL)                    /*!< USART CONTROL: RINH (Bit 14)                          */
#define USART_CONTROL_RINH_Msk            (0x4000UL)                /*!< USART CONTROL: RINH (Bitfield-Mask: 0x01)             */
#define USART_CONTROL_REN_Pos             (15UL)                    /*!< USART CONTROL: REN (Bit 15)                           */
#define USART_CONTROL_REN_Msk             (0x8000UL)                /*!< USART CONTROL: REN (Bitfield-Mask: 0x01)              */
#define USART_CONTROL_TSCERI_Pos          (16UL)                    /*!< USART CONTROL: TSCERI (Bit 16)                        */
#define USART_CONTROL_TSCERI_Msk          (0x10000UL)               /*!< USART CONTROL: TSCERI (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_TUREI_Pos           (17UL)                    /*!< USART CONTROL: TUREI (Bit 17)                         */
#define USART_CONTROL_TUREI_Msk           (0x20000UL)               /*!< USART CONTROL: TUREI (Bitfield-Mask: 0x01)            */
#define USART_CONTROL_TDREQI_Pos          (18UL)                    /*!< USART CONTROL: TDREQI (Bit 18)                        */
#define USART_CONTROL_TDREQI_Msk          (0x40000UL)               /*!< USART CONTROL: TDREQI (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_TCPTI_Pos           (19UL)                    /*!< USART CONTROL: TCPTI (Bit 19)                         */
#define USART_CONTROL_TCPTI_Msk           (0x80000UL)               /*!< USART CONTROL: TCPTI (Bitfield-Mask: 0x01)            */
#define USART_CONTROL_TCPTTH_Pos          (20UL)                    /*!< USART CONTROL: TCPTTH (Bit 20)                        */
#define USART_CONTROL_TCPTTH_Msk          (0x100000UL)              /*!< USART CONTROL: TCPTTH (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_TERIEN_Pos          (21UL)                    /*!< USART CONTROL: TERIEN (Bit 21)                        */
#define USART_CONTROL_TERIEN_Msk          (0x200000UL)              /*!< USART CONTROL: TERIEN (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_TDREQIEN_Pos        (22UL)                    /*!< USART CONTROL: TDREQIEN (Bit 22)                      */
#define USART_CONTROL_TDREQIEN_Msk        (0x400000UL)              /*!< USART CONTROL: TDREQIEN (Bitfield-Mask: 0x01)         */
#define USART_CONTROL_TCPTIEN_Pos         (23UL)                    /*!< USART CONTROL: TCPTIEN (Bit 23)                       */
#define USART_CONTROL_TCPTIEN_Msk         (0x800000UL)              /*!< USART CONTROL: TCPTIEN (Bitfield-Mask: 0x01)          */
#define USART_CONTROL_TBUSYF_Pos          (27UL)                    /*!< USART CONTROL: TBUSYF (Bit 27)                        */
#define USART_CONTROL_TBUSYF_Msk          (0x8000000UL)             /*!< USART CONTROL: TBUSYF (Bitfield-Mask: 0x01)           */
#define USART_CONTROL_TBIT_Pos            (28UL)                    /*!< USART CONTROL: TBIT (Bit 28)                          */
#define USART_CONTROL_TBIT_Msk            (0x10000000UL)            /*!< USART CONTROL: TBIT (Bitfield-Mask: 0x01)             */
#define USART_CONTROL_TINH_Pos            (30UL)                    /*!< USART CONTROL: TINH (Bit 30)                          */
#define USART_CONTROL_TINH_Msk            (0x40000000UL)            /*!< USART CONTROL: TINH (Bitfield-Mask: 0x01)             */
#define USART_CONTROL_TEN_Pos             (31UL)                    /*!< USART CONTROL: TEN (Bit 31)                           */
#define USART_CONTROL_TEN_Msk             (0x80000000UL)            /*!< USART CONTROL: TEN (Bitfield-Mask: 0x01)              */
/* ========================================================  IPDELAY  ======================================================== */
#define USART_IPDELAY_IPDELAY_Pos         (16UL)                    /*!< USART IPDELAY: IPDELAY (Bit 16)                       */
#define USART_IPDELAY_IPDELAY_Msk         (0xff0000UL)              /*!< USART IPDELAY: IPDELAY (Bitfield-Mask: 0xff)          */
/* =======================================================  BAUDRATE  ======================================================== */
#define USART_BAUDRATE_RBAUD_Pos          (0UL)                     /*!< USART BAUDRATE: RBAUD (Bit 0)                         */
#define USART_BAUDRATE_RBAUD_Msk          (0xffffUL)                /*!< USART BAUDRATE: RBAUD (Bitfield-Mask: 0xffff)         */
#define USART_BAUDRATE_TBAUD_Pos          (16UL)                    /*!< USART BAUDRATE: TBAUD (Bit 16)                        */
#define USART_BAUDRATE_TBAUD_Msk          (0xffff0000UL)            /*!< USART BAUDRATE: TBAUD (Bitfield-Mask: 0xffff)         */
/* ========================================================  FIFOCN  ========================================================= */
#define USART_FIFOCN_RCNT_Pos             (0UL)                     /*!< USART FIFOCN: RCNT (Bit 0)                            */
#define USART_FIFOCN_RCNT_Msk             (0x7UL)                   /*!< USART FIFOCN: RCNT (Bitfield-Mask: 0x07)              */
#define USART_FIFOCN_RFTH_Pos             (4UL)                     /*!< USART FIFOCN: RFTH (Bit 4)                            */
#define USART_FIFOCN_RFTH_Msk             (0x30UL)                  /*!< USART FIFOCN: RFTH (Bitfield-Mask: 0x03)              */
#define USART_FIFOCN_RDMAEN_Pos           (7UL)                     /*!< USART FIFOCN: RDMAEN (Bit 7)                          */
#define USART_FIFOCN_RDMAEN_Msk           (0x80UL)                  /*!< USART FIFOCN: RDMAEN (Bitfield-Mask: 0x01)            */
#define USART_FIFOCN_RFIFOFL_Pos          (8UL)                     /*!< USART FIFOCN: RFIFOFL (Bit 8)                         */
#define USART_FIFOCN_RFIFOFL_Msk          (0x100UL)                 /*!< USART FIFOCN: RFIFOFL (Bitfield-Mask: 0x01)           */
#define USART_FIFOCN_RFERI_Pos            (9UL)                     /*!< USART FIFOCN: RFERI (Bit 9)                           */
#define USART_FIFOCN_RFERI_Msk            (0x200UL)                 /*!< USART FIFOCN: RFERI (Bitfield-Mask: 0x01)             */
#define USART_FIFOCN_RSRFULLF_Pos         (10UL)                    /*!< USART FIFOCN: RSRFULLF (Bit 10)                       */
#define USART_FIFOCN_RSRFULLF_Msk         (0x400UL)                 /*!< USART FIFOCN: RSRFULLF (Bitfield-Mask: 0x01)          */
#define USART_FIFOCN_TCNT_Pos             (16UL)                    /*!< USART FIFOCN: TCNT (Bit 16)                           */
#define USART_FIFOCN_TCNT_Msk             (0x70000UL)               /*!< USART FIFOCN: TCNT (Bitfield-Mask: 0x07)              */
#define USART_FIFOCN_TFTH_Pos             (20UL)                    /*!< USART FIFOCN: TFTH (Bit 20)                           */
#define USART_FIFOCN_TFTH_Msk             (0x300000UL)              /*!< USART FIFOCN: TFTH (Bitfield-Mask: 0x03)              */
#define USART_FIFOCN_TDMAEN_Pos           (23UL)                    /*!< USART FIFOCN: TDMAEN (Bit 23)                         */
#define USART_FIFOCN_TDMAEN_Msk           (0x800000UL)              /*!< USART FIFOCN: TDMAEN (Bitfield-Mask: 0x01)            */
#define USART_FIFOCN_TFIFOFL_Pos          (24UL)                    /*!< USART FIFOCN: TFIFOFL (Bit 24)                        */
#define USART_FIFOCN_TFIFOFL_Msk          (0x1000000UL)             /*!< USART FIFOCN: TFIFOFL (Bitfield-Mask: 0x01)           */
#define USART_FIFOCN_TFERI_Pos            (25UL)                    /*!< USART FIFOCN: TFERI (Bit 25)                          */
#define USART_FIFOCN_TFERI_Msk            (0x2000000UL)             /*!< USART FIFOCN: TFERI (Bitfield-Mask: 0x01)             */
#define USART_FIFOCN_TSRFULLF_Pos         (26UL)                    /*!< USART FIFOCN: TSRFULLF (Bit 26)                       */
#define USART_FIFOCN_TSRFULLF_Msk         (0x4000000UL)             /*!< USART FIFOCN: TSRFULLF (Bitfield-Mask: 0x01)          */
/* =========================================================  DATA  ========================================================== */
#define USART_DATA_DATA_Pos               (0UL)                     /*!< USART DATA: DATA (Bit 0)                              */
#define USART_DATA_DATA_Msk               (0xffffffffUL)            /*!< USART DATA: DATA (Bitfield-Mask: 0xffffffff)          */


/* =========================================================================================================================== */
/* ================                                           USB_0                                           ================ */
/* =========================================================================================================================== */

