chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =========================================================  FADDR  ========================================================= */
#define USB_0_FADDR_FADDR_Pos             (0UL)                     /*!< USB_0 FADDR: FADDR (Bit 0)                            */
#define USB_0_FADDR_FADDR_Msk             (0x7fUL)                  /*!< USB_0 FADDR: FADDR (Bitfield-Mask: 0x7f)              */
#define USB_0_FADDR_FADDRUPD_Pos          (7UL)                     /*!< USB_0 FADDR: FADDRUPD (Bit 7)                         */
#define USB_0_FADDR_FADDRUPD_Msk          (0x80UL)                  /*!< USB_0 FADDR: FADDRUPD (Bitfield-Mask: 0x01)           */
/* =========================================================  POWER  ========================================================= */
#define USB_0_POWER_SUSDEN_Pos            (0UL)                     /*!< USB_0 POWER: SUSDEN (Bit 0)                           */
#define USB_0_POWER_SUSDEN_Msk            (0x1UL)                   /*!< USB_0 POWER: SUSDEN (Bitfield-Mask: 0x01)             */
#define USB_0_POWER_SUSMDF_Pos            (1UL)                     /*!< USB_0 POWER: SUSMDF (Bit 1)                           */
#define USB_0_POWER_SUSMDF_Msk            (0x2UL)                   /*!< USB_0 POWER: SUSMDF (Bitfield-Mask: 0x01)             */
#define USB_0_POWER_RESUME_Pos            (2UL)                     /*!< USB_0 POWER: RESUME (Bit 2)                           */
#define USB_0_POWER_RESUME_Msk            (0x4UL)                   /*!< USB_0 POWER: RESUME (Bitfield-Mask: 0x01)             */
#define USB_0_POWER_RSTDETF_Pos           (3UL)                     /*!< USB_0 POWER: RSTDETF (Bit 3)                          */
#define USB_0_POWER_RSTDETF_Msk           (0x8UL)                   /*!< USB_0 POWER: RSTDETF (Bitfield-Mask: 0x01)            */
#define USB_0_POWER_USBINH_Pos            (4UL)                     /*!< USB_0 POWER: USBINH (Bit 4)                           */
#define USB_0_POWER_USBINH_Msk            (0x10UL)                  /*!< USB_0 POWER: USBINH (Bitfield-Mask: 0x01)             */
#define USB_0_POWER_DITHEN_Pos            (5UL)                     /*!< USB_0 POWER: DITHEN (Bit 5)                           */
#define USB_0_POWER_DITHEN_Msk            (0x20UL)                  /*!< USB_0 POWER: DITHEN (Bitfield-Mask: 0x01)             */
#define USB_0_POWER_ISOUPDMD_Pos          (7UL)                     /*!< USB_0 POWER: ISOUPDMD (Bit 7)                         */
#define USB_0_POWER_ISOUPDMD_Msk          (0x80UL)                  /*!< USB_0 POWER: ISOUPDMD (Bitfield-Mask: 0x01)           */
/* =========================================================  IOINT  ========================================================= */
#define USB_0_IOINT_EP0I_Pos              (0UL)                     /*!< USB_0 IOINT: EP0I (Bit 0)                             */
#define USB_0_IOINT_EP0I_Msk              (0x1UL)                   /*!< USB_0 IOINT: EP0I (Bitfield-Mask: 0x01)               */
#define USB_0_IOINT_IN1I_Pos              (1UL)                     /*!< USB_0 IOINT: IN1I (Bit 1)                             */
#define USB_0_IOINT_IN1I_Msk              (0x2UL)                   /*!< USB_0 IOINT: IN1I (Bitfield-Mask: 0x01)               */
#define USB_0_IOINT_IN2I_Pos              (2UL)                     /*!< USB_0 IOINT: IN2I (Bit 2)                             */
#define USB_0_IOINT_IN2I_Msk              (0x4UL)                   /*!< USB_0 IOINT: IN2I (Bitfield-Mask: 0x01)               */
#define USB_0_IOINT_IN3I_Pos              (3UL)                     /*!< USB_0 IOINT: IN3I (Bit 3)                             */
#define USB_0_IOINT_IN3I_Msk              (0x8UL)                   /*!< USB_0 IOINT: IN3I (Bitfield-Mask: 0x01)               */
#define USB_0_IOINT_IN4I_Pos              (4UL)                     /*!< USB_0 IOINT: IN4I (Bit 4)                             */
#define USB_0_IOINT_IN4I_Msk              (0x10UL)                  /*!< USB_0 IOINT: IN4I (Bitfield-Mask: 0x01)               */
#define USB_0_IOINT_OUT1I_Pos             (17UL)                    /*!< USB_0 IOINT: OUT1I (Bit 17)                           */
#define USB_0_IOINT_OUT1I_Msk             (0x20000UL)               /*!< USB_0 IOINT: OUT1I (Bitfield-Mask: 0x01)              */
#define USB_0_IOINT_OUT2I_Pos             (18UL)                    /*!< USB_0 IOINT: OUT2I (Bit 18)                           */
#define USB_0_IOINT_OUT2I_Msk             (0x40000UL)               /*!< USB_0 IOINT: OUT2I (Bitfield-Mask: 0x01)              */
#define USB_0_IOINT_OUT3I_Pos             (19UL)                    /*!< USB_0 IOINT: OUT3I (Bit 19)                           */
#define USB_0_IOINT_OUT3I_Msk             (0x80000UL)               /*!< USB_0 IOINT: OUT3I (Bitfield-Mask: 0x01)              */
#define USB_0_IOINT_OUT4I_Pos             (20UL)                    /*!< USB_0 IOINT: OUT4I (Bit 20)                           */
#define USB_0_IOINT_OUT4I_Msk             (0x100000UL)              /*!< USB_0 IOINT: OUT4I (Bitfield-Mask: 0x01)              */
/* =========================================================  CMINT  ========================================================= */
#define USB_0_CMINT_SUSI_Pos              (0UL)                     /*!< USB_0 CMINT: SUSI (Bit 0)                             */
#define USB_0_CMINT_SUSI_Msk              (0x1UL)                   /*!< USB_0 CMINT: SUSI (Bitfield-Mask: 0x01)               */
#define USB_0_CMINT_RESI_Pos              (1UL)                     /*!< USB_0 CMINT: RESI (Bit 1)                             */
#define USB_0_CMINT_RESI_Msk              (0x2UL)                   /*!< USB_0 CMINT: RESI (Bitfield-Mask: 0x01)               */
#define USB_0_CMINT_RSTI_Pos              (2UL)                     /*!< USB_0 CMINT: RSTI (Bit 2)                             */
#define USB_0_CMINT_RSTI_Msk              (0x4UL)                   /*!< USB_0 CMINT: RSTI (Bitfield-Mask: 0x01)               */
#define USB_0_CMINT_SOFI_Pos              (3UL)                     /*!< USB_0 CMINT: SOFI (Bit 3)                             */
#define USB_0_CMINT_SOFI_Msk              (0x8UL)                   /*!< USB_0 CMINT: SOFI (Bitfield-Mask: 0x01)               */
/* ========================================================  IOINTE  ========================================================= */
#define USB_0_IOINTE_EP0IEN_Pos           (0UL)                     /*!< USB_0 IOINTE: EP0IEN (Bit 0)                          */
#define USB_0_IOINTE_EP0IEN_Msk           (0x1UL)                   /*!< USB_0 IOINTE: EP0IEN (Bitfield-Mask: 0x01)            */
#define USB_0_IOINTE_IN1IEN_Pos           (1UL)                     /*!< USB_0 IOINTE: IN1IEN (Bit 1)                          */
#define USB_0_IOINTE_IN1IEN_Msk           (0x2UL)                   /*!< USB_0 IOINTE: IN1IEN (Bitfield-Mask: 0x01)            */
#define USB_0_IOINTE_IN2IEN_Pos           (2UL)                     /*!< USB_0 IOINTE: IN2IEN (Bit 2)                          */
#define USB_0_IOINTE_IN2IEN_Msk           (0x4UL)                   /*!< USB_0 IOINTE: IN2IEN (Bitfield-Mask: 0x01)            */
#define USB_0_IOINTE_IN3IEN_Pos           (3UL)                     /*!< USB_0 IOINTE: IN3IEN (Bit 3)                          */
#define USB_0_IOINTE_IN3IEN_Msk           (0x8UL)                   /*!< USB_0 IOINTE: IN3IEN (Bitfield-Mask: 0x01)            */
#define USB_0_IOINTE_IN4IEN_Pos           (4UL)                     /*!< USB_0 IOINTE: IN4IEN (Bit 4)                          */
#define USB_0_IOINTE_IN4IEN_Msk           (0x10UL)                  /*!< USB_0 IOINTE: IN4IEN (Bitfield-Mask: 0x01)            */
#define USB_0_IOINTE_OUT1IEN_Pos          (17UL)                    /*!< USB_0 IOINTE: OUT1IEN (Bit 17)                        */
#define USB_0_IOINTE_OUT1IEN_Msk          (0x20000UL)               /*!< USB_0 IOINTE: OUT1IEN (Bitfield-Mask: 0x01)           */
#define USB_0_IOINTE_OUT2IEN_Pos          (18UL)                    /*!< USB_0 IOINTE: OUT2IEN (Bit 18)                        */
#define USB_0_IOINTE_OUT2IEN_Msk          (0x40000UL)               /*!< USB_0 IOINTE: OUT2IEN (Bitfield-Mask: 0x01)           */
#define USB_0_IOINTE_OUT3IEN_Pos          (19UL)                    /*!< USB_0 IOINTE: OUT3IEN (Bit 19)                        */
#define USB_0_IOINTE_OUT3IEN_Msk          (0x80000UL)               /*!< USB_0 IOINTE: OUT3IEN (Bitfield-Mask: 0x01)           */
#define USB_0_IOINTE_OUT4IEN_Pos          (20UL)                    /*!< USB_0 IOINTE: OUT4IEN (Bit 20)                        */
#define USB_0_IOINTE_OUT4IEN_Msk          (0x100000UL)              /*!< USB_0 IOINTE: OUT4IEN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMINTEPE  ======================================================== */
#define USB_0_CMINTEPE_SUSIEN_Pos         (0UL)                     /*!< USB_0 CMINTEPE: SUSIEN (Bit 0)                        */
#define USB_0_CMINTEPE_SUSIEN_Msk         (0x1UL)                   /*!< USB_0 CMINTEPE: SUSIEN (Bitfield-Mask: 0x01)          */
#define USB_0_CMINTEPE_RESIEN_Pos         (1UL)                     /*!< USB_0 CMINTEPE: RESIEN (Bit 1)                        */
#define USB_0_CMINTEPE_RESIEN_Msk         (0x2UL)                   /*!< USB_0 CMINTEPE: RESIEN (Bitfield-Mask: 0x01)          */
#define USB_0_CMINTEPE_RSTIEN_Pos         (2UL)                     /*!< USB_0 CMINTEPE: RSTIEN (Bit 2)                        */
#define USB_0_CMINTEPE_RSTIEN_Msk         (0x4UL)                   /*!< USB_0 CMINTEPE: RSTIEN (Bitfield-Mask: 0x01)          */
#define USB_0_CMINTEPE_SOFIEN_Pos         (3UL)                     /*!< USB_0 CMINTEPE: SOFIEN (Bit 3)                        */
#define USB_0_CMINTEPE_SOFIEN_Msk         (0x8UL)                   /*!< USB_0 CMINTEPE: SOFIEN (Bitfield-Mask: 0x01)          */
#define USB_0_CMINTEPE_EP0EN_Pos          (16UL)                    /*!< USB_0 CMINTEPE: EP0EN (Bit 16)                        */
#define USB_0_CMINTEPE_EP0EN_Msk          (0x10000UL)               /*!< USB_0 CMINTEPE: EP0EN (Bitfield-Mask: 0x01)           */
#define USB_0_CMINTEPE_EP1EN_Pos          (17UL)                    /*!< USB_0 CMINTEPE: EP1EN (Bit 17)                        */
#define USB_0_CMINTEPE_EP1EN_Msk          (0x20000UL)               /*!< USB_0 CMINTEPE: EP1EN (Bitfield-Mask: 0x01)           */
#define USB_0_CMINTEPE_EP2EN_Pos          (18UL)                    /*!< USB_0 CMINTEPE: EP2EN (Bit 18)                        */
#define USB_0_CMINTEPE_EP2EN_Msk          (0x40000UL)               /*!< USB_0 CMINTEPE: EP2EN (Bitfield-Mask: 0x01)           */
#define USB_0_CMINTEPE_EP3EN_Pos          (19UL)                    /*!< USB_0 CMINTEPE: EP3EN (Bit 19)                        */
#define USB_0_CMINTEPE_EP3EN_Msk          (0x80000UL)               /*!< USB_0 CMINTEPE: EP3EN (Bitfield-Mask: 0x01)           */
#define USB_0_CMINTEPE_EP4EN_Pos          (20UL)                    /*!< USB_0 CMINTEPE: EP4EN (Bit 20)                        */
#define USB_0_CMINTEPE_EP4EN_Msk          (0x100000UL)              /*!< USB_0 CMINTEPE: EP4EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CRCONTROL  ======================================================= */
#define USB_0_CRCONTROL_OLEN_Pos          (4UL)                     /*!< USB_0 CRCONTROL: OLEN (Bit 4)                         */
#define USB_0_CRCONTROL_OLEN_Msk          (0x10UL)                  /*!< USB_0 CRCONTROL: OLEN (Bitfield-Mask: 0x01)           */
#define USB_0_CRCONTROL_LSCRMD_Pos        (5UL)                     /*!< USB_0 CRCONTROL: LSCRMD (Bit 5)                       */
#define USB_0_CRCONTROL_LSCRMD_Msk        (0x20UL)                  /*!< USB_0 CRCONTROL: LSCRMD (Bitfield-Mask: 0x01)         */
#define USB_0_CRCONTROL_CRSSEN_Pos        (6UL)                     /*!< USB_0 CRCONTROL: CRSSEN (Bit 6)                       */
#define USB_0_CRCONTROL_CRSSEN_Msk        (0x40UL)                  /*!< USB_0 CRCONTROL: CRSSEN (Bitfield-Mask: 0x01)         */
#define USB_0_CRCONTROL_CREN_Pos          (7UL)                     /*!< USB_0 CRCONTROL: CREN (Bit 7)                         */
#define USB_0_CRCONTROL_CREN_Msk          (0x80UL)                  /*!< USB_0 CRCONTROL: CREN (Bitfield-Mask: 0x01)           */
/* =========================================================  FRAME  ========================================================= */
#define USB_0_FRAME_FRAMENUM_Pos          (0UL)                     /*!< USB_0 FRAME: FRAMENUM (Bit 0)                         */
#define USB_0_FRAME_FRAMENUM_Msk          (0x7ffUL)                 /*!< USB_0 FRAME: FRAMENUM (Bitfield-Mask: 0x7ff)          */
/* =======================================================  TCONTROL  ======================================================== */
#define USB_0_TCONTROL_DN_Pos             (0UL)                     /*!< USB_0 TCONTROL: DN (Bit 0)                            */
#define USB_0_TCONTROL_DN_Msk             (0x1UL)                   /*!< USB_0 TCONTROL: DN (Bitfield-Mask: 0x01)              */
#define USB_0_TCONTROL_DP_Pos             (1UL)                     /*!< USB_0 TCONTROL: DP (Bit 1)                            */
#define USB_0_TCONTROL_DP_Msk             (0x2UL)                   /*!< USB_0 TCONTROL: DP (Bitfield-Mask: 0x01)              */
#define USB_0_TCONTROL_DFREC_Pos          (2UL)                     /*!< USB_0 TCONTROL: DFREC (Bit 2)                         */
#define USB_0_TCONTROL_DFREC_Msk          (0x4UL)                   /*!< USB_0 TCONTROL: DFREC (Bitfield-Mask: 0x01)           */
#define USB_0_TCONTROL_PHYTST_Pos         (3UL)                     /*!< USB_0 TCONTROL: PHYTST (Bit 3)                        */
#define USB_0_TCONTROL_PHYTST_Msk         (0x18UL)                  /*!< USB_0 TCONTROL: PHYTST (Bitfield-Mask: 0x03)          */
#define USB_0_TCONTROL_SSEL_Pos           (5UL)                     /*!< USB_0 TCONTROL: SSEL (Bit 5)                          */
#define USB_0_TCONTROL_SSEL_Msk           (0x20UL)                  /*!< USB_0 TCONTROL: SSEL (Bitfield-Mask: 0x01)            */
#define USB_0_TCONTROL_PHYEN_Pos          (6UL)                     /*!< USB_0 TCONTROL: PHYEN (Bit 6)                         */
#define USB_0_TCONTROL_PHYEN_Msk          (0x40UL)                  /*!< USB_0 TCONTROL: PHYEN (Bitfield-Mask: 0x01)           */
#define USB_0_TCONTROL_PUEN_Pos           (7UL)                     /*!< USB_0 TCONTROL: PUEN (Bit 7)                          */
#define USB_0_TCONTROL_PUEN_Msk           (0x80UL)                  /*!< USB_0 TCONTROL: PUEN (Bitfield-Mask: 0x01)            */
/* ========================================================  CLKSEL  ========================================================= */
#define USB_0_CLKSEL_CLKSEL_Pos           (0UL)                     /*!< USB_0 CLKSEL: CLKSEL (Bit 0)                          */
#define USB_0_CLKSEL_CLKSEL_Msk           (0x3UL)                   /*!< USB_0 CLKSEL: CLKSEL (Bitfield-Mask: 0x03)            */
#define USB_0_CLKSEL_CLKDIV_Pos           (4UL)                     /*!< USB_0 CLKSEL: CLKDIV (Bit 4)                          */
#define USB_0_CLKSEL_CLKDIV_Msk           (0x30UL)                  /*!< USB_0 CLKSEL: CLKDIV (Bitfield-Mask: 0x03)            */
#define USB_0_CLKSEL_RESET_Pos            (6UL)                     /*!< USB_0 CLKSEL: RESET (Bit 6)                           */
#define USB_0_CLKSEL_RESET_Msk            (0x40UL)                  /*!< USB_0 CLKSEL: RESET (Bitfield-Mask: 0x01)             */
/* ======================================================  OSCCONTROL  ======================================================= */
#define USB_0_OSCCONTROL_SUSPEND_Pos      (5UL)                     /*!< USB_0 OSCCONTROL: SUSPEND (Bit 5)                     */
#define USB_0_OSCCONTROL_SUSPEND_Msk      (0x20UL)                  /*!< USB_0 OSCCONTROL: SUSPEND (Bitfield-Mask: 0x01)       */
#define USB_0_OSCCONTROL_OSCEN_Pos        (7UL)                     /*!< USB_0 OSCCONTROL: OSCEN (Bit 7)                       */
#define USB_0_OSCCONTROL_OSCEN_Msk        (0x80UL)                  /*!< USB_0 OSCCONTROL: OSCEN (Bitfield-Mask: 0x01)         */
/* =======================================================  AFADJUST  ======================================================== */
#define USB_0_AFADJUST_FINEFADJ_Pos       (0UL)                     /*!< USB_0 AFADJUST: FINEFADJ (Bit 0)                      */
#define USB_0_AFADJUST_FINEFADJ_Msk       (0x3fUL)                  /*!< USB_0 AFADJUST: FINEFADJ (Bitfield-Mask: 0x3f)        */
#define USB_0_AFADJUST_DITHEN_Pos         (6UL)                     /*!< USB_0 AFADJUST: DITHEN (Bit 6)                        */
#define USB_0_AFADJUST_DITHEN_Msk         (0x40UL)                  /*!< USB_0 AFADJUST: DITHEN (Bitfield-Mask: 0x01)          */
/* ========================================================  FADJUST  ======================================================== */
#define USB_0_FADJUST_FADJ_Pos            (0UL)                     /*!< USB_0 FADJUST: FADJ (Bit 0)                           */
#define USB_0_FADJUST_FADJ_Msk            (0x7fUL)                  /*!< USB_0 FADJUST: FADJ (Bitfield-Mask: 0x7f)             */
/* ========================================================  DMAFIFO  ======================================================== */
#define USB_0_DMAFIFO_DMAFIFO_Pos         (0UL)                     /*!< USB_0 DMAFIFO: DMAFIFO (Bit 0)                        */
#define USB_0_DMAFIFO_DMAFIFO_Msk         (0xffffffffUL)            /*!< USB_0 DMAFIFO: DMAFIFO (Bitfield-Mask: 0xffffffff)    */
/* ======================================================  DMACONTROL  ======================================================= */
#define USB_0_DMACONTROL_DBGMD_Pos        (4UL)                     /*!< USB_0 DMACONTROL: DBGMD (Bit 4)                       */
#define USB_0_DMACONTROL_DBGMD_Msk        (0x10UL)                  /*!< USB_0 DMACONTROL: DBGMD (Bitfield-Mask: 0x01)         */
#define USB_0_DMACONTROL_TERRF_Pos        (5UL)                     /*!< USB_0 DMACONTROL: TERRF (Bit 5)                       */
#define USB_0_DMACONTROL_TERRF_Msk        (0x20UL)                  /*!< USB_0 DMACONTROL: TERRF (Bitfield-Mask: 0x01)         */
#define USB_0_DMACONTROL_DBUSYF_Pos       (6UL)                     /*!< USB_0 DMACONTROL: DBUSYF (Bit 6)                      */
#define USB_0_DMACONTROL_DBUSYF_Msk       (0x40UL)                  /*!< USB_0 DMACONTROL: DBUSYF (Bitfield-Mask: 0x01)        */
#define USB_0_DMACONTROL_DFIFOFL_Pos      (7UL)                     /*!< USB_0 DMACONTROL: DFIFOFL (Bit 7)                     */
#define USB_0_DMACONTROL_DFIFOFL_Msk      (0x80UL)                  /*!< USB_0 DMACONTROL: DFIFOFL (Bitfield-Mask: 0x01)       */
/* ======================================================  EP0CONTROL  ======================================================= */
#define USB_0_EP0CONTROL_OPRDYI_Pos       (0UL)                     /*!< USB_0 EP0CONTROL: OPRDYI (Bit 0)                      */
#define USB_0_EP0CONTROL_OPRDYI_Msk       (0x1UL)                   /*!< USB_0 EP0CONTROL: OPRDYI (Bitfield-Mask: 0x01)        */
#define USB_0_EP0CONTROL_IPRDYI_Pos       (1UL)                     /*!< USB_0 EP0CONTROL: IPRDYI (Bit 1)                      */
#define USB_0_EP0CONTROL_IPRDYI_Msk       (0x2UL)                   /*!< USB_0 EP0CONTROL: IPRDYI (Bitfield-Mask: 0x01)        */
#define USB_0_EP0CONTROL_STSTLI_Pos       (2UL)                     /*!< USB_0 EP0CONTROL: STSTLI (Bit 2)                      */
#define USB_0_EP0CONTROL_STSTLI_Msk       (0x4UL)                   /*!< USB_0 EP0CONTROL: STSTLI (Bitfield-Mask: 0x01)        */
#define USB_0_EP0CONTROL_DEND_Pos         (3UL)                     /*!< USB_0 EP0CONTROL: DEND (Bit 3)                        */
#define USB_0_EP0CONTROL_DEND_Msk         (0x8UL)                   /*!< USB_0 EP0CONTROL: DEND (Bitfield-Mask: 0x01)          */
#define USB_0_EP0CONTROL_SUENDI_Pos       (4UL)                     /*!< USB_0 EP0CONTROL: SUENDI (Bit 4)                      */
#define USB_0_EP0CONTROL_SUENDI_Msk       (0x10UL)                  /*!< USB_0 EP0CONTROL: SUENDI (Bitfield-Mask: 0x01)        */
#define USB_0_EP0CONTROL_SDSTL_Pos        (5UL)                     /*!< USB_0 EP0CONTROL: SDSTL (Bit 5)                       */
#define USB_0_EP0CONTROL_SDSTL_Msk        (0x20UL)                  /*!< USB_0 EP0CONTROL: SDSTL (Bitfield-Mask: 0x01)         */
#define USB_0_EP0CONTROL_OPRDYIS_Pos      (6UL)                     /*!< USB_0 EP0CONTROL: OPRDYIS (Bit 6)                     */
#define USB_0_EP0CONTROL_OPRDYIS_Msk      (0x40UL)                  /*!< USB_0 EP0CONTROL: OPRDYIS (Bitfield-Mask: 0x01)       */
#define USB_0_EP0CONTROL_SUENDIS_Pos      (7UL)                     /*!< USB_0 EP0CONTROL: SUENDIS (Bit 7)                     */
#define USB_0_EP0CONTROL_SUENDIS_Msk      (0x80UL)                  /*!< USB_0 EP0CONTROL: SUENDIS (Bitfield-Mask: 0x01)       */
/* =======================================================  EP0COUNT  ======================================================== */
#define USB_0_EP0COUNT_COUNT_Pos          (0UL)                     /*!< USB_0 EP0COUNT: COUNT (Bit 0)                         */
#define USB_0_EP0COUNT_COUNT_Msk          (0x7fUL)                  /*!< USB_0 EP0COUNT: COUNT (Bitfield-Mask: 0x7f)           */
/* ========================================================  EP0FIFO  ======================================================== */
#define USB_0_EP0FIFO_FIFO_Pos            (0UL)                     /*!< USB_0 EP0FIFO: FIFO (Bit 0)                           */
#define USB_0_EP0FIFO_FIFO_Msk            (0xffffffffUL)            /*!< USB_0 EP0FIFO: FIFO (Bitfield-Mask: 0xffffffff)       */
/* ======================================================  EPMPSIZE_1  ======================================================= */
#define USB_0_EPMPSIZE_1_IMAXP_Pos        (0UL)                     /*!< USB_0 EPMPSIZE_1: IMAXP (Bit 0)                       */
#define USB_0_EPMPSIZE_1_IMAXP_Msk        (0xffUL)                  /*!< USB_0 EPMPSIZE_1: IMAXP (Bitfield-Mask: 0xff)         */
#define USB_0_EPMPSIZE_1_OMAXP_Pos        (16UL)                    /*!< USB_0 EPMPSIZE_1: OMAXP (Bit 16)                      */
#define USB_0_EPMPSIZE_1_OMAXP_Msk        (0xff0000UL)              /*!< USB_0 EPMPSIZE_1: OMAXP (Bitfield-Mask: 0xff)         */
/* ======================================================  EPCONTROL_1  ====================================================== */
#define USB_0_EPCONTROL_1_IPRDYI_Pos      (0UL)                     /*!< USB_0 EPCONTROL_1: IPRDYI (Bit 0)                     */
#define USB_0_EPCONTROL_1_IPRDYI_Msk      (0x1UL)                   /*!< USB_0 EPCONTROL_1: IPRDYI (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_IFIFONEF_Pos    (1UL)                     /*!< USB_0 EPCONTROL_1: IFIFONEF (Bit 1)                   */
#define USB_0_EPCONTROL_1_IFIFONEF_Msk    (0x2UL)                   /*!< USB_0 EPCONTROL_1: IFIFONEF (Bitfield-Mask: 0x01)     */
#define USB_0_EPCONTROL_1_IURF_Pos        (2UL)                     /*!< USB_0 EPCONTROL_1: IURF (Bit 2)                       */
#define USB_0_EPCONTROL_1_IURF_Msk        (0x4UL)                   /*!< USB_0 EPCONTROL_1: IURF (Bitfield-Mask: 0x01)         */
#define USB_0_EPCONTROL_1_IFIFOFL_Pos     (3UL)                     /*!< USB_0 EPCONTROL_1: IFIFOFL (Bit 3)                    */
#define USB_0_EPCONTROL_1_IFIFOFL_Msk     (0x8UL)                   /*!< USB_0 EPCONTROL_1: IFIFOFL (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_1_ISDSTL_Pos      (4UL)                     /*!< USB_0 EPCONTROL_1: ISDSTL (Bit 4)                     */
#define USB_0_EPCONTROL_1_ISDSTL_Msk      (0x10UL)                  /*!< USB_0 EPCONTROL_1: ISDSTL (Bitfield-Mask: 0x01)       */
