chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
#define USB_0_EPCONTROL_1_ISTSTLI_Pos     (5UL)                     /*!< USB_0 EPCONTROL_1: ISTSTLI (Bit 5)                    */
#define USB_0_EPCONTROL_1_ISTSTLI_Msk     (0x20UL)                  /*!< USB_0 EPCONTROL_1: ISTSTLI (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_1_ICLRDT_Pos      (6UL)                     /*!< USB_0 EPCONTROL_1: ICLRDT (Bit 6)                     */
#define USB_0_EPCONTROL_1_ICLRDT_Msk      (0x40UL)                  /*!< USB_0 EPCONTROL_1: ICLRDT (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_SPLITEN_Pos     (10UL)                    /*!< USB_0 EPCONTROL_1: SPLITEN (Bit 10)                   */
#define USB_0_EPCONTROL_1_SPLITEN_Msk     (0x400UL)                 /*!< USB_0 EPCONTROL_1: SPLITEN (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_1_FDTEN_Pos       (11UL)                    /*!< USB_0 EPCONTROL_1: FDTEN (Bit 11)                     */
#define USB_0_EPCONTROL_1_FDTEN_Msk       (0x800UL)                 /*!< USB_0 EPCONTROL_1: FDTEN (Bitfield-Mask: 0x01)        */
#define USB_0_EPCONTROL_1_IDMAEN_Pos      (12UL)                    /*!< USB_0 EPCONTROL_1: IDMAEN (Bit 12)                    */
#define USB_0_EPCONTROL_1_IDMAEN_Msk      (0x1000UL)                /*!< USB_0 EPCONTROL_1: IDMAEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_DIRSEL_Pos      (13UL)                    /*!< USB_0 EPCONTROL_1: DIRSEL (Bit 13)                    */
#define USB_0_EPCONTROL_1_DIRSEL_Msk      (0x2000UL)                /*!< USB_0 EPCONTROL_1: DIRSEL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_IISOEN_Pos      (14UL)                    /*!< USB_0 EPCONTROL_1: IISOEN (Bit 14)                    */
#define USB_0_EPCONTROL_1_IISOEN_Msk      (0x4000UL)                /*!< USB_0 EPCONTROL_1: IISOEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_AUTOSETEN_Pos   (15UL)                    /*!< USB_0 EPCONTROL_1: AUTOSETEN (Bit 15)                 */
#define USB_0_EPCONTROL_1_AUTOSETEN_Msk   (0x8000UL)                /*!< USB_0 EPCONTROL_1: AUTOSETEN (Bitfield-Mask: 0x01)    */
#define USB_0_EPCONTROL_1_OPRDYI_Pos      (16UL)                    /*!< USB_0 EPCONTROL_1: OPRDYI (Bit 16)                    */
#define USB_0_EPCONTROL_1_OPRDYI_Msk      (0x10000UL)               /*!< USB_0 EPCONTROL_1: OPRDYI (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_OFIFOFF_Pos     (17UL)                    /*!< USB_0 EPCONTROL_1: OFIFOFF (Bit 17)                   */
#define USB_0_EPCONTROL_1_OFIFOFF_Msk     (0x20000UL)               /*!< USB_0 EPCONTROL_1: OFIFOFF (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_1_OORF_Pos        (18UL)                    /*!< USB_0 EPCONTROL_1: OORF (Bit 18)                      */
#define USB_0_EPCONTROL_1_OORF_Msk        (0x40000UL)               /*!< USB_0 EPCONTROL_1: OORF (Bitfield-Mask: 0x01)         */
#define USB_0_EPCONTROL_1_ODERRF_Pos      (19UL)                    /*!< USB_0 EPCONTROL_1: ODERRF (Bit 19)                    */
#define USB_0_EPCONTROL_1_ODERRF_Msk      (0x80000UL)               /*!< USB_0 EPCONTROL_1: ODERRF (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_OFIFOFL_Pos     (20UL)                    /*!< USB_0 EPCONTROL_1: OFIFOFL (Bit 20)                   */
#define USB_0_EPCONTROL_1_OFIFOFL_Msk     (0x100000UL)              /*!< USB_0 EPCONTROL_1: OFIFOFL (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_1_OSDSTL_Pos      (21UL)                    /*!< USB_0 EPCONTROL_1: OSDSTL (Bit 21)                    */
#define USB_0_EPCONTROL_1_OSDSTL_Msk      (0x200000UL)              /*!< USB_0 EPCONTROL_1: OSDSTL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_OSTSTLI_Pos     (22UL)                    /*!< USB_0 EPCONTROL_1: OSTSTLI (Bit 22)                   */
#define USB_0_EPCONTROL_1_OSTSTLI_Msk     (0x400000UL)              /*!< USB_0 EPCONTROL_1: OSTSTLI (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_1_OCLRDT_Pos      (23UL)                    /*!< USB_0 EPCONTROL_1: OCLRDT (Bit 23)                    */
#define USB_0_EPCONTROL_1_OCLRDT_Msk      (0x800000UL)              /*!< USB_0 EPCONTROL_1: OCLRDT (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_ODMAMD_Pos      (28UL)                    /*!< USB_0 EPCONTROL_1: ODMAMD (Bit 28)                    */
#define USB_0_EPCONTROL_1_ODMAMD_Msk      (0x10000000UL)            /*!< USB_0 EPCONTROL_1: ODMAMD (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_ODMAEN_Pos      (29UL)                    /*!< USB_0 EPCONTROL_1: ODMAEN (Bit 29)                    */
#define USB_0_EPCONTROL_1_ODMAEN_Msk      (0x20000000UL)            /*!< USB_0 EPCONTROL_1: ODMAEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_OISOEN_Pos      (30UL)                    /*!< USB_0 EPCONTROL_1: OISOEN (Bit 30)                    */
#define USB_0_EPCONTROL_1_OISOEN_Msk      (0x40000000UL)            /*!< USB_0 EPCONTROL_1: OISOEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_1_AUTOCLREN_Pos   (31UL)                    /*!< USB_0 EPCONTROL_1: AUTOCLREN (Bit 31)                 */
#define USB_0_EPCONTROL_1_AUTOCLREN_Msk   (0x80000000UL)            /*!< USB_0 EPCONTROL_1: AUTOCLREN (Bitfield-Mask: 0x01)    */
/* =======================================================  EPCOUNT_1  ======================================================= */
#define USB_0_EPCOUNT_1_COUNT_Pos         (0UL)                     /*!< USB_0 EPCOUNT_1: COUNT (Bit 0)                        */
#define USB_0_EPCOUNT_1_COUNT_Msk         (0x3ffUL)                 /*!< USB_0 EPCOUNT_1: COUNT (Bitfield-Mask: 0x3ff)         */
/* =======================================================  EPFIFO_1  ======================================================== */
#define USB_0_EPFIFO_1_FIFO_Pos           (0UL)                     /*!< USB_0 EPFIFO_1: FIFO (Bit 0)                          */
#define USB_0_EPFIFO_1_FIFO_Msk           (0xffffffffUL)            /*!< USB_0 EPFIFO_1: FIFO (Bitfield-Mask: 0xffffffff)      */
/* ======================================================  EPMPSIZE_2  ======================================================= */
#define USB_0_EPMPSIZE_2_IMAXP_Pos        (0UL)                     /*!< USB_0 EPMPSIZE_2: IMAXP (Bit 0)                       */
#define USB_0_EPMPSIZE_2_IMAXP_Msk        (0xffUL)                  /*!< USB_0 EPMPSIZE_2: IMAXP (Bitfield-Mask: 0xff)         */
#define USB_0_EPMPSIZE_2_OMAXP_Pos        (16UL)                    /*!< USB_0 EPMPSIZE_2: OMAXP (Bit 16)                      */
#define USB_0_EPMPSIZE_2_OMAXP_Msk        (0xff0000UL)              /*!< USB_0 EPMPSIZE_2: OMAXP (Bitfield-Mask: 0xff)         */
/* ======================================================  EPCONTROL_2  ====================================================== */
#define USB_0_EPCONTROL_2_IPRDYI_Pos      (0UL)                     /*!< USB_0 EPCONTROL_2: IPRDYI (Bit 0)                     */
#define USB_0_EPCONTROL_2_IPRDYI_Msk      (0x1UL)                   /*!< USB_0 EPCONTROL_2: IPRDYI (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_IFIFONEF_Pos    (1UL)                     /*!< USB_0 EPCONTROL_2: IFIFONEF (Bit 1)                   */
#define USB_0_EPCONTROL_2_IFIFONEF_Msk    (0x2UL)                   /*!< USB_0 EPCONTROL_2: IFIFONEF (Bitfield-Mask: 0x01)     */
#define USB_0_EPCONTROL_2_IURF_Pos        (2UL)                     /*!< USB_0 EPCONTROL_2: IURF (Bit 2)                       */
#define USB_0_EPCONTROL_2_IURF_Msk        (0x4UL)                   /*!< USB_0 EPCONTROL_2: IURF (Bitfield-Mask: 0x01)         */
#define USB_0_EPCONTROL_2_IFIFOFL_Pos     (3UL)                     /*!< USB_0 EPCONTROL_2: IFIFOFL (Bit 3)                    */
#define USB_0_EPCONTROL_2_IFIFOFL_Msk     (0x8UL)                   /*!< USB_0 EPCONTROL_2: IFIFOFL (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_2_ISDSTL_Pos      (4UL)                     /*!< USB_0 EPCONTROL_2: ISDSTL (Bit 4)                     */
#define USB_0_EPCONTROL_2_ISDSTL_Msk      (0x10UL)                  /*!< USB_0 EPCONTROL_2: ISDSTL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_ISTSTLI_Pos     (5UL)                     /*!< USB_0 EPCONTROL_2: ISTSTLI (Bit 5)                    */
#define USB_0_EPCONTROL_2_ISTSTLI_Msk     (0x20UL)                  /*!< USB_0 EPCONTROL_2: ISTSTLI (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_2_ICLRDT_Pos      (6UL)                     /*!< USB_0 EPCONTROL_2: ICLRDT (Bit 6)                     */
#define USB_0_EPCONTROL_2_ICLRDT_Msk      (0x40UL)                  /*!< USB_0 EPCONTROL_2: ICLRDT (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_SPLITEN_Pos     (10UL)                    /*!< USB_0 EPCONTROL_2: SPLITEN (Bit 10)                   */
#define USB_0_EPCONTROL_2_SPLITEN_Msk     (0x400UL)                 /*!< USB_0 EPCONTROL_2: SPLITEN (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_2_FDTEN_Pos       (11UL)                    /*!< USB_0 EPCONTROL_2: FDTEN (Bit 11)                     */
#define USB_0_EPCONTROL_2_FDTEN_Msk       (0x800UL)                 /*!< USB_0 EPCONTROL_2: FDTEN (Bitfield-Mask: 0x01)        */
#define USB_0_EPCONTROL_2_IDMAEN_Pos      (12UL)                    /*!< USB_0 EPCONTROL_2: IDMAEN (Bit 12)                    */
#define USB_0_EPCONTROL_2_IDMAEN_Msk      (0x1000UL)                /*!< USB_0 EPCONTROL_2: IDMAEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_DIRSEL_Pos      (13UL)                    /*!< USB_0 EPCONTROL_2: DIRSEL (Bit 13)                    */
#define USB_0_EPCONTROL_2_DIRSEL_Msk      (0x2000UL)                /*!< USB_0 EPCONTROL_2: DIRSEL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_IISOEN_Pos      (14UL)                    /*!< USB_0 EPCONTROL_2: IISOEN (Bit 14)                    */
#define USB_0_EPCONTROL_2_IISOEN_Msk      (0x4000UL)                /*!< USB_0 EPCONTROL_2: IISOEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_AUTOSETEN_Pos   (15UL)                    /*!< USB_0 EPCONTROL_2: AUTOSETEN (Bit 15)                 */
#define USB_0_EPCONTROL_2_AUTOSETEN_Msk   (0x8000UL)                /*!< USB_0 EPCONTROL_2: AUTOSETEN (Bitfield-Mask: 0x01)    */
#define USB_0_EPCONTROL_2_OPRDYI_Pos      (16UL)                    /*!< USB_0 EPCONTROL_2: OPRDYI (Bit 16)                    */
#define USB_0_EPCONTROL_2_OPRDYI_Msk      (0x10000UL)               /*!< USB_0 EPCONTROL_2: OPRDYI (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_OFIFOFF_Pos     (17UL)                    /*!< USB_0 EPCONTROL_2: OFIFOFF (Bit 17)                   */
#define USB_0_EPCONTROL_2_OFIFOFF_Msk     (0x20000UL)               /*!< USB_0 EPCONTROL_2: OFIFOFF (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_2_OORF_Pos        (18UL)                    /*!< USB_0 EPCONTROL_2: OORF (Bit 18)                      */
#define USB_0_EPCONTROL_2_OORF_Msk        (0x40000UL)               /*!< USB_0 EPCONTROL_2: OORF (Bitfield-Mask: 0x01)         */
#define USB_0_EPCONTROL_2_ODERRF_Pos      (19UL)                    /*!< USB_0 EPCONTROL_2: ODERRF (Bit 19)                    */
#define USB_0_EPCONTROL_2_ODERRF_Msk      (0x80000UL)               /*!< USB_0 EPCONTROL_2: ODERRF (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_OFIFOFL_Pos     (20UL)                    /*!< USB_0 EPCONTROL_2: OFIFOFL (Bit 20)                   */
#define USB_0_EPCONTROL_2_OFIFOFL_Msk     (0x100000UL)              /*!< USB_0 EPCONTROL_2: OFIFOFL (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_2_OSDSTL_Pos      (21UL)                    /*!< USB_0 EPCONTROL_2: OSDSTL (Bit 21)                    */
#define USB_0_EPCONTROL_2_OSDSTL_Msk      (0x200000UL)              /*!< USB_0 EPCONTROL_2: OSDSTL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_OSTSTLI_Pos     (22UL)                    /*!< USB_0 EPCONTROL_2: OSTSTLI (Bit 22)                   */
#define USB_0_EPCONTROL_2_OSTSTLI_Msk     (0x400000UL)              /*!< USB_0 EPCONTROL_2: OSTSTLI (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_2_OCLRDT_Pos      (23UL)                    /*!< USB_0 EPCONTROL_2: OCLRDT (Bit 23)                    */
#define USB_0_EPCONTROL_2_OCLRDT_Msk      (0x800000UL)              /*!< USB_0 EPCONTROL_2: OCLRDT (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_ODMAMD_Pos      (28UL)                    /*!< USB_0 EPCONTROL_2: ODMAMD (Bit 28)                    */
#define USB_0_EPCONTROL_2_ODMAMD_Msk      (0x10000000UL)            /*!< USB_0 EPCONTROL_2: ODMAMD (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_ODMAEN_Pos      (29UL)                    /*!< USB_0 EPCONTROL_2: ODMAEN (Bit 29)                    */
#define USB_0_EPCONTROL_2_ODMAEN_Msk      (0x20000000UL)            /*!< USB_0 EPCONTROL_2: ODMAEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_OISOEN_Pos      (30UL)                    /*!< USB_0 EPCONTROL_2: OISOEN (Bit 30)                    */
#define USB_0_EPCONTROL_2_OISOEN_Msk      (0x40000000UL)            /*!< USB_0 EPCONTROL_2: OISOEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_2_AUTOCLREN_Pos   (31UL)                    /*!< USB_0 EPCONTROL_2: AUTOCLREN (Bit 31)                 */
#define USB_0_EPCONTROL_2_AUTOCLREN_Msk   (0x80000000UL)            /*!< USB_0 EPCONTROL_2: AUTOCLREN (Bitfield-Mask: 0x01)    */
/* =======================================================  EPCOUNT_2  ======================================================= */
#define USB_0_EPCOUNT_2_COUNT_Pos         (0UL)                     /*!< USB_0 EPCOUNT_2: COUNT (Bit 0)                        */
#define USB_0_EPCOUNT_2_COUNT_Msk         (0x3ffUL)                 /*!< USB_0 EPCOUNT_2: COUNT (Bitfield-Mask: 0x3ff)         */
/* =======================================================  EPFIFO_2  ======================================================== */
#define USB_0_EPFIFO_2_FIFO_Pos           (0UL)                     /*!< USB_0 EPFIFO_2: FIFO (Bit 0)                          */
#define USB_0_EPFIFO_2_FIFO_Msk           (0xffffffffUL)            /*!< USB_0 EPFIFO_2: FIFO (Bitfield-Mask: 0xffffffff)      */
/* ======================================================  EPMPSIZE_3  ======================================================= */
#define USB_0_EPMPSIZE_3_IMAXP_Pos        (0UL)                     /*!< USB_0 EPMPSIZE_3: IMAXP (Bit 0)                       */
#define USB_0_EPMPSIZE_3_IMAXP_Msk        (0xffUL)                  /*!< USB_0 EPMPSIZE_3: IMAXP (Bitfield-Mask: 0xff)         */
#define USB_0_EPMPSIZE_3_OMAXP_Pos        (16UL)                    /*!< USB_0 EPMPSIZE_3: OMAXP (Bit 16)                      */
#define USB_0_EPMPSIZE_3_OMAXP_Msk        (0xff0000UL)              /*!< USB_0 EPMPSIZE_3: OMAXP (Bitfield-Mask: 0xff)         */
/* ======================================================  EPCONTROL_3  ====================================================== */
#define USB_0_EPCONTROL_3_IPRDYI_Pos      (0UL)                     /*!< USB_0 EPCONTROL_3: IPRDYI (Bit 0)                     */
#define USB_0_EPCONTROL_3_IPRDYI_Msk      (0x1UL)                   /*!< USB_0 EPCONTROL_3: IPRDYI (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_IFIFONEF_Pos    (1UL)                     /*!< USB_0 EPCONTROL_3: IFIFONEF (Bit 1)                   */
#define USB_0_EPCONTROL_3_IFIFONEF_Msk    (0x2UL)                   /*!< USB_0 EPCONTROL_3: IFIFONEF (Bitfield-Mask: 0x01)     */
#define USB_0_EPCONTROL_3_IURF_Pos        (2UL)                     /*!< USB_0 EPCONTROL_3: IURF (Bit 2)                       */
#define USB_0_EPCONTROL_3_IURF_Msk        (0x4UL)                   /*!< USB_0 EPCONTROL_3: IURF (Bitfield-Mask: 0x01)         */
#define USB_0_EPCONTROL_3_IFIFOFL_Pos     (3UL)                     /*!< USB_0 EPCONTROL_3: IFIFOFL (Bit 3)                    */
#define USB_0_EPCONTROL_3_IFIFOFL_Msk     (0x8UL)                   /*!< USB_0 EPCONTROL_3: IFIFOFL (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_3_ISDSTL_Pos      (4UL)                     /*!< USB_0 EPCONTROL_3: ISDSTL (Bit 4)                     */
#define USB_0_EPCONTROL_3_ISDSTL_Msk      (0x10UL)                  /*!< USB_0 EPCONTROL_3: ISDSTL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_ISTSTLI_Pos     (5UL)                     /*!< USB_0 EPCONTROL_3: ISTSTLI (Bit 5)                    */
#define USB_0_EPCONTROL_3_ISTSTLI_Msk     (0x20UL)                  /*!< USB_0 EPCONTROL_3: ISTSTLI (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_3_ICLRDT_Pos      (6UL)                     /*!< USB_0 EPCONTROL_3: ICLRDT (Bit 6)                     */
#define USB_0_EPCONTROL_3_ICLRDT_Msk      (0x40UL)                  /*!< USB_0 EPCONTROL_3: ICLRDT (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_SPLITEN_Pos     (10UL)                    /*!< USB_0 EPCONTROL_3: SPLITEN (Bit 10)                   */
#define USB_0_EPCONTROL_3_SPLITEN_Msk     (0x400UL)                 /*!< USB_0 EPCONTROL_3: SPLITEN (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_3_FDTEN_Pos       (11UL)                    /*!< USB_0 EPCONTROL_3: FDTEN (Bit 11)                     */
#define USB_0_EPCONTROL_3_FDTEN_Msk       (0x800UL)                 /*!< USB_0 EPCONTROL_3: FDTEN (Bitfield-Mask: 0x01)        */
#define USB_0_EPCONTROL_3_IDMAEN_Pos      (12UL)                    /*!< USB_0 EPCONTROL_3: IDMAEN (Bit 12)                    */
#define USB_0_EPCONTROL_3_IDMAEN_Msk      (0x1000UL)                /*!< USB_0 EPCONTROL_3: IDMAEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_DIRSEL_Pos      (13UL)                    /*!< USB_0 EPCONTROL_3: DIRSEL (Bit 13)                    */
#define USB_0_EPCONTROL_3_DIRSEL_Msk      (0x2000UL)                /*!< USB_0 EPCONTROL_3: DIRSEL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_IISOEN_Pos      (14UL)                    /*!< USB_0 EPCONTROL_3: IISOEN (Bit 14)                    */
#define USB_0_EPCONTROL_3_IISOEN_Msk      (0x4000UL)                /*!< USB_0 EPCONTROL_3: IISOEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_AUTOSETEN_Pos   (15UL)                    /*!< USB_0 EPCONTROL_3: AUTOSETEN (Bit 15)                 */
#define USB_0_EPCONTROL_3_AUTOSETEN_Msk   (0x8000UL)                /*!< USB_0 EPCONTROL_3: AUTOSETEN (Bitfield-Mask: 0x01)    */
#define USB_0_EPCONTROL_3_OPRDYI_Pos      (16UL)                    /*!< USB_0 EPCONTROL_3: OPRDYI (Bit 16)                    */
#define USB_0_EPCONTROL_3_OPRDYI_Msk      (0x10000UL)               /*!< USB_0 EPCONTROL_3: OPRDYI (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_OFIFOFF_Pos     (17UL)                    /*!< USB_0 EPCONTROL_3: OFIFOFF (Bit 17)                   */
#define USB_0_EPCONTROL_3_OFIFOFF_Msk     (0x20000UL)               /*!< USB_0 EPCONTROL_3: OFIFOFF (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_3_OORF_Pos        (18UL)                    /*!< USB_0 EPCONTROL_3: OORF (Bit 18)                      */
#define USB_0_EPCONTROL_3_OORF_Msk        (0x40000UL)               /*!< USB_0 EPCONTROL_3: OORF (Bitfield-Mask: 0x01)         */
#define USB_0_EPCONTROL_3_ODERRF_Pos      (19UL)                    /*!< USB_0 EPCONTROL_3: ODERRF (Bit 19)                    */
#define USB_0_EPCONTROL_3_ODERRF_Msk      (0x80000UL)               /*!< USB_0 EPCONTROL_3: ODERRF (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_OFIFOFL_Pos     (20UL)                    /*!< USB_0 EPCONTROL_3: OFIFOFL (Bit 20)                   */
#define USB_0_EPCONTROL_3_OFIFOFL_Msk     (0x100000UL)              /*!< USB_0 EPCONTROL_3: OFIFOFL (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_3_OSDSTL_Pos      (21UL)                    /*!< USB_0 EPCONTROL_3: OSDSTL (Bit 21)                    */
#define USB_0_EPCONTROL_3_OSDSTL_Msk      (0x200000UL)              /*!< USB_0 EPCONTROL_3: OSDSTL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_OSTSTLI_Pos     (22UL)                    /*!< USB_0 EPCONTROL_3: OSTSTLI (Bit 22)                   */
#define USB_0_EPCONTROL_3_OSTSTLI_Msk     (0x400000UL)              /*!< USB_0 EPCONTROL_3: OSTSTLI (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_3_OCLRDT_Pos      (23UL)                    /*!< USB_0 EPCONTROL_3: OCLRDT (Bit 23)                    */
#define USB_0_EPCONTROL_3_OCLRDT_Msk      (0x800000UL)              /*!< USB_0 EPCONTROL_3: OCLRDT (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_ODMAMD_Pos      (28UL)                    /*!< USB_0 EPCONTROL_3: ODMAMD (Bit 28)                    */
#define USB_0_EPCONTROL_3_ODMAMD_Msk      (0x10000000UL)            /*!< USB_0 EPCONTROL_3: ODMAMD (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_ODMAEN_Pos      (29UL)                    /*!< USB_0 EPCONTROL_3: ODMAEN (Bit 29)                    */
#define USB_0_EPCONTROL_3_ODMAEN_Msk      (0x20000000UL)            /*!< USB_0 EPCONTROL_3: ODMAEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_OISOEN_Pos      (30UL)                    /*!< USB_0 EPCONTROL_3: OISOEN (Bit 30)                    */
#define USB_0_EPCONTROL_3_OISOEN_Msk      (0x40000000UL)            /*!< USB_0 EPCONTROL_3: OISOEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_3_AUTOCLREN_Pos   (31UL)                    /*!< USB_0 EPCONTROL_3: AUTOCLREN (Bit 31)                 */
#define USB_0_EPCONTROL_3_AUTOCLREN_Msk   (0x80000000UL)            /*!< USB_0 EPCONTROL_3: AUTOCLREN (Bitfield-Mask: 0x01)    */
/* =======================================================  EPCOUNT_3  ======================================================= */
#define USB_0_EPCOUNT_3_COUNT_Pos         (0UL)                     /*!< USB_0 EPCOUNT_3: COUNT (Bit 0)                        */
#define USB_0_EPCOUNT_3_COUNT_Msk         (0x3ffUL)                 /*!< USB_0 EPCOUNT_3: COUNT (Bitfield-Mask: 0x3ff)         */
/* =======================================================  EPFIFO_3  ======================================================== */
#define USB_0_EPFIFO_3_FIFO_Pos           (0UL)                     /*!< USB_0 EPFIFO_3: FIFO (Bit 0)                          */
#define USB_0_EPFIFO_3_FIFO_Msk           (0xffffffffUL)            /*!< USB_0 EPFIFO_3: FIFO (Bitfield-Mask: 0xffffffff)      */
/* ======================================================  EPMPSIZE_4  ======================================================= */
#define USB_0_EPMPSIZE_4_IMAXP_Pos        (0UL)                     /*!< USB_0 EPMPSIZE_4: IMAXP (Bit 0)                       */
#define USB_0_EPMPSIZE_4_IMAXP_Msk        (0xffUL)                  /*!< USB_0 EPMPSIZE_4: IMAXP (Bitfield-Mask: 0xff)         */
#define USB_0_EPMPSIZE_4_OMAXP_Pos        (16UL)                    /*!< USB_0 EPMPSIZE_4: OMAXP (Bit 16)                      */
#define USB_0_EPMPSIZE_4_OMAXP_Msk        (0xff0000UL)              /*!< USB_0 EPMPSIZE_4: OMAXP (Bitfield-Mask: 0xff)         */
/* ======================================================  EPCONTROL_4  ====================================================== */
#define USB_0_EPCONTROL_4_IPRDYI_Pos      (0UL)                     /*!< USB_0 EPCONTROL_4: IPRDYI (Bit 0)                     */
#define USB_0_EPCONTROL_4_IPRDYI_Msk      (0x1UL)                   /*!< USB_0 EPCONTROL_4: IPRDYI (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_IFIFONEF_Pos    (1UL)                     /*!< USB_0 EPCONTROL_4: IFIFONEF (Bit 1)                   */
#define USB_0_EPCONTROL_4_IFIFONEF_Msk    (0x2UL)                   /*!< USB_0 EPCONTROL_4: IFIFONEF (Bitfield-Mask: 0x01)     */
#define USB_0_EPCONTROL_4_IURF_Pos        (2UL)                     /*!< USB_0 EPCONTROL_4: IURF (Bit 2)                       */
#define USB_0_EPCONTROL_4_IURF_Msk        (0x4UL)                   /*!< USB_0 EPCONTROL_4: IURF (Bitfield-Mask: 0x01)         */
#define USB_0_EPCONTROL_4_IFIFOFL_Pos     (3UL)                     /*!< USB_0 EPCONTROL_4: IFIFOFL (Bit 3)                    */
#define USB_0_EPCONTROL_4_IFIFOFL_Msk     (0x8UL)                   /*!< USB_0 EPCONTROL_4: IFIFOFL (Bitfield-Mask: 0x01)      */
