chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
#define USB_0_EPCONTROL_4_ISDSTL_Pos      (4UL)                     /*!< USB_0 EPCONTROL_4: ISDSTL (Bit 4)                     */
#define USB_0_EPCONTROL_4_ISDSTL_Msk      (0x10UL)                  /*!< USB_0 EPCONTROL_4: ISDSTL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_ISTSTLI_Pos     (5UL)                     /*!< USB_0 EPCONTROL_4: ISTSTLI (Bit 5)                    */
#define USB_0_EPCONTROL_4_ISTSTLI_Msk     (0x20UL)                  /*!< USB_0 EPCONTROL_4: ISTSTLI (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_4_ICLRDT_Pos      (6UL)                     /*!< USB_0 EPCONTROL_4: ICLRDT (Bit 6)                     */
#define USB_0_EPCONTROL_4_ICLRDT_Msk      (0x40UL)                  /*!< USB_0 EPCONTROL_4: ICLRDT (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_SPLITEN_Pos     (10UL)                    /*!< USB_0 EPCONTROL_4: SPLITEN (Bit 10)                   */
#define USB_0_EPCONTROL_4_SPLITEN_Msk     (0x400UL)                 /*!< USB_0 EPCONTROL_4: SPLITEN (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_4_FDTEN_Pos       (11UL)                    /*!< USB_0 EPCONTROL_4: FDTEN (Bit 11)                     */
#define USB_0_EPCONTROL_4_FDTEN_Msk       (0x800UL)                 /*!< USB_0 EPCONTROL_4: FDTEN (Bitfield-Mask: 0x01)        */
#define USB_0_EPCONTROL_4_IDMAEN_Pos      (12UL)                    /*!< USB_0 EPCONTROL_4: IDMAEN (Bit 12)                    */
#define USB_0_EPCONTROL_4_IDMAEN_Msk      (0x1000UL)                /*!< USB_0 EPCONTROL_4: IDMAEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_DIRSEL_Pos      (13UL)                    /*!< USB_0 EPCONTROL_4: DIRSEL (Bit 13)                    */
#define USB_0_EPCONTROL_4_DIRSEL_Msk      (0x2000UL)                /*!< USB_0 EPCONTROL_4: DIRSEL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_IISOEN_Pos      (14UL)                    /*!< USB_0 EPCONTROL_4: IISOEN (Bit 14)                    */
#define USB_0_EPCONTROL_4_IISOEN_Msk      (0x4000UL)                /*!< USB_0 EPCONTROL_4: IISOEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_AUTOSETEN_Pos   (15UL)                    /*!< USB_0 EPCONTROL_4: AUTOSETEN (Bit 15)                 */
#define USB_0_EPCONTROL_4_AUTOSETEN_Msk   (0x8000UL)                /*!< USB_0 EPCONTROL_4: AUTOSETEN (Bitfield-Mask: 0x01)    */
#define USB_0_EPCONTROL_4_OPRDYI_Pos      (16UL)                    /*!< USB_0 EPCONTROL_4: OPRDYI (Bit 16)                    */
#define USB_0_EPCONTROL_4_OPRDYI_Msk      (0x10000UL)               /*!< USB_0 EPCONTROL_4: OPRDYI (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_OFIFOFF_Pos     (17UL)                    /*!< USB_0 EPCONTROL_4: OFIFOFF (Bit 17)                   */
#define USB_0_EPCONTROL_4_OFIFOFF_Msk     (0x20000UL)               /*!< USB_0 EPCONTROL_4: OFIFOFF (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_4_OORF_Pos        (18UL)                    /*!< USB_0 EPCONTROL_4: OORF (Bit 18)                      */
#define USB_0_EPCONTROL_4_OORF_Msk        (0x40000UL)               /*!< USB_0 EPCONTROL_4: OORF (Bitfield-Mask: 0x01)         */
#define USB_0_EPCONTROL_4_ODERRF_Pos      (19UL)                    /*!< USB_0 EPCONTROL_4: ODERRF (Bit 19)                    */
#define USB_0_EPCONTROL_4_ODERRF_Msk      (0x80000UL)               /*!< USB_0 EPCONTROL_4: ODERRF (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_OFIFOFL_Pos     (20UL)                    /*!< USB_0 EPCONTROL_4: OFIFOFL (Bit 20)                   */
#define USB_0_EPCONTROL_4_OFIFOFL_Msk     (0x100000UL)              /*!< USB_0 EPCONTROL_4: OFIFOFL (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_4_OSDSTL_Pos      (21UL)                    /*!< USB_0 EPCONTROL_4: OSDSTL (Bit 21)                    */
#define USB_0_EPCONTROL_4_OSDSTL_Msk      (0x200000UL)              /*!< USB_0 EPCONTROL_4: OSDSTL (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_OSTSTLI_Pos     (22UL)                    /*!< USB_0 EPCONTROL_4: OSTSTLI (Bit 22)                   */
#define USB_0_EPCONTROL_4_OSTSTLI_Msk     (0x400000UL)              /*!< USB_0 EPCONTROL_4: OSTSTLI (Bitfield-Mask: 0x01)      */
#define USB_0_EPCONTROL_4_OCLRDT_Pos      (23UL)                    /*!< USB_0 EPCONTROL_4: OCLRDT (Bit 23)                    */
#define USB_0_EPCONTROL_4_OCLRDT_Msk      (0x800000UL)              /*!< USB_0 EPCONTROL_4: OCLRDT (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_ODMAMD_Pos      (28UL)                    /*!< USB_0 EPCONTROL_4: ODMAMD (Bit 28)                    */
#define USB_0_EPCONTROL_4_ODMAMD_Msk      (0x10000000UL)            /*!< USB_0 EPCONTROL_4: ODMAMD (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_ODMAEN_Pos      (29UL)                    /*!< USB_0 EPCONTROL_4: ODMAEN (Bit 29)                    */
#define USB_0_EPCONTROL_4_ODMAEN_Msk      (0x20000000UL)            /*!< USB_0 EPCONTROL_4: ODMAEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_OISOEN_Pos      (30UL)                    /*!< USB_0 EPCONTROL_4: OISOEN (Bit 30)                    */
#define USB_0_EPCONTROL_4_OISOEN_Msk      (0x40000000UL)            /*!< USB_0 EPCONTROL_4: OISOEN (Bitfield-Mask: 0x01)       */
#define USB_0_EPCONTROL_4_AUTOCLREN_Pos   (31UL)                    /*!< USB_0 EPCONTROL_4: AUTOCLREN (Bit 31)                 */
#define USB_0_EPCONTROL_4_AUTOCLREN_Msk   (0x80000000UL)            /*!< USB_0 EPCONTROL_4: AUTOCLREN (Bitfield-Mask: 0x01)    */
/* =======================================================  EPCOUNT_4  ======================================================= */
#define USB_0_EPCOUNT_4_COUNT_Pos         (0UL)                     /*!< USB_0 EPCOUNT_4: COUNT (Bit 0)                        */
#define USB_0_EPCOUNT_4_COUNT_Msk         (0x3ffUL)                 /*!< USB_0 EPCOUNT_4: COUNT (Bitfield-Mask: 0x3ff)         */
/* =======================================================  EPFIFO_4  ======================================================== */
#define USB_0_EPFIFO_4_FIFO_Pos           (0UL)                     /*!< USB_0 EPFIFO_4: FIFO (Bit 0)                          */
#define USB_0_EPFIFO_4_FIFO_Msk           (0xffffffffUL)            /*!< USB_0 EPFIFO_4: FIFO (Bitfield-Mask: 0xffffffff)      */


/* =========================================================================================================================== */
/* ================                                          VMON_0                                           ================ */
/* =========================================================================================================================== */

