chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define VMON_0_CONTROL_VREGINSEN_Pos      (0UL)                     /*!< VMON_0 CONTROL: VREGINSEN (Bit 0)                     */
#define VMON_0_CONTROL_VREGINSEN_Msk      (0x1UL)                   /*!< VMON_0 CONTROL: VREGINSEN (Bitfield-Mask: 0x01)       */
#define VMON_0_CONTROL_VREGINLI_Pos       (1UL)                     /*!< VMON_0 CONTROL: VREGINLI (Bit 1)                      */
#define VMON_0_CONTROL_VREGINLI_Msk       (0x2UL)                   /*!< VMON_0 CONTROL: VREGINLI (Bitfield-Mask: 0x01)        */
#define VMON_0_CONTROL_VDDRSTF_Pos        (2UL)                     /*!< VMON_0 CONTROL: VDDRSTF (Bit 2)                       */
#define VMON_0_CONTROL_VDDRSTF_Msk        (0x4UL)                   /*!< VMON_0 CONTROL: VDDRSTF (Bitfield-Mask: 0x01)         */
#define VMON_0_CONTROL_VDDLI_Pos          (3UL)                     /*!< VMON_0 CONTROL: VDDLI (Bit 3)                         */
#define VMON_0_CONTROL_VDDLI_Msk          (0x8UL)                   /*!< VMON_0 CONTROL: VDDLI (Bitfield-Mask: 0x01)           */
#define VMON_0_CONTROL_VDDHITHEN_Pos      (4UL)                     /*!< VMON_0 CONTROL: VDDHITHEN (Bit 4)                     */
#define VMON_0_CONTROL_VDDHITHEN_Msk      (0x10UL)                  /*!< VMON_0 CONTROL: VDDHITHEN (Bitfield-Mask: 0x01)       */
#define VMON_0_CONTROL_VDDLIEN_Pos        (6UL)                     /*!< VMON_0 CONTROL: VDDLIEN (Bit 6)                       */
#define VMON_0_CONTROL_VDDLIEN_Msk        (0x40UL)                  /*!< VMON_0 CONTROL: VDDLIEN (Bitfield-Mask: 0x01)         */
#define VMON_0_CONTROL_VREGINLIEN_Pos     (7UL)                     /*!< VMON_0 CONTROL: VREGINLIEN (Bit 7)                    */
#define VMON_0_CONTROL_VREGINLIEN_Msk     (0x80UL)                  /*!< VMON_0 CONTROL: VREGINLIEN (Bitfield-Mask: 0x01)      */
#define VMON_0_CONTROL_VMONEN_Pos         (31UL)                    /*!< VMON_0 CONTROL: VMONEN (Bit 31)                       */
#define VMON_0_CONTROL_VMONEN_Msk         (0x80000000UL)            /*!< VMON_0 CONTROL: VMONEN (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                          VREF_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
#define VREF_0_CONTROL_VREF2X_Pos         (0UL)                     /*!< VREF_0 CONTROL: VREF2X (Bit 0)                        */
#define VREF_0_CONTROL_VREF2X_Msk         (0x1UL)                   /*!< VREF_0 CONTROL: VREF2X (Bitfield-Mask: 0x01)          */
#define VREF_0_CONTROL_TEMPEN_Pos         (1UL)                     /*!< VREF_0 CONTROL: TEMPEN (Bit 1)                        */
#define VREF_0_CONTROL_TEMPEN_Msk         (0x2UL)                   /*!< VREF_0 CONTROL: TEMPEN (Bitfield-Mask: 0x01)          */
#define VREF_0_CONTROL_VREFEN_Pos         (31UL)                    /*!< VREF_0 CONTROL: VREFEN (Bit 31)                       */
#define VREF_0_CONTROL_VREFEN_Msk         (0x80000000UL)            /*!< VREF_0 CONTROL: VREFEN (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                         EXTVREG_0                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
#define EXTVREG_0_CONTROL_SAEN_Pos        (0UL)                     /*!< EXTVREG_0 CONTROL: SAEN (Bit 0)                       */
#define EXTVREG_0_CONTROL_SAEN_Msk        (0x1UL)                   /*!< EXTVREG_0 CONTROL: SAEN (Bitfield-Mask: 0x01)         */
#define EXTVREG_0_CONTROL_WPULLEN_Pos     (24UL)                    /*!< EXTVREG_0 CONTROL: WPULLEN (Bit 24)                   */
#define EXTVREG_0_CONTROL_WPULLEN_Msk     (0x1000000UL)             /*!< EXTVREG_0 CONTROL: WPULLEN (Bitfield-Mask: 0x01)      */
#define EXTVREG_0_CONTROL_FBLEN_Pos       (25UL)                    /*!< EXTVREG_0 CONTROL: FBLEN (Bit 25)                     */
#define EXTVREG_0_CONTROL_FBLEN_Msk       (0x2000000UL)             /*!< EXTVREG_0 CONTROL: FBLEN (Bitfield-Mask: 0x01)        */
#define EXTVREG_0_CONTROL_PNSEL_Pos       (26UL)                    /*!< EXTVREG_0 CONTROL: PNSEL (Bit 26)                     */
#define EXTVREG_0_CONTROL_PNSEL_Msk       (0x4000000UL)             /*!< EXTVREG_0 CONTROL: PNSEL (Bitfield-Mask: 0x01)        */
#define EXTVREG_0_CONTROL_FBPINSEL_Pos    (27UL)                    /*!< EXTVREG_0 CONTROL: FBPINSEL (Bit 27)                  */
#define EXTVREG_0_CONTROL_FBPINSEL_Msk    (0x8000000UL)             /*!< EXTVREG_0 CONTROL: FBPINSEL (Bitfield-Mask: 0x01)     */
#define EXTVREG_0_CONTROL_EVREGEN_Pos     (31UL)                    /*!< EXTVREG_0 CONTROL: EVREGEN (Bit 31)                   */
#define EXTVREG_0_CONTROL_EVREGEN_Msk     (0x80000000UL)            /*!< EXTVREG_0 CONTROL: EVREGEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CONFIG  ========================================================= */
#define EXTVREG_0_CONFIG_IMINFINE_Pos     (0UL)                     /*!< EXTVREG_0 CONFIG: IMINFINE (Bit 0)                    */
#define EXTVREG_0_CONFIG_IMINFINE_Msk     (0x3UL)                   /*!< EXTVREG_0 CONFIG: IMINFINE (Bitfield-Mask: 0x03)      */
#define EXTVREG_0_CONFIG_IMIN_Pos         (2UL)                     /*!< EXTVREG_0 CONFIG: IMIN (Bit 2)                        */
#define EXTVREG_0_CONFIG_IMIN_Msk         (0x1cUL)                  /*!< EXTVREG_0 CONFIG: IMIN (Bitfield-Mask: 0x07)          */
#define EXTVREG_0_CONFIG_FBVOSEL_Pos      (8UL)                     /*!< EXTVREG_0 CONFIG: FBVOSEL (Bit 8)                     */
#define EXTVREG_0_CONFIG_FBVOSEL_Msk      (0x700UL)                 /*!< EXTVREG_0 CONFIG: FBVOSEL (Bitfield-Mask: 0x07)       */
#define EXTVREG_0_CONFIG_FBRATE_Pos       (12UL)                    /*!< EXTVREG_0 CONFIG: FBRATE (Bit 12)                     */
#define EXTVREG_0_CONFIG_FBRATE_Msk       (0x7000UL)                /*!< EXTVREG_0 CONFIG: FBRATE (Bitfield-Mask: 0x07)        */
#define EXTVREG_0_CONFIG_IMAX_Pos         (16UL)                    /*!< EXTVREG_0 CONFIG: IMAX (Bit 16)                       */
#define EXTVREG_0_CONFIG_IMAX_Msk         (0x70000UL)               /*!< EXTVREG_0 CONFIG: IMAX (Bitfield-Mask: 0x07)          */
#define EXTVREG_0_CONFIG_VOUTSEL_Pos      (24UL)                    /*!< EXTVREG_0 CONFIG: VOUTSEL (Bit 24)                    */
#define EXTVREG_0_CONFIG_VOUTSEL_Msk      (0x3f000000UL)            /*!< EXTVREG_0 CONFIG: VOUTSEL (Bitfield-Mask: 0x3f)       */
/* ========================================================  STATUS  ========================================================= */
#define EXTVREG_0_STATUS_FBMAXF_Pos       (0UL)                     /*!< EXTVREG_0 STATUS: FBMAXF (Bit 0)                      */
#define EXTVREG_0_STATUS_FBMAXF_Msk       (0x1UL)                   /*!< EXTVREG_0 STATUS: FBMAXF (Bitfield-Mask: 0x01)        */
/* =======================================================  CSCONTROL  ======================================================= */
#define EXTVREG_0_CSCONTROL_ISNSEN_Pos    (30UL)                    /*!< EXTVREG_0 CSCONTROL: ISNSEN (Bit 30)                  */
#define EXTVREG_0_CSCONTROL_ISNSEN_Msk    (0x40000000UL)            /*!< EXTVREG_0 CSCONTROL: ISNSEN (Bitfield-Mask: 0x01)     */
#define EXTVREG_0_CSCONTROL_ADCISNSEN_Pos (31UL)                    /*!< EXTVREG_0 CSCONTROL: ADCISNSEN (Bit 31)               */
#define EXTVREG_0_CSCONTROL_ADCISNSEN_Msk (0x80000000UL)            /*!< EXTVREG_0 CSCONTROL: ADCISNSEN (Bitfield-Mask: 0x01)  */
/* =======================================================  CSCONFIG  ======================================================== */
#define EXTVREG_0_CSCONFIG_ISADCGAIN_Pos  (0UL)                     /*!< EXTVREG_0 CSCONFIG: ISADCGAIN (Bit 0)                 */
#define EXTVREG_0_CSCONFIG_ISADCGAIN_Msk  (0x7UL)                   /*!< EXTVREG_0 CSCONFIG: ISADCGAIN (Bitfield-Mask: 0x07)   */
#define EXTVREG_0_CSCONFIG_ISOGAIN_Pos    (3UL)                     /*!< EXTVREG_0 CSCONFIG: ISOGAIN (Bit 3)                   */
#define EXTVREG_0_CSCONFIG_ISOGAIN_Msk    (0x38UL)                  /*!< EXTVREG_0 CSCONFIG: ISOGAIN (Bitfield-Mask: 0x07)     */
#define EXTVREG_0_CSCONFIG_ISINSEL_Pos    (6UL)                     /*!< EXTVREG_0 CSCONFIG: ISINSEL (Bit 6)                   */
#define EXTVREG_0_CSCONFIG_ISINSEL_Msk    (0xc0UL)                  /*!< EXTVREG_0 CSCONFIG: ISINSEL (Bitfield-Mask: 0x03)     */


/* =========================================================================================================================== */
/* ================                                          VREG_0                                           ================ */
/* =========================================================================================================================== */

