chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
#define VREG_0_CONTROL_VBUSVLDF_Pos       (0UL)                     /*!< VREG_0 CONTROL: VBUSVLDF (Bit 0)                      */
#define VREG_0_CONTROL_VBUSVLDF_Msk       (0x1UL)                   /*!< VREG_0 CONTROL: VBUSVLDF (Bitfield-Mask: 0x01)        */
#define VREG_0_CONTROL_SUSEN_Pos          (1UL)                     /*!< VREG_0 CONTROL: SUSEN (Bit 1)                         */
#define VREG_0_CONTROL_SUSEN_Msk          (0x2UL)                   /*!< VREG_0 CONTROL: SUSEN (Bitfield-Mask: 0x01)           */
#define VREG_0_CONTROL_BGDIS_Pos          (5UL)                     /*!< VREG_0 CONTROL: BGDIS (Bit 5)                         */
#define VREG_0_CONTROL_BGDIS_Msk          (0x20UL)                  /*!< VREG_0 CONTROL: BGDIS (Bitfield-Mask: 0x01)           */
#define VREG_0_CONTROL_SENSEEN_Pos        (6UL)                     /*!< VREG_0 CONTROL: SENSEEN (Bit 6)                       */
#define VREG_0_CONTROL_SENSEEN_Msk        (0x40UL)                  /*!< VREG_0 CONTROL: SENSEEN (Bitfield-Mask: 0x01)         */
#define VREG_0_CONTROL_VBUSIVLDI_Pos      (7UL)                     /*!< VREG_0 CONTROL: VBUSIVLDI (Bit 7)                     */
#define VREG_0_CONTROL_VBUSIVLDI_Msk      (0x80UL)                  /*!< VREG_0 CONTROL: VBUSIVLDI (Bitfield-Mask: 0x01)       */
#define VREG_0_CONTROL_VBUSIVLDIEN_Pos    (8UL)                     /*!< VREG_0 CONTROL: VBUSIVLDIEN (Bit 8)                   */
#define VREG_0_CONTROL_VBUSIVLDIEN_Msk    (0x100UL)                 /*!< VREG_0 CONTROL: VBUSIVLDIEN (Bitfield-Mask: 0x01)     */
#define VREG_0_CONTROL_VREGDIS_Pos        (31UL)                    /*!< VREG_0 CONTROL: VREGDIS (Bit 31)                      */
#define VREG_0_CONTROL_VREGDIS_Msk        (0x80000000UL)            /*!< VREG_0 CONTROL: VREGDIS (Bitfield-Mask: 0x01)         */


/* =========================================================================================================================== */
/* ================                                           LDO_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
#define LDO_0_CONTROL_LDOIBIAS_Pos        (1UL)                     /*!< LDO_0 CONTROL: LDOIBIAS (Bit 1)                       */
#define LDO_0_CONTROL_LDOIBIAS_Msk        (0x2UL)                   /*!< LDO_0 CONTROL: LDOIBIAS (Bitfield-Mask: 0x01)         */
#define LDO_0_CONTROL_LDOAEN_Pos          (31UL)                    /*!< LDO_0 CONTROL: LDOAEN (Bit 31)                        */
#define LDO_0_CONTROL_LDOAEN_Msk          (0x80000000UL)            /*!< LDO_0 CONTROL: LDOAEN (Bitfield-Mask: 0x01)           */


/* =========================================================================================================================== */
/* ================                                         WDTIMER_0                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
#define WDTIMER_0_CONTROL_EWIEN_Pos       (0UL)                     /*!< WDTIMER_0 CONTROL: EWIEN (Bit 0)                      */
#define WDTIMER_0_CONTROL_EWIEN_Msk       (0x1UL)                   /*!< WDTIMER_0 CONTROL: EWIEN (Bitfield-Mask: 0x01)        */
#define WDTIMER_0_CONTROL_DBGMD_Pos       (1UL)                     /*!< WDTIMER_0 CONTROL: DBGMD (Bit 1)                      */
#define WDTIMER_0_CONTROL_DBGMD_Msk       (0x2UL)                   /*!< WDTIMER_0 CONTROL: DBGMD (Bitfield-Mask: 0x01)        */
/* ========================================================  STATUS  ========================================================= */
#define WDTIMER_0_STATUS_KEYSTS_Pos       (0UL)                     /*!< WDTIMER_0 STATUS: KEYSTS (Bit 0)                      */
#define WDTIMER_0_STATUS_KEYSTS_Msk       (0x1UL)                   /*!< WDTIMER_0 STATUS: KEYSTS (Bitfield-Mask: 0x01)        */
#define WDTIMER_0_STATUS_PRIVSTS_Pos      (1UL)                     /*!< WDTIMER_0 STATUS: PRIVSTS (Bit 1)                     */
#define WDTIMER_0_STATUS_PRIVSTS_Msk      (0x2UL)                   /*!< WDTIMER_0 STATUS: PRIVSTS (Bitfield-Mask: 0x01)       */
#define WDTIMER_0_STATUS_EWI_Pos          (2UL)                     /*!< WDTIMER_0 STATUS: EWI (Bit 2)                         */
#define WDTIMER_0_STATUS_EWI_Msk          (0x4UL)                   /*!< WDTIMER_0 STATUS: EWI (Bitfield-Mask: 0x01)           */
#define WDTIMER_0_STATUS_RTHF_Pos         (3UL)                     /*!< WDTIMER_0 STATUS: RTHF (Bit 3)                        */
#define WDTIMER_0_STATUS_RTHF_Msk         (0x8UL)                   /*!< WDTIMER_0 STATUS: RTHF (Bitfield-Mask: 0x01)          */
#define WDTIMER_0_STATUS_UPDSTS_Pos       (4UL)                     /*!< WDTIMER_0 STATUS: UPDSTS (Bit 4)                      */
#define WDTIMER_0_STATUS_UPDSTS_Msk       (0x10UL)                  /*!< WDTIMER_0 STATUS: UPDSTS (Bitfield-Mask: 0x01)        */
/* =======================================================  THRESHOLD  ======================================================= */
#define WDTIMER_0_THRESHOLD_EWTH_Pos      (0UL)                     /*!< WDTIMER_0 THRESHOLD: EWTH (Bit 0)                     */
#define WDTIMER_0_THRESHOLD_EWTH_Msk      (0xffffUL)                /*!< WDTIMER_0 THRESHOLD: EWTH (Bitfield-Mask: 0xffff)     */
#define WDTIMER_0_THRESHOLD_RTH_Pos       (16UL)                    /*!< WDTIMER_0 THRESHOLD: RTH (Bit 16)                     */
#define WDTIMER_0_THRESHOLD_RTH_Msk       (0xffff0000UL)            /*!< WDTIMER_0 THRESHOLD: RTH (Bitfield-Mask: 0xffff)      */
/* ========================================================  WDTKEY  ========================================================= */
#define WDTIMER_0_WDTKEY_KEY_Pos          (0UL)                     /*!< WDTIMER_0 WDTKEY: KEY (Bit 0)                         */
#define WDTIMER_0_WDTKEY_KEY_Msk          (0xffUL)                  /*!< WDTIMER_0 WDTKEY: KEY (Bitfield-Mask: 0xff)           */

/** @} */ /* End of group PosMask_peripherals */


/* =========================================================================================================================== */
/* ================                             Enumerated Values Cluster Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_clusters
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           DATA                                            ================ */
/* =========================================================================================================================== */

