chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==========================================================  U32  ========================================================== */
/* ==========================================================  U16  ========================================================== */
/* ==========================================================  U8  =========================================================== */

/** @} */ /* End of group EnumValue_clusters */


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         SARADC_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* =============================================  SARADC_0 CONFIG SPSEL [0..3]  ============================================== */
typedef enum {                                  /*!< SARADC_0_CONFIG_SPSEL                                                     */
  SARADC_0_CONFIG_SPSEL_PHASE0         = 0,     /*!< PHASE0 : The ADC samples at SSG phase 0.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE1         = 1,     /*!< PHASE1 : The ADC samples at SSG phase 1.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE2         = 2,     /*!< PHASE2 : The ADC samples at SSG phase 2.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE3         = 3,     /*!< PHASE3 : The ADC samples at SSG phase 3.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE4         = 4,     /*!< PHASE4 : The ADC samples at SSG phase 4.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE5         = 5,     /*!< PHASE5 : The ADC samples at SSG phase 5.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE6         = 6,     /*!< PHASE6 : The ADC samples at SSG phase 6.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE7         = 7,     /*!< PHASE7 : The ADC samples at SSG phase 7.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE8         = 8,     /*!< PHASE8 : The ADC samples at SSG phase 8.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE9         = 9,     /*!< PHASE9 : The ADC samples at SSG phase 9.                                  */
  SARADC_0_CONFIG_SPSEL_PHASE10        = 10,    /*!< PHASE10 : The ADC samples at SSG phase 10.                                */
  SARADC_0_CONFIG_SPSEL_PHASE11        = 11,    /*!< PHASE11 : The ADC samples at SSG phase 11.                                */
  SARADC_0_CONFIG_SPSEL_PHASE12        = 12,    /*!< PHASE12 : The ADC samples at SSG phase 12.                                */
  SARADC_0_CONFIG_SPSEL_PHASE13        = 13,    /*!< PHASE13 : The ADC samples at SSG phase 13.                                */
  SARADC_0_CONFIG_SPSEL_PHASE14        = 14,    /*!< PHASE14 : The ADC samples at SSG phase 14.                                */
  SARADC_0_CONFIG_SPSEL_PHASE15        = 15,    /*!< PHASE15 : The ADC samples at SSG phase 15.                                */
} SARADC_0_CONFIG_SPSEL_Enum;

/* ==============================================  SARADC_0 CONFIG SPEN [4..4]  ============================================== */
typedef enum {                                  /*!< SARADC_0_CONFIG_SPEN                                                      */
  SARADC_0_CONFIG_SPEN_DISABLED        = 0,     /*!< DISABLED : Disable Phase Select. The ADC will always sample
                                                                    on the start-of-conversion trigger selected
                                                                    by the SCSEL field.                                        */
  SARADC_0_CONFIG_SPEN_ENABLED         = 1,     /*!< ENABLED : Enable Phase Select. The ADC will sample according
                                                     to the phase selected by the SPSEL field.                                 */
} SARADC_0_CONFIG_SPEN_Enum;

/* =============================================  SARADC_0 CONFIG SSGEN [5..5]  ============================================== */
typedef enum {                                  /*!< SARADC_0_CONFIG_SSGEN                                                     */
  SARADC_0_CONFIG_SSGEN_DISABLED       = 0,     /*!< DISABLED : Disable the SAR clock output to SSG.                           */
  SARADC_0_CONFIG_SSGEN_ENABLED        = 1,     /*!< ENABLED : The ADC is the SSG master, and the SAR clock will
                                                     be output to the SSG block.                                               */
} SARADC_0_CONFIG_SSGEN_Enum;

/* =============================================  SARADC_0 CONFIG PACKMD [6..7]  ============================================= */
typedef enum {                                  /*!< SARADC_0_CONFIG_PACKMD                                                    */
  SARADC_0_CONFIG_PACKMD_UPPER_ONLY    = 0,     /*!< UPPER_ONLY : Data is written to the upper half-word and the
                                                     lower half-word is filled with 0's. An SCI interrupt is
                                                     triggered when data is written, if enabled.                               */
  SARADC_0_CONFIG_PACKMD_LOWER_ONLY    = 1,     /*!< LOWER_ONLY : Data is written to the lower half-word, and the
                                                     upper half-word is filled with 0's. An SCI interrupt is
                                                     triggered when data is written, if enabled.                               */
  SARADC_0_CONFIG_PACKMD_UPPER_FIRST   = 2,     /*!< UPPER_FIRST : Two data words are packed into the register with
                                                     the upper half-word representing the earlier data, and
                                                     the lower half-word representing the later data. If SIMCEN
                                                     is set to 1, the upper half-word represents data from the
                                                     master ADC (selected by SSGEN) and the lower half-word
                                                     represents data from the slave ADC. The ADC write to the
                                                     lower half-word will trigger the SCI interrupt, if enabled.               */
  SARADC_0_CONFIG_PACKMD_LOWER_FIRST   = 3,     /*!< LOWER_FIRST : Two data words are packed into the register with
                                                     the lower half-word representing the earlier data, and
                                                     the upper half-word representing the later data. If SIMCEN
                                                     is set to 1, the lower half-word represents data from the
                                                     master ADC (selected by SSGEN) and the upper half-word
                                                     represents data from the slave ADC. The ADC write to the
                                                     upper half-word will trigger the SCI interrupt, if enabled.               */
} SARADC_0_CONFIG_PACKMD_Enum;

/* =============================================  SARADC_0 CONFIG SIMCEN [8..8]  ============================================= */
typedef enum {                                  /*!< SARADC_0_CONFIG_SIMCEN                                                    */
  SARADC_0_CONFIG_SIMCEN_DISABLED      = 0,     /*!< DISABLED : Disable simultaneous mode conversion packing.                  */
  SARADC_0_CONFIG_SIMCEN_ENABLED       = 1,     /*!< ENABLED : Enable simultaneous mode conversion packing.                    */
} SARADC_0_CONFIG_SIMCEN_Enum;

/* ============================================  SARADC_0 CONFIG INTLVEN [9..9]  ============================================= */
typedef enum {                                  /*!< SARADC_0_CONFIG_INTLVEN                                                   */
  SARADC_0_CONFIG_INTLVEN_DISABLED     = 0,     /*!< DISABLED : Disable interleaved mode conversion packing.                   */
  SARADC_0_CONFIG_INTLVEN_ENABLED      = 1,     /*!< ENABLED : Enable interleaved mode conversion packing.                     */
} SARADC_0_CONFIG_INTLVEN_Enum;

/* ============================================  SARADC_0 CONFIG SCANEN [10..10]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONFIG_SCANEN                                                    */
  SARADC_0_CONFIG_SCANEN_DISABLED      = 0,     /*!< DISABLED : Disable ADC scan mode.                                         */
  SARADC_0_CONFIG_SCANEN_ENABLED       = 1,     /*!< ENABLED : Enable ADC scan mode. The ADC will scan through the
                                                     defined time slots in sequence on every start of conversion.              */
} SARADC_0_CONFIG_SCANEN_Enum;

/* ============================================  SARADC_0 CONFIG SCANMD [12..12]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONFIG_SCANMD                                                    */
  SARADC_0_CONFIG_SCANMD_ONCE          = 0,     /*!< ONCE : The channel sequencer will cycle through all of the specified
                                                     time slots once.                                                          */
  SARADC_0_CONFIG_SCANMD_LOOP          = 1,     /*!< LOOP : The channel sequencer will cycle through all of the specified
                                                     time slots in a loop until SCANEN is cleared to 0.                        */
} SARADC_0_CONFIG_SCANMD_Enum;

/* ============================================  SARADC_0 CONFIG DMAEN [14..14]  ============================================= */
typedef enum {                                  /*!< SARADC_0_CONFIG_DMAEN                                                     */
  SARADC_0_CONFIG_DMAEN_DISABLED       = 0,     /*!< DISABLED : Disable the ADC module DMA interface.                          */
  SARADC_0_CONFIG_DMAEN_ENABLED        = 1,     /*!< ENABLED : Enable the ADC module DMA interface.                            */
} SARADC_0_CONFIG_DMAEN_Enum;

/* ===========================================  SARADC_0 CONFIG BCLKSEL [15..15]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONFIG_BCLKSEL                                                   */
  SARADC_0_CONFIG_BCLKSEL_LPOSC0       = 0,     /*!< LPOSC0 : Burst mode uses the Low Power Oscillator.                        */
  SARADC_0_CONFIG_BCLKSEL_APB          = 1,     /*!< APB : Burst mode uses the APB clock.                                      */
} SARADC_0_CONFIG_BCLKSEL_Enum;

/* ============================================  SARADC_0 CONFIG SCCIEN [27..27]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONFIG_SCCIEN                                                    */
  SARADC_0_CONFIG_SCCIEN_DISABLED      = 0,     /*!< DISABLED : Disable the ADC single data conversion complete interrupt.     */
  SARADC_0_CONFIG_SCCIEN_ENABLED       = 1,     /*!< ENABLED : Enable the ADC single data conversion complete interrupt.       */
} SARADC_0_CONFIG_SCCIEN_Enum;

/* ============================================  SARADC_0 CONFIG SDIEN [28..28]  ============================================= */
typedef enum {                                  /*!< SARADC_0_CONFIG_SDIEN                                                     */
  SARADC_0_CONFIG_SDIEN_DISABLED       = 0,     /*!< DISABLED : Disable the ADC scan complete interrupt.                       */
  SARADC_0_CONFIG_SDIEN_ENABLED        = 1,     /*!< ENABLED : Enable the ADC scan complete interrupt.                         */
} SARADC_0_CONFIG_SDIEN_Enum;

/* ============================================  SARADC_0 CONFIG FORIEN [29..29]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONFIG_FORIEN                                                    */
  SARADC_0_CONFIG_FORIEN_DISABLED      = 0,     /*!< DISABLED : Disable the data FIFO overrun interrupt.                       */
  SARADC_0_CONFIG_FORIEN_ENABLED       = 1,     /*!< ENABLED : Enable the data FIFO overrun interrupt.                         */
} SARADC_0_CONFIG_FORIEN_Enum;

