chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==========================================  SARADC_0 CONTROL AD12BSSEL [18..18]  ========================================== */
typedef enum {                                  /*!< SARADC_0_CONTROL_AD12BSSEL                                                */
  SARADC_0_CONTROL_AD12BSSEL_FOUR      = 0,     /*!< FOUR : The ADC re-samples the input before each of the four
                                                     conversions.                                                              */
  SARADC_0_CONTROL_AD12BSSEL_ONE       = 1,     /*!< ONE : The ADC samples once before the first conversion and converts
                                                     four times.                                                               */
} SARADC_0_CONTROL_AD12BSSEL_Enum;

/* ============================================  SARADC_0 CONTROL VCMEN [19..19]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONTROL_VCMEN                                                    */
  SARADC_0_CONTROL_VCMEN_DISABLED      = 0,     /*!< DISABLED : Disable the common mode buffer.                                */
  SARADC_0_CONTROL_VCMEN_ENABLED       = 1,     /*!< ENABLED : Enable the common mode buffer.                                  */
} SARADC_0_CONTROL_VCMEN_Enum;

/* ============================================  SARADC_0 CONTROL ACCMD [21..21]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONTROL_ACCMD                                                    */
  SARADC_0_CONTROL_ACCMD_ACCUMULATE    = 0,     /*!< ACCUMULATE : Conversions will be accumulated for the specified
                                                     number of cycles in burst mode according to the channel
                                                     configuration.                                                            */
  SARADC_0_CONTROL_ACCMD_REPEAT        = 1,     /*!< REPEAT : Conversions will not be accumulated in burst mode.               */
} SARADC_0_CONTROL_ACCMD_Enum;

/* ============================================  SARADC_0 CONTROL TRKMD [22..22]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONTROL_TRKMD                                                    */
  SARADC_0_CONTROL_TRKMD_NORMAL        = 0,     /*!< NORMAL : Normal Tracking Mode: When the ADC is enabled, a conversion
                                                     begins immediately following the start-of-conversion signal.              */
  SARADC_0_CONTROL_TRKMD_DELAYED       = 1,     /*!< DELAYED : Delayed Tracking Mode: When the ADC is enabled, a
                                                     conversion begins 3 SAR clock cycles following the start-of-conversion
                                                     signal. The ADC is allowed to track during this time.                     */
} SARADC_0_CONTROL_TRKMD_Enum;

/* ===========================================  SARADC_0 CONTROL BIASSEL [24..25]  =========================================== */
typedef enum {                                  /*!< SARADC_0_CONTROL_BIASSEL                                                  */
  SARADC_0_CONTROL_BIASSEL_MODE0       = 0,     /*!< MODE0 : Select bias current mode 0. Recommended to use modes
                                                     1, 2, or 3.                                                               */
  SARADC_0_CONTROL_BIASSEL_MODE1       = 1,     /*!< MODE1 : Select bias current mode 1 (SARCLK = 16 MHz).                     */
  SARADC_0_CONTROL_BIASSEL_MODE2       = 2,     /*!< MODE2 : Select bias current mode 2.                                       */
  SARADC_0_CONTROL_BIASSEL_MODE3       = 3,     /*!< MODE3 : Select bias current mode 3 (SARCLK = 4 MHz).                      */
} SARADC_0_CONTROL_BIASSEL_Enum;

/* ===========================================  SARADC_0 CONTROL LPMDEN [26..26]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CONTROL_LPMDEN                                                   */
  SARADC_0_CONTROL_LPMDEN_DISABLED     = 0,     /*!< DISABLED : Disable low power mode.                                        */
  SARADC_0_CONTROL_LPMDEN_ENABLED      = 1,     /*!< ENABLED : Enable low power mode (requires extended tracking
                                                     time).                                                                    */
} SARADC_0_CONTROL_LPMDEN_Enum;

/* ==========================================  SARADC_0 CONTROL MREFLPEN [27..27]  =========================================== */
typedef enum {                                  /*!< SARADC_0_CONTROL_MREFLPEN                                                 */
  SARADC_0_CONTROL_MREFLPEN_DISABLED   = 0,     /*!< DISABLED : Disable low power mode.                                        */
  SARADC_0_CONTROL_MREFLPEN_ENABLED    = 1,     /*!< ENABLED : Enable low power mode (SAR clock <= 4 MHz).                     */
} SARADC_0_CONTROL_MREFLPEN_Enum;

/* ===========================================  SARADC_0 CONTROL VREFSEL [30..31]  =========================================== */
typedef enum {                                  /*!< SARADC_0_CONTROL_VREFSEL                                                  */
  SARADC_0_CONTROL_VREFSEL_INTERNAL_VREF = 0,   /*!< INTERNAL_VREF : Select the internal, dedicated SARADC voltage
                                                     reference as the ADC reference.                                           */
  SARADC_0_CONTROL_VREFSEL_VDD         = 1,     /*!< VDD : Select the VDD pin as the ADC reference.                            */
  SARADC_0_CONTROL_VREFSEL_LDO_OUT     = 2,     /*!< LDO_OUT : Select the output of the internal LDO regulator (~1.8
                                                     V) as the ADC reference.                                                  */
  SARADC_0_CONTROL_VREFSEL_EXTERNAL_VREF = 3,   /*!< EXTERNAL_VREF : Select the VREF pin as the ADC reference. This
                                                     option is used for either an external VREF or the on-chip
                                                     VREF driving out to the VREF pin.                                         */
} SARADC_0_CONTROL_VREFSEL_Enum;

/* ========================================================  SQ7654  ========================================================= */
/* =============================================  SARADC_0 SQ7654 TS4CHR [0..1]  ============================================= */
typedef enum {                                  /*!< SARADC_0_SQ7654_TS4CHR                                                    */
  SARADC_0_SQ7654_TS4CHR_CC0           = 0,     /*!< CC0 : Select conversion characteristic 0 for time slot 4.                 */
  SARADC_0_SQ7654_TS4CHR_CC1           = 1,     /*!< CC1 : Select conversion characteristic 1 for time slot 4.                 */
  SARADC_0_SQ7654_TS4CHR_CC2           = 2,     /*!< CC2 : Select conversion characteristic 2 for time slot 4.                 */
  SARADC_0_SQ7654_TS4CHR_CC3           = 3,     /*!< CC3 : Select conversion characteristic 3 for time slot 4.                 */
} SARADC_0_SQ7654_TS4CHR_Enum;

/* =============================================  SARADC_0 SQ7654 TS4MUX [2..6]  ============================================= */
typedef enum {                                  /*!< SARADC_0_SQ7654_TS4MUX                                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN0         = 0,     /*!< ADCN0 : Select channel ADCn.0 (PB0.0).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN1         = 1,     /*!< ADCN1 : Select channel ADCn.1 (PB0.1).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN2         = 2,     /*!< ADCN2 : Select channel ADCn.2 (PB0.2).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN3         = 3,     /*!< ADCN3 : Select channel ADCn.3 (PB0.3).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN4         = 4,     /*!< ADCN4 : Select channel ADCn.4 (PB0.4).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN5         = 5,     /*!< ADCN5 : Select channel ADCn.5 (PB0.5).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN6         = 6,     /*!< ADCN6 : Select channel ADCn.6 (PB0.7).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN7         = 7,     /*!< ADCN7 : Select channel ADCn.7 (PB0.8).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN8         = 8,     /*!< ADCN8 : Select channel ADCn.8 (PB0.9).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN9         = 9,     /*!< ADCN9 : Select channel ADCn.9 (PB0.11).                                   */
  SARADC_0_SQ7654_TS4MUX_ADCN10        = 10,    /*!< ADCN10 : Select channel ADCn.10 (PB0.12).                                 */
  SARADC_0_SQ7654_TS4MUX_ADCN11        = 11,    /*!< ADCN11 : Select channel ADCn.11 (PB1.1).                                  */
  SARADC_0_SQ7654_TS4MUX_ADCN12        = 12,    /*!< ADCN12 : Select channel ADCn.12 (PB1.3).                                  */
  SARADC_0_SQ7654_TS4MUX_ADCN13        = 13,    /*!< ADCN13 : Select channel ADCn.13 (PB1.4).                                  */
  SARADC_0_SQ7654_TS4MUX_ADCN14        = 14,    /*!< ADCN14 : Select channel ADCn.14 (PB1.5).                                  */
  SARADC_0_SQ7654_TS4MUX_ADCN15        = 15,    /*!< ADCN15 : Select channel ADCn.15 (PB1.6).                                  */
  SARADC_0_SQ7654_TS4MUX_ADCN16        = 16,    /*!< ADCN16 : Select channel ADCn.16 (IVC0.0 Output (IVC0C0)).                 */
  SARADC_0_SQ7654_TS4MUX_ADCN17        = 17,    /*!< ADCN17 : Select channel ADCn.17 (VSS).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN18        = 18,    /*!< ADCN18 : Select channel ADCn.18 (1.8 V Output of LDO).                    */
  SARADC_0_SQ7654_TS4MUX_ADCN19        = 19,    /*!< ADCN19 : Select channel ADCn.19 (VDD).                                    */
  SARADC_0_SQ7654_TS4MUX_ADCN20        = 20,    /*!< ADCN20 : Select channel ADCn.20 (Temperature Sensor Output).              */
  SARADC_0_SQ7654_TS4MUX_ADCN21        = 21,    /*!< ADCN21 : Select channel ADCn.21 (VIOHD / 4).                              */
  SARADC_0_SQ7654_TS4MUX_ADCN22        = 22,    /*!< ADCN22 : Select channel ADCn.22 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_ADCN23        = 23,    /*!< ADCN23 : Select channel ADCn.23 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_ADCN24        = 24,    /*!< ADCN24 : Select channel ADCn.24 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_ADCN25        = 25,    /*!< ADCN25 : Select channel ADCn.25 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_ADCN26        = 26,    /*!< ADCN26 : Select channel ADCn.26 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_ADCN27        = 27,    /*!< ADCN27 : Select channel ADCn.27 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_ADCN28        = 28,    /*!< ADCN28 : Select channel ADCn.28 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_ADCN29        = 29,    /*!< ADCN29 : Select channel ADCn.29 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_ADCN30        = 30,    /*!< ADCN30 : Select channel ADCn.30 (RESERVED).                               */
  SARADC_0_SQ7654_TS4MUX_END           = 31,    /*!< END : None - End the sequence.                                            */
} SARADC_0_SQ7654_TS4MUX_Enum;

/* =============================================  SARADC_0 SQ7654 TS5CHR [8..9]  ============================================= */
typedef enum {                                  /*!< SARADC_0_SQ7654_TS5CHR                                                    */
  SARADC_0_SQ7654_TS5CHR_CC0           = 0,     /*!< CC0 : Select conversion characteristic 0 for time slot 5.                 */
  SARADC_0_SQ7654_TS5CHR_CC1           = 1,     /*!< CC1 : Select conversion characteristic 1 for time slot 5.                 */
  SARADC_0_SQ7654_TS5CHR_CC2           = 2,     /*!< CC2 : Select conversion characteristic 2 for time slot 5.                 */
  SARADC_0_SQ7654_TS5CHR_CC3           = 3,     /*!< CC3 : Select conversion characteristic 3 for time slot 5.                 */
} SARADC_0_SQ7654_TS5CHR_Enum;

/* ============================================  SARADC_0 SQ7654 TS5MUX [10..14]  ============================================ */
typedef enum {                                  /*!< SARADC_0_SQ7654_TS5MUX                                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN0         = 0,     /*!< ADCN0 : Select channel ADCn.0 (PB0.0).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN1         = 1,     /*!< ADCN1 : Select channel ADCn.1 (PB0.1).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN2         = 2,     /*!< ADCN2 : Select channel ADCn.2 (PB0.2).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN3         = 3,     /*!< ADCN3 : Select channel ADCn.3 (PB0.3).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN4         = 4,     /*!< ADCN4 : Select channel ADCn.4 (PB0.4).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN5         = 5,     /*!< ADCN5 : Select channel ADCn.5 (PB0.5).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN6         = 6,     /*!< ADCN6 : Select channel ADCn.6 (PB0.7).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN7         = 7,     /*!< ADCN7 : Select channel ADCn.7 (PB0.8).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN8         = 8,     /*!< ADCN8 : Select channel ADCn.8 (PB0.9).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN9         = 9,     /*!< ADCN9 : Select channel ADCn.9 (PB0.11).                                   */
  SARADC_0_SQ7654_TS5MUX_ADCN10        = 10,    /*!< ADCN10 : Select channel ADCn.10 (PB0.12).                                 */
  SARADC_0_SQ7654_TS5MUX_ADCN11        = 11,    /*!< ADCN11 : Select channel ADCn.11 (PB1.1).                                  */
  SARADC_0_SQ7654_TS5MUX_ADCN12        = 12,    /*!< ADCN12 : Select channel ADCn.12 (PB1.3).                                  */
  SARADC_0_SQ7654_TS5MUX_ADCN13        = 13,    /*!< ADCN13 : Select channel ADCn.13 (PB1.4).                                  */
  SARADC_0_SQ7654_TS5MUX_ADCN14        = 14,    /*!< ADCN14 : Select channel ADCn.14 (PB1.5).                                  */
  SARADC_0_SQ7654_TS5MUX_ADCN15        = 15,    /*!< ADCN15 : Select channel ADCn.15 (PB1.6).                                  */
  SARADC_0_SQ7654_TS5MUX_ADCN16        = 16,    /*!< ADCN16 : Select channel ADCn.16 (IVC0.0 Output (IVC0C0)).                 */
  SARADC_0_SQ7654_TS5MUX_ADCN17        = 17,    /*!< ADCN17 : Select channel ADCn.17 (VSS).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN18        = 18,    /*!< ADCN18 : Select channel ADCn.18 (1.8 V Output of LDO).                    */
  SARADC_0_SQ7654_TS5MUX_ADCN19        = 19,    /*!< ADCN19 : Select channel ADCn.19 (VDD).                                    */
  SARADC_0_SQ7654_TS5MUX_ADCN20        = 20,    /*!< ADCN20 : Select channel ADCn.20 (Temperature Sensor Output).              */
  SARADC_0_SQ7654_TS5MUX_ADCN21        = 21,    /*!< ADCN21 : Select channel ADCn.21 (VIOHD / 4).                              */
  SARADC_0_SQ7654_TS5MUX_ADCN22        = 22,    /*!< ADCN22 : Select channel ADCn.22 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_ADCN23        = 23,    /*!< ADCN23 : Select channel ADCn.23 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_ADCN24        = 24,    /*!< ADCN24 : Select channel ADCn.24 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_ADCN25        = 25,    /*!< ADCN25 : Select channel ADCn.25 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_ADCN26        = 26,    /*!< ADCN26 : Select channel ADCn.26 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_ADCN27        = 27,    /*!< ADCN27 : Select channel ADCn.27 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_ADCN28        = 28,    /*!< ADCN28 : Select channel ADCn.28 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_ADCN29        = 29,    /*!< ADCN29 : Select channel ADCn.29 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_ADCN30        = 30,    /*!< ADCN30 : Select channel ADCn.30 (RESERVED).                               */
  SARADC_0_SQ7654_TS5MUX_END           = 31,    /*!< END : None - End the sequence.                                            */
} SARADC_0_SQ7654_TS5MUX_Enum;

