chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  SARADC_0 SQ3210 TS2MUX [18..22]  ============================================ */
typedef enum {                                  /*!< SARADC_0_SQ3210_TS2MUX                                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN0         = 0,     /*!< ADCN0 : Select channel ADCn.0 (PB0.0).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN1         = 1,     /*!< ADCN1 : Select channel ADCn.1 (PB0.1).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN2         = 2,     /*!< ADCN2 : Select channel ADCn.2 (PB0.2).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN3         = 3,     /*!< ADCN3 : Select channel ADCn.3 (PB0.3).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN4         = 4,     /*!< ADCN4 : Select channel ADCn.4 (PB0.4).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN5         = 5,     /*!< ADCN5 : Select channel ADCn.5 (PB0.5).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN6         = 6,     /*!< ADCN6 : Select channel ADCn.6 (PB0.7).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN7         = 7,     /*!< ADCN7 : Select channel ADCn.7 (PB0.8).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN8         = 8,     /*!< ADCN8 : Select channel ADCn.8 (PB0.9).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN9         = 9,     /*!< ADCN9 : Select channel ADCn.9 (PB0.11).                                   */
  SARADC_0_SQ3210_TS2MUX_ADCN10        = 10,    /*!< ADCN10 : Select channel ADCn.10 (PB0.12).                                 */
  SARADC_0_SQ3210_TS2MUX_ADCN11        = 11,    /*!< ADCN11 : Select channel ADCn.11 (PB1.1).                                  */
  SARADC_0_SQ3210_TS2MUX_ADCN12        = 12,    /*!< ADCN12 : Select channel ADCn.12 (PB1.3).                                  */
  SARADC_0_SQ3210_TS2MUX_ADCN13        = 13,    /*!< ADCN13 : Select channel ADCn.13 (PB1.4).                                  */
  SARADC_0_SQ3210_TS2MUX_ADCN14        = 14,    /*!< ADCN14 : Select channel ADCn.14 (PB1.5).                                  */
  SARADC_0_SQ3210_TS2MUX_ADCN15        = 15,    /*!< ADCN15 : Select channel ADCn.15 (PB1.6).                                  */
  SARADC_0_SQ3210_TS2MUX_ADCN16        = 16,    /*!< ADCN16 : Select channel ADCn.16 (IVC0.0 Output (IVC0C0)).                 */
  SARADC_0_SQ3210_TS2MUX_ADCN17        = 17,    /*!< ADCN17 : Select channel ADCn.17 (VSS).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN18        = 18,    /*!< ADCN18 : Select channel ADCn.18 (1.8 V Output of LDO).                    */
  SARADC_0_SQ3210_TS2MUX_ADCN19        = 19,    /*!< ADCN19 : Select channel ADCn.19 (VDD).                                    */
  SARADC_0_SQ3210_TS2MUX_ADCN20        = 20,    /*!< ADCN20 : Select channel ADCn.20 (Temperature Sensor Output).              */
  SARADC_0_SQ3210_TS2MUX_ADCN21        = 21,    /*!< ADCN21 : Select channel ADCn.21 (VIOHD / 4).                              */
  SARADC_0_SQ3210_TS2MUX_ADCN22        = 22,    /*!< ADCN22 : Select channel ADCn.22 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_ADCN23        = 23,    /*!< ADCN23 : Select channel ADCn.23 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_ADCN24        = 24,    /*!< ADCN24 : Select channel ADCn.24 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_ADCN25        = 25,    /*!< ADCN25 : Select channel ADCn.25 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_ADCN26        = 26,    /*!< ADCN26 : Select channel ADCn.26 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_ADCN27        = 27,    /*!< ADCN27 : Select channel ADCn.27 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_ADCN28        = 28,    /*!< ADCN28 : Select channel ADCn.28 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_ADCN29        = 29,    /*!< ADCN29 : Select channel ADCn.29 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_ADCN30        = 30,    /*!< ADCN30 : Select channel ADCn.30 (RESERVED).                               */
  SARADC_0_SQ3210_TS2MUX_END           = 31,    /*!< END : None - End the sequence.                                            */
} SARADC_0_SQ3210_TS2MUX_Enum;

/* ============================================  SARADC_0 SQ3210 TS3CHR [24..25]  ============================================ */
typedef enum {                                  /*!< SARADC_0_SQ3210_TS3CHR                                                    */
  SARADC_0_SQ3210_TS3CHR_CC0           = 0,     /*!< CC0 : Select conversion characteristic 0 for time slot 3.                 */
  SARADC_0_SQ3210_TS3CHR_CC1           = 1,     /*!< CC1 : Select conversion characteristic 1 for time slot 3.                 */
  SARADC_0_SQ3210_TS3CHR_CC2           = 2,     /*!< CC2 : Select conversion characteristic 2 for time slot 3.                 */
  SARADC_0_SQ3210_TS3CHR_CC3           = 3,     /*!< CC3 : Select conversion characteristic 3 for time slot 3.                 */
} SARADC_0_SQ3210_TS3CHR_Enum;

/* ============================================  SARADC_0 SQ3210 TS3MUX [26..30]  ============================================ */
typedef enum {                                  /*!< SARADC_0_SQ3210_TS3MUX                                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN0         = 0,     /*!< ADCN0 : Select channel ADCn.0 (PB0.0).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN1         = 1,     /*!< ADCN1 : Select channel ADCn.1 (PB0.1).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN2         = 2,     /*!< ADCN2 : Select channel ADCn.2 (PB0.2).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN3         = 3,     /*!< ADCN3 : Select channel ADCn.3 (PB0.3).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN4         = 4,     /*!< ADCN4 : Select channel ADCn.4 (PB0.4).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN5         = 5,     /*!< ADCN5 : Select channel ADCn.5 (PB0.5).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN6         = 6,     /*!< ADCN6 : Select channel ADCn.6 (PB0.7).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN7         = 7,     /*!< ADCN7 : Select channel ADCn.7 (PB0.8).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN8         = 8,     /*!< ADCN8 : Select channel ADCn.8 (PB0.9).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN9         = 9,     /*!< ADCN9 : Select channel ADCn.9 (PB0.11).                                   */
  SARADC_0_SQ3210_TS3MUX_ADCN10        = 10,    /*!< ADCN10 : Select channel ADCn.10 (PB0.12).                                 */
  SARADC_0_SQ3210_TS3MUX_ADCN11        = 11,    /*!< ADCN11 : Select channel ADCn.11 (PB1.1).                                  */
  SARADC_0_SQ3210_TS3MUX_ADCN12        = 12,    /*!< ADCN12 : Select channel ADCn.12 (PB1.3).                                  */
  SARADC_0_SQ3210_TS3MUX_ADCN13        = 13,    /*!< ADCN13 : Select channel ADCn.13 (PB1.4).                                  */
  SARADC_0_SQ3210_TS3MUX_ADCN14        = 14,    /*!< ADCN14 : Select channel ADCn.14 (PB1.5).                                  */
  SARADC_0_SQ3210_TS3MUX_ADCN15        = 15,    /*!< ADCN15 : Select channel ADCn.15 (PB1.6).                                  */
  SARADC_0_SQ3210_TS3MUX_ADCN16        = 16,    /*!< ADCN16 : Select channel ADCn.16 (IVC0.0 Output (IVC0C0)).                 */
  SARADC_0_SQ3210_TS3MUX_ADCN17        = 17,    /*!< ADCN17 : Select channel ADCn.17 (VSS).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN18        = 18,    /*!< ADCN18 : Select channel ADCn.18 (1.8 V Output of LDO).                    */
  SARADC_0_SQ3210_TS3MUX_ADCN19        = 19,    /*!< ADCN19 : Select channel ADCn.19 (VDD).                                    */
  SARADC_0_SQ3210_TS3MUX_ADCN20        = 20,    /*!< ADCN20 : Select channel ADCn.20 (Temperature Sensor Output).              */
  SARADC_0_SQ3210_TS3MUX_ADCN21        = 21,    /*!< ADCN21 : Select channel ADCn.21 (VIOHD / 4).                              */
  SARADC_0_SQ3210_TS3MUX_ADCN22        = 22,    /*!< ADCN22 : Select channel ADCn.22 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_ADCN23        = 23,    /*!< ADCN23 : Select channel ADCn.23 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_ADCN24        = 24,    /*!< ADCN24 : Select channel ADCn.24 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_ADCN25        = 25,    /*!< ADCN25 : Select channel ADCn.25 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_ADCN26        = 26,    /*!< ADCN26 : Select channel ADCn.26 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_ADCN27        = 27,    /*!< ADCN27 : Select channel ADCn.27 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_ADCN28        = 28,    /*!< ADCN28 : Select channel ADCn.28 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_ADCN29        = 29,    /*!< ADCN29 : Select channel ADCn.29 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_ADCN30        = 30,    /*!< ADCN30 : Select channel ADCn.30 (RESERVED).                               */
  SARADC_0_SQ3210_TS3MUX_END           = 31,    /*!< END : None - End the sequence.                                            */
} SARADC_0_SQ3210_TS3MUX_Enum;

/* ========================================================  CHAR32  ========================================================= */
/* =============================================  SARADC_0 CHAR32 CHR2GN [0..0]  ============================================= */
typedef enum {                                  /*!< SARADC_0_CHAR32_CHR2GN                                                    */
  SARADC_0_CHAR32_CHR2GN_UNITY         = 0,     /*!< UNITY : The on-chip PGA gain is 1.                                        */
  SARADC_0_CHAR32_CHR2GN_HALF          = 1,     /*!< HALF : The on-chip PGA gain is 0.5.                                       */
} SARADC_0_CHAR32_CHR2GN_Enum;

/* ============================================  SARADC_0 CHAR32 CHR2RPT [1..3]  ============================================= */
typedef enum {                                  /*!< SARADC_0_CHAR32_CHR2RPT                                                   */
  SARADC_0_CHAR32_CHR2RPT_ACC1         = 0,     /*!< ACC1 : Accumulate one sample.                                             */
  SARADC_0_CHAR32_CHR2RPT_ACC4         = 1,     /*!< ACC4 : Accumulate four samples.                                           */
  SARADC_0_CHAR32_CHR2RPT_ACC8         = 2,     /*!< ACC8 : Accumulate eight samples.                                          */
  SARADC_0_CHAR32_CHR2RPT_ACC16        = 3,     /*!< ACC16 : Accumulate sixteen samples.                                       */
  SARADC_0_CHAR32_CHR2RPT_ACC32        = 4,     /*!< ACC32 : Accumulate thirty-two samples (10-bit mode only).                 */
  SARADC_0_CHAR32_CHR2RPT_ACC64        = 5,     /*!< ACC64 : Accumulate sixty-four samples (10-bit mode only).                 */
} SARADC_0_CHAR32_CHR2RPT_Enum;

/* ============================================  SARADC_0 CHAR32 CHR2RSEL [7..7]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CHAR32_CHR2RSEL                                                  */
  SARADC_0_CHAR32_CHR2RSEL_B10         = 0,     /*!< B10 : Select 10-bit Mode.                                                 */
  SARADC_0_CHAR32_CHR2RSEL_B12         = 1,     /*!< B12 : Select 12-bit Mode (burst mode must be enabled).                    */
} SARADC_0_CHAR32_CHR2RSEL_Enum;

/* ===========================================  SARADC_0 CHAR32 CHR2WCIEN [8..8]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CHAR32_CHR2WCIEN                                                 */
  SARADC_0_CHAR32_CHR2WCIEN_DISABLED   = 0,     /*!< DISABLED : Disable window comparison interrupts.                          */
  SARADC_0_CHAR32_CHR2WCIEN_ENABLED    = 1,     /*!< ENABLED : Enabled window comparison interrupts. The window comparator
                                                     will be used to check the ADC result on channels that use
                                                     this characteristic.                                                      */
} SARADC_0_CHAR32_CHR2WCIEN_Enum;

/* ============================================  SARADC_0 CHAR32 CHR3GN [16..16]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CHAR32_CHR3GN                                                    */
  SARADC_0_CHAR32_CHR3GN_UNITY         = 0,     /*!< UNITY : The on-chip PGA gain is 1.                                        */
  SARADC_0_CHAR32_CHR3GN_HALF          = 1,     /*!< HALF : The on-chip PGA gain is 0.5.                                       */
} SARADC_0_CHAR32_CHR3GN_Enum;

