chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  SARADC_0 CHAR10 CHR1RPT [17..19]  ============================================ */
typedef enum {                                  /*!< SARADC_0_CHAR10_CHR1RPT                                                   */
  SARADC_0_CHAR10_CHR1RPT_ACC1         = 0,     /*!< ACC1 : Accumulate one sample.                                             */
  SARADC_0_CHAR10_CHR1RPT_ACC4         = 1,     /*!< ACC4 : Accumulate four samples.                                           */
  SARADC_0_CHAR10_CHR1RPT_ACC8         = 2,     /*!< ACC8 : Accumulate eight samples.                                          */
  SARADC_0_CHAR10_CHR1RPT_ACC16        = 3,     /*!< ACC16 : Accumulate sixteen samples.                                       */
  SARADC_0_CHAR10_CHR1RPT_ACC32        = 4,     /*!< ACC32 : Accumulate thirty-two samples (10-bit mode only).                 */
  SARADC_0_CHAR10_CHR1RPT_ACC64        = 5,     /*!< ACC64 : Accumulate sixty-four samples (10-bit mode only).                 */
} SARADC_0_CHAR10_CHR1RPT_Enum;

/* ===========================================  SARADC_0 CHAR10 CHR1RSEL [23..23]  =========================================== */
typedef enum {                                  /*!< SARADC_0_CHAR10_CHR1RSEL                                                  */
  SARADC_0_CHAR10_CHR1RSEL_B10         = 0,     /*!< B10 : Select 10-bit Mode.                                                 */
  SARADC_0_CHAR10_CHR1RSEL_B12         = 1,     /*!< B12 : Select 12-bit Mode (burst mode must be enabled).                    */
} SARADC_0_CHAR10_CHR1RSEL_Enum;

/* ==========================================  SARADC_0 CHAR10 CHR1WCIEN [24..24]  =========================================== */
typedef enum {                                  /*!< SARADC_0_CHAR10_CHR1WCIEN                                                 */
  SARADC_0_CHAR10_CHR1WCIEN_DISABLED   = 0,     /*!< DISABLED : Disable window comparison interrupts.                          */
  SARADC_0_CHAR10_CHR1WCIEN_ENABLED    = 1,     /*!< ENABLED : Enabled window comparison interrupts. The window comparator
                                                     will be used to check the ADC result on channels that use
                                                     this characteristic.                                                      */
} SARADC_0_CHAR10_CHR1WCIEN_Enum;

/* =========================================================  DATA  ========================================================== */
/* =======================================================  WCLIMITS  ======================================================== */
/* ==========================================================  ACC  ========================================================== */
/* ========================================================  STATUS  ========================================================= */
/* ==============================================  SARADC_0 STATUS WCI [0..0]  =============================================== */
typedef enum {                                  /*!< SARADC_0_STATUS_WCI                                                       */
  SARADC_0_STATUS_WCI_NOT_SET          = 0,     /*!< NOT_SET : Read: A window compare interrupt has not occurred.
                                                     Write: Clear the interrupt.                                               */
  SARADC_0_STATUS_WCI_SET              = 1,     /*!< SET : Read: A window compare interrupt occurred. Write: Force
                                                     a window compare interrupt.                                               */
} SARADC_0_STATUS_WCI_Enum;

/* ==============================================  SARADC_0 STATUS SCCI [1..1]  ============================================== */
typedef enum {                                  /*!< SARADC_0_STATUS_SCCI                                                      */
  SARADC_0_STATUS_SCCI_NOT_SET         = 0,     /*!< NOT_SET : Read: A single data conversion interrupt has not occurred.
                                                     Write: Clear the interrupt.                                               */
  SARADC_0_STATUS_SCCI_SET             = 1,     /*!< SET : Read: A single data conversion interrupt occurred. Write:
                                                     Force a single data conversion interrupt.                                 */
} SARADC_0_STATUS_SCCI_Enum;

/* ==============================================  SARADC_0 STATUS SDI [2..2]  =============================================== */
typedef enum {                                  /*!< SARADC_0_STATUS_SDI                                                       */
  SARADC_0_STATUS_SDI_NOT_SET          = 0,     /*!< NOT_SET : Read: A scan done interrupt has not occurred. Write:
                                                     Clear the interrupt.                                                      */
  SARADC_0_STATUS_SDI_SET              = 1,     /*!< SET : Read: A scan done interrupt occurred. Write: Force a scan
                                                     done interrupt.                                                           */
} SARADC_0_STATUS_SDI_Enum;

/* ==============================================  SARADC_0 STATUS FORI [3..3]  ============================================== */
typedef enum {                                  /*!< SARADC_0_STATUS_FORI                                                      */
  SARADC_0_STATUS_FORI_NOT_SET         = 0,     /*!< NOT_SET : Read: A data FIFO overrun interrupt has not occurred.
                                                     Write: Clear the interrupt.                                               */
  SARADC_0_STATUS_FORI_SET             = 1,     /*!< SET : Read: A data FIFO overrun interrupt occurred. Write: Force
                                                     a data FIFO overrun interrupt.                                            */
} SARADC_0_STATUS_FORI_Enum;

/* ==============================================  SARADC_0 STATUS FURI [4..4]  ============================================== */
typedef enum {                                  /*!< SARADC_0_STATUS_FURI                                                      */
  SARADC_0_STATUS_FURI_NOT_SET         = 0,     /*!< NOT_SET : Read: A data FIFO underrun interrupt has not occurred.
                                                     Write: Clear the interrupt.                                               */
  SARADC_0_STATUS_FURI_SET             = 1,     /*!< SET : Read: A data FIFO underrun interrupt occurred. Write:
                                                     Force a data FIFO underrun interrupt.                                     */
} SARADC_0_STATUS_FURI_Enum;

/* ======================================================  FIFOSTATUS  ======================================================= */
/* ===========================================  SARADC_0 FIFOSTATUS DPSTS [4..4]  ============================================ */
typedef enum {                                  /*!< SARADC_0_FIFOSTATUS_DPSTS                                                 */
  SARADC_0_FIFOSTATUS_DPSTS_LOWER      = 0,     /*!< LOWER : The next ADC conversion will be written to the lower
                                                     half-word.                                                                */
  SARADC_0_FIFOSTATUS_DPSTS_UPPER      = 1,     /*!< UPPER : The next ADC conversion will be written to the upper
                                                     half-word.                                                                */
} SARADC_0_FIFOSTATUS_DPSTS_Enum;

/* ===========================================  SARADC_0 FIFOSTATUS DRDYF [5..5]  ============================================ */
typedef enum {                                  /*!< SARADC_0_FIFOSTATUS_DRDYF                                                 */
  SARADC_0_FIFOSTATUS_DRDYF_NOT_SET    = 0,     /*!< NOT_SET : New data is not produced yet.                                   */
  SARADC_0_FIFOSTATUS_DRDYF_SET        = 1,     /*!< SET : New data is ready.                                                  */
} SARADC_0_FIFOSTATUS_DRDYF_Enum;



/* =========================================================================================================================== */
/* ================                                         SARADC_1                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* =============================================  SARADC_1 CONFIG SPSEL [0..3]  ============================================== */
typedef enum {                                  /*!< SARADC_1_CONFIG_SPSEL                                                     */
  SARADC_1_CONFIG_SPSEL_PHASE0         = 0,     /*!< PHASE0 : The ADC samples at SSG phase 0.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE1         = 1,     /*!< PHASE1 : The ADC samples at SSG phase 1.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE2         = 2,     /*!< PHASE2 : The ADC samples at SSG phase 2.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE3         = 3,     /*!< PHASE3 : The ADC samples at SSG phase 3.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE4         = 4,     /*!< PHASE4 : The ADC samples at SSG phase 4.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE5         = 5,     /*!< PHASE5 : The ADC samples at SSG phase 5.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE6         = 6,     /*!< PHASE6 : The ADC samples at SSG phase 6.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE7         = 7,     /*!< PHASE7 : The ADC samples at SSG phase 7.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE8         = 8,     /*!< PHASE8 : The ADC samples at SSG phase 8.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE9         = 9,     /*!< PHASE9 : The ADC samples at SSG phase 9.                                  */
  SARADC_1_CONFIG_SPSEL_PHASE10        = 10,    /*!< PHASE10 : The ADC samples at SSG phase 10.                                */
  SARADC_1_CONFIG_SPSEL_PHASE11        = 11,    /*!< PHASE11 : The ADC samples at SSG phase 11.                                */
  SARADC_1_CONFIG_SPSEL_PHASE12        = 12,    /*!< PHASE12 : The ADC samples at SSG phase 12.                                */
  SARADC_1_CONFIG_SPSEL_PHASE13        = 13,    /*!< PHASE13 : The ADC samples at SSG phase 13.                                */
  SARADC_1_CONFIG_SPSEL_PHASE14        = 14,    /*!< PHASE14 : The ADC samples at SSG phase 14.                                */
  SARADC_1_CONFIG_SPSEL_PHASE15        = 15,    /*!< PHASE15 : The ADC samples at SSG phase 15.                                */
} SARADC_1_CONFIG_SPSEL_Enum;

/* ==============================================  SARADC_1 CONFIG SPEN [4..4]  ============================================== */
typedef enum {                                  /*!< SARADC_1_CONFIG_SPEN                                                      */
  SARADC_1_CONFIG_SPEN_DISABLED        = 0,     /*!< DISABLED : Disable Phase Select. The ADC will always sample
                                                     on the start-of-conversion trigger selected by the SCSEL
                                                     field.                                                                    */
  SARADC_1_CONFIG_SPEN_ENABLED         = 1,     /*!< ENABLED : Enable Phase Select. The ADC will sample according
                                                     to the phase selected by the SPSEL field.                                 */
} SARADC_1_CONFIG_SPEN_Enum;

/* =============================================  SARADC_1 CONFIG SSGEN [5..5]  ============================================== */
typedef enum {                                  /*!< SARADC_1_CONFIG_SSGEN                                                     */
  SARADC_1_CONFIG_SSGEN_DISABLED       = 0,     /*!< DISABLED : Disable the SAR clock output to SSG.                           */
  SARADC_1_CONFIG_SSGEN_ENABLED        = 1,     /*!< ENABLED : The ADC is the SSG master, and the SAR clock will
                                                     be output to the SSG block.                                               */
} SARADC_1_CONFIG_SSGEN_Enum;

/* =============================================  SARADC_1 CONFIG PACKMD [6..7]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CONFIG_PACKMD                                                    */
  SARADC_1_CONFIG_PACKMD_UPPER_ONLY    = 0,     /*!< UPPER_ONLY : Data is written to the upper half-word and the
                                                     lower half-word is filled with 0's. An SCI interrupt is
                                                     triggered when data is written, if enabled.                               */
  SARADC_1_CONFIG_PACKMD_LOWER_ONLY    = 1,     /*!< LOWER_ONLY : Data is written to the lower half-word, and the
                                                     upper half-word is filled with 0's. An SCI interrupt is
                                                     triggered when data is written, if enabled.                               */
  SARADC_1_CONFIG_PACKMD_UPPER_FIRST   = 2,     /*!< UPPER_FIRST : Two data words are packed into the register with
                                                     the upper half-word representing the earlier data, and
                                                     the lower half-word representing the later data. If SIMCEN
                                                     is set to 1, the upper half-word represents data from the
                                                     master ADC (selected by SSGEN) and the lower half-word
                                                     represents data from the slave ADC. The ADC write to the
                                                     lower half-word will trigger the SCI interrupt, if enabled.               */
  SARADC_1_CONFIG_PACKMD_LOWER_FIRST   = 3,     /*!< LOWER_FIRST : Two data words are packed into the register with
                                                     the lower half-word representing the earlier data, and
                                                     the upper half-word representing the later data. If SIMCEN
                                                     is set to 1, the lower half-word represents data from the
                                                     master ADC (selected by SSGEN) and the upper half-word
                                                     represents data from the slave ADC. The ADC write to the
                                                     upper half-word will trigger the SCI interrupt, if enabled.               */
} SARADC_1_CONFIG_PACKMD_Enum;

/* =============================================  SARADC_1 CONFIG SIMCEN [8..8]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CONFIG_SIMCEN                                                    */
  SARADC_1_CONFIG_SIMCEN_DISABLED      = 0,     /*!< DISABLED : Disable simultaneous mode conversion packing.                  */
  SARADC_1_CONFIG_SIMCEN_ENABLED       = 1,     /*!< ENABLED : Enable simultaneous mode conversion packing.                    */
} SARADC_1_CONFIG_SIMCEN_Enum;

/* ============================================  SARADC_1 CONFIG INTLVEN [9..9]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CONFIG_INTLVEN                                                   */
  SARADC_1_CONFIG_INTLVEN_DISABLED     = 0,     /*!< DISABLED : Disable interleaved mode conversion packing.                   */
  SARADC_1_CONFIG_INTLVEN_ENABLED      = 1,     /*!< ENABLED : Enable interleaved mode conversion packing.                     */
} SARADC_1_CONFIG_INTLVEN_Enum;

/* ============================================  SARADC_1 CONFIG SCANEN [10..10]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CONFIG_SCANEN                                                    */
  SARADC_1_CONFIG_SCANEN_DISABLED      = 0,     /*!< DISABLED : Disable ADC scan mode.                                         */
  SARADC_1_CONFIG_SCANEN_ENABLED       = 1,     /*!< ENABLED : Enable ADC scan mode. The ADC will scan through the
                                                     defined time slots in sequence on every start of conversion.              */
} SARADC_1_CONFIG_SCANEN_Enum;

/* ============================================  SARADC_1 CONFIG SCANMD [12..12]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CONFIG_SCANMD                                                    */
  SARADC_1_CONFIG_SCANMD_ONCE          = 0,     /*!< ONCE : The channel sequencer will cycle through all of the specified
                                                     time slots once.                                                          */
  SARADC_1_CONFIG_SCANMD_LOOP          = 1,     /*!< LOOP : The channel sequencer will cycle through all of the specified
                                                     time slots in a loop until SCANEN is cleared to 0.                        */
} SARADC_1_CONFIG_SCANMD_Enum;

/* ============================================  SARADC_1 CONFIG DMAEN [14..14]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CONFIG_DMAEN                                                     */
  SARADC_1_CONFIG_DMAEN_DISABLED       = 0,     /*!< DISABLED : Disable the ADC module DMA interface.                          */
  SARADC_1_CONFIG_DMAEN_ENABLED        = 1,     /*!< ENABLED : Enable the ADC module DMA interface.                            */
} SARADC_1_CONFIG_DMAEN_Enum;

/* ===========================================  SARADC_1 CONFIG BCLKSEL [15..15]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CONFIG_BCLKSEL                                                   */
  SARADC_1_CONFIG_BCLKSEL_LPOSC0       = 0,     /*!< LPOSC0 : Burst mode uses the Low Power Oscillator.                        */
  SARADC_1_CONFIG_BCLKSEL_APB          = 1,     /*!< APB : Burst mode uses the APB clock.                                      */
} SARADC_1_CONFIG_BCLKSEL_Enum;

