chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  SARADC_1 CONFIG SCCIEN [27..27]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CONFIG_SCCIEN                                                    */
  SARADC_1_CONFIG_SCCIEN_DISABLED      = 0,     /*!< DISABLED : Disable the ADC single data conversion complete interrupt.     */
  SARADC_1_CONFIG_SCCIEN_ENABLED       = 1,     /*!< ENABLED : Enable the ADC single data conversion complete interrupt.       */
} SARADC_1_CONFIG_SCCIEN_Enum;

/* ============================================  SARADC_1 CONFIG SDIEN [28..28]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CONFIG_SDIEN                                                     */
  SARADC_1_CONFIG_SDIEN_DISABLED       = 0,     /*!< DISABLED : Disable the ADC scan complete interrupt.                       */
  SARADC_1_CONFIG_SDIEN_ENABLED        = 1,     /*!< ENABLED : Enable the ADC scan complete interrupt.                         */
} SARADC_1_CONFIG_SDIEN_Enum;

/* ============================================  SARADC_1 CONFIG FORIEN [29..29]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CONFIG_FORIEN                                                    */
  SARADC_1_CONFIG_FORIEN_DISABLED      = 0,     /*!< DISABLED : Disable the data FIFO overrun interrupt.                       */
  SARADC_1_CONFIG_FORIEN_ENABLED       = 1,     /*!< ENABLED : Enable the data FIFO overrun interrupt.                         */
} SARADC_1_CONFIG_FORIEN_Enum;

/* ============================================  SARADC_1 CONFIG FURIEN [30..30]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CONFIG_FURIEN                                                    */
  SARADC_1_CONFIG_FURIEN_DISABLED      = 0,     /*!< DISABLED : Disable the data FIFO underrun interrupt.                      */
  SARADC_1_CONFIG_FURIEN_ENABLED       = 1,     /*!< ENABLED : Enable the data FIFO underrun interrupt.                        */
} SARADC_1_CONFIG_FURIEN_Enum;

/* ========================================================  CONTROL  ======================================================== */
/* ===========================================  SARADC_1 CONTROL REFGNDSEL [0..0]  =========================================== */
typedef enum {                                  /*!< SARADC_1_CONTROL_REFGNDSEL                                                */
  SARADC_1_CONTROL_REFGNDSEL_INTERNAL  = 0,     /*!< INTERNAL : The internal device ground is used as the ground
                                                     reference for ADC conversions.                                            */
  SARADC_1_CONTROL_REFGNDSEL_EXTERNAL  = 1,     /*!< EXTERNAL : The VREFGND pin is used as the ground reference for
                                                     ADC conversions.                                                          */
} SARADC_1_CONTROL_REFGNDSEL_Enum;

/* ============================================  SARADC_1 CONTROL CLKESEL [1..1]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CONTROL_CLKESEL                                                  */
  SARADC_1_CONTROL_CLKESEL_RISING      = 0,     /*!< RISING : Select the rising edge of the APB clock.                         */
  SARADC_1_CONTROL_CLKESEL_FALLING     = 1,     /*!< FALLING : Select the falling edge of the APB clock.                       */
} SARADC_1_CONTROL_CLKESEL_Enum;

/* ============================================  SARADC_1 CONTROL SCSEL [8..11]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CONTROL_SCSEL                                                    */
  SARADC_1_CONTROL_SCSEL_ADCNT0        = 0,     /*!< ADCNT0 : An ADC conversion triggers from the ADCnT0 ('On Demand'
                                                     by writing 1 to ADBUSY) trigger source.                                   */
  SARADC_1_CONTROL_SCSEL_ADCNT1        = 1,     /*!< ADCNT1 : An ADC conversion triggers from the ADCnT1 (Timer 0
                                                     Low Overflow) trigger source.                                             */
  SARADC_1_CONTROL_SCSEL_ADCNT2        = 2,     /*!< ADCNT2 : An ADC conversion triggers from the ADCnT2 (Timer 0
                                                     High Overflow) trigger source.                                            */
  SARADC_1_CONTROL_SCSEL_ADCNT3        = 3,     /*!< ADCNT3 : An ADC conversion triggers from the ADCnT3 (Timer 1
                                                     Low Overflow) trigger source.                                             */
  SARADC_1_CONTROL_SCSEL_ADCNT4        = 4,     /*!< ADCNT4 : An ADC conversion triggers from the ADCnT4 (Timer 1
                                                     High Overflow) trigger source.                                            */
  SARADC_1_CONTROL_SCSEL_ADCNT5        = 5,     /*!< ADCNT5 : An ADC conversion triggers from the ADCnT5 (EPCA0 synchronization
                                                     pulse) trigger source.                                                    */
  SARADC_1_CONTROL_SCSEL_ADCNT6        = 6,     /*!< ADCNT6 : An ADC conversion triggers from the ADCnT6 (I2C0 Timer
                                                     overflow) trigger source.                                                 */
  SARADC_1_CONTROL_SCSEL_ADCNT7        = 7,     /*!< ADCNT7 : An ADC conversion triggers from the ADCnT7 (I2C1 Timer
                                                     overflow) trigger source.                                                 */
  SARADC_1_CONTROL_SCSEL_ADCNT8        = 8,     /*!< ADCNT8 : An ADC conversion triggers from the ADCnT8 (SSG phase
                                                     defined by ADSP bits) trigger source.                                     */
  SARADC_1_CONTROL_SCSEL_ADCNT9        = 9,     /*!< ADCNT9 : An ADC conversion triggers from the ADCnT9 (RESERVED)
                                                     trigger source.                                                           */
  SARADC_1_CONTROL_SCSEL_ADCNT10       = 10,    /*!< ADCNT10 : An ADC conversion triggers from the ADCnT10 (RESERVED)
                                                     trigger source.                                                           */
  SARADC_1_CONTROL_SCSEL_ADCNT11       = 11,    /*!< ADCNT11 : An ADC conversion triggers from the ADCnT11 (RESERVED)
                                                     trigger source.                                                           */
  SARADC_1_CONTROL_SCSEL_ADCNT12       = 12,    /*!< ADCNT12 : An ADC conversion triggers from the ADCnT12 (RESERVED)
                                                     trigger source.                                                           */
  SARADC_1_CONTROL_SCSEL_ADCNT13       = 13,    /*!< ADCNT13 : An ADC conversion triggers from the ADCnT13 (RESERVED)
                                                     trigger source.                                                           */
  SARADC_1_CONTROL_SCSEL_ADCNT14       = 14,    /*!< ADCNT14 : An ADC conversion triggers from the ADCnT14 (RESERVED)
                                                     trigger source.                                                           */
  SARADC_1_CONTROL_SCSEL_ADCNT15       = 15,    /*!< ADCNT15 : An ADC conversion triggers from the ADCnT15 (PB1.14)
                                                     trigger source.                                                           */
} SARADC_1_CONTROL_SCSEL_Enum;

