chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  SARADC_1 SQ3210 TS2CHR [16..17]  ============================================ */
typedef enum {                                  /*!< SARADC_1_SQ3210_TS2CHR                                                    */
  SARADC_1_SQ3210_TS2CHR_CC0           = 0,     /*!< CC0 : Select conversion characteristic 0 for time slot 2.                 */
  SARADC_1_SQ3210_TS2CHR_CC1           = 1,     /*!< CC1 : Select conversion characteristic 1 for time slot 2.                 */
  SARADC_1_SQ3210_TS2CHR_CC2           = 2,     /*!< CC2 : Select conversion characteristic 2 for time slot 2.                 */
  SARADC_1_SQ3210_TS2CHR_CC3           = 3,     /*!< CC3 : Select conversion characteristic 3 for time slot 2.                 */
} SARADC_1_SQ3210_TS2CHR_Enum;

/* ============================================  SARADC_1 SQ3210 TS2MUX [18..22]  ============================================ */
typedef enum {                                  /*!< SARADC_1_SQ3210_TS2MUX                                                    */
  SARADC_1_SQ3210_TS2MUX_ADCN0         = 0,     /*!< ADCN0 : Select channel ADCn.0 (PB2.2).                                    */
  SARADC_1_SQ3210_TS2MUX_ADCN1         = 1,     /*!< ADCN1 : Select channel ADCn.1 (PB2.1).                                    */
  SARADC_1_SQ3210_TS2MUX_ADCN2         = 2,     /*!< ADCN2 : Select channel ADCn.2 (PB2.0).                                    */
  SARADC_1_SQ3210_TS2MUX_ADCN3         = 3,     /*!< ADCN3 : Select channel ADCn.3 (PB1.15).                                   */
  SARADC_1_SQ3210_TS2MUX_ADCN4         = 4,     /*!< ADCN4 : Select channel ADCn.4 (PB1.14).                                   */
  SARADC_1_SQ3210_TS2MUX_ADCN5         = 5,     /*!< ADCN5 : Select channel ADCn.5 (PB1.13).                                   */
  SARADC_1_SQ3210_TS2MUX_ADCN6         = 6,     /*!< ADCN6 : Select channel ADCn.6 (PB1.12).                                   */
  SARADC_1_SQ3210_TS2MUX_ADCN7         = 7,     /*!< ADCN7 : Select channel ADCn.7 (PB1.11).                                   */
  SARADC_1_SQ3210_TS2MUX_ADCN8         = 8,     /*!< ADCN8 : Select channel ADCn.8 (PB1.10).                                   */
  SARADC_1_SQ3210_TS2MUX_ADCN9         = 9,     /*!< ADCN9 : Select channel ADCn.9 (PB1.9).                                    */
  SARADC_1_SQ3210_TS2MUX_ADCN10        = 10,    /*!< ADCN10 : Select channel ADCn.10 (PB1.8).                                  */
  SARADC_1_SQ3210_TS2MUX_ADCN11        = 11,    /*!< ADCN11 : Select channel ADCn.11 (PB1.7).                                  */
  SARADC_1_SQ3210_TS2MUX_ADCN12        = 12,    /*!< ADCN12 : Select channel ADCn.12 (PB1.3).                                  */
  SARADC_1_SQ3210_TS2MUX_ADCN13        = 13,    /*!< ADCN13 : Select channel ADCn.13 (PB1.4).                                  */
  SARADC_1_SQ3210_TS2MUX_ADCN14        = 14,    /*!< ADCN14 : Select channel ADCn.14 (PB1.5).                                  */
  SARADC_1_SQ3210_TS2MUX_ADCN15        = 15,    /*!< ADCN15 : Select channel ADCn.15 (PB1.6).                                  */
  SARADC_1_SQ3210_TS2MUX_ADCN16        = 16,    /*!< ADCN16 : Select channel ADCn.16 (IVC0.1 Output (IVC0C1)).                 */
  SARADC_1_SQ3210_TS2MUX_ADCN17        = 17,    /*!< ADCN17 : Select channel ADCn.17 (Voltage at VIOHD / 4).                   */
  SARADC_1_SQ3210_TS2MUX_ADCN18        = 18,    /*!< ADCN18 : Select channel ADCn.18 (Voltage at VREGIN / 4).                  */
  SARADC_1_SQ3210_TS2MUX_ADCN19        = 19,    /*!< ADCN19 : Select channel ADCn.19 (EXTVREG0 Current Sense).                 */
  SARADC_1_SQ3210_TS2MUX_ADCN20        = 20,    /*!< ADCN20 : Select channel ADCn.20 (VIO).                                    */
  SARADC_1_SQ3210_TS2MUX_ADCN21        = 21,    /*!< ADCN21 : Select channel ADCn.21 (Temperature Sensor Output).              */
  SARADC_1_SQ3210_TS2MUX_ADCN22        = 22,    /*!< ADCN22 : Select channel ADCn.22 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_ADCN23        = 23,    /*!< ADCN23 : Select channel ADCn.23 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_ADCN24        = 24,    /*!< ADCN24 : Select channel ADCn.24 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_ADCN25        = 25,    /*!< ADCN25 : Select channel ADCn.25 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_ADCN26        = 26,    /*!< ADCN26 : Select channel ADCn.26 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_ADCN27        = 27,    /*!< ADCN27 : Select channel ADCn.27 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_ADCN28        = 28,    /*!< ADCN28 : Select channel ADCn.28 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_ADCN29        = 29,    /*!< ADCN29 : Select channel ADCn.29 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_ADCN30        = 30,    /*!< ADCN30 : Select channel ADCn.30 (RESERVED).                               */
  SARADC_1_SQ3210_TS2MUX_END           = 31,    /*!< END : None - End the sequence.                                            */
} SARADC_1_SQ3210_TS2MUX_Enum;

/* ============================================  SARADC_1 SQ3210 TS3CHR [24..25]  ============================================ */
typedef enum {                                  /*!< SARADC_1_SQ3210_TS3CHR                                                    */
  SARADC_1_SQ3210_TS3CHR_CC0           = 0,     /*!< CC0 : Select conversion characteristic 0 for time slot 3.                 */
  SARADC_1_SQ3210_TS3CHR_CC1           = 1,     /*!< CC1 : Select conversion characteristic 1 for time slot 3.                 */
  SARADC_1_SQ3210_TS3CHR_CC2           = 2,     /*!< CC2 : Select conversion characteristic 2 for time slot 3.                 */
  SARADC_1_SQ3210_TS3CHR_CC3           = 3,     /*!< CC3 : Select conversion characteristic 3 for time slot 3.                 */
} SARADC_1_SQ3210_TS3CHR_Enum;

/* ============================================  SARADC_1 SQ3210 TS3MUX [26..30]  ============================================ */
typedef enum {                                  /*!< SARADC_1_SQ3210_TS3MUX                                                    */
  SARADC_1_SQ3210_TS3MUX_ADCN0         = 0,     /*!< ADCN0 : Select channel ADCn.0 (PB2.2).                                    */
  SARADC_1_SQ3210_TS3MUX_ADCN1         = 1,     /*!< ADCN1 : Select channel ADCn.1 (PB2.1).                                    */
  SARADC_1_SQ3210_TS3MUX_ADCN2         = 2,     /*!< ADCN2 : Select channel ADCn.2 (PB2.0).                                    */
  SARADC_1_SQ3210_TS3MUX_ADCN3         = 3,     /*!< ADCN3 : Select channel ADCn.3 (PB1.15).                                   */
  SARADC_1_SQ3210_TS3MUX_ADCN4         = 4,     /*!< ADCN4 : Select channel ADCn.4 (PB1.14).                                   */
  SARADC_1_SQ3210_TS3MUX_ADCN5         = 5,     /*!< ADCN5 : Select channel ADCn.5 (PB1.13).                                   */
  SARADC_1_SQ3210_TS3MUX_ADCN6         = 6,     /*!< ADCN6 : Select channel ADCn.6 (PB1.12).                                   */
  SARADC_1_SQ3210_TS3MUX_ADCN7         = 7,     /*!< ADCN7 : Select channel ADCn.7 (PB1.11).                                   */
  SARADC_1_SQ3210_TS3MUX_ADCN8         = 8,     /*!< ADCN8 : Select channel ADCn.8 (PB1.10).                                   */
  SARADC_1_SQ3210_TS3MUX_ADCN9         = 9,     /*!< ADCN9 : Select channel ADCn.9 (PB1.9).                                    */
  SARADC_1_SQ3210_TS3MUX_ADCN10        = 10,    /*!< ADCN10 : Select channel ADCn.10 (PB1.8).                                  */
  SARADC_1_SQ3210_TS3MUX_ADCN11        = 11,    /*!< ADCN11 : Select channel ADCn.11 (PB1.7).                                  */
  SARADC_1_SQ3210_TS3MUX_ADCN12        = 12,    /*!< ADCN12 : Select channel ADCn.12 (PB1.3).                                  */
  SARADC_1_SQ3210_TS3MUX_ADCN13        = 13,    /*!< ADCN13 : Select channel ADCn.13 (PB1.4).                                  */
  SARADC_1_SQ3210_TS3MUX_ADCN14        = 14,    /*!< ADCN14 : Select channel ADCn.14 (PB1.5).                                  */
  SARADC_1_SQ3210_TS3MUX_ADCN15        = 15,    /*!< ADCN15 : Select channel ADCn.15 (PB1.6).                                  */
  SARADC_1_SQ3210_TS3MUX_ADCN16        = 16,    /*!< ADCN16 : Select channel ADCn.16 (IVC0.1 Output (IVC0C1)).                 */
  SARADC_1_SQ3210_TS3MUX_ADCN17        = 17,    /*!< ADCN17 : Select channel ADCn.17 (Voltage at VIOHD / 4).                   */
  SARADC_1_SQ3210_TS3MUX_ADCN18        = 18,    /*!< ADCN18 : Select channel ADCn.18 (Voltage at VREGIN / 4).                  */
  SARADC_1_SQ3210_TS3MUX_ADCN19        = 19,    /*!< ADCN19 : Select channel ADCn.19 (EXTVREG0 Current Sense).                 */
  SARADC_1_SQ3210_TS3MUX_ADCN20        = 20,    /*!< ADCN20 : Select channel ADCn.20 (VIO).                                    */
  SARADC_1_SQ3210_TS3MUX_ADCN21        = 21,    /*!< ADCN21 : Select channel ADCn.21 (Temperature Sensor Output).              */
  SARADC_1_SQ3210_TS3MUX_ADCN22        = 22,    /*!< ADCN22 : Select channel ADCn.22 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_ADCN23        = 23,    /*!< ADCN23 : Select channel ADCn.23 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_ADCN24        = 24,    /*!< ADCN24 : Select channel ADCn.24 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_ADCN25        = 25,    /*!< ADCN25 : Select channel ADCn.25 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_ADCN26        = 26,    /*!< ADCN26 : Select channel ADCn.26 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_ADCN27        = 27,    /*!< ADCN27 : Select channel ADCn.27 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_ADCN28        = 28,    /*!< ADCN28 : Select channel ADCn.28 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_ADCN29        = 29,    /*!< ADCN29 : Select channel ADCn.29 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_ADCN30        = 30,    /*!< ADCN30 : Select channel ADCn.30 (RESERVED).                               */
  SARADC_1_SQ3210_TS3MUX_END           = 31,    /*!< END : None - End the sequence.                                            */
} SARADC_1_SQ3210_TS3MUX_Enum;

/* ========================================================  CHAR32  ========================================================= */
/* =============================================  SARADC_1 CHAR32 CHR2GN [0..0]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CHAR32_CHR2GN                                                    */
  SARADC_1_CHAR32_CHR2GN_UNITY         = 0,     /*!< UNITY : The on-chip PGA gain is 1.                                        */
  SARADC_1_CHAR32_CHR2GN_HALF          = 1,     /*!< HALF : The on-chip PGA gain is 0.5.                                       */
} SARADC_1_CHAR32_CHR2GN_Enum;

