chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  SARADC_1 CHAR32 CHR2RPT [1..3]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CHAR32_CHR2RPT                                                   */
  SARADC_1_CHAR32_CHR2RPT_ACC1         = 0,     /*!< ACC1 : Accumulate one sample.                                             */
  SARADC_1_CHAR32_CHR2RPT_ACC4         = 1,     /*!< ACC4 : Accumulate four samples.                                           */
  SARADC_1_CHAR32_CHR2RPT_ACC8         = 2,     /*!< ACC8 : Accumulate eight samples.                                          */
  SARADC_1_CHAR32_CHR2RPT_ACC16        = 3,     /*!< ACC16 : Accumulate sixteen samples.                                       */
  SARADC_1_CHAR32_CHR2RPT_ACC32        = 4,     /*!< ACC32 : Accumulate thirty-two samples (10-bit mode only).                 */
  SARADC_1_CHAR32_CHR2RPT_ACC64        = 5,     /*!< ACC64 : Accumulate sixty-four samples (10-bit mode only).                 */
} SARADC_1_CHAR32_CHR2RPT_Enum;

/* ============================================  SARADC_1 CHAR32 CHR2RSEL [7..7]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CHAR32_CHR2RSEL                                                  */
  SARADC_1_CHAR32_CHR2RSEL_B10         = 0,     /*!< B10 : Select 10-bit Mode.                                                 */
  SARADC_1_CHAR32_CHR2RSEL_B12         = 1,     /*!< B12 : Select 12-bit Mode (burst mode must be enabled).                    */
} SARADC_1_CHAR32_CHR2RSEL_Enum;

/* ===========================================  SARADC_1 CHAR32 CHR2WCIEN [8..8]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CHAR32_CHR2WCIEN                                                 */
  SARADC_1_CHAR32_CHR2WCIEN_DISABLED   = 0,     /*!< DISABLED : Disable window comparison interrupts.                          */
  SARADC_1_CHAR32_CHR2WCIEN_ENABLED    = 1,     /*!< ENABLED : Enabled window comparison interrupts. The window comparator
                                                     will be used to check the ADC result on channels that use
                                                     this characteristic.                                                      */
} SARADC_1_CHAR32_CHR2WCIEN_Enum;

/* ============================================  SARADC_1 CHAR32 CHR3GN [16..16]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CHAR32_CHR3GN                                                    */
  SARADC_1_CHAR32_CHR3GN_UNITY         = 0,     /*!< UNITY : The on-chip PGA gain is 1.                                        */
  SARADC_1_CHAR32_CHR3GN_HALF          = 1,     /*!< HALF : The on-chip PGA gain is 0.5.                                       */
} SARADC_1_CHAR32_CHR3GN_Enum;

/* ===========================================  SARADC_1 CHAR32 CHR3RPT [17..19]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CHAR32_CHR3RPT                                                   */
  SARADC_1_CHAR32_CHR3RPT_ACC1         = 0,     /*!< ACC1 : Accumulate one sample.                                             */
  SARADC_1_CHAR32_CHR3RPT_ACC4         = 1,     /*!< ACC4 : Accumulate four samples.                                           */
  SARADC_1_CHAR32_CHR3RPT_ACC8         = 2,     /*!< ACC8 : Accumulate eight samples.                                          */
  SARADC_1_CHAR32_CHR3RPT_ACC16        = 3,     /*!< ACC16 : Accumulate sixteen samples.                                       */
  SARADC_1_CHAR32_CHR3RPT_ACC32        = 4,     /*!< ACC32 : Accumulate thirty-two samples (10-bit mode only).                 */
  SARADC_1_CHAR32_CHR3RPT_ACC64        = 5,     /*!< ACC64 : Accumulate sixty-four samples (10-bit mode only).                 */
} SARADC_1_CHAR32_CHR3RPT_Enum;

/* ===========================================  SARADC_1 CHAR32 CHR3RSEL [23..23]  =========================================== */
typedef enum {                                  /*!< SARADC_1_CHAR32_CHR3RSEL                                                  */
  SARADC_1_CHAR32_CHR3RSEL_B10         = 0,     /*!< B10 : Select 10-bit Mode.                                                 */
  SARADC_1_CHAR32_CHR3RSEL_B12         = 1,     /*!< B12 : Select 12-bit Mode (burst mode must be enabled).                    */
} SARADC_1_CHAR32_CHR3RSEL_Enum;

/* ==========================================  SARADC_1 CHAR32 CHR3WCIEN [24..24]  =========================================== */
typedef enum {                                  /*!< SARADC_1_CHAR32_CHR3WCIEN                                                 */
  SARADC_1_CHAR32_CHR3WCIEN_DISABLED   = 0,     /*!< DISABLED : Disable window comparison interrupts.                          */
  SARADC_1_CHAR32_CHR3WCIEN_ENABLED    = 1,     /*!< ENABLED : Enabled window comparison interrupts. The window comparator
                                                     will be used to check the ADC result on channels that use
                                                     this characteristic.                                                      */
} SARADC_1_CHAR32_CHR3WCIEN_Enum;

/* ========================================================  CHAR10  ========================================================= */
/* =============================================  SARADC_1 CHAR10 CHR0GN [0..0]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CHAR10_CHR0GN                                                    */
  SARADC_1_CHAR10_CHR0GN_UNITY         = 0,     /*!< UNITY : The on-chip PGA gain is 1.                                        */
  SARADC_1_CHAR10_CHR0GN_HALF          = 1,     /*!< HALF : The on-chip PGA gain is 0.5.                                       */
} SARADC_1_CHAR10_CHR0GN_Enum;

/* ============================================  SARADC_1 CHAR10 CHR0RPT [1..3]  ============================================= */
typedef enum {                                  /*!< SARADC_1_CHAR10_CHR0RPT                                                   */
  SARADC_1_CHAR10_CHR0RPT_ACC1         = 0,     /*!< ACC1 : Accumulate one sample.                                             */
  SARADC_1_CHAR10_CHR0RPT_ACC4         = 1,     /*!< ACC4 : Accumulate four samples.                                           */
  SARADC_1_CHAR10_CHR0RPT_ACC8         = 2,     /*!< ACC8 : Accumulate eight samples.                                          */
  SARADC_1_CHAR10_CHR0RPT_ACC16        = 3,     /*!< ACC16 : Accumulate sixteen samples.                                       */
  SARADC_1_CHAR10_CHR0RPT_ACC32        = 4,     /*!< ACC32 : Accumulate thirty-two samples (10-bit mode only).                 */
  SARADC_1_CHAR10_CHR0RPT_ACC64        = 5,     /*!< ACC64 : Accumulate sixty-four samples (10-bit mode only).                 */
} SARADC_1_CHAR10_CHR0RPT_Enum;

/* ============================================  SARADC_1 CHAR10 CHR0RSEL [7..7]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CHAR10_CHR0RSEL                                                  */
  SARADC_1_CHAR10_CHR0RSEL_B10         = 0,     /*!< B10 : Select 10-bit Mode.                                                 */
  SARADC_1_CHAR10_CHR0RSEL_B12         = 1,     /*!< B12 : Select 12-bit Mode (burst mode must be enabled).                    */
} SARADC_1_CHAR10_CHR0RSEL_Enum;

/* ===========================================  SARADC_1 CHAR10 CHR0WCIEN [8..8]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CHAR10_CHR0WCIEN                                                 */
  SARADC_1_CHAR10_CHR0WCIEN_DISABLED   = 0,     /*!< DISABLED : Disable window comparison interrupts.                          */
  SARADC_1_CHAR10_CHR0WCIEN_ENABLED    = 1,     /*!< ENABLED : Enabled window comparison interrupts. The window comparator
                                                     will be used to check the ADC result on channels that use
                                                     this characteristic.                                                      */
} SARADC_1_CHAR10_CHR0WCIEN_Enum;

/* ============================================  SARADC_1 CHAR10 CHR1GN [16..16]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CHAR10_CHR1GN                                                    */
  SARADC_1_CHAR10_CHR1GN_UNITY         = 0,     /*!< UNITY : The on-chip PGA gain is 1.                                        */
  SARADC_1_CHAR10_CHR1GN_HALF          = 1,     /*!< HALF : The on-chip PGA gain is 0.5.                                       */
} SARADC_1_CHAR10_CHR1GN_Enum;

/* ===========================================  SARADC_1 CHAR10 CHR1RPT [17..19]  ============================================ */
typedef enum {                                  /*!< SARADC_1_CHAR10_CHR1RPT                                                   */
  SARADC_1_CHAR10_CHR1RPT_ACC1         = 0,     /*!< ACC1 : Accumulate one sample.                                             */
  SARADC_1_CHAR10_CHR1RPT_ACC4         = 1,     /*!< ACC4 : Accumulate four samples.                                           */
  SARADC_1_CHAR10_CHR1RPT_ACC8         = 2,     /*!< ACC8 : Accumulate eight samples.                                          */
  SARADC_1_CHAR10_CHR1RPT_ACC16        = 3,     /*!< ACC16 : Accumulate sixteen samples.                                       */
  SARADC_1_CHAR10_CHR1RPT_ACC32        = 4,     /*!< ACC32 : Accumulate thirty-two samples (10-bit mode only).                 */
  SARADC_1_CHAR10_CHR1RPT_ACC64        = 5,     /*!< ACC64 : Accumulate sixty-four samples (10-bit mode only).                 */
} SARADC_1_CHAR10_CHR1RPT_Enum;

