chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  SARADC_1 CHAR10 CHR1RSEL [23..23]  =========================================== */
typedef enum {                                  /*!< SARADC_1_CHAR10_CHR1RSEL                                                  */
  SARADC_1_CHAR10_CHR1RSEL_B10         = 0,     /*!< B10 : Select 10-bit Mode.                                                 */
  SARADC_1_CHAR10_CHR1RSEL_B12         = 1,     /*!< B12 : Select 12-bit Mode (burst mode must be enabled).                    */
} SARADC_1_CHAR10_CHR1RSEL_Enum;

/* ==========================================  SARADC_1 CHAR10 CHR1WCIEN [24..24]  =========================================== */
typedef enum {                                  /*!< SARADC_1_CHAR10_CHR1WCIEN                                                 */
  SARADC_1_CHAR10_CHR1WCIEN_DISABLED   = 0,     /*!< DISABLED : Disable window comparison interrupts.                          */
  SARADC_1_CHAR10_CHR1WCIEN_ENABLED    = 1,     /*!< ENABLED : Enabled window comparison interrupts. The window comparator
                                                     will be used to check the ADC result on channels that use
                                                     this characteristic.                                                      */
} SARADC_1_CHAR10_CHR1WCIEN_Enum;

/* =========================================================  DATA  ========================================================== */
/* =======================================================  WCLIMITS  ======================================================== */
/* ==========================================================  ACC  ========================================================== */
/* ========================================================  STATUS  ========================================================= */
/* ==============================================  SARADC_1 STATUS WCI [0..0]  =============================================== */
typedef enum {                                  /*!< SARADC_1_STATUS_WCI                                                       */
  SARADC_1_STATUS_WCI_NOT_SET          = 0,     /*!< NOT_SET : Read: A window compare interrupt has not occurred.
                                                     Write: Clear the interrupt.                                               */
  SARADC_1_STATUS_WCI_SET              = 1,     /*!< SET : Read: A window compare interrupt occurred. Write: Force
                                                     a window compare interrupt.                                               */
} SARADC_1_STATUS_WCI_Enum;

/* ==============================================  SARADC_1 STATUS SCCI [1..1]  ============================================== */
typedef enum {                                  /*!< SARADC_1_STATUS_SCCI                                                      */
  SARADC_1_STATUS_SCCI_NOT_SET         = 0,     /*!< NOT_SET : Read: A single data conversion interrupt has not occurred.
                                                     Write: Clear the interrupt.                                               */
  SARADC_1_STATUS_SCCI_SET             = 1,     /*!< SET : Read: A single data conversion interrupt occurred. Write:
                                                     Force a single data conversion interrupt.                                 */
} SARADC_1_STATUS_SCCI_Enum;

/* ==============================================  SARADC_1 STATUS SDI [2..2]  =============================================== */
typedef enum {                                  /*!< SARADC_1_STATUS_SDI                                                       */
  SARADC_1_STATUS_SDI_NOT_SET          = 0,     /*!< NOT_SET : Read: A scan done interrupt has not occurred. Write:
                                                     Clear the interrupt.                                                      */
  SARADC_1_STATUS_SDI_SET              = 1,     /*!< SET : Read: A scan done interrupt occurred. Write: Force a scan
                                                     done interrupt.                                                           */
} SARADC_1_STATUS_SDI_Enum;

/* ==============================================  SARADC_1 STATUS FORI [3..3]  ============================================== */
typedef enum {                                  /*!< SARADC_1_STATUS_FORI                                                      */
  SARADC_1_STATUS_FORI_NOT_SET         = 0,     /*!< NOT_SET : Read: A data FIFO overrun interrupt has not occurred.
                                                     Write: Clear the interrupt.                                               */
  SARADC_1_STATUS_FORI_SET             = 1,     /*!< SET : Read: A data FIFO overrun interrupt occurred. Write: Force
                                                     a data FIFO overrun interrupt.                                            */
} SARADC_1_STATUS_FORI_Enum;

/* ==============================================  SARADC_1 STATUS FURI [4..4]  ============================================== */
typedef enum {                                  /*!< SARADC_1_STATUS_FURI                                                      */
  SARADC_1_STATUS_FURI_NOT_SET         = 0,     /*!< NOT_SET : Read: A data FIFO underrun interrupt has not occurred.
                                                     Write: Clear the interrupt.                                               */
  SARADC_1_STATUS_FURI_SET             = 1,     /*!< SET : Read: A data FIFO underrun interrupt occurred. Write:
                                                     Force a data FIFO underrun interrupt.                                     */
} SARADC_1_STATUS_FURI_Enum;

/* ======================================================  FIFOSTATUS  ======================================================= */
/* ===========================================  SARADC_1 FIFOSTATUS DPSTS [4..4]  ============================================ */
typedef enum {                                  /*!< SARADC_1_FIFOSTATUS_DPSTS                                                 */
  SARADC_1_FIFOSTATUS_DPSTS_LOWER      = 0,     /*!< LOWER : The next ADC conversion will be written to the lower
                                                     half-word.                                                                */
  SARADC_1_FIFOSTATUS_DPSTS_UPPER      = 1,     /*!< UPPER : The next ADC conversion will be written to the upper
                                                     half-word.                                                                */
} SARADC_1_FIFOSTATUS_DPSTS_Enum;

/* ===========================================  SARADC_1 FIFOSTATUS DRDYF [5..5]  ============================================ */
typedef enum {                                  /*!< SARADC_1_FIFOSTATUS_DRDYF                                                 */
  SARADC_1_FIFOSTATUS_DRDYF_NOT_SET    = 0,     /*!< NOT_SET : New data is not produced yet.                                   */
  SARADC_1_FIFOSTATUS_DRDYF_SET        = 1,     /*!< SET : New data is ready.                                                  */
} SARADC_1_FIFOSTATUS_DRDYF_Enum;



/* =========================================================================================================================== */
/* ================                                           AES_0                                           ================ */
/* =========================================================================================================================== */

