chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  AES_0 CONTROL XFRSTA [0..0]  ============================================== */
typedef enum {                                  /*!< AES_0_CONTROL_XFRSTA                                                      */
  AES_0_CONTROL_XFRSTA_START           = 1,     /*!< START : Start the AES operation.                                          */
} AES_0_CONTROL_XFRSTA_Enum;

/* =============================================  AES_0 CONTROL KEYCPEN [1..1]  ============================================== */
typedef enum {                                  /*!< AES_0_CONTROL_KEYCPEN                                                     */
  AES_0_CONTROL_KEYCPEN_DISABLED       = 0,     /*!< DISABLED : Disable key capture.                                           */
  AES_0_CONTROL_KEYCPEN_ENABLED        = 1,     /*!< ENABLED : Enable key capture.                                             */
} AES_0_CONTROL_KEYCPEN_Enum;

/* ===============================================  AES_0 CONTROL EDMD [2..2]  =============================================== */
typedef enum {                                  /*!< AES_0_CONTROL_EDMD                                                        */
  AES_0_CONTROL_EDMD_DECRYPT           = 0,     /*!< DECRYPT : AES module performs a decryption operation                      */
  AES_0_CONTROL_EDMD_ENCRYPT           = 1,     /*!< ENCRYPT : AES module performs an encryption operation.                    */
} AES_0_CONTROL_EDMD_Enum;

/* ==============================================  AES_0 CONTROL SWMDEN [8..8]  ============================================== */
typedef enum {                                  /*!< AES_0_CONTROL_SWMDEN                                                      */
  AES_0_CONTROL_SWMDEN_DISABLED        = 0,     /*!< DISABLED : Disable software mode.                                         */
  AES_0_CONTROL_SWMDEN_ENABLED         = 1,     /*!< ENABLED : Enable software mode.                                           */
} AES_0_CONTROL_SWMDEN_Enum;

/* ===============================================  AES_0 CONTROL BEN [9..9]  ================================================ */
typedef enum {                                  /*!< AES_0_CONTROL_BEN                                                         */
  AES_0_CONTROL_BEN_DISABLED           = 0,     /*!< DISABLED : Do not bypass AES operations.                                  */
  AES_0_CONTROL_BEN_ENABLED            = 1,     /*!< ENABLED : Bypass AES operations.                                          */
} AES_0_CONTROL_BEN_Enum;

/* =============================================  AES_0 CONTROL XOREN [10..11]  ============================================== */
typedef enum {                                  /*!< AES_0_CONTROL_XOREN                                                       */
  AES_0_CONTROL_XOREN_XOR_DISABLED     = 0,     /*!< XOR_DISABLED : Disable the XOR paths.                                     */
  AES_0_CONTROL_XOREN_XOR_INPUT        = 1,     /*!< XOR_INPUT : Enable the XOR input path, disable the XOR output
                                                     path.                                                                     */
  AES_0_CONTROL_XOREN_XOR_OUTPUT       = 2,     /*!< XOR_OUTPUT : Disable the XOR input path, enable the XOR output
                                                     path.                                                                     */
} AES_0_CONTROL_XOREN_Enum;

/* =============================================  AES_0 CONTROL HCTREN [12..12]  ============================================= */
typedef enum {                                  /*!< AES_0_CONTROL_HCTREN                                                      */
  AES_0_CONTROL_HCTREN_DISABLED        = 0,     /*!< DISABLED : Disable hardware counter mode.                                 */
  AES_0_CONTROL_HCTREN_ENABLED         = 1,     /*!< ENABLED : Enable hardware counter mode.                                   */
} AES_0_CONTROL_HCTREN_Enum;

/* =============================================  AES_0 CONTROL HCBCEN [13..13]  ============================================= */
typedef enum {                                  /*!< AES_0_CONTROL_HCBCEN                                                      */
  AES_0_CONTROL_HCBCEN_DISABLED        = 0,     /*!< DISABLED : Disable hardware cipher-block chaining (CBC) mode.             */
  AES_0_CONTROL_HCBCEN_ENABLED         = 1,     /*!< ENABLED : Enable hardware cipher-block chaining (CBC) mode.               */
} AES_0_CONTROL_HCBCEN_Enum;

/* ============================================  AES_0 CONTROL KEYSIZE [16..17]  ============================================= */
typedef enum {                                  /*!< AES_0_CONTROL_KEYSIZE                                                     */
  AES_0_CONTROL_KEYSIZE_KEY128         = 0,     /*!< KEY128 : Key is composed of 128 bits.                                     */
  AES_0_CONTROL_KEYSIZE_KEY192         = 1,     /*!< KEY192 : Key is composed of 192 bits.                                     */
  AES_0_CONTROL_KEYSIZE_KEY256         = 2,     /*!< KEY256 : Key is composed of 256 bits.                                     */
} AES_0_CONTROL_KEYSIZE_Enum;

/* =============================================  AES_0 CONTROL ERRIEN [24..24]  ============================================= */
typedef enum {                                  /*!< AES_0_CONTROL_ERRIEN                                                      */
  AES_0_CONTROL_ERRIEN_DISABLED        = 0,     /*!< DISABLED : Disable the error interrupt.                                   */
  AES_0_CONTROL_ERRIEN_ENABLED         = 1,     /*!< ENABLED : Enable the error interrupt.                                     */
} AES_0_CONTROL_ERRIEN_Enum;

/* =============================================  AES_0 CONTROL OCIEN [25..25]  ============================================== */
typedef enum {                                  /*!< AES_0_CONTROL_OCIEN                                                       */
  AES_0_CONTROL_OCIEN_DISABLED         = 0,     /*!< DISABLED : Disable the operation complete interrupt.                      */
  AES_0_CONTROL_OCIEN_ENABLED          = 1,     /*!< ENABLED : Enable the operation complete interrupt.                        */
} AES_0_CONTROL_OCIEN_Enum;

/* =============================================  AES_0 CONTROL DBGMD [30..30]  ============================================== */
typedef enum {                                  /*!< AES_0_CONTROL_DBGMD                                                       */
  AES_0_CONTROL_DBGMD_HALT             = 0,     /*!< HALT : A debug breakpoint will cause the AES module to halt.              */
  AES_0_CONTROL_DBGMD_RUN              = 1,     /*!< RUN : The AES module will continue to operate while the core
                                                     is halted in debug mode.                                                  */
} AES_0_CONTROL_DBGMD_Enum;

