chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  AES_0 CONTROL RESET [31..31]  ============================================== */
typedef enum {                                  /*!< AES_0_CONTROL_RESET                                                       */
  AES_0_CONTROL_RESET_INACTIVE         = 0,     /*!< INACTIVE : AES module is not in soft reset.                               */
  AES_0_CONTROL_RESET_ACTIVE           = 1,     /*!< ACTIVE : AES module is in soft reset and none of the module
                                                     bits can be accessed.                                                     */
} AES_0_CONTROL_RESET_Enum;

/* ========================================================  XFRSIZE  ======================================================== */
/* =======================================================  DATAFIFO  ======================================================== */
/* ========================================================  XORFIFO  ======================================================== */
/* ========================================================  HWKEY0  ========================================================= */
/* ========================================================  HWKEY1  ========================================================= */
/* ========================================================  HWKEY2  ========================================================= */
/* ========================================================  HWKEY3  ========================================================= */
/* ========================================================  HWKEY4  ========================================================= */
/* ========================================================  HWKEY5  ========================================================= */
/* ========================================================  HWKEY6  ========================================================= */
/* ========================================================  HWKEY7  ========================================================= */
/* ========================================================  HWCTR0  ========================================================= */
/* ========================================================  HWCTR1  ========================================================= */
/* ========================================================  HWCTR2  ========================================================= */
/* ========================================================  HWCTR3  ========================================================= */
/* ========================================================  STATUS  ========================================================= */
/* ===============================================  AES_0 STATUS DURF [0..0]  ================================================ */
typedef enum {                                  /*!< AES_0_STATUS_DURF                                                         */
  AES_0_STATUS_DURF_NOT_SET            = 0,     /*!< NOT_SET : No input/output data FIFO underrun.                             */
  AES_0_STATUS_DURF_SET                = 1,     /*!< SET : An input/output data FIFO underrun has occurred.                    */
} AES_0_STATUS_DURF_Enum;

/* ===============================================  AES_0 STATUS DORF [1..1]  ================================================ */
typedef enum {                                  /*!< AES_0_STATUS_DORF                                                         */
  AES_0_STATUS_DORF_NOT_SET            = 0,     /*!< NOT_SET : No input/output data FIFO overrun.                              */
  AES_0_STATUS_DORF_SET                = 1,     /*!< SET : An input/output data FIFO overrun has occurred.                     */
} AES_0_STATUS_DORF_Enum;

/* ===============================================  AES_0 STATUS XORF [2..2]  ================================================ */
typedef enum {                                  /*!< AES_0_STATUS_XORF                                                         */
  AES_0_STATUS_XORF_NOT_SET            = 0,     /*!< NOT_SET : No XOR data FIFO overrun.                                       */
  AES_0_STATUS_XORF_SET                = 1,     /*!< SET : An XOR data FIFO overrun has occurred.                              */
} AES_0_STATUS_XORF_Enum;

/* =============================================  AES_0 STATUS DFIFOLVL [4..6]  ============================================== */
typedef enum {                                  /*!< AES_0_STATUS_DFIFOLVL                                                     */
  AES_0_STATUS_DFIFOLVL_EMPTY          = 0,     /*!< EMPTY : Input/Output data FIFO is empty.                                  */
  AES_0_STATUS_DFIFOLVL_1WORD          = 1,     /*!< 1WORD : Input/Output data FIFO contains 1 word.                           */
  AES_0_STATUS_DFIFOLVL_2WORDS         = 2,     /*!< 2WORDS : Input/Output data FIFO contains 2 words.                         */
  AES_0_STATUS_DFIFOLVL_3WORDS         = 3,     /*!< 3WORDS : Input/Output data FIFO contains 3 words.                         */
  AES_0_STATUS_DFIFOLVL_FULL           = 4,     /*!< FULL : Input/Output data FIFO contains 4 words (full).                    */
} AES_0_STATUS_DFIFOLVL_Enum;

/* =============================================  AES_0 STATUS XFIFOLVL [8..10]  ============================================= */
typedef enum {                                  /*!< AES_0_STATUS_XFIFOLVL                                                     */
  AES_0_STATUS_XFIFOLVL_EMPTY          = 0,     /*!< EMPTY : XOR data FIFO is empty.                                           */
  AES_0_STATUS_XFIFOLVL_1WORD          = 1,     /*!< 1WORD : XOR data FIFO contains 1 word.                                    */
  AES_0_STATUS_XFIFOLVL_2WORDS         = 2,     /*!< 2WORDS : XOR data FIFO contains 2 words.                                  */
  AES_0_STATUS_XFIFOLVL_3WORDS         = 3,     /*!< 3WORDS : XOR data FIFO contains 3 words.                                  */
  AES_0_STATUS_XFIFOLVL_FULL           = 4,     /*!< FULL : XOR data FIFO contains 4 words (full).                             */
} AES_0_STATUS_XFIFOLVL_Enum;

/* ==============================================  AES_0 STATUS BUSYF [16..16]  ============================================== */
typedef enum {                                  /*!< AES_0_STATUS_BUSYF                                                        */
  AES_0_STATUS_BUSYF_NOT_SET           = 0,     /*!< NOT_SET : AES module is not busy.                                         */
  AES_0_STATUS_BUSYF_SET               = 1,     /*!< SET : AES module is completing an operation.                              */
} AES_0_STATUS_BUSYF_Enum;

