chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  AES_0 STATUS ERRI [30..30]  =============================================== */
typedef enum {                                  /*!< AES_0_STATUS_ERRI                                                         */
  AES_0_STATUS_ERRI_NOT_SET            = 0,     /*!< NOT_SET : AES error interrupt has not occurred.                           */
  AES_0_STATUS_ERRI_SET                = 1,     /*!< SET : AES error interrupt has occurred.                                   */
} AES_0_STATUS_ERRI_Enum;

/* ===============================================  AES_0 STATUS OCI [31..31]  =============================================== */
typedef enum {                                  /*!< AES_0_STATUS_OCI                                                          */
  AES_0_STATUS_OCI_NOT_SET             = 0,     /*!< NOT_SET : AES operation complete interrupt has not occurred.              */
  AES_0_STATUS_OCI_SET                 = 1,     /*!< SET : AES operation complete interrupt occurred.                          */
} AES_0_STATUS_OCI_Enum;



/* =========================================================================================================================== */
/* ================                                           CRC_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* =============================================  CRC_0 CONTROL SINITEN [0..0]  ============================================== */
typedef enum {                                  /*!< CRC_0_CONTROL_SINITEN                                                     */
  CRC_0_CONTROL_SINITEN_DISABLED       = 0,     /*!< DISABLED : Do not initialize the CRC module to the value set
                                                     by the SEED bit.                                                          */
  CRC_0_CONTROL_SINITEN_ENABLED        = 1,     /*!< ENABLED : Initialize the CRC module to the value set by the
                                                     SEED bit.                                                                 */
} CRC_0_CONTROL_SINITEN_Enum;

/* ===============================================  CRC_0 CONTROL SEED [1..1]  =============================================== */
typedef enum {                                  /*!< CRC_0_CONTROL_SEED                                                        */
  CRC_0_CONTROL_SEED_ALL_ZEROES        = 0,     /*!< ALL_ZEROES : CRC seed value is all 0's (0x00000000)                       */
  CRC_0_CONTROL_SEED_ALL_ONES          = 1,     /*!< ALL_ONES : CRC seed value is all 1's (0xFFFFFFFF).                        */
} CRC_0_CONTROL_SEED_Enum;

/* ==============================================  CRC_0 CONTROL CRCEN [2..2]  =============================================== */
typedef enum {                                  /*!< CRC_0_CONTROL_CRCEN                                                       */
  CRC_0_CONTROL_CRCEN_DISABLED         = 0,     /*!< DISABLED : Disable CRC operations.                                        */
  CRC_0_CONTROL_CRCEN_ENABLED          = 1,     /*!< ENABLED : Enable CRC operations.                                          */
} CRC_0_CONTROL_CRCEN_Enum;

/* =============================================  CRC_0 CONTROL POLYSEL [4..5]  ============================================== */
typedef enum {                                  /*!< CRC_0_CONTROL_POLYSEL                                                     */
  CRC_0_CONTROL_POLYSEL_CRC_32_04C11DB7 = 0,    /*!< CRC_32_04C11DB7 : Select 32-bit polynomial: 0x04C11DB7.                   */
  CRC_0_CONTROL_POLYSEL_CRC_16_1021    = 1,     /*!< CRC_16_1021 : Select 16-bit polynomial: 0x1021.                           */
  CRC_0_CONTROL_POLYSEL_CRC_16_3D65    = 2,     /*!< CRC_16_3D65 : Select 16-bit polynomial: 0x3D65.                           */
  CRC_0_CONTROL_POLYSEL_CRC_16_8005    = 3,     /*!< CRC_16_8005 : Select 16-bit polynomial: 0x8005.                           */
} CRC_0_CONTROL_POLYSEL_Enum;

/* ==============================================  CRC_0 CONTROL BMDEN [8..8]  =============================================== */
typedef enum {                                  /*!< CRC_0_CONTROL_BMDEN                                                       */
  CRC_0_CONTROL_BMDEN_DISABLED         = 0,     /*!< DISABLED : Disable byte mode (word/byte width is determined
                                                     automatically by the hardware).                                           */
  CRC_0_CONTROL_BMDEN_ENABLED          = 1,     /*!< ENABLED : Enable byte mode (all writes are considered as bytes).          */
} CRC_0_CONTROL_BMDEN_Enum;

/* ==============================================  CRC_0 CONTROL BBREN [9..9]  =============================================== */
typedef enum {                                  /*!< CRC_0_CONTROL_BBREN                                                       */
  CRC_0_CONTROL_BBREN_DISABLED         = 0,     /*!< DISABLED : No byte-level bit reversal (input is same order as
                                                     written).                                                                 */
  CRC_0_CONTROL_BBREN_ENABLED          = 1,     /*!< ENABLED : Byte-level bit reversal enabled (the bits in each
                                                     byte are reversed).                                                       */
} CRC_0_CONTROL_BBREN_Enum;

/* =============================================  CRC_0 CONTROL ORDER [10..11]  ============================================== */
typedef enum {                                  /*!< CRC_0_CONTROL_ORDER                                                       */
  CRC_0_CONTROL_ORDER_NO_REORDER       = 0,     /*!< NO_REORDER : No byte reorientation (output is same order as
                                                     input).                                                                   */
  CRC_0_CONTROL_ORDER_BIG_ENDIAN_16    = 1,     /*!< BIG_ENDIAN_16 : Swap for 16-bit big endian order (input: B3
                                                     B2 B1 B0, output: B2 B3 B0 B1).                                           */
  CRC_0_CONTROL_ORDER_BIG_ENDIAN_32    = 2,     /*!< BIG_ENDIAN_32 : Swap for 32-bit big endian order (input: B3
                                                     B2 B1 B0, output: B0 B1 B2 B3).                                           */
} CRC_0_CONTROL_ORDER_Enum;

/* =========================================================  DATA  ========================================================== */
/* =========================================================  RDATA  ========================================================= */


/* =========================================================================================================================== */
/* ================                                        CAPSENSE_0                                         ================ */
/* =========================================================================================================================== */

