chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* ============================================  CAPSENSE_0 CONTROL BUSYF [0..0]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_BUSYF                                                  */
  CAPSENSE_0_CONTROL_BUSYF_IDLE        = 0,     /*!< IDLE : Read: A capacitive sensing conversion is complete or
                                                     a conversion is not currently in progress. Write: No effect.              */
  CAPSENSE_0_CONTROL_BUSYF_BUSY        = 1,     /*!< BUSY : Read: A capacitive sensing conversion is in progress.
                                                     Write: Initiate a capacitive sensing conversion if BUSYF
                                                     is selected as the start of conversion source.                            */
} CAPSENSE_0_CONTROL_BUSYF_Enum;

/* ============================================  CAPSENSE_0 CONTROL CSEN [1..1]  ============================================= */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CSEN                                                   */
  CAPSENSE_0_CONTROL_CSEN_DISABLED     = 0,     /*!< DISABLED : Disable the capacitive sensing module.                         */
  CAPSENSE_0_CONTROL_CSEN_ENABLED      = 1,     /*!< ENABLED : Enable the capacitive sensing module.                           */
} CAPSENSE_0_CONTROL_CSEN_Enum;

/* ===========================================  CAPSENSE_0 CONTROL BIASEN [2..2]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_BIASEN                                                 */
  CAPSENSE_0_CONTROL_BIASEN_DISABLED   = 0,     /*!< DISABLED : Disable the bias.                                              */
  CAPSENSE_0_CONTROL_BIASEN_ENABLED    = 1,     /*!< ENABLED : Enable the bias.                                                */
} CAPSENSE_0_CONTROL_BIASEN_Enum;

/* ===========================================  CAPSENSE_0 CONTROL CMPPOL [3..3]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CMPPOL                                                 */
  CAPSENSE_0_CONTROL_CMPPOL_GT         = 0,     /*!< GT : The digital comparator generates an interrupt if the conversion
                                                     is greater than the CSTH threshold.                                       */
  CAPSENSE_0_CONTROL_CMPPOL_LTE        = 1,     /*!< LTE : The digital comparator generates an interrupt if the conversion
                                                     is less than or equal to the CSTH threshold.                              */
} CAPSENSE_0_CONTROL_CMPPOL_Enum;

/* =============================================  CAPSENSE_0 CONTROL CMD [4..5]  ============================================= */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CMD                                                    */
  CAPSENSE_0_CONTROL_CMD_SINGLE        = 0,     /*!< SINGLE : Single Conversion Mode: One conversion occurs on a
                                                     single channel.                                                           */
  CAPSENSE_0_CONTROL_CMD_SCAN          = 1,     /*!< SCAN : Single Scan Mode: One conversion on each channel selected
                                                     by SCANEN occurs. An end-of-scan interrupt indicates all
                                                     channels have been measured.                                              */
  CAPSENSE_0_CONTROL_CMD_CONT_SINGLE   = 2,     /*!< CONT_SINGLE : Continuous Single Conversion Mode: Continuously
                                                     converts on a single channel. This operation ends only
                                                     if the module is disabled (CSEN = 0) or if a compare threshold
                                                     event occurs (CMPI = 1).                                                  */
  CAPSENSE_0_CONTROL_CMD_CONT_SCAN     = 3,     /*!< CONT_SCAN : Continuous Scan Mode: Continuously loops through
                                                     and converts on all the channels selected by SCANEN. This
                                                     operation ends only if the module is disabled (CSEN = 0)
                                                     or if a compare threshold event occurs (CMPI = 1).                        */
} CAPSENSE_0_CONTROL_CMD_Enum;

/* ============================================  CAPSENSE_0 CONTROL CNVR [6..7]  ============================================= */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CNVR                                                   */
  CAPSENSE_0_CONTROL_CNVR_12BIT        = 0,     /*!< 12BIT : Conversions last 12 internal CAPSENSE clocks and results
                                                     are 12 bits in length.                                                    */
  CAPSENSE_0_CONTROL_CNVR_13BIT        = 1,     /*!< 13BIT : Conversions last 13 internal CAPSENSE clocks and results
                                                     are 13 bits in length.                                                    */
  CAPSENSE_0_CONTROL_CNVR_14BIT        = 2,     /*!< 14BIT : Conversions last 14 internal CAPSENSE clocks and results
                                                     are 14 bits in length.                                                    */
  CAPSENSE_0_CONTROL_CNVR_16BIT        = 3,     /*!< 16BIT : Conversions last 16 internal CAPSENSE clocks and results
                                                     are 16 bits in length.                                                    */
} CAPSENSE_0_CONTROL_CNVR_Enum;

/* ===========================================  CAPSENSE_0 CONTROL ACCMD [8..10]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_ACCMD                                                  */
  CAPSENSE_0_CONTROL_ACCMD_ACC_1       = 0,     /*!< ACC_1 : Accumulate 1 sample.                                              */
  CAPSENSE_0_CONTROL_ACCMD_ACC_4       = 1,     /*!< ACC_4 : Accumulate 4 samples.                                             */
  CAPSENSE_0_CONTROL_ACCMD_ACC_8       = 2,     /*!< ACC_8 : Accumulate 8 samples.                                             */
  CAPSENSE_0_CONTROL_ACCMD_ACC_16      = 3,     /*!< ACC_16 : Accumulate 16 samples.                                           */
  CAPSENSE_0_CONTROL_ACCMD_ACC_32      = 4,     /*!< ACC_32 : Accumulate 32 samples.                                           */
  CAPSENSE_0_CONTROL_ACCMD_ACC_64      = 5,     /*!< ACC_64 : Accumulate 64 samples.                                           */
} CAPSENSE_0_CONTROL_ACCMD_Enum;

/* ===========================================  CAPSENSE_0 CONTROL MCEN [11..11]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_MCEN                                                   */
  CAPSENSE_0_CONTROL_MCEN_DISABLED     = 0,     /*!< DISABLED : Disable the multiple channel measurement feature.              */
  CAPSENSE_0_CONTROL_MCEN_ENABLED      = 1,     /*!< ENABLED : Enable the multiple channel measurement feature.                */
} CAPSENSE_0_CONTROL_MCEN_Enum;

