chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  CAPSENSE_0 CONTROL CSCM [12..15]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CSCM                                                   */
  CAPSENSE_0_CONTROL_CSCM_CSNT0        = 0,     /*!< CSNT0 : The CSnT0 ('On Demand' by writing 1 to CSBUSY) trigger
                                                     source starts conversions.                                                */
  CAPSENSE_0_CONTROL_CSCM_CSNT1        = 1,     /*!< CSNT1 : The CSnT1 (Timer 0 Low Overflow) trigger source starts
                                                     conversions.                                                              */
  CAPSENSE_0_CONTROL_CSCM_CSNT2        = 2,     /*!< CSNT2 : The CSnT2 (Timer 0 High Overflow) trigger source starts
                                                     conversions.                                                              */
  CAPSENSE_0_CONTROL_CSCM_CSNT3        = 3,     /*!< CSNT3 : The CSnT3 (Timer 1 Low Overflow) trigger source starts
                                                     conversions.                                                              */
  CAPSENSE_0_CONTROL_CSCM_CSNT4        = 4,     /*!< CSNT4 : The CSnT4 (Timer 1 High Overflow) trigger source starts
                                                     conversions.                                                              */
  CAPSENSE_0_CONTROL_CSCM_CSNT5        = 5,     /*!< CSNT5 : The CSnT5 (I2C0 Timer Byte 1 Overflow) trigger source
                                                     starts conversions.                                                       */
  CAPSENSE_0_CONTROL_CSCM_CSNT6        = 6,     /*!< CSNT6 : The CSnT6 (I2C0 Timer Byte 3 Overflow) trigger source
                                                     starts conversions.                                                       */
  CAPSENSE_0_CONTROL_CSCM_CSNT7        = 7,     /*!< CSNT7 : The CSnT7 (I2C1 Timer Byte 1 Overflow) trigger source
                                                     starts conversions.                                                       */
  CAPSENSE_0_CONTROL_CSCM_CSNT8        = 8,     /*!< CSNT8 : The CSnT8 (I2C1 Timer Byte 3 Overflow) trigger source
                                                     starts conversions.                                                       */
  CAPSENSE_0_CONTROL_CSCM_CSNT9        = 9,     /*!< CSNT9 : The CSnT9 (RESERVED) trigger source starts conversions.           */
  CAPSENSE_0_CONTROL_CSCM_CSNT10       = 10,    /*!< CSNT10 : The CSnT10 (RESERVED) trigger source starts conversions.         */
  CAPSENSE_0_CONTROL_CSCM_CSNT11       = 11,    /*!< CSNT11 : The CSnT11 (RESERVED) trigger source starts conversions.         */
  CAPSENSE_0_CONTROL_CSCM_CSNT12       = 12,    /*!< CSNT12 : The CSnT12 (RESERVED) trigger source starts conversions.         */
  CAPSENSE_0_CONTROL_CSCM_CSNT13       = 13,    /*!< CSNT13 : The CSnT13 (RESERVED) trigger source starts conversions.         */
  CAPSENSE_0_CONTROL_CSCM_CSNT14       = 14,    /*!< CSNT14 : The CSnT14 (RESERVED) trigger source starts conversions.         */
  CAPSENSE_0_CONTROL_CSCM_CSNT15       = 15,    /*!< CSNT15 : The CSnT15 (RESERVED) trigger source starts conversions.         */
} CAPSENSE_0_CONTROL_CSCM_Enum;

/* ===========================================  CAPSENSE_0 CONTROL PMMD [16..17]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_PMMD                                                   */
  CAPSENSE_0_CONTROL_PMMD_ALWAYS_RETRY = 0,     /*!< ALWAYS_RETRY : Always retry on a pin state change.                        */
  CAPSENSE_0_CONTROL_PMMD_RETRY_TWICE  = 1,     /*!< RETRY_TWICE : Retry up to twice on consecutive bit cycles.                */
  CAPSENSE_0_CONTROL_PMMD_RETRY_FOUR_TIMES = 2, /*!< RETRY_FOUR_TIMES : Retry up to four times on consecutive bit
                                                     cycles.                                                                   */
  CAPSENSE_0_CONTROL_PMMD_DO_NOT_RETRY = 3,     /*!< DO_NOT_RETRY : Ignore monitored signal state change.                      */
} CAPSENSE_0_CONTROL_PMMD_Enum;

/* ===========================================  CAPSENSE_0 CONTROL PMEF [18..18]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_PMEF                                                   */
  CAPSENSE_0_CONTROL_PMEF_NOT_SET      = 0,     /*!< NOT_SET : A retry did not occur due to a pin monitor event during
                                                     the last conversion.                                                      */
  CAPSENSE_0_CONTROL_PMEF_SET          = 1,     /*!< SET : A retry occurred due to a pin monitor event during the
                                                     last conversion.                                                          */
} CAPSENSE_0_CONTROL_PMEF_Enum;

/* ===========================================  CAPSENSE_0 CONTROL CMPEN [20..20]  =========================================== */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CMPEN                                                  */
  CAPSENSE_0_CONTROL_CMPEN_DISABLED    = 0,     /*!< DISABLED : Disable the threshold comparator.                              */
  CAPSENSE_0_CONTROL_CMPEN_ENABLED     = 1,     /*!< ENABLED : Enable the threshold comparator.                                */
} CAPSENSE_0_CONTROL_CMPEN_Enum;

/* ===========================================  CAPSENSE_0 CONTROL CDIEN [21..21]  =========================================== */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CDIEN                                                  */
  CAPSENSE_0_CONTROL_CDIEN_DISABLED    = 0,     /*!< DISABLED : Disable the single conversion done interrupt.                  */
  CAPSENSE_0_CONTROL_CDIEN_ENABLED     = 1,     /*!< ENABLED : Enable the single conversion done interrupt.                    */
} CAPSENSE_0_CONTROL_CDIEN_Enum;

/* ==========================================  CAPSENSE_0 CONTROL EOSIEN [22..22]  =========================================== */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_EOSIEN                                                 */
  CAPSENSE_0_CONTROL_EOSIEN_DISABLED   = 0,     /*!< DISABLED : Disable the single scan end-of-scan interrupt.                 */
  CAPSENSE_0_CONTROL_EOSIEN_ENABLED    = 1,     /*!< ENABLED : Enable the single scan end-of-scan interrupt.                   */
} CAPSENSE_0_CONTROL_EOSIEN_Enum;

/* ===========================================  CAPSENSE_0 CONTROL CMPI [24..24]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CMPI                                                   */
  CAPSENSE_0_CONTROL_CMPI_NOT_SET      = 0,     /*!< NOT_SET : The capacitive sensing result did not cause a compare
                                                     threshold interrupt.                                                      */
  CAPSENSE_0_CONTROL_CMPI_SET          = 1,     /*!< SET : The capacitive sensing result caused a compare threshold
                                                     interrupt.                                                                */
} CAPSENSE_0_CONTROL_CMPI_Enum;

