chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  CAPSENSE_0 CONTROL CDI [25..25]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_CDI                                                    */
  CAPSENSE_0_CONTROL_CDI_NOT_SET       = 0,     /*!< NOT_SET : Read: The CAPSENSEn module has not completed a data
                                                     conversion since the last time CDI was cleared. Write:
                                                     Clear the interrupt.                                                      */
  CAPSENSE_0_CONTROL_CDI_SET           = 1,     /*!< SET : Read: The CAPSENSEn module completed a data conversion.
                                                     Write: Force a conversion complete interrupt.                             */
} CAPSENSE_0_CONTROL_CDI_Enum;

/* ===========================================  CAPSENSE_0 CONTROL EOSI [26..26]  ============================================ */
typedef enum {                                  /*!< CAPSENSE_0_CONTROL_EOSI                                                   */
  CAPSENSE_0_CONTROL_EOSI_NOT_SET      = 0,     /*!< NOT_SET : The CAPSENSEn module has not completed a scan since
                                                     the last time EOSI was cleared.                                           */
  CAPSENSE_0_CONTROL_EOSI_SET          = 1,     /*!< SET : The CAPSENSEn module completed a scan.                              */
} CAPSENSE_0_CONTROL_EOSI_Enum;

/* =========================================================  MODE  ========================================================== */
/* =========================================================  DATA  ========================================================== */
/* =========================================================  SCAN  ========================================================== */
/* =========================================================  CSTH  ========================================================== */
/* ==========================================================  MUX  ========================================================== */
/* ==============================================  CAPSENSE_0 MUX CSMX [0..3]  =============================================== */
typedef enum {                                  /*!< CAPSENSE_0_MUX_CSMX                                                       */
  CAPSENSE_0_MUX_CSMX_CSN0             = 0,     /*!< CSN0 : Select CSn.0 (PB0.1).                                              */
  CAPSENSE_0_MUX_CSMX_CSN1             = 1,     /*!< CSN1 : Select CSn.1 (PB0.2).                                              */
  CAPSENSE_0_MUX_CSMX_CSN2             = 2,     /*!< CSN2 : Select CSn.2 (PB0.3).                                              */
  CAPSENSE_0_MUX_CSMX_CSN3             = 3,     /*!< CSN3 : Select CSn.3 (PB0.4).                                              */
  CAPSENSE_0_MUX_CSMX_CSN4             = 4,     /*!< CSN4 : Select CSn.4 (PB0.5).                                              */
  CAPSENSE_0_MUX_CSMX_CSN5             = 5,     /*!< CSN5 : Select CSn.5 (PB0.6).                                              */
  CAPSENSE_0_MUX_CSMX_CSN6             = 6,     /*!< CSN6 : Select CSn.6 (PB0.7).                                              */
  CAPSENSE_0_MUX_CSMX_CSN7             = 7,     /*!< CSN7 : Select CSn.7 (PB0.8).                                              */
  CAPSENSE_0_MUX_CSMX_CSN8             = 8,     /*!< CSN8 : Select CSn.8 (PB1.7).                                              */
  CAPSENSE_0_MUX_CSMX_CSN9             = 9,     /*!< CSN9 : Select CSn.9 (PB1.8).                                              */
  CAPSENSE_0_MUX_CSMX_CSN10            = 10,    /*!< CSN10 : Select CSn.10 (PB1.13).                                           */
  CAPSENSE_0_MUX_CSMX_CSN11            = 11,    /*!< CSN11 : Select CSn.11 (PB1.14).                                           */
  CAPSENSE_0_MUX_CSMX_CSN12            = 12,    /*!< CSN12 : Select CSn.12 (PB1.15).                                           */
  CAPSENSE_0_MUX_CSMX_CSN13            = 13,    /*!< CSN13 : Select CSn.13 (PB2.0).                                            */
  CAPSENSE_0_MUX_CSMX_CSN14            = 14,    /*!< CSN14 : Select CSn.14 (PB2.1).                                            */
  CAPSENSE_0_MUX_CSMX_CSN15            = 15,    /*!< CSN15 : Select CSn.15 (PB2.2).                                            */
} CAPSENSE_0_MUX_CSMX_Enum;

/* =============================================  CAPSENSE_0 MUX CSDISC [7..7]  ============================================== */
typedef enum {                                  /*!< CAPSENSE_0_MUX_CSDISC                                                     */
  CAPSENSE_0_MUX_CSDISC_CONNECT        = 0,     /*!< CONNECT : Connect the capacitive sensing circuit to the selected
                                                     channel.                                                                  */
  CAPSENSE_0_MUX_CSDISC_DISCONNECT     = 1,     /*!< DISCONNECT : Disconnect the capacitive sensing input channel.             */
} CAPSENSE_0_MUX_CSDISC_Enum;



/* =========================================================================================================================== */
/* ================                                         CLKCTRL_0                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* ============================================  CLKCTRL_0 CONTROL AHBSEL [0..2]  ============================================ */
typedef enum {                                  /*!< CLKCTRL_0_CONTROL_AHBSEL                                                  */
  CLKCTRL_0_CONTROL_AHBSEL_LPOSC0      = 0,     /*!< LPOSC0 : AHB clock source is the Low-Power Oscillator.                    */
  CLKCTRL_0_CONTROL_AHBSEL_LFOSC0      = 1,     /*!< LFOSC0 : AHB clock source is the Low-Frequency Oscillator.                */
  CLKCTRL_0_CONTROL_AHBSEL_RTC0OSC     = 2,     /*!< RTC0OSC : AHB clock source is the RTC Oscillator.                         */
  CLKCTRL_0_CONTROL_AHBSEL_EXTOSC0     = 3,     /*!< EXTOSC0 : AHB clock source is the External Oscillator.                    */
  CLKCTRL_0_CONTROL_AHBSEL_USB0OSC     = 4,     /*!< USB0OSC : AHB clock source is the USB Oscillator.                         */
  CLKCTRL_0_CONTROL_AHBSEL_PLL0OSC     = 5,     /*!< PLL0OSC : AHB clock source is the PLL.                                    */
  CLKCTRL_0_CONTROL_AHBSEL_LPOSC0_DIV  = 6,     /*!< LPOSC0_DIV : AHB clock source is a divided version of the Low-Power
                                                     Oscillator.                                                               */
} CLKCTRL_0_CONTROL_AHBSEL_Enum;

/* ===========================================  CLKCTRL_0 CONTROL AHBDIV [8..10]  ============================================ */
typedef enum {                                  /*!< CLKCTRL_0_CONTROL_AHBDIV                                                  */
  CLKCTRL_0_CONTROL_AHBDIV_DIV1        = 0,     /*!< DIV1 : AHB clock divided by 1.                                            */
  CLKCTRL_0_CONTROL_AHBDIV_DIV2        = 1,     /*!< DIV2 : AHB clock divided by 2.                                            */
  CLKCTRL_0_CONTROL_AHBDIV_DIV4        = 2,     /*!< DIV4 : AHB clock divided by 4.                                            */
  CLKCTRL_0_CONTROL_AHBDIV_DIV8        = 3,     /*!< DIV8 : AHB clock divided by 8.                                            */
  CLKCTRL_0_CONTROL_AHBDIV_DIV16       = 4,     /*!< DIV16 : AHB clock divided by 16.                                          */
  CLKCTRL_0_CONTROL_AHBDIV_DIV32       = 5,     /*!< DIV32 : AHB clock divided by 32.                                          */
  CLKCTRL_0_CONTROL_AHBDIV_DIV64       = 6,     /*!< DIV64 : AHB clock divided by 64.                                          */
  CLKCTRL_0_CONTROL_AHBDIV_DIV128      = 7,     /*!< DIV128 : AHB clock divided by 128.                                        */
} CLKCTRL_0_CONTROL_AHBDIV_Enum;

/* ===========================================  CLKCTRL_0 CONTROL APBDIV [16..16]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_CONTROL_APBDIV                                                  */
  CLKCTRL_0_CONTROL_APBDIV_DIV1        = 0,     /*!< DIV1 : APB clock is the same as the AHB clock (divided by 1).             */
  CLKCTRL_0_CONTROL_APBDIV_DIV2        = 1,     /*!< DIV2 : APB clock is the AHB clock divided by 2.                           */
} CLKCTRL_0_CONTROL_APBDIV_Enum;

/* ==========================================  CLKCTRL_0 CONTROL EXTESEL [28..28]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_CONTROL_EXTESEL                                                 */
  CLKCTRL_0_CONTROL_EXTESEL_BOTH_EDGES = 0,     /*!< BOTH_EDGES : External clock generated by both rising and falling
                                                     edges of the external oscillator.                                         */
  CLKCTRL_0_CONTROL_EXTESEL_RISING_ONLY = 1,    /*!< RISING_ONLY : External clock generated by only rising edges
                                                     of the external oscillator.                                               */
} CLKCTRL_0_CONTROL_EXTESEL_Enum;

/* ===========================================  CLKCTRL_0 CONTROL OBUSYF [29..29]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_CONTROL_OBUSYF                                                  */
  CLKCTRL_0_CONTROL_OBUSYF_NOT_SET     = 0,     /*!< NOT_SET : AHB and APB oscillators are not busy.                           */
  CLKCTRL_0_CONTROL_OBUSYF_SET         = 1,     /*!< SET : AHB and APB oscillators are busy and the AHBSEL, AHBDIV,
                                                     and APBDIV fields should not be modified.                                 */
} CLKCTRL_0_CONTROL_OBUSYF_Enum;

/* ========================================================  AHBCLKG  ======================================================== */
/* ============================================  CLKCTRL_0 AHBCLKG RAMCEN [0..0]  ============================================ */
typedef enum {                                  /*!< CLKCTRL_0_AHBCLKG_RAMCEN                                                  */
  CLKCTRL_0_AHBCLKG_RAMCEN_DISABLED    = 0,     /*!< DISABLED : Disable the AHB clock to the RAM.                              */
  CLKCTRL_0_AHBCLKG_RAMCEN_ENABLED     = 1,     /*!< ENABLED : Enable the AHB clock to the RAM (default).                      */
} CLKCTRL_0_AHBCLKG_RAMCEN_Enum;

/* ============================================  CLKCTRL_0 AHBCLKG DMACEN [1..1]  ============================================ */
typedef enum {                                  /*!< CLKCTRL_0_AHBCLKG_DMACEN                                                  */
  CLKCTRL_0_AHBCLKG_DMACEN_DISABLED    = 0,     /*!< DISABLED : Disable the AHB clock to the DMA Controller (default).         */
  CLKCTRL_0_AHBCLKG_DMACEN_ENABLED     = 1,     /*!< ENABLED : Enable the AHB clock to the DMA Controller.                     */
} CLKCTRL_0_AHBCLKG_DMACEN_Enum;

