chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  CLKCTRL_0 AHBCLKG FLASHCEN [2..2]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_AHBCLKG_FLASHCEN                                                */
  CLKCTRL_0_AHBCLKG_FLASHCEN_DISABLED  = 0,     /*!< DISABLED : Disable the AHB clock to the Flash.                            */
  CLKCTRL_0_AHBCLKG_FLASHCEN_ENABLED   = 1,     /*!< ENABLED : Enable the AHB clock to the Flash (default).                    */
} CLKCTRL_0_AHBCLKG_FLASHCEN_Enum;

/* ===========================================  CLKCTRL_0 AHBCLKG EMIF0CEN [3..3]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_AHBCLKG_EMIF0CEN                                                */
  CLKCTRL_0_AHBCLKG_EMIF0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the AHB clock to the External Memory Interface
                                                     (EMIF) (default).                                                         */
  CLKCTRL_0_AHBCLKG_EMIF0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the AHB clock to the External Memory Interface
                                                     (EMIF).                                                                   */
} CLKCTRL_0_AHBCLKG_EMIF0CEN_Enum;

/* ===========================================  CLKCTRL_0 AHBCLKG USB0BCEN [4..4]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_AHBCLKG_USB0BCEN                                                */
  CLKCTRL_0_AHBCLKG_USB0BCEN_DISABLED  = 0,     /*!< DISABLED : Disable the AHB clock to the USB0 Buffer (default).            */
  CLKCTRL_0_AHBCLKG_USB0BCEN_ENABLED   = 1,     /*!< ENABLED : Enable the AHB clock to the USB0 Buffer.                        */
} CLKCTRL_0_AHBCLKG_USB0BCEN_Enum;

/* =======================================================  APBCLKG0  ======================================================== */
/* ===========================================  CLKCTRL_0 APBCLKG0 PLL0CEN [0..0]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_PLL0CEN                                                */
  CLKCTRL_0_APBCLKG0_PLL0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the PLL0 registers (default).         */
  CLKCTRL_0_APBCLKG0_PLL0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the PLL0 registers.                     */
} CLKCTRL_0_APBCLKG0_PLL0CEN_Enum;

/* ===========================================  CLKCTRL_0 APBCLKG0 PB0CEN [1..1]  ============================================ */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_PB0CEN                                                 */
  CLKCTRL_0_APBCLKG0_PB0CEN_DISABLED   = 0,     /*!< DISABLED : Disable the APB clock to the Port Bank Modules (default).      */
  CLKCTRL_0_APBCLKG0_PB0CEN_ENABLED    = 1,     /*!< ENABLED : Enable the APB clock to the Port Bank Modules.                  */
} CLKCTRL_0_APBCLKG0_PB0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 USART0CEN [2..2]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_USART0CEN                                              */
  CLKCTRL_0_APBCLKG0_USART0CEN_DISABLED = 0,    /*!< DISABLED : Disable the APB clock to the USART0 Module (default).          */
  CLKCTRL_0_APBCLKG0_USART0CEN_ENABLED = 1,     /*!< ENABLED : Enable the APB clock to the USART0 Module.                      */
} CLKCTRL_0_APBCLKG0_USART0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 USART1CEN [3..3]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_USART1CEN                                              */
  CLKCTRL_0_APBCLKG0_USART1CEN_DISABLED = 0,    /*!< DISABLED : Disable the APB clock to the USART1 Module (default).          */
  CLKCTRL_0_APBCLKG0_USART1CEN_ENABLED = 1,     /*!< ENABLED : Enable the APB clock to the USART1 Module.                      */
} CLKCTRL_0_APBCLKG0_USART1CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 UART0CEN [4..4]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_UART0CEN                                               */
  CLKCTRL_0_APBCLKG0_UART0CEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the UART0 Module (default).           */
  CLKCTRL_0_APBCLKG0_UART0CEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the UART0 Module.                       */
} CLKCTRL_0_APBCLKG0_UART0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 UART1CEN [5..5]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_UART1CEN                                               */
  CLKCTRL_0_APBCLKG0_UART1CEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the UART1 Module (default).           */
  CLKCTRL_0_APBCLKG0_UART1CEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the UART1 Module.                       */
} CLKCTRL_0_APBCLKG0_UART1CEN_Enum;

/* ===========================================  CLKCTRL_0 APBCLKG0 SPI0CEN [6..6]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_SPI0CEN                                                */
  CLKCTRL_0_APBCLKG0_SPI0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the SPI0 Module (default).            */
  CLKCTRL_0_APBCLKG0_SPI0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the SPI0 Module.                        */
} CLKCTRL_0_APBCLKG0_SPI0CEN_Enum;

/* ===========================================  CLKCTRL_0 APBCLKG0 SPI1CEN [7..7]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_SPI1CEN                                                */
  CLKCTRL_0_APBCLKG0_SPI1CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the SPI1 Module (default).            */
  CLKCTRL_0_APBCLKG0_SPI1CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the SPI1 Module.                        */
} CLKCTRL_0_APBCLKG0_SPI1CEN_Enum;

