chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  CLKCTRL_0 APBCLKG0 SPI2CEN [8..8]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_SPI2CEN                                                */
  CLKCTRL_0_APBCLKG0_SPI2CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the SPI2 Module (default).            */
  CLKCTRL_0_APBCLKG0_SPI2CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the SPI2 Module.                        */
} CLKCTRL_0_APBCLKG0_SPI2CEN_Enum;

/* ===========================================  CLKCTRL_0 APBCLKG0 I2C0CEN [9..9]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_I2C0CEN                                                */
  CLKCTRL_0_APBCLKG0_I2C0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the I2C0 Module (default).            */
  CLKCTRL_0_APBCLKG0_I2C0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the I2C0 Module.                        */
} CLKCTRL_0_APBCLKG0_I2C0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 I2C1CEN [10..10]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_I2C1CEN                                                */
  CLKCTRL_0_APBCLKG0_I2C1CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the I2C1 Module (default).            */
  CLKCTRL_0_APBCLKG0_I2C1CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the I2C1 Module.                        */
} CLKCTRL_0_APBCLKG0_I2C1CEN_Enum;

/* =========================================  CLKCTRL_0 APBCLKG0 EPCA0CEN [11..11]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_EPCA0CEN                                               */
  CLKCTRL_0_APBCLKG0_EPCA0CEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the EPCA0 Module (default).           */
  CLKCTRL_0_APBCLKG0_EPCA0CEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the EPCA0 Module.                       */
} CLKCTRL_0_APBCLKG0_EPCA0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 PCA0CEN [12..12]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_PCA0CEN                                                */
  CLKCTRL_0_APBCLKG0_PCA0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the PCA0 Module (default).            */
  CLKCTRL_0_APBCLKG0_PCA0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the PCA0 Module.                        */
} CLKCTRL_0_APBCLKG0_PCA0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 PCA1CEN [13..13]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_PCA1CEN                                                */
  CLKCTRL_0_APBCLKG0_PCA1CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the PCA1 Module (default).            */
  CLKCTRL_0_APBCLKG0_PCA1CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the PCA1 Module.                        */
} CLKCTRL_0_APBCLKG0_PCA1CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 SSG0CEN [14..14]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_SSG0CEN                                                */
  CLKCTRL_0_APBCLKG0_SSG0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the SSG0 Module (default).            */
  CLKCTRL_0_APBCLKG0_SSG0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the SSG0 Module.                        */
} CLKCTRL_0_APBCLKG0_SSG0CEN_Enum;

/* =========================================  CLKCTRL_0 APBCLKG0 TIMER0CEN [15..15]  ========================================= */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_TIMER0CEN                                              */
  CLKCTRL_0_APBCLKG0_TIMER0CEN_DISABLED = 0,    /*!< DISABLED : Disable the APB clock to the TIMER0 Module (default).          */
  CLKCTRL_0_APBCLKG0_TIMER0CEN_ENABLED = 1,     /*!< ENABLED : Enable the APB clock to the TIMER0 Module.                      */
} CLKCTRL_0_APBCLKG0_TIMER0CEN_Enum;

/* =========================================  CLKCTRL_0 APBCLKG0 TIMER1CEN [16..16]  ========================================= */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_TIMER1CEN                                              */
  CLKCTRL_0_APBCLKG0_TIMER1CEN_DISABLED = 0,    /*!< DISABLED : Disable the APB clock to the TIMER1 Module (default).          */
  CLKCTRL_0_APBCLKG0_TIMER1CEN_ENABLED = 1,     /*!< ENABLED : Enable the APB clock to the TIMER1 Module.                      */
} CLKCTRL_0_APBCLKG0_TIMER1CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 ADC0CEN [17..17]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_ADC0CEN                                                */
  CLKCTRL_0_APBCLKG0_ADC0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the SARADC0 Module (default).         */
  CLKCTRL_0_APBCLKG0_ADC0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the SARADC0 Module.                     */
} CLKCTRL_0_APBCLKG0_ADC0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 ADC1CEN [18..18]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_ADC1CEN                                                */
  CLKCTRL_0_APBCLKG0_ADC1CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the SARADC1 Module (default).         */
  CLKCTRL_0_APBCLKG0_ADC1CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the SARADC1 Module.                     */
} CLKCTRL_0_APBCLKG0_ADC1CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 CMP0CEN [19..19]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_CMP0CEN                                                */
  CLKCTRL_0_APBCLKG0_CMP0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the Comparator 0 Module
                                                     (default).                                                                */
  CLKCTRL_0_APBCLKG0_CMP0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the Comparator 0 Module.                */
} CLKCTRL_0_APBCLKG0_CMP0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 CMP1CEN [20..20]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_CMP1CEN                                                */
  CLKCTRL_0_APBCLKG0_CMP1CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the Comparator 1 Module
                                                     (default).                                                                */
  CLKCTRL_0_APBCLKG0_CMP1CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the Comparator 1 Module.                */
} CLKCTRL_0_APBCLKG0_CMP1CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 CS0CEN [21..21]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_CS0CEN                                                 */
  CLKCTRL_0_APBCLKG0_CS0CEN_DISABLED   = 0,     /*!< DISABLED : Disable the APB clock to the CAPSENSE0 Module (default).       */
  CLKCTRL_0_APBCLKG0_CS0CEN_ENABLED    = 1,     /*!< ENABLED : Enable the APB clock to the CAPSENSE0 Module.                   */
} CLKCTRL_0_APBCLKG0_CS0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 AES0CEN [22..22]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_AES0CEN                                                */
  CLKCTRL_0_APBCLKG0_AES0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the AES0 Module (default).            */
  CLKCTRL_0_APBCLKG0_AES0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the AES0 Module.                        */
} CLKCTRL_0_APBCLKG0_AES0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 CRC0CEN [23..23]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_CRC0CEN                                                */
  CLKCTRL_0_APBCLKG0_CRC0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the CRC0 Module (default).            */
  CLKCTRL_0_APBCLKG0_CRC0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the CRC0 Module.                        */
} CLKCTRL_0_APBCLKG0_CRC0CEN_Enum;

/* =========================================  CLKCTRL_0 APBCLKG0 IDAC0CEN [24..24]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_IDAC0CEN                                               */
  CLKCTRL_0_APBCLKG0_IDAC0CEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the IDAC0 Module (default).           */
  CLKCTRL_0_APBCLKG0_IDAC0CEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the IDAC0 Module.                       */
} CLKCTRL_0_APBCLKG0_IDAC0CEN_Enum;

