chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =========================================  CLKCTRL_0 APBCLKG0 IDAC1CEN [25..25]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_IDAC1CEN                                               */
  CLKCTRL_0_APBCLKG0_IDAC1CEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the IDAC1 Module (default).           */
  CLKCTRL_0_APBCLKG0_IDAC1CEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the IDAC1 Module.                       */
} CLKCTRL_0_APBCLKG0_IDAC1CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 LPT0CEN [26..26]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_LPT0CEN                                                */
  CLKCTRL_0_APBCLKG0_LPT0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the LPTIMER0 Module (default).        */
  CLKCTRL_0_APBCLKG0_LPT0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the LPTIMER0 Module.                    */
} CLKCTRL_0_APBCLKG0_LPT0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 I2S0CEN [27..27]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_I2S0CEN                                                */
  CLKCTRL_0_APBCLKG0_I2S0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the I2S0 Module (default).            */
  CLKCTRL_0_APBCLKG0_I2S0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the I2S0 Module.                        */
} CLKCTRL_0_APBCLKG0_I2S0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG0 USB0CEN [28..28]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_USB0CEN                                                */
  CLKCTRL_0_APBCLKG0_USB0CEN_DISABLED  = 0,     /*!< DISABLED : Disable the APB clock to the USB0 Module (default).            */
  CLKCTRL_0_APBCLKG0_USB0CEN_ENABLED   = 1,     /*!< ENABLED : Enable the APB clock to the USB0 Module.                        */
} CLKCTRL_0_APBCLKG0_USB0CEN_Enum;

/* =========================================  CLKCTRL_0 APBCLKG0 EVREGCEN [29..29]  ========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_EVREGCEN                                               */
  CLKCTRL_0_APBCLKG0_EVREGCEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the External Regulator Module
                                                     (EXTVREG0) (default).                                                     */
  CLKCTRL_0_APBCLKG0_EVREGCEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the External Regulator Module
                                                     (EXTVREG0).                                                               */
} CLKCTRL_0_APBCLKG0_EVREGCEN_Enum;

/* =========================================  CLKCTRL_0 APBCLKG0 FLCTRLCEN [30..30]  ========================================= */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG0_FLCTRLCEN                                              */
  CLKCTRL_0_APBCLKG0_FLCTRLCEN_DISABLED = 0,    /*!< DISABLED : Disable the APB clock to the Flash Controller Module
                                                     (FLASHCTRL0) (default).                                                   */
  CLKCTRL_0_APBCLKG0_FLCTRLCEN_ENABLED = 1,     /*!< ENABLED : Enable the APB clock to the Flash Controller Module
                                                     (FLASHCTRL0).                                                             */
} CLKCTRL_0_APBCLKG0_FLCTRLCEN_Enum;

/* =======================================================  APBCLKG1  ======================================================== */
/* ==========================================  CLKCTRL_0 APBCLKG1 MISC0CEN [0..0]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG1_MISC0CEN                                               */
  CLKCTRL_0_APBCLKG1_MISC0CEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the RSTSRC0, LOCK0, VMON0,
                                                     VREG0, LDO0, VREF0, EXTOSC0, LPOSC0, EXTVREG0, IVC0 and
                                                     RTC0 modules (default).                                                   */
  CLKCTRL_0_APBCLKG1_MISC0CEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the RSTSRC0, LOCK0, VMON0,
                                                     VREG0, LDO0, VREF0, EXTOSC0, LPOSC0, EXTVREG0, IVC0 and
                                                     RTC0 modules.                                                             */
} CLKCTRL_0_APBCLKG1_MISC0CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG1 MISC1CEN [1..1]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG1_MISC1CEN                                               */
  CLKCTRL_0_APBCLKG1_MISC1CEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the Watchdog Timer (WDTIMER0),
                                                     EMIF0, and DMA Crossbar (DMAXBAR0) modules.                               */
  CLKCTRL_0_APBCLKG1_MISC1CEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the Watchdog Timer (WDTIMER0),
                                                     EMIF0, and DMA Crossbar (DMAXBAR0) modules (default).                     */
} CLKCTRL_0_APBCLKG1_MISC1CEN_Enum;

/* ==========================================  CLKCTRL_0 APBCLKG1 MISC2CEN [2..2]  =========================================== */
typedef enum {                                  /*!< CLKCTRL_0_APBCLKG1_MISC2CEN                                               */
  CLKCTRL_0_APBCLKG1_MISC2CEN_DISABLED = 0,     /*!< DISABLED : Disable the APB clock to the OSCVLDF flag in the
                                                     EXTOSC module (default).                                                  */
  CLKCTRL_0_APBCLKG1_MISC2CEN_ENABLED  = 1,     /*!< ENABLED : Enable the APB clock to the OSCVLDF flag in the EXTOSC
                                                     module.                                                                   */
} CLKCTRL_0_APBCLKG1_MISC2CEN_Enum;

/* =========================================================  PM3CN  ========================================================= */
/* ============================================  CLKCTRL_0 PM3CN PM3CSEL [0..2]  ============================================= */
typedef enum {                                  /*!< CLKCTRL_0_PM3CN_PM3CSEL                                                   */
  CLKCTRL_0_PM3CN_PM3CSEL_LPOSC0       = 0,     /*!< LPOSC0 : Power Mode 3 clock source is the Low-Power Oscillator.           */
  CLKCTRL_0_PM3CN_PM3CSEL_LFOSC0       = 1,     /*!< LFOSC0 : Power Mode 3 clock source is the Low-Frequency Oscillator.       */
  CLKCTRL_0_PM3CN_PM3CSEL_RTC0OSC      = 2,     /*!< RTC0OSC : Power Mode 3 clock source is the RTC Oscillator.                */
  CLKCTRL_0_PM3CN_PM3CSEL_EXTOSC0      = 3,     /*!< EXTOSC0 : Power Mode 3 clock source is the External Oscillator.           */
  CLKCTRL_0_PM3CN_PM3CSEL_USB0OSC      = 4,     /*!< USB0OSC : Power Mode 3 clock source is the USB Oscillator.                */
  CLKCTRL_0_PM3CN_PM3CSEL_PLL0OSC      = 5,     /*!< PLL0OSC : Power Mode 3 clock source is the PLL.                           */
  CLKCTRL_0_PM3CN_PM3CSEL_LPOSC0_DIV   = 6,     /*!< LPOSC0_DIV : Power Mode 3 clock source is a divided version
                                                     of the Low-Power Oscillator.                                              */
} CLKCTRL_0_PM3CN_PM3CSEL_Enum;

/* ============================================  CLKCTRL_0 PM3CN PM3CEN [16..16]  ============================================ */
typedef enum {                                  /*!< CLKCTRL_0_PM3CN_PM3CEN                                                    */
  CLKCTRL_0_PM3CN_PM3CEN_DISABLED      = 0,     /*!< DISABLED : Disable the core clock when in Power Mode 3.                   */
  CLKCTRL_0_PM3CN_PM3CEN_ENABLED       = 1,     /*!< ENABLED : The core clock is enabled and runs off the clock selected
                                                     by PM3CSEL in Power Mode 3.                                               */
} CLKCTRL_0_PM3CN_PM3CEN_Enum;



/* =========================================================================================================================== */
/* ================                                           CMP_0                                           ================ */
/* =========================================================================================================================== */

