chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* =============================================  CMP_0 CONTROL CMPFI [13..13]  ============================================== */
typedef enum {                                  /*!< CMP_0_CONTROL_CMPFI                                                       */
  CMP_0_CONTROL_CMPFI_NOT_SET          = 0,     /*!< NOT_SET : No comparator falling edge has occurred since this
                                                     flag was last cleared.                                                    */
  CMP_0_CONTROL_CMPFI_SET              = 1,     /*!< SET : A comparator falling edge occurred since last flag was
                                                     cleared.                                                                  */
} CMP_0_CONTROL_CMPFI_Enum;

/* =============================================  CMP_0 CONTROL CMPRI [14..14]  ============================================== */
typedef enum {                                  /*!< CMP_0_CONTROL_CMPRI                                                       */
  CMP_0_CONTROL_CMPRI_NOT_SET          = 0,     /*!< NOT_SET : No comparator rising edge has occurred since this
                                                     flag was last cleared.                                                    */
  CMP_0_CONTROL_CMPRI_SET              = 1,     /*!< SET : A comparator rising edge occurred since last flag was
                                                     cleared.                                                                  */
} CMP_0_CONTROL_CMPRI_Enum;

/* =============================================  CMP_0 CONTROL CMPOUT [30..30]  ============================================= */
typedef enum {                                  /*!< CMP_0_CONTROL_CMPOUT                                                      */
  CMP_0_CONTROL_CMPOUT_POS_LT_NEG      = 0,     /*!< POS_LT_NEG : Voltage on CP+ < CP-.                                        */
  CMP_0_CONTROL_CMPOUT_POS_GT_NEG      = 1,     /*!< POS_GT_NEG : Voltage on CP+ > CP-.                                        */
} CMP_0_CONTROL_CMPOUT_Enum;

/* =============================================  CMP_0 CONTROL CMPEN [31..31]  ============================================== */
typedef enum {                                  /*!< CMP_0_CONTROL_CMPEN                                                       */
  CMP_0_CONTROL_CMPEN_DISABLED         = 0,     /*!< DISABLED : Disable the comparator.                                        */
  CMP_0_CONTROL_CMPEN_ENABLED          = 1,     /*!< ENABLED : Enable the comparator.                                          */
} CMP_0_CONTROL_CMPEN_Enum;

/* =========================================================  MODE  ========================================================== */
/* ================================================  CMP_0 MODE NMUX [0..3]  ================================================= */
typedef enum {                                  /*!< CMP_0_MODE_NMUX                                                           */
  CMP_0_MODE_NMUX_CMPNN0               = 0,     /*!< CMPNN0 : Select CMPnN.0 (P2.12).                                          */
  CMP_0_MODE_NMUX_CMPNN1               = 1,     /*!< CMPNN1 : Select CMPnN.1 (PB2.14).                                         */
  CMP_0_MODE_NMUX_CMPNN2               = 2,     /*!< CMPNN2 : Select CMPnN.2 (PB3.1).                                          */
  CMP_0_MODE_NMUX_CMPNN3               = 3,     /*!< CMPNN3 : Select CMPnN.3 (PB3.3).                                          */
  CMP_0_MODE_NMUX_CMPNN4               = 4,     /*!< CMPNN4 : Select CMPnN.4 (PB3.5).                                          */
  CMP_0_MODE_NMUX_CMPNN5               = 5,     /*!< CMPNN5 : Select CMPnN.5 (PB3.7).                                          */
  CMP_0_MODE_NMUX_CMPNN6               = 6,     /*!< CMPNN6 : Select CMPnN.6 (PB3.9).                                          */
  CMP_0_MODE_NMUX_CMPNN7               = 7,     /*!< CMPNN7 : Select CMPnN.7 (PB3.11).                                         */
  CMP_0_MODE_NMUX_CMPNN8               = 8,     /*!< CMPNN8 : Select CMPnN.8 (VDD).                                            */
  CMP_0_MODE_NMUX_CMPNN9               = 9,     /*!< CMPNN9 : Select CMPnN.9 (VREF).                                           */
  CMP_0_MODE_NMUX_CMPNN10              = 10,    /*!< CMPNN10 : Select CMPnN.10 (RESERVED).                                     */
  CMP_0_MODE_NMUX_CMPNN11              = 11,    /*!< CMPNN11 : Select CMPnN.11 (RESERVED).                                     */
  CMP_0_MODE_NMUX_CMPNN12              = 12,    /*!< CMPNN12 : Select CMPnN.12 (RESERVED).                                     */
  CMP_0_MODE_NMUX_CMPNN13              = 13,    /*!< CMPNN13 : Select CMPnN.13 (RESERVED).                                     */
  CMP_0_MODE_NMUX_CMPNN14              = 14,    /*!< CMPNN14 : Select CMPnN.14 (RESERVED).                                     */
  CMP_0_MODE_NMUX_CMPNN15              = 15,    /*!< CMPNN15 : Select CMPnN.15 (RESERVED).                                     */
} CMP_0_MODE_NMUX_Enum;

/* ================================================  CMP_0 MODE PMUX [4..7]  ================================================= */
typedef enum {                                  /*!< CMP_0_MODE_PMUX                                                           */
  CMP_0_MODE_PMUX_CMPNP0               = 0,     /*!< CMPNP0 : Select CMPnP.0 (PB2.11).                                         */
  CMP_0_MODE_PMUX_CMPNP1               = 1,     /*!< CMPNP1 : Select CMPnP.1 (PB2.13).                                         */
  CMP_0_MODE_PMUX_CMPNP2               = 2,     /*!< CMPNP2 : Select CMPnP.2 (PB3.0).                                          */
  CMP_0_MODE_PMUX_CMPNP3               = 3,     /*!< CMPNP3 : Select CMPnP.3 (PB3.2).                                          */
  CMP_0_MODE_PMUX_CMPNP4               = 4,     /*!< CMPNP4 : Select CMPnP.4 (PB3.4).                                          */
  CMP_0_MODE_PMUX_CMPNP5               = 5,     /*!< CMPNP5 : Select CMPnP.5 (PB3.6).                                          */
  CMP_0_MODE_PMUX_CMPNP6               = 6,     /*!< CMPNP6 : Select CMPnP.6 (PB3.8).                                          */
  CMP_0_MODE_PMUX_CMPNP7               = 7,     /*!< CMPNP7 : Select CMPnP.7 (PB3.10).                                         */
  CMP_0_MODE_PMUX_CMPNP8               = 8,     /*!< CMPNP8 : Select CMPnP.8 (Voltage at VREGIN / 4).                          */
  CMP_0_MODE_PMUX_CMPNP9               = 9,     /*!< CMPNP9 : Select CMPnP.9 (EXTVREG0 Current Sense).                         */
  CMP_0_MODE_PMUX_CMPNP10              = 10,    /*!< CMPNP10 : Select CMPnP.10 (1.8V Output of LDO).                           */
  CMP_0_MODE_PMUX_CMPNP11              = 11,    /*!< CMPNP11 : Select CMPnP.11 (VDDOSC Supply).                                */
  CMP_0_MODE_PMUX_CMPNP12              = 12,    /*!< CMPNP12 : Select CMPnP.12 (VREF).                                         */
  CMP_0_MODE_PMUX_CMPNP13              = 13,    /*!< CMPNP13 : Select CMPnP.13 (VIO).                                          */
  CMP_0_MODE_PMUX_CMPNP14              = 14,    /*!< CMPNP14 : Select CMPnP.14 (Voltage at VIOHD / 4).                         */
  CMP_0_MODE_PMUX_CMPNP15              = 15,    /*!< CMPNP15 : Select CMPnP.15 (RESERVED).                                     */
} CMP_0_MODE_PMUX_Enum;

/* ================================================  CMP_0 MODE INMUX [8..9]  ================================================ */
typedef enum {                                  /*!< CMP_0_MODE_INMUX                                                          */
  CMP_0_MODE_INMUX_DIRECT              = 0,     /*!< DIRECT : Connects the NMUX signal to CP- and the PMUX signal
                                                     to CP+.                                                                   */
  CMP_0_MODE_INMUX_CMPP_VSS            = 1,     /*!< CMPP_VSS : Connects VSS to CP- and the PMUX signal to CP+.                */
  CMP_0_MODE_INMUX_CMPP_DAC            = 2,     /*!< CMPP_DAC : Connects the NMUX signal to CP-, the PMUX signal
                                                     to the Comparator DAC voltage reference, and the DAC output
                                                     to CP+.                                                                   */
  CMP_0_MODE_INMUX_CMPN_DAC            = 3,     /*!< CMPN_DAC : Connects the PMUX signal to CP+, the NMUX signal
                                                     to the Comparator DAC voltage reference, and the DAC output
                                                     to CP-.                                                                   */
} CMP_0_MODE_INMUX_Enum;

/* ===============================================  CMP_0 MODE CMPMD [10..11]  =============================================== */
typedef enum {                                  /*!< CMP_0_MODE_CMPMD                                                          */
  CMP_0_MODE_CMPMD_MODE0               = 0,     /*!< MODE0 : Mode 0 (fastest response time, highest power consumption).        */
  CMP_0_MODE_CMPMD_MODE1               = 1,     /*!< MODE1 : Mode 1.                                                           */
  CMP_0_MODE_CMPMD_MODE2               = 2,     /*!< MODE2 : Mode 2.                                                           */
  CMP_0_MODE_CMPMD_MODE3               = 3,     /*!< MODE3 : Mode 3 (slowest response time, lowest power consumption).         */
} CMP_0_MODE_CMPMD_Enum;

