chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===============================================  CMP_0 MODE FIEN [13..13]  ================================================ */
typedef enum {                                  /*!< CMP_0_MODE_FIEN                                                           */
  CMP_0_MODE_FIEN_DISABLED             = 0,     /*!< DISABLED : Disable the comparator falling edge interrupt.                 */
  CMP_0_MODE_FIEN_ENABLED              = 1,     /*!< ENABLED : Enable the comparator falling edge interrupt.                   */
} CMP_0_MODE_FIEN_Enum;

/* ===============================================  CMP_0 MODE RIEN [14..14]  ================================================ */
typedef enum {                                  /*!< CMP_0_MODE_RIEN                                                           */
  CMP_0_MODE_RIEN_DISABLED             = 0,     /*!< DISABLED : Disable the comparator rising edge interrupt.                  */
  CMP_0_MODE_RIEN_ENABLED              = 1,     /*!< ENABLED : Enable the comparator rising edge interrupt.                    */
} CMP_0_MODE_RIEN_Enum;

/* ==============================================  CMP_0 MODE NWPUEN [22..22]  =============================================== */
typedef enum {                                  /*!< CMP_0_MODE_NWPUEN                                                         */
  CMP_0_MODE_NWPUEN_DISABLED           = 0,     /*!< DISABLED : Disable the negative input weak pull up.                       */
  CMP_0_MODE_NWPUEN_ENABLED            = 1,     /*!< ENABLED : Enable the negative input weak pull up.                         */
} CMP_0_MODE_NWPUEN_Enum;

/* ==============================================  CMP_0 MODE PWPUEN [23..23]  =============================================== */
typedef enum {                                  /*!< CMP_0_MODE_PWPUEN                                                         */
  CMP_0_MODE_PWPUEN_DISABLED           = 0,     /*!< DISABLED : Disable the positive input weak pull up.                       */
  CMP_0_MODE_PWPUEN_ENABLED            = 1,     /*!< ENABLED : Enable the positive input weak pull up.                         */
} CMP_0_MODE_PWPUEN_Enum;

/* ==============================================  CMP_0 MODE CMPHYN [24..25]  =============================================== */
typedef enum {                                  /*!< CMP_0_MODE_CMPHYN                                                         */
  CMP_0_MODE_CMPHYN_DISABLED           = 0,     /*!< DISABLED : Disable negative hysteresis.                                   */
  CMP_0_MODE_CMPHYN_NEG_5_MV           = 1,     /*!< NEG_5_MV : Set negative hysteresis to 5 mV.                               */
  CMP_0_MODE_CMPHYN_NEG_10_MV          = 2,     /*!< NEG_10_MV : Set negative hysteresis to 10 mV.                             */
  CMP_0_MODE_CMPHYN_NEG_20_MV          = 3,     /*!< NEG_20_MV : Set negative hysteresis to 20 mV.                             */
} CMP_0_MODE_CMPHYN_Enum;

/* ==============================================  CMP_0 MODE CMPHYP [26..27]  =============================================== */
typedef enum {                                  /*!< CMP_0_MODE_CMPHYP                                                         */
  CMP_0_MODE_CMPHYP_DISABLED           = 0,     /*!< DISABLED : Disable positive hysteresis.                                   */
  CMP_0_MODE_CMPHYP_POS_5_MV           = 1,     /*!< POS_5_MV : Set positive hysteresis to 5 mV.                               */
  CMP_0_MODE_CMPHYP_POS_10_MV          = 2,     /*!< POS_10_MV : Set positive hysteresis to 10 mV.                             */
  CMP_0_MODE_CMPHYP_POS_20_MV          = 3,     /*!< POS_20_MV : Set positive hysteresis to 20 mV.                             */
} CMP_0_MODE_CMPHYP_Enum;

/* ===============================================  CMP_0 MODE INVEN [30..30]  =============================================== */
typedef enum {                                  /*!< CMP_0_MODE_INVEN                                                          */
  CMP_0_MODE_INVEN_DISABLED            = 0,     /*!< DISABLED : Do not invert the comparator output.                           */
  CMP_0_MODE_INVEN_ENABLED             = 1,     /*!< ENABLED : Invert the comparator output.                                   */
} CMP_0_MODE_INVEN_Enum;



/* =========================================================================================================================== */
/* ================                                           CMP_1                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* =============================================  CMP_1 CONTROL CMPFI [13..13]  ============================================== */
typedef enum {                                  /*!< CMP_1_CONTROL_CMPFI                                                       */
  CMP_1_CONTROL_CMPFI_NOT_SET          = 0,     /*!< NOT_SET : No comparator falling edge has occurred since this
                                                     flag was last cleared.                                                    */
  CMP_1_CONTROL_CMPFI_SET              = 1,     /*!< SET : A comparator falling edge occurred since last flag was
                                                     cleared.                                                                  */
} CMP_1_CONTROL_CMPFI_Enum;

/* =============================================  CMP_1 CONTROL CMPRI [14..14]  ============================================== */
typedef enum {                                  /*!< CMP_1_CONTROL_CMPRI                                                       */
  CMP_1_CONTROL_CMPRI_NOT_SET          = 0,     /*!< NOT_SET : No comparator rising edge has occurred since this
                                                     flag was last cleared.                                                    */
  CMP_1_CONTROL_CMPRI_SET              = 1,     /*!< SET : A comparator rising edge occurred since last flag was
                                                     cleared.                                                                  */
} CMP_1_CONTROL_CMPRI_Enum;

/* =============================================  CMP_1 CONTROL CMPOUT [30..30]  ============================================= */
typedef enum {                                  /*!< CMP_1_CONTROL_CMPOUT                                                      */
  CMP_1_CONTROL_CMPOUT_POS_LT_NEG      = 0,     /*!< POS_LT_NEG : Voltage on CP+ < CP-.                                        */
  CMP_1_CONTROL_CMPOUT_POS_GT_NEG      = 1,     /*!< POS_GT_NEG : Voltage on CP+ > CP-.                                        */
} CMP_1_CONTROL_CMPOUT_Enum;

/* =============================================  CMP_1 CONTROL CMPEN [31..31]  ============================================== */
typedef enum {                                  /*!< CMP_1_CONTROL_CMPEN                                                       */
  CMP_1_CONTROL_CMPEN_DISABLED         = 0,     /*!< DISABLED : Disable the comparator.                                        */
  CMP_1_CONTROL_CMPEN_ENABLED          = 1,     /*!< ENABLED : Enable the comparator.                                          */
} CMP_1_CONTROL_CMPEN_Enum;

/* =========================================================  MODE  ========================================================== */
/* ================================================  CMP_1 MODE NMUX [0..3]  ================================================= */
typedef enum {                                  /*!< CMP_1_MODE_NMUX                                                           */
  CMP_1_MODE_NMUX_CMPNN0               = 0,     /*!< CMPNN0 : Select CMPnN.0 (P2.12).                                          */
  CMP_1_MODE_NMUX_CMPNN1               = 1,     /*!< CMPNN1 : Select CMPnN.1 (PB2.14).                                         */
  CMP_1_MODE_NMUX_CMPNN2               = 2,     /*!< CMPNN2 : Select CMPnN.2 (PB3.1).                                          */
  CMP_1_MODE_NMUX_CMPNN3               = 3,     /*!< CMPNN3 : Select CMPnN.3 (PB3.3).                                          */
  CMP_1_MODE_NMUX_CMPNN4               = 4,     /*!< CMPNN4 : Select CMPnN.4 (PB3.5).                                          */
  CMP_1_MODE_NMUX_CMPNN5               = 5,     /*!< CMPNN5 : Select CMPnN.5 (PB3.7).                                          */
  CMP_1_MODE_NMUX_CMPNN6               = 6,     /*!< CMPNN6 : Select CMPnN.6 (PB3.9).                                          */
  CMP_1_MODE_NMUX_CMPNN7               = 7,     /*!< CMPNN7 : Select CMPnN.7 (PB3.11).                                         */
  CMP_1_MODE_NMUX_CMPNN8               = 8,     /*!< CMPNN8 : Select CMPnN.8 (VDD).                                            */
  CMP_1_MODE_NMUX_CMPNN9               = 9,     /*!< CMPNN9 : Select CMPnN.9 (VREF).                                           */
  CMP_1_MODE_NMUX_CMPNN10              = 10,    /*!< CMPNN10 : Select CMPnN.10 (RESERVED).                                     */
  CMP_1_MODE_NMUX_CMPNN11              = 11,    /*!< CMPNN11 : Select CMPnN.11 (RESERVED).                                     */
  CMP_1_MODE_NMUX_CMPNN12              = 12,    /*!< CMPNN12 : Select CMPnN.12 (RESERVED).                                     */
  CMP_1_MODE_NMUX_CMPNN13              = 13,    /*!< CMPNN13 : Select CMPnN.13 (RESERVED).                                     */
  CMP_1_MODE_NMUX_CMPNN14              = 14,    /*!< CMPNN14 : Select CMPnN.14 (RESERVED).                                     */
  CMP_1_MODE_NMUX_CMPNN15              = 15,    /*!< CMPNN15 : Select CMPnN.15 (RESERVED).                                     */
} CMP_1_MODE_NMUX_Enum;

/* ================================================  CMP_1 MODE PMUX [4..7]  ================================================= */
typedef enum {                                  /*!< CMP_1_MODE_PMUX                                                           */
  CMP_1_MODE_PMUX_CMPNP0               = 0,     /*!< CMPNP0 : Select CMPnP.0 (PB2.11).                                         */
  CMP_1_MODE_PMUX_CMPNP1               = 1,     /*!< CMPNP1 : Select CMPnP.1 (PB2.13).                                         */
  CMP_1_MODE_PMUX_CMPNP2               = 2,     /*!< CMPNP2 : Select CMPnP.2 (PB3.0).                                          */
  CMP_1_MODE_PMUX_CMPNP3               = 3,     /*!< CMPNP3 : Select CMPnP.3 (PB3.2).                                          */
  CMP_1_MODE_PMUX_CMPNP4               = 4,     /*!< CMPNP4 : Select CMPnP.4 (PB3.4).                                          */
  CMP_1_MODE_PMUX_CMPNP5               = 5,     /*!< CMPNP5 : Select CMPnP.5 (PB3.6).                                          */
  CMP_1_MODE_PMUX_CMPNP6               = 6,     /*!< CMPNP6 : Select CMPnP.6 (PB3.8).                                          */
  CMP_1_MODE_PMUX_CMPNP7               = 7,     /*!< CMPNP7 : Select CMPnP.7 (PB3.10).                                         */
  CMP_1_MODE_PMUX_CMPNP8               = 8,     /*!< CMPNP8 : Select CMPnP.8 (Voltage at VREGIN / 4).                          */
  CMP_1_MODE_PMUX_CMPNP9               = 9,     /*!< CMPNP9 : Select CMPnP.9 (EXTVREG0 Current Sense).                         */
  CMP_1_MODE_PMUX_CMPNP10              = 10,    /*!< CMPNP10 : Select CMPnP.10 (1.8V Output of LDO).                           */
  CMP_1_MODE_PMUX_CMPNP11              = 11,    /*!< CMPNP11 : Select CMPnP.11 (VDDOSC Supply).                                */
  CMP_1_MODE_PMUX_CMPNP12              = 12,    /*!< CMPNP12 : Select CMPnP.12 (VREF).                                         */
  CMP_1_MODE_PMUX_CMPNP13              = 13,    /*!< CMPNP13 : Select CMPnP.13 (VIO).                                          */
  CMP_1_MODE_PMUX_CMPNP14              = 14,    /*!< CMPNP14 : Select CMPnP.14 (Voltage at VIOHD / 4).                         */
  CMP_1_MODE_PMUX_CMPNP15              = 15,    /*!< CMPNP15 : Select CMPnP.15 (RESERVED).                                     */
} CMP_1_MODE_PMUX_Enum;

/* ================================================  CMP_1 MODE INMUX [8..9]  ================================================ */
typedef enum {                                  /*!< CMP_1_MODE_INMUX                                                          */
  CMP_1_MODE_INMUX_DIRECT              = 0,     /*!< DIRECT : Connects the NMUX signal to CP- and the PMUX signal
                                                     to CP+.                                                                   */
  CMP_1_MODE_INMUX_CMPP_VSS            = 1,     /*!< CMPP_VSS : Connects VSS to CP- and the PMUX signal to CP+.                */
  CMP_1_MODE_INMUX_CMPP_DAC            = 2,     /*!< CMPP_DAC : Connects the NMUX signal to CP-, the PMUX signal
                                                     to the Comparator DAC voltage reference, and the DAC output
                                                     to CP+.                                                                   */
  CMP_1_MODE_INMUX_CMPN_DAC            = 3,     /*!< CMPN_DAC : Connects the PMUX signal to CP+, the NMUX signal
                                                     to the Comparator DAC voltage reference, and the DAC output
                                                     to CP-.                                                                   */
} CMP_1_MODE_INMUX_Enum;

/* ===============================================  CMP_1 MODE CMPMD [10..11]  =============================================== */
typedef enum {                                  /*!< CMP_1_MODE_CMPMD                                                          */
  CMP_1_MODE_CMPMD_MODE0               = 0,     /*!< MODE0 : Mode 0 (fastest response time, highest power consumption).        */
  CMP_1_MODE_CMPMD_MODE1               = 1,     /*!< MODE1 : Mode 1.                                                           */
  CMP_1_MODE_CMPMD_MODE2               = 2,     /*!< MODE2 : Mode 2.                                                           */
  CMP_1_MODE_CMPMD_MODE3               = 3,     /*!< MODE3 : Mode 3 (slowest response time, lowest power consumption).         */
} CMP_1_MODE_CMPMD_Enum;

/* ===============================================  CMP_1 MODE FIEN [13..13]  ================================================ */
typedef enum {                                  /*!< CMP_1_MODE_FIEN                                                           */
  CMP_1_MODE_FIEN_DISABLED             = 0,     /*!< DISABLED : Disable the comparator falling edge interrupt.                 */
  CMP_1_MODE_FIEN_ENABLED              = 1,     /*!< ENABLED : Enable the comparator falling edge interrupt.                   */
} CMP_1_MODE_FIEN_Enum;

/* ===============================================  CMP_1 MODE RIEN [14..14]  ================================================ */
typedef enum {                                  /*!< CMP_1_MODE_RIEN                                                           */
  CMP_1_MODE_RIEN_DISABLED             = 0,     /*!< DISABLED : Disable the comparator rising edge interrupt.                  */
  CMP_1_MODE_RIEN_ENABLED              = 1,     /*!< ENABLED : Enable the comparator rising edge interrupt.                    */
} CMP_1_MODE_RIEN_Enum;

/* ==============================================  CMP_1 MODE NWPUEN [22..22]  =============================================== */
typedef enum {                                  /*!< CMP_1_MODE_NWPUEN                                                         */
  CMP_1_MODE_NWPUEN_DISABLED           = 0,     /*!< DISABLED : Disable the negative input weak pull up.                       */
  CMP_1_MODE_NWPUEN_ENABLED            = 1,     /*!< ENABLED : Enable the negative input weak pull up.                         */
} CMP_1_MODE_NWPUEN_Enum;

/* ==============================================  CMP_1 MODE PWPUEN [23..23]  =============================================== */
typedef enum {                                  /*!< CMP_1_MODE_PWPUEN                                                         */
  CMP_1_MODE_PWPUEN_DISABLED           = 0,     /*!< DISABLED : Disable the positive input weak pull up.                       */
  CMP_1_MODE_PWPUEN_ENABLED            = 1,     /*!< ENABLED : Enable the positive input weak pull up.                         */
} CMP_1_MODE_PWPUEN_Enum;

/* ==============================================  CMP_1 MODE CMPHYN [24..25]  =============================================== */
typedef enum {                                  /*!< CMP_1_MODE_CMPHYN                                                         */
  CMP_1_MODE_CMPHYN_DISABLED           = 0,     /*!< DISABLED : Disable negative hysteresis.                                   */
  CMP_1_MODE_CMPHYN_NEG_5_MV           = 1,     /*!< NEG_5_MV : Set negative hysteresis to 5 mV.                               */
  CMP_1_MODE_CMPHYN_NEG_10_MV          = 2,     /*!< NEG_10_MV : Set negative hysteresis to 10 mV.                             */
  CMP_1_MODE_CMPHYN_NEG_20_MV          = 3,     /*!< NEG_20_MV : Set negative hysteresis to 20 mV.                             */
} CMP_1_MODE_CMPHYN_Enum;

/* ==============================================  CMP_1 MODE CMPHYP [26..27]  =============================================== */
typedef enum {                                  /*!< CMP_1_MODE_CMPHYP                                                         */
  CMP_1_MODE_CMPHYP_DISABLED           = 0,     /*!< DISABLED : Disable positive hysteresis.                                   */
  CMP_1_MODE_CMPHYP_POS_5_MV           = 1,     /*!< POS_5_MV : Set positive hysteresis to 5 mV.                               */
  CMP_1_MODE_CMPHYP_POS_10_MV          = 2,     /*!< POS_10_MV : Set positive hysteresis to 10 mV.                             */
  CMP_1_MODE_CMPHYP_POS_20_MV          = 3,     /*!< POS_20_MV : Set positive hysteresis to 20 mV.                             */
} CMP_1_MODE_CMPHYP_Enum;

/* ===============================================  CMP_1 MODE INVEN [30..30]  =============================================== */
typedef enum {                                  /*!< CMP_1_MODE_INVEN                                                          */
  CMP_1_MODE_INVEN_DISABLED            = 0,     /*!< DISABLED : Do not invert the comparator output.                           */
  CMP_1_MODE_INVEN_ENABLED             = 1,     /*!< ENABLED : Invert the comparator output.                                   */
} CMP_1_MODE_INVEN_Enum;



/* =========================================================================================================================== */
/* ================                                         DMACTRL_0                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
/* ===========================================  DMACTRL_0 STATUS DMAENSTS [0..0]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_STATUS_DMAENSTS                                                 */
  DMACTRL_0_STATUS_DMAENSTS_NOT_SET    = 0,     /*!< NOT_SET : DMA controller is disabled                                      */
  DMACTRL_0_STATUS_DMAENSTS_SET        = 1,     /*!< SET : DMA controller is enabled.                                          */
} DMACTRL_0_STATUS_DMAENSTS_Enum;

/* =============================================  DMACTRL_0 STATUS STATE [4..7]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_STATUS_STATE                                                    */
  DMACTRL_0_STATUS_STATE_IDLE          = 0,     /*!< IDLE : Idle.                                                              */
  DMACTRL_0_STATUS_STATE_READING_CHANNEL_CONFIG = 1,/*!< READING_CHANNEL_CONFIG : Reading channel controller data.             */
  DMACTRL_0_STATUS_STATE_READING_SOURCE_POINTER = 2,/*!< READING_SOURCE_POINTER : Reading source data end pointer.             */
  DMACTRL_0_STATUS_STATE_READING_DEST_POINTER = 3,/*!< READING_DEST_POINTER : Reading destination data end pointer.            */
  DMACTRL_0_STATUS_STATE_READING_SOURCE_DATA = 4,/*!< READING_SOURCE_DATA : Reading source data.                               */
  DMACTRL_0_STATUS_STATE_WRITING_DEST_DATA = 5, /*!< WRITING_DEST_DATA : Writing destination data.                             */
  DMACTRL_0_STATUS_STATE_WAITING_DMA_REQ_CLEAR = 6,/*!< WAITING_DMA_REQ_CLEAR : Waiting for a DMA request to clear.            */
  DMACTRL_0_STATUS_STATE_WRITING_CHANNEL_CONFIG = 7,/*!< WRITING_CHANNEL_CONFIG : Writing channel controller data.             */
  DMACTRL_0_STATUS_STATE_STALLED       = 8,     /*!< STALLED : Stalled.                                                        */
  DMACTRL_0_STATUS_STATE_DONE          = 9,     /*!< DONE : Done.                                                              */
  DMACTRL_0_STATUS_STATE_SCATTER_GATHER_TRANSITION = 10,/*!< SCATTER_GATHER_TRANSITION : Peripheral scatter-gather transition. */
} DMACTRL_0_STATUS_STATE_Enum;

/* ========================================================  CONFIG  ========================================================= */
/* =============================================  DMACTRL_0 CONFIG DMAEN [0..0]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CONFIG_DMAEN                                                    */
  DMACTRL_0_CONFIG_DMAEN_DISABLED      = 0,     /*!< DISABLED : Disable the DMA controller.                                    */
  DMACTRL_0_CONFIG_DMAEN_ENABLED       = 1,     /*!< ENABLED : Enable the DMA controller.                                      */
} DMACTRL_0_CONFIG_DMAEN_Enum;

/* ========================================================  BASEPTR  ======================================================== */
/* =======================================================  ABASEPTR  ======================================================== */
/* =======================================================  CHSTATUS  ======================================================== */
/* =============================================  DMACTRL_0 CHSTATUS CH0 [0..0]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH0                                                    */
  DMACTRL_0_CHSTATUS_CH0_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 0 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH0_WAITING       = 1,     /*!< WAITING : DMA Channel 0 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH0_Enum;

/* =============================================  DMACTRL_0 CHSTATUS CH1 [1..1]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH1                                                    */
  DMACTRL_0_CHSTATUS_CH1_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 1 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH1_WAITING       = 1,     /*!< WAITING : DMA Channel 1 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH1_Enum;

