chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  DMACTRL_0 CHSTATUS CH2 [2..2]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH2                                                    */
  DMACTRL_0_CHSTATUS_CH2_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 2 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH2_WAITING       = 1,     /*!< WAITING : DMA Channel 2 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH2_Enum;

/* =============================================  DMACTRL_0 CHSTATUS CH3 [3..3]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH3                                                    */
  DMACTRL_0_CHSTATUS_CH3_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 3 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH3_WAITING       = 1,     /*!< WAITING : DMA Channel 3 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH3_Enum;

/* =============================================  DMACTRL_0 CHSTATUS CH4 [4..4]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH4                                                    */
  DMACTRL_0_CHSTATUS_CH4_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 4 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH4_WAITING       = 1,     /*!< WAITING : DMA Channel 4 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH4_Enum;

/* =============================================  DMACTRL_0 CHSTATUS CH5 [5..5]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH5                                                    */
  DMACTRL_0_CHSTATUS_CH5_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 5 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH5_WAITING       = 1,     /*!< WAITING : DMA Channel 5 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH5_Enum;

/* =============================================  DMACTRL_0 CHSTATUS CH6 [6..6]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH6                                                    */
  DMACTRL_0_CHSTATUS_CH6_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 6 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH6_WAITING       = 1,     /*!< WAITING : DMA Channel 6 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH6_Enum;

/* =============================================  DMACTRL_0 CHSTATUS CH7 [7..7]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH7                                                    */
  DMACTRL_0_CHSTATUS_CH7_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 7 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH7_WAITING       = 1,     /*!< WAITING : DMA Channel 7 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH7_Enum;

/* =============================================  DMACTRL_0 CHSTATUS CH8 [8..8]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH8                                                    */
  DMACTRL_0_CHSTATUS_CH8_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 8 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH8_WAITING       = 1,     /*!< WAITING : DMA Channel 8 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH8_Enum;

/* =============================================  DMACTRL_0 CHSTATUS CH9 [9..9]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH9                                                    */
  DMACTRL_0_CHSTATUS_CH9_NOT_WAITING   = 0,     /*!< NOT_WAITING : DMA Channel 9 is not waiting for a data request.            */
  DMACTRL_0_CHSTATUS_CH9_WAITING       = 1,     /*!< WAITING : DMA Channel 9 is waiting for a data request.                    */
} DMACTRL_0_CHSTATUS_CH9_Enum;

/* ===========================================  DMACTRL_0 CHSTATUS CH10 [10..10]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH10                                                   */
  DMACTRL_0_CHSTATUS_CH10_NOT_WAITING  = 0,     /*!< NOT_WAITING : DMA Channel 10 is not waiting for a data request.           */
  DMACTRL_0_CHSTATUS_CH10_WAITING      = 1,     /*!< WAITING : DMA Channel 10 is waiting for a data request.                   */
} DMACTRL_0_CHSTATUS_CH10_Enum;

/* ===========================================  DMACTRL_0 CHSTATUS CH11 [11..11]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH11                                                   */
  DMACTRL_0_CHSTATUS_CH11_NOT_WAITING  = 0,     /*!< NOT_WAITING : DMA Channel 11 is not waiting for a data request.           */
  DMACTRL_0_CHSTATUS_CH11_WAITING      = 1,     /*!< WAITING : DMA Channel 11 is waiting for a data request.                   */
} DMACTRL_0_CHSTATUS_CH11_Enum;

/* ===========================================  DMACTRL_0 CHSTATUS CH12 [12..12]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH12                                                   */
  DMACTRL_0_CHSTATUS_CH12_NOT_WAITING  = 0,     /*!< NOT_WAITING : DMA Channel 12 is not waiting for a data request.           */
  DMACTRL_0_CHSTATUS_CH12_WAITING      = 1,     /*!< WAITING : DMA Channel 12 is waiting for a data request.                   */
} DMACTRL_0_CHSTATUS_CH12_Enum;

