chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  DMACTRL_0 CHSTATUS CH13 [13..13]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH13                                                   */
  DMACTRL_0_CHSTATUS_CH13_NOT_WAITING  = 0,     /*!< NOT_WAITING : DMA Channel 13 is not waiting for a data request.           */
  DMACTRL_0_CHSTATUS_CH13_WAITING      = 1,     /*!< WAITING : DMA Channel 13 is waiting for a data request.                   */
} DMACTRL_0_CHSTATUS_CH13_Enum;

/* ===========================================  DMACTRL_0 CHSTATUS CH14 [14..14]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH14                                                   */
  DMACTRL_0_CHSTATUS_CH14_NOT_WAITING  = 0,     /*!< NOT_WAITING : DMA Channel 14 is not waiting for a data request.           */
  DMACTRL_0_CHSTATUS_CH14_WAITING      = 1,     /*!< WAITING : DMA Channel 14 is waiting for a data request.                   */
} DMACTRL_0_CHSTATUS_CH14_Enum;

/* ===========================================  DMACTRL_0 CHSTATUS CH15 [15..15]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSTATUS_CH15                                                   */
  DMACTRL_0_CHSTATUS_CH15_NOT_WAITING  = 0,     /*!< NOT_WAITING : DMA Channel 15 is not waiting for a data request.           */
  DMACTRL_0_CHSTATUS_CH15_WAITING      = 1,     /*!< WAITING : DMA Channel 15 is waiting for a data request.                   */
} DMACTRL_0_CHSTATUS_CH15_Enum;

/* ========================================================  CHSWRCN  ======================================================== */
/* =============================================  DMACTRL_0 CHSWRCN CH0 [0..0]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH0                                                     */
  DMACTRL_0_CHSWRCN_CH0_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 0 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH0_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 0 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH0_Enum;

/* =============================================  DMACTRL_0 CHSWRCN CH1 [1..1]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH1                                                     */
  DMACTRL_0_CHSWRCN_CH1_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 1 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH1_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 1 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH1_Enum;

/* =============================================  DMACTRL_0 CHSWRCN CH2 [2..2]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH2                                                     */
  DMACTRL_0_CHSWRCN_CH2_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 2 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH2_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 2 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH2_Enum;

/* =============================================  DMACTRL_0 CHSWRCN CH3 [3..3]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH3                                                     */
  DMACTRL_0_CHSWRCN_CH3_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 3 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH3_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 3 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH3_Enum;

/* =============================================  DMACTRL_0 CHSWRCN CH4 [4..4]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH4                                                     */
  DMACTRL_0_CHSWRCN_CH4_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 4 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH4_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 4 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH4_Enum;

/* =============================================  DMACTRL_0 CHSWRCN CH5 [5..5]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH5                                                     */
  DMACTRL_0_CHSWRCN_CH5_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 5 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH5_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 5 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH5_Enum;

/* =============================================  DMACTRL_0 CHSWRCN CH6 [6..6]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH6                                                     */
  DMACTRL_0_CHSWRCN_CH6_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 6 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH6_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 6 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH6_Enum;

/* =============================================  DMACTRL_0 CHSWRCN CH7 [7..7]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH7                                                     */
  DMACTRL_0_CHSWRCN_CH7_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 7 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH7_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 7 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH7_Enum;

/* =============================================  DMACTRL_0 CHSWRCN CH8 [8..8]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH8                                                     */
  DMACTRL_0_CHSWRCN_CH8_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 8 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH8_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 8 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH8_Enum;

