chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  DMACTRL_0 CHSWRCN CH9 [9..9]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH9                                                     */
  DMACTRL_0_CHSWRCN_CH9_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 9 does not generate a software
                                                     data request.                                                             */
  DMACTRL_0_CHSWRCN_CH9_GENERATE_SW_REQ = 1,    /*!< GENERATE_SW_REQ : DMA Channel 9 generates a software data request.        */
} DMACTRL_0_CHSWRCN_CH9_Enum;

/* ============================================  DMACTRL_0 CHSWRCN CH10 [10..10]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH10                                                    */
  DMACTRL_0_CHSWRCN_CH10_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 10 does not generate a
                                                     software data request.                                                    */
  DMACTRL_0_CHSWRCN_CH10_GENERATE_SW_REQ = 1,   /*!< GENERATE_SW_REQ : DMA Channel 10 generates a software data request.       */
} DMACTRL_0_CHSWRCN_CH10_Enum;

/* ============================================  DMACTRL_0 CHSWRCN CH11 [11..11]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH11                                                    */
  DMACTRL_0_CHSWRCN_CH11_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 11 does not generate a
                                                     software data request.                                                    */
  DMACTRL_0_CHSWRCN_CH11_GENERATE_SW_REQ = 1,   /*!< GENERATE_SW_REQ : DMA Channel 11 generates a software data request.       */
} DMACTRL_0_CHSWRCN_CH11_Enum;

/* ============================================  DMACTRL_0 CHSWRCN CH12 [12..12]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH12                                                    */
  DMACTRL_0_CHSWRCN_CH12_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 12 does not generate a
                                                     software data request.                                                    */
  DMACTRL_0_CHSWRCN_CH12_GENERATE_SW_REQ = 1,   /*!< GENERATE_SW_REQ : DMA Channel 12 generates a software data request.       */
} DMACTRL_0_CHSWRCN_CH12_Enum;

/* ============================================  DMACTRL_0 CHSWRCN CH13 [13..13]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH13                                                    */
  DMACTRL_0_CHSWRCN_CH13_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 13 does not generate a
                                                     software data request.                                                    */
  DMACTRL_0_CHSWRCN_CH13_GENERATE_SW_REQ = 1,   /*!< GENERATE_SW_REQ : DMA Channel 13 generates a software data request.       */
} DMACTRL_0_CHSWRCN_CH13_Enum;

/* ============================================  DMACTRL_0 CHSWRCN CH14 [14..14]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH14                                                    */
  DMACTRL_0_CHSWRCN_CH14_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 14 does not generate a
                                                     software data request.                                                    */
  DMACTRL_0_CHSWRCN_CH14_GENERATE_SW_REQ = 1,   /*!< GENERATE_SW_REQ : DMA Channel 14 generates a software data request.       */
} DMACTRL_0_CHSWRCN_CH14_Enum;

/* ============================================  DMACTRL_0 CHSWRCN CH15 [15..15]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHSWRCN_CH15                                                    */
  DMACTRL_0_CHSWRCN_CH15_DO_NOT_GENERATE_SW_REQ = 0,/*!< DO_NOT_GENERATE_SW_REQ : DMA Channel 15 does not generate a
                                                     software data request.                                                    */
  DMACTRL_0_CHSWRCN_CH15_GENERATE_SW_REQ = 1,   /*!< GENERATE_SW_REQ : DMA Channel 15 generates a software data request.       */
} DMACTRL_0_CHSWRCN_CH15_Enum;

/* =======================================================  CHREQMSET  ======================================================= */
/* ============================================  DMACTRL_0 CHREQMSET CH0 [0..0]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH0                                                   */
  DMACTRL_0_CHREQMSET_CH0_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 0 peripheral data requests enabled.
                                                     1: DMA Channel 0 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     0 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH0_Enum;

/* ============================================  DMACTRL_0 CHREQMSET CH1 [1..1]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH1                                                   */
  DMACTRL_0_CHREQMSET_CH1_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 1 peripheral data requests enabled.
                                                     1: DMA Channel 1 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     1 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH1_Enum;

