chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  DMACTRL_0 CHREQMSET CH2 [2..2]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH2                                                   */
  DMACTRL_0_CHREQMSET_CH2_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 2 peripheral data requests enabled.
                                                     1: DMA Channel 2 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     2 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH2_Enum;

/* ============================================  DMACTRL_0 CHREQMSET CH3 [3..3]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH3                                                   */
  DMACTRL_0_CHREQMSET_CH3_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 3 peripheral data requests enabled.
                                                     1: DMA Channel 3 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     3 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH3_Enum;

/* ============================================  DMACTRL_0 CHREQMSET CH4 [4..4]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH4                                                   */
  DMACTRL_0_CHREQMSET_CH4_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 4 peripheral data requests enabled.
                                                     1: DMA Channel 4 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     4 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH4_Enum;

/* ============================================  DMACTRL_0 CHREQMSET CH5 [5..5]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH5                                                   */
  DMACTRL_0_CHREQMSET_CH5_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 5 peripheral data requests enabled.
                                                     1: DMA Channel 5 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     5 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH5_Enum;

/* ============================================  DMACTRL_0 CHREQMSET CH6 [6..6]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH6                                                   */
  DMACTRL_0_CHREQMSET_CH6_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 6 peripheral data requests enabled.
                                                     1: DMA Channel 6 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     6 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH6_Enum;

/* ============================================  DMACTRL_0 CHREQMSET CH7 [7..7]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH7                                                   */
  DMACTRL_0_CHREQMSET_CH7_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 7 peripheral data requests enabled.
                                                     1: DMA Channel 7 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     7 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH7_Enum;

/* ============================================  DMACTRL_0 CHREQMSET CH8 [8..8]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH8                                                   */
  DMACTRL_0_CHREQMSET_CH8_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 8 peripheral data requests enabled.
                                                     1: DMA Channel 8 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     8 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH8_Enum;

/* ============================================  DMACTRL_0 CHREQMSET CH9 [9..9]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH9                                                   */
  DMACTRL_0_CHREQMSET_CH9_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 9 peripheral data requests enabled.
                                                     1: DMA Channel 9 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     9 peripheral data requests.                                               */
} DMACTRL_0_CHREQMSET_CH9_Enum;

