chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  DMACTRL_0 CHREQMSET CH10 [10..10]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH10                                                  */
  DMACTRL_0_CHREQMSET_CH10_ENABLED     = 1,     /*!< ENABLED : Read: 0: DMA Channel 10 peripheral data requests enabled.
                                                     1: DMA Channel 10 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     10 peripheral data requests.                                              */
} DMACTRL_0_CHREQMSET_CH10_Enum;

/* ===========================================  DMACTRL_0 CHREQMSET CH11 [11..11]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH11                                                  */
  DMACTRL_0_CHREQMSET_CH11_ENABLED     = 1,     /*!< ENABLED : Read: 0: DMA Channel 11 peripheral data requests enabled.
                                                     1: DMA Channel 11 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     11 peripheral data requests.                                              */
} DMACTRL_0_CHREQMSET_CH11_Enum;

/* ===========================================  DMACTRL_0 CHREQMSET CH12 [12..12]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH12                                                  */
  DMACTRL_0_CHREQMSET_CH12_ENABLED     = 1,     /*!< ENABLED : Read: 0: DMA Channel 12 peripheral data requests enabled.
                                                     1: DMA Channel 12 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     12 peripheral data requests.                                              */
} DMACTRL_0_CHREQMSET_CH12_Enum;

/* ===========================================  DMACTRL_0 CHREQMSET CH13 [13..13]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH13                                                  */
  DMACTRL_0_CHREQMSET_CH13_ENABLED     = 1,     /*!< ENABLED : Read: 0: DMA Channel 13 peripheral data requests enabled.
                                                     1: DMA Channel 13 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     13 peripheral data requests.                                              */
} DMACTRL_0_CHREQMSET_CH13_Enum;

/* ===========================================  DMACTRL_0 CHREQMSET CH14 [14..14]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH14                                                  */
  DMACTRL_0_CHREQMSET_CH14_ENABLED     = 1,     /*!< ENABLED : Read: 0: DMA Channel 14 peripheral data requests enabled.
                                                     1: DMA Channel 14 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     14 peripheral data requests.                                              */
} DMACTRL_0_CHREQMSET_CH14_Enum;

/* ===========================================  DMACTRL_0 CHREQMSET CH15 [15..15]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMSET_CH15                                                  */
  DMACTRL_0_CHREQMSET_CH15_ENABLED     = 1,     /*!< ENABLED : Read: 0: DMA Channel 15 peripheral data requests enabled.
                                                     1: DMA Channel 15 peripheral data requests disabled. Write:
                                                     0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel
                                                     15 peripheral data requests.                                              */
} DMACTRL_0_CHREQMSET_CH15_Enum;

/* =======================================================  CHREQMCLR  ======================================================= */
/* ============================================  DMACTRL_0 CHREQMCLR CH0 [0..0]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH0                                                   */
  DMACTRL_0_CHREQMCLR_CH0_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 0 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH0_Enum;

/* ============================================  DMACTRL_0 CHREQMCLR CH1 [1..1]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH1                                                   */
  DMACTRL_0_CHREQMCLR_CH1_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 1 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH1_Enum;

/* ============================================  DMACTRL_0 CHREQMCLR CH2 [2..2]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH2                                                   */
  DMACTRL_0_CHREQMCLR_CH2_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 2 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH2_Enum;

/* ============================================  DMACTRL_0 CHREQMCLR CH3 [3..3]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH3                                                   */
  DMACTRL_0_CHREQMCLR_CH3_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 3 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH3_Enum;

