chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  DMACTRL_0 CHREQMCLR CH4 [4..4]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH4                                                   */
  DMACTRL_0_CHREQMCLR_CH4_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 4 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH4_Enum;

/* ============================================  DMACTRL_0 CHREQMCLR CH5 [5..5]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH5                                                   */
  DMACTRL_0_CHREQMCLR_CH5_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 5 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH5_Enum;

/* ============================================  DMACTRL_0 CHREQMCLR CH6 [6..6]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH6                                                   */
  DMACTRL_0_CHREQMCLR_CH6_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 6 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH6_Enum;

/* ============================================  DMACTRL_0 CHREQMCLR CH7 [7..7]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH7                                                   */
  DMACTRL_0_CHREQMCLR_CH7_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 7 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH7_Enum;

/* ============================================  DMACTRL_0 CHREQMCLR CH8 [8..8]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH8                                                   */
  DMACTRL_0_CHREQMCLR_CH8_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 8 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH8_Enum;

/* ============================================  DMACTRL_0 CHREQMCLR CH9 [9..9]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH9                                                   */
  DMACTRL_0_CHREQMCLR_CH9_DISABLED     = 1,     /*!< DISABLED : Enable DMA Channel 9 peripheral data requests.                 */
} DMACTRL_0_CHREQMCLR_CH9_Enum;

/* ===========================================  DMACTRL_0 CHREQMCLR CH10 [10..10]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH10                                                  */
  DMACTRL_0_CHREQMCLR_CH10_DISABLED    = 1,     /*!< DISABLED : Enable DMA Channel 10 peripheral data requests.                */
} DMACTRL_0_CHREQMCLR_CH10_Enum;

/* ===========================================  DMACTRL_0 CHREQMCLR CH11 [11..11]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH11                                                  */
  DMACTRL_0_CHREQMCLR_CH11_DISABLED    = 1,     /*!< DISABLED : Enable DMA Channel 11 peripheral data requests.                */
} DMACTRL_0_CHREQMCLR_CH11_Enum;

/* ===========================================  DMACTRL_0 CHREQMCLR CH12 [12..12]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH12                                                  */
  DMACTRL_0_CHREQMCLR_CH12_DISABLED    = 1,     /*!< DISABLED : Enable DMA Channel 12 peripheral data requests.                */
} DMACTRL_0_CHREQMCLR_CH12_Enum;

/* ===========================================  DMACTRL_0 CHREQMCLR CH13 [13..13]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH13                                                  */
  DMACTRL_0_CHREQMCLR_CH13_DISABLED    = 1,     /*!< DISABLED : Enable DMA Channel 13 peripheral data requests.                */
} DMACTRL_0_CHREQMCLR_CH13_Enum;

/* ===========================================  DMACTRL_0 CHREQMCLR CH14 [14..14]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH14                                                  */
  DMACTRL_0_CHREQMCLR_CH14_DISABLED    = 1,     /*!< DISABLED : Enable DMA Channel 14 peripheral data requests.                */
} DMACTRL_0_CHREQMCLR_CH14_Enum;

/* ===========================================  DMACTRL_0 CHREQMCLR CH15 [15..15]  =========================================== */
typedef enum {                                  /*!< DMACTRL_0_CHREQMCLR_CH15                                                  */
  DMACTRL_0_CHREQMCLR_CH15_DISABLED    = 1,     /*!< DISABLED : Enable DMA Channel 15 peripheral data requests.                */
} DMACTRL_0_CHREQMCLR_CH15_Enum;

/* ========================================================  CHENSET  ======================================================== */
/* =============================================  DMACTRL_0 CHENSET CH0 [0..0]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH0                                                     */
  DMACTRL_0_CHENSET_CH0_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 0 disabled. 1: DMA Channel 0
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 0.                                                     */
} DMACTRL_0_CHENSET_CH0_Enum;

/* =============================================  DMACTRL_0 CHENSET CH1 [1..1]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH1                                                     */
  DMACTRL_0_CHENSET_CH1_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 1 disabled. 1: DMA Channel 1
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 1.                                                     */
} DMACTRL_0_CHENSET_CH1_Enum;

/* =============================================  DMACTRL_0 CHENSET CH2 [2..2]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH2                                                     */
  DMACTRL_0_CHENSET_CH2_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 2 disabled. 1: DMA Channel 2
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 2.                                                     */
} DMACTRL_0_CHENSET_CH2_Enum;

/* =============================================  DMACTRL_0 CHENSET CH3 [3..3]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH3                                                     */
  DMACTRL_0_CHENSET_CH3_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 3 disabled. 1: DMA Channel 3
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 3.                                                     */
} DMACTRL_0_CHENSET_CH3_Enum;

