chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  DMACTRL_0 CHENSET CH4 [4..4]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH4                                                     */
  DMACTRL_0_CHENSET_CH4_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 4 disabled. 1: DMA Channel 4
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 4.                                                     */
} DMACTRL_0_CHENSET_CH4_Enum;

/* =============================================  DMACTRL_0 CHENSET CH5 [5..5]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH5                                                     */
  DMACTRL_0_CHENSET_CH5_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 5 disabled. 1: DMA Channel 5
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 5.                                                     */
} DMACTRL_0_CHENSET_CH5_Enum;

/* =============================================  DMACTRL_0 CHENSET CH6 [6..6]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH6                                                     */
  DMACTRL_0_CHENSET_CH6_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 6 disabled. 1: DMA Channel 6
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 6.                                                     */
} DMACTRL_0_CHENSET_CH6_Enum;

/* =============================================  DMACTRL_0 CHENSET CH7 [7..7]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH7                                                     */
  DMACTRL_0_CHENSET_CH7_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 7 disabled. 1: DMA Channel 7
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 7.                                                     */
} DMACTRL_0_CHENSET_CH7_Enum;

/* =============================================  DMACTRL_0 CHENSET CH8 [8..8]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH8                                                     */
  DMACTRL_0_CHENSET_CH8_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 8 disabled. 1: DMA Channel 8
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 8.                                                     */
} DMACTRL_0_CHENSET_CH8_Enum;

/* =============================================  DMACTRL_0 CHENSET CH9 [9..9]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH9                                                     */
  DMACTRL_0_CHENSET_CH9_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 9 disabled. 1: DMA Channel 9
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 9.                                                     */
} DMACTRL_0_CHENSET_CH9_Enum;

/* ============================================  DMACTRL_0 CHENSET CH10 [10..10]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH10                                                    */
  DMACTRL_0_CHENSET_CH10_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 10 disabled. 1: DMA Channel 10
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 10.                                                    */
} DMACTRL_0_CHENSET_CH10_Enum;

/* ============================================  DMACTRL_0 CHENSET CH11 [11..11]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH11                                                    */
  DMACTRL_0_CHENSET_CH11_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 11 disabled. 1: DMA Channel 11
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 11.                                                    */
} DMACTRL_0_CHENSET_CH11_Enum;

/* ============================================  DMACTRL_0 CHENSET CH12 [12..12]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH12                                                    */
  DMACTRL_0_CHENSET_CH12_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 12 disabled. 1: DMA Channel 12
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 12.                                                    */
} DMACTRL_0_CHENSET_CH12_Enum;

/* ============================================  DMACTRL_0 CHENSET CH13 [13..13]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH13                                                    */
  DMACTRL_0_CHENSET_CH13_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 13 disabled. 1: DMA Channel 13
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 13.                                                    */
} DMACTRL_0_CHENSET_CH13_Enum;

/* ============================================  DMACTRL_0 CHENSET CH14 [14..14]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH14                                                    */
  DMACTRL_0_CHENSET_CH14_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 14 disabled. 1: DMA Channel 14
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 14.                                                    */
} DMACTRL_0_CHENSET_CH14_Enum;

/* ============================================  DMACTRL_0 CHENSET CH15 [15..15]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENSET_CH15                                                    */
  DMACTRL_0_CHENSET_CH15_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 15 disabled. 1: DMA Channel 15
                                                     enabled. Write: 0: No effect (use CHENCLR to clear). 1:
                                                     Enable DMA Channel 15.                                                    */
} DMACTRL_0_CHENSET_CH15_Enum;

