chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CHENCLR  ======================================================== */
/* =============================================  DMACTRL_0 CHENCLR CH0 [0..0]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH0                                                     */
  DMACTRL_0_CHENCLR_CH0_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 0.                                         */
} DMACTRL_0_CHENCLR_CH0_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH1 [1..1]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH1                                                     */
  DMACTRL_0_CHENCLR_CH1_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 1.                                         */
} DMACTRL_0_CHENCLR_CH1_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH2 [2..2]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH2                                                     */
  DMACTRL_0_CHENCLR_CH2_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 2.                                         */
} DMACTRL_0_CHENCLR_CH2_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH3 [3..3]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH3                                                     */
  DMACTRL_0_CHENCLR_CH3_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 3.                                         */
} DMACTRL_0_CHENCLR_CH3_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH4 [4..4]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH4                                                     */
  DMACTRL_0_CHENCLR_CH4_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 4.                                         */
} DMACTRL_0_CHENCLR_CH4_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH5 [5..5]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH5                                                     */
  DMACTRL_0_CHENCLR_CH5_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 5.                                         */
} DMACTRL_0_CHENCLR_CH5_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH6 [6..6]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH6                                                     */
  DMACTRL_0_CHENCLR_CH6_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 6.                                         */
} DMACTRL_0_CHENCLR_CH6_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH7 [7..7]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH7                                                     */
  DMACTRL_0_CHENCLR_CH7_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 7.                                         */
} DMACTRL_0_CHENCLR_CH7_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH8 [8..8]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH8                                                     */
  DMACTRL_0_CHENCLR_CH8_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 8.                                         */
} DMACTRL_0_CHENCLR_CH8_Enum;

/* =============================================  DMACTRL_0 CHENCLR CH9 [9..9]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH9                                                     */
  DMACTRL_0_CHENCLR_CH9_DISABLED       = 1,     /*!< DISABLED : Disable DMA Channel 9.                                         */
} DMACTRL_0_CHENCLR_CH9_Enum;

/* ============================================  DMACTRL_0 CHENCLR CH10 [10..10]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH10                                                    */
  DMACTRL_0_CHENCLR_CH10_DISABLED      = 1,     /*!< DISABLED : Disable DMA Channel 10.                                        */
} DMACTRL_0_CHENCLR_CH10_Enum;

/* ============================================  DMACTRL_0 CHENCLR CH11 [11..11]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH11                                                    */
  DMACTRL_0_CHENCLR_CH11_DISABLED      = 1,     /*!< DISABLED : Disable DMA Channel 11.                                        */
} DMACTRL_0_CHENCLR_CH11_Enum;

/* ============================================  DMACTRL_0 CHENCLR CH12 [12..12]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH12                                                    */
  DMACTRL_0_CHENCLR_CH12_DISABLED      = 1,     /*!< DISABLED : Disable DMA Channel 12.                                        */
} DMACTRL_0_CHENCLR_CH12_Enum;

/* ============================================  DMACTRL_0 CHENCLR CH13 [13..13]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH13                                                    */
  DMACTRL_0_CHENCLR_CH13_DISABLED      = 1,     /*!< DISABLED : Disable DMA Channel 13.                                        */
} DMACTRL_0_CHENCLR_CH13_Enum;

/* ============================================  DMACTRL_0 CHENCLR CH14 [14..14]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH14                                                    */
  DMACTRL_0_CHENCLR_CH14_DISABLED      = 1,     /*!< DISABLED : Disable DMA Channel 14.                                        */
} DMACTRL_0_CHENCLR_CH14_Enum;

/* ============================================  DMACTRL_0 CHENCLR CH15 [15..15]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHENCLR_CH15                                                    */
  DMACTRL_0_CHENCLR_CH15_DISABLED      = 1,     /*!< DISABLED : Disable DMA Channel 15.                                        */
} DMACTRL_0_CHENCLR_CH15_Enum;

