chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  CHALTSET  ======================================================== */
/* =============================================  DMACTRL_0 CHALTSET CH0 [0..0]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH0                                                    */
  DMACTRL_0_CHALTSET_CH0_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 0 is using primary data structure.
                                                     1: DMA Channel 0 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 0.                                         */
} DMACTRL_0_CHALTSET_CH0_Enum;

/* =============================================  DMACTRL_0 CHALTSET CH1 [1..1]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH1                                                    */
  DMACTRL_0_CHALTSET_CH1_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 1 is using primary data structure.
                                                     1: DMA Channel 1 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 1.                                         */
} DMACTRL_0_CHALTSET_CH1_Enum;

/* =============================================  DMACTRL_0 CHALTSET CH2 [2..2]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH2                                                    */
  DMACTRL_0_CHALTSET_CH2_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 2 is using primary data structure.
                                                     1: DMA Channel 2 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 2.                                         */
} DMACTRL_0_CHALTSET_CH2_Enum;

/* =============================================  DMACTRL_0 CHALTSET CH3 [3..3]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH3                                                    */
  DMACTRL_0_CHALTSET_CH3_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 3 is using primary data structure.
                                                     1: DMA Channel 3 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 3.                                         */
} DMACTRL_0_CHALTSET_CH3_Enum;

/* =============================================  DMACTRL_0 CHALTSET CH4 [4..4]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH4                                                    */
  DMACTRL_0_CHALTSET_CH4_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 4 is using primary data structure.
                                                     1: DMA Channel 4 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 4.                                         */
} DMACTRL_0_CHALTSET_CH4_Enum;

/* =============================================  DMACTRL_0 CHALTSET CH5 [5..5]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH5                                                    */
  DMACTRL_0_CHALTSET_CH5_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 5 is using primary data structure.
                                                     1: DMA Channel 5 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 5.                                         */
} DMACTRL_0_CHALTSET_CH5_Enum;

/* =============================================  DMACTRL_0 CHALTSET CH6 [6..6]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH6                                                    */
  DMACTRL_0_CHALTSET_CH6_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 6 is using primary data structure.
                                                     1: DMA Channel 6 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 6.                                         */
} DMACTRL_0_CHALTSET_CH6_Enum;

/* =============================================  DMACTRL_0 CHALTSET CH7 [7..7]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH7                                                    */
  DMACTRL_0_CHALTSET_CH7_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 7 is using primary data structure.
                                                     1: DMA Channel 7 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 7.                                         */
} DMACTRL_0_CHALTSET_CH7_Enum;

/* =============================================  DMACTRL_0 CHALTSET CH8 [8..8]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH8                                                    */
  DMACTRL_0_CHALTSET_CH8_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 8 is using primary data structure.
                                                     1: DMA Channel 8 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 8.                                         */
} DMACTRL_0_CHALTSET_CH8_Enum;

