chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  DMACTRL_0 CHALTSET CH9 [9..9]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH9                                                    */
  DMACTRL_0_CHALTSET_CH9_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 9 is using primary data structure.
                                                     1: DMA Channel 9 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 9.                                         */
} DMACTRL_0_CHALTSET_CH9_Enum;

/* ===========================================  DMACTRL_0 CHALTSET CH10 [10..10]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH10                                                   */
  DMACTRL_0_CHALTSET_CH10_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 10 is using primary data structure.
                                                     1: DMA Channel 10 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 10.                                        */
} DMACTRL_0_CHALTSET_CH10_Enum;

/* ===========================================  DMACTRL_0 CHALTSET CH11 [11..11]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH11                                                   */
  DMACTRL_0_CHALTSET_CH11_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 11 is using primary data structure.
                                                     1: DMA Channel 11 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 11.                                        */
} DMACTRL_0_CHALTSET_CH11_Enum;

/* ===========================================  DMACTRL_0 CHALTSET CH12 [12..12]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH12                                                   */
  DMACTRL_0_CHALTSET_CH12_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 12 is using primary data structure.
                                                     1: DMA Channel 12 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 12.                                        */
} DMACTRL_0_CHALTSET_CH12_Enum;

/* ===========================================  DMACTRL_0 CHALTSET CH13 [13..13]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH13                                                   */
  DMACTRL_0_CHALTSET_CH13_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 13 is using primary data structure.
                                                     1: DMA Channel 13 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 13.                                        */
} DMACTRL_0_CHALTSET_CH13_Enum;

/* ===========================================  DMACTRL_0 CHALTSET CH14 [14..14]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH14                                                   */
  DMACTRL_0_CHALTSET_CH14_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 14 is using primary data structure.
                                                     1: DMA Channel 14 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 14.                                        */
} DMACTRL_0_CHALTSET_CH14_Enum;

/* ===========================================  DMACTRL_0 CHALTSET CH15 [15..15]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTSET_CH15                                                   */
  DMACTRL_0_CHALTSET_CH15_ENABLED      = 1,     /*!< ENABLED : Read: 0: DMA Channel 15 is using primary data structure.
                                                     1: DMA Channel 15 is using alternate data structure. Write:
                                                     0: No effect (use CHALTCLR to clear). 1: Use the alternate
                                                     data structure for DMA Channel 15.                                        */
} DMACTRL_0_CHALTSET_CH15_Enum;

/* =======================================================  CHALTCLR  ======================================================== */
/* =============================================  DMACTRL_0 CHALTCLR CH0 [0..0]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH0                                                    */
  DMACTRL_0_CHALTCLR_CH0_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 0.              */
} DMACTRL_0_CHALTCLR_CH0_Enum;

/* =============================================  DMACTRL_0 CHALTCLR CH1 [1..1]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH1                                                    */
  DMACTRL_0_CHALTCLR_CH1_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 1.              */
} DMACTRL_0_CHALTCLR_CH1_Enum;

/* =============================================  DMACTRL_0 CHALTCLR CH2 [2..2]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH2                                                    */
  DMACTRL_0_CHALTCLR_CH2_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 2.              */
} DMACTRL_0_CHALTCLR_CH2_Enum;

