chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  DMACTRL_0 CHALTCLR CH3 [3..3]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH3                                                    */
  DMACTRL_0_CHALTCLR_CH3_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 3.              */
} DMACTRL_0_CHALTCLR_CH3_Enum;

/* =============================================  DMACTRL_0 CHALTCLR CH4 [4..4]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH4                                                    */
  DMACTRL_0_CHALTCLR_CH4_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 4.              */
} DMACTRL_0_CHALTCLR_CH4_Enum;

/* =============================================  DMACTRL_0 CHALTCLR CH5 [5..5]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH5                                                    */
  DMACTRL_0_CHALTCLR_CH5_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 5.              */
} DMACTRL_0_CHALTCLR_CH5_Enum;

/* =============================================  DMACTRL_0 CHALTCLR CH6 [6..6]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH6                                                    */
  DMACTRL_0_CHALTCLR_CH6_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 6.              */
} DMACTRL_0_CHALTCLR_CH6_Enum;

/* =============================================  DMACTRL_0 CHALTCLR CH7 [7..7]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH7                                                    */
  DMACTRL_0_CHALTCLR_CH7_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 7.              */
} DMACTRL_0_CHALTCLR_CH7_Enum;

/* =============================================  DMACTRL_0 CHALTCLR CH8 [8..8]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH8                                                    */
  DMACTRL_0_CHALTCLR_CH8_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 8.              */
} DMACTRL_0_CHALTCLR_CH8_Enum;

/* =============================================  DMACTRL_0 CHALTCLR CH9 [9..9]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH9                                                    */
  DMACTRL_0_CHALTCLR_CH9_DISABLED      = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 9.              */
} DMACTRL_0_CHALTCLR_CH9_Enum;

/* ===========================================  DMACTRL_0 CHALTCLR CH10 [10..10]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH10                                                   */
  DMACTRL_0_CHALTCLR_CH10_DISABLED     = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 10.             */
} DMACTRL_0_CHALTCLR_CH10_Enum;

/* ===========================================  DMACTRL_0 CHALTCLR CH11 [11..11]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH11                                                   */
  DMACTRL_0_CHALTCLR_CH11_DISABLED     = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 11.             */
} DMACTRL_0_CHALTCLR_CH11_Enum;

/* ===========================================  DMACTRL_0 CHALTCLR CH12 [12..12]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH12                                                   */
  DMACTRL_0_CHALTCLR_CH12_DISABLED     = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 12.             */
} DMACTRL_0_CHALTCLR_CH12_Enum;

/* ===========================================  DMACTRL_0 CHALTCLR CH13 [13..13]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH13                                                   */
  DMACTRL_0_CHALTCLR_CH13_DISABLED     = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 13.             */
} DMACTRL_0_CHALTCLR_CH13_Enum;

/* ===========================================  DMACTRL_0 CHALTCLR CH14 [14..14]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH14                                                   */
  DMACTRL_0_CHALTCLR_CH14_DISABLED     = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 14.             */
} DMACTRL_0_CHALTCLR_CH14_Enum;

/* ===========================================  DMACTRL_0 CHALTCLR CH15 [15..15]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHALTCLR_CH15                                                   */
  DMACTRL_0_CHALTCLR_CH15_DISABLED     = 1,     /*!< DISABLED : Use the primary data structure for DMA Channel 15.             */
} DMACTRL_0_CHALTCLR_CH15_Enum;

/* ========================================================  CHHPSET  ======================================================== */
/* =============================================  DMACTRL_0 CHHPSET CH0 [0..0]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH0                                                     */
  DMACTRL_0_CHHPSET_CH0_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 0 is using the default priority
                                                     level. 1: DMA Channel 0 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 0.                                    */
} DMACTRL_0_CHHPSET_CH0_Enum;

