chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  DMACTRL_0 CHHPSET CH1 [1..1]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH1                                                     */
  DMACTRL_0_CHHPSET_CH1_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 1 is using the default priority
                                                     level. 1: DMA Channel 1 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 1.                                    */
} DMACTRL_0_CHHPSET_CH1_Enum;

/* =============================================  DMACTRL_0 CHHPSET CH2 [2..2]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH2                                                     */
  DMACTRL_0_CHHPSET_CH2_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 2 is using the default priority
                                                     level. 1: DMA Channel 2 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 2.                                    */
} DMACTRL_0_CHHPSET_CH2_Enum;

/* =============================================  DMACTRL_0 CHHPSET CH3 [3..3]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH3                                                     */
  DMACTRL_0_CHHPSET_CH3_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 3 is using the default priority
                                                     level. 1: DMA Channel 3 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 3.                                    */
} DMACTRL_0_CHHPSET_CH3_Enum;

/* =============================================  DMACTRL_0 CHHPSET CH4 [4..4]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH4                                                     */
  DMACTRL_0_CHHPSET_CH4_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 4 is using the default priority
                                                     level. 1: DMA Channel 4 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 4.                                    */
} DMACTRL_0_CHHPSET_CH4_Enum;

/* =============================================  DMACTRL_0 CHHPSET CH5 [5..5]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH5                                                     */
  DMACTRL_0_CHHPSET_CH5_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 5 is using the default priority
                                                     level. 1: DMA Channel 5 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 5.                                    */
} DMACTRL_0_CHHPSET_CH5_Enum;

/* =============================================  DMACTRL_0 CHHPSET CH6 [6..6]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH6                                                     */
  DMACTRL_0_CHHPSET_CH6_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 6 is using the default priority
                                                     level. 1: DMA Channel 6 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 6.                                    */
} DMACTRL_0_CHHPSET_CH6_Enum;

/* =============================================  DMACTRL_0 CHHPSET CH7 [7..7]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH7                                                     */
  DMACTRL_0_CHHPSET_CH7_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 7 is using the default priority
                                                     level. 1: DMA Channel 7 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 7.                                    */
} DMACTRL_0_CHHPSET_CH7_Enum;

/* =============================================  DMACTRL_0 CHHPSET CH8 [8..8]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH8                                                     */
  DMACTRL_0_CHHPSET_CH8_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 8 is using the default priority
                                                     level. 1: DMA Channel 8 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 8.                                    */
} DMACTRL_0_CHHPSET_CH8_Enum;

