chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  DMACTRL_0 CHHPSET CH9 [9..9]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH9                                                     */
  DMACTRL_0_CHHPSET_CH9_ENABLED        = 1,     /*!< ENABLED : Read: 0: DMA Channel 9 is using the default priority
                                                     level. 1: DMA Channel 9 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 9.                                    */
} DMACTRL_0_CHHPSET_CH9_Enum;

/* ============================================  DMACTRL_0 CHHPSET CH10 [10..10]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH10                                                    */
  DMACTRL_0_CHHPSET_CH10_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 10 is using the default priority
                                                     level. 1: DMA Channel 10 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 10.                                   */
} DMACTRL_0_CHHPSET_CH10_Enum;

/* ============================================  DMACTRL_0 CHHPSET CH11 [11..11]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH11                                                    */
  DMACTRL_0_CHHPSET_CH11_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 11 is using the default priority
                                                     level. 1: DMA Channel 11 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 11.                                   */
} DMACTRL_0_CHHPSET_CH11_Enum;

/* ============================================  DMACTRL_0 CHHPSET CH12 [12..12]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH12                                                    */
  DMACTRL_0_CHHPSET_CH12_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 12 is using the default priority
                                                     level. 1: DMA Channel 12 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 12.                                   */
} DMACTRL_0_CHHPSET_CH12_Enum;

/* ============================================  DMACTRL_0 CHHPSET CH13 [13..13]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH13                                                    */
  DMACTRL_0_CHHPSET_CH13_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 13 is using the default priority
                                                     level. 1: DMA Channel 13 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 13.                                   */
} DMACTRL_0_CHHPSET_CH13_Enum;

/* ============================================  DMACTRL_0 CHHPSET CH14 [14..14]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH14                                                    */
  DMACTRL_0_CHHPSET_CH14_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 14 is using the default priority
                                                     level. 1: DMA Channel 14 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 14.                                   */
} DMACTRL_0_CHHPSET_CH14_Enum;

/* ============================================  DMACTRL_0 CHHPSET CH15 [15..15]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPSET_CH15                                                    */
  DMACTRL_0_CHHPSET_CH15_ENABLED       = 1,     /*!< ENABLED : Read: 0: DMA Channel 15 is using the default priority
                                                     level. 1: DMA Channel 15 is using the high priority level.
                                                     Write: 0: No effect (use CHHPCLR to clear). 1: Use the
                                                     high priority level for DMA Channel 15.                                   */
} DMACTRL_0_CHHPSET_CH15_Enum;

/* ========================================================  CHHPCLR  ======================================================== */
/* =============================================  DMACTRL_0 CHHPCLR CH0 [0..0]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH0                                                     */
  DMACTRL_0_CHHPCLR_CH0_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 0.                  */
} DMACTRL_0_CHHPCLR_CH0_Enum;

/* =============================================  DMACTRL_0 CHHPCLR CH1 [1..1]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH1                                                     */
  DMACTRL_0_CHHPCLR_CH1_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 1.                  */
} DMACTRL_0_CHHPCLR_CH1_Enum;

/* =============================================  DMACTRL_0 CHHPCLR CH2 [2..2]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH2                                                     */
  DMACTRL_0_CHHPCLR_CH2_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 2.                  */
} DMACTRL_0_CHHPCLR_CH2_Enum;

/* =============================================  DMACTRL_0 CHHPCLR CH3 [3..3]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH3                                                     */
  DMACTRL_0_CHHPCLR_CH3_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 3.                  */
} DMACTRL_0_CHHPCLR_CH3_Enum;

