chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  DMACTRL_0 CHHPCLR CH4 [4..4]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH4                                                     */
  DMACTRL_0_CHHPCLR_CH4_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 4.                  */
} DMACTRL_0_CHHPCLR_CH4_Enum;

/* =============================================  DMACTRL_0 CHHPCLR CH5 [5..5]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH5                                                     */
  DMACTRL_0_CHHPCLR_CH5_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 5.                  */
} DMACTRL_0_CHHPCLR_CH5_Enum;

/* =============================================  DMACTRL_0 CHHPCLR CH6 [6..6]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH6                                                     */
  DMACTRL_0_CHHPCLR_CH6_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 6.                  */
} DMACTRL_0_CHHPCLR_CH6_Enum;

/* =============================================  DMACTRL_0 CHHPCLR CH7 [7..7]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH7                                                     */
  DMACTRL_0_CHHPCLR_CH7_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 7.                  */
} DMACTRL_0_CHHPCLR_CH7_Enum;

/* =============================================  DMACTRL_0 CHHPCLR CH8 [8..8]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH8                                                     */
  DMACTRL_0_CHHPCLR_CH8_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 8.                  */
} DMACTRL_0_CHHPCLR_CH8_Enum;

/* =============================================  DMACTRL_0 CHHPCLR CH9 [9..9]  ============================================== */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH9                                                     */
  DMACTRL_0_CHHPCLR_CH9_DISABLED       = 1,     /*!< DISABLED : Use the high default level for DMA Channel 9.                  */
} DMACTRL_0_CHHPCLR_CH9_Enum;

/* ============================================  DMACTRL_0 CHHPCLR CH10 [10..10]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH10                                                    */
  DMACTRL_0_CHHPCLR_CH10_DISABLED      = 1,     /*!< DISABLED : Use the high default level for DMA Channel 10.                 */
} DMACTRL_0_CHHPCLR_CH10_Enum;

/* ============================================  DMACTRL_0 CHHPCLR CH11 [11..11]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH11                                                    */
  DMACTRL_0_CHHPCLR_CH11_DISABLED      = 1,     /*!< DISABLED : Use the high default level for DMA Channel 11.                 */
} DMACTRL_0_CHHPCLR_CH11_Enum;

/* ============================================  DMACTRL_0 CHHPCLR CH12 [12..12]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH12                                                    */
  DMACTRL_0_CHHPCLR_CH12_DISABLED      = 1,     /*!< DISABLED : Use the high default level for DMA Channel 12.                 */
} DMACTRL_0_CHHPCLR_CH12_Enum;

/* ============================================  DMACTRL_0 CHHPCLR CH13 [13..13]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH13                                                    */
  DMACTRL_0_CHHPCLR_CH13_DISABLED      = 1,     /*!< DISABLED : Use the high default level for DMA Channel 13.                 */
} DMACTRL_0_CHHPCLR_CH13_Enum;

/* ============================================  DMACTRL_0 CHHPCLR CH14 [14..14]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH14                                                    */
  DMACTRL_0_CHHPCLR_CH14_DISABLED      = 1,     /*!< DISABLED : Use the high default level for DMA Channel 14.                 */
} DMACTRL_0_CHHPCLR_CH14_Enum;

/* ============================================  DMACTRL_0 CHHPCLR CH15 [15..15]  ============================================ */
typedef enum {                                  /*!< DMACTRL_0_CHHPCLR_CH15                                                    */
  DMACTRL_0_CHHPCLR_CH15_DISABLED      = 1,     /*!< DISABLED : Use the high default level for DMA Channel 15.                 */
} DMACTRL_0_CHHPCLR_CH15_Enum;

/* ========================================================  BERRCLR  ======================================================== */
/* ============================================  DMACTRL_0 BERRCLR ERROR [0..0]  ============================================= */
typedef enum {                                  /*!< DMACTRL_0_BERRCLR_ERROR                                                   */
  DMACTRL_0_BERRCLR_ERROR_CLEAR        = 1,     /*!< CLEAR : Read: 0: DMA error did not occur. 1: DMA error occurred
                                                     since the last time ERROR was cleared. Write: 0: No effect.
                                                     1: Clear the DMA error flag.                                              */
} DMACTRL_0_BERRCLR_ERROR_Enum;



/* =========================================================================================================================== */
/* ================                                         DMAXBAR_0                                         ================ */
/* =========================================================================================================================== */

/* =======================================================  DMAXBAR0  ======================================================== */
/* ===========================================  DMAXBAR_0 DMAXBAR0 CH0SEL [0..3]  ============================================ */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR0_CH0SEL                                                 */
  DMAXBAR_0_DMAXBAR0_CH0SEL_USB0_EP4_OUT = 0,   /*!< USB0_EP4_OUT : Service USB0 EP4 OUT data requests.                        */
  DMAXBAR_0_DMAXBAR0_CH0SEL_SPI1_RX    = 1,     /*!< SPI1_RX : Service SPI1 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH0SEL_USART0_RX  = 2,     /*!< USART0_RX : Service USART0 RX data requests.                              */
  DMAXBAR_0_DMAXBAR0_CH0SEL_I2C0_TX    = 3,     /*!< I2C0_TX : Service I2C0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH0SEL_DMA0T0_RISE = 4,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH0SEL_DMA0T0_FALL = 5,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH0SEL_DMA0T1_RISE = 6,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH0SEL_DMA0T1_FALL = 7,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH0SEL_TIMER0L    = 8,     /*!< TIMER0L : Service TIMER0L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR0_CH0SEL_TIMER0H    = 9,     /*!< TIMER0H : Service TIMER0H overflow data requests.                         */
  DMAXBAR_0_DMAXBAR0_CH0SEL_TIMER1L    = 10,    /*!< TIMER1L : Service TIMER1L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR0_CH0SEL_TIMER1H    = 11,    /*!< TIMER1H : Service TIMER1H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR0_CH0SEL_Enum;

