chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  DMAXBAR_0 DMAXBAR0 CH1SEL [4..7]  ============================================ */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR0_CH1SEL                                                 */
  DMAXBAR_0_DMAXBAR0_CH1SEL_USB0_EP3_OUT = 0,   /*!< USB0_EP3_OUT : Service USB0 EP3 OUT data requests.                        */
  DMAXBAR_0_DMAXBAR0_CH1SEL_SPI0_RX    = 1,     /*!< SPI0_RX : Service SPI0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH1SEL_USART1_RX  = 2,     /*!< USART1_RX : Service USART1 RX data requests.                              */
  DMAXBAR_0_DMAXBAR0_CH1SEL_I2C0_RX    = 3,     /*!< I2C0_RX : Service I2C0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH1SEL_IDAC1      = 4,     /*!< IDAC1 : Service IDAC1 data requests.                                      */
  DMAXBAR_0_DMAXBAR0_CH1SEL_EPCA0_CONTROL = 5,  /*!< EPCA0_CONTROL : Service EPCA0 control data requests.                      */
  DMAXBAR_0_DMAXBAR0_CH1SEL_DMA0T0_RISE = 6,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH1SEL_DMA0T0_FALL = 7,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH1SEL_DMA0T1_RISE = 8,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH1SEL_DMA0T1_FALL = 9,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH1SEL_TIMER0L    = 10,    /*!< TIMER0L : Service TIMER0L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR0_CH1SEL_TIMER1L    = 11,    /*!< TIMER1L : Service TIMER1L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR0_CH1SEL_TIMER1H    = 12,    /*!< TIMER1H : Service TIMER1H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR0_CH1SEL_Enum;

/* ===========================================  DMAXBAR_0 DMAXBAR0 CH2SEL [8..11]  =========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR0_CH2SEL                                                 */
  DMAXBAR_0_DMAXBAR0_CH2SEL_USB0_EP2_OUT = 0,   /*!< USB0_EP2_OUT : Service USB0 EP2 OUT data requests.                        */
  DMAXBAR_0_DMAXBAR0_CH2SEL_SPI0_TX    = 1,     /*!< SPI0_TX : Service SPI0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH2SEL_USART0_TX  = 2,     /*!< USART0_TX : Service USART0 TX data requests.                              */
  DMAXBAR_0_DMAXBAR0_CH2SEL_SARADC0    = 3,     /*!< SARADC0 : Service SARADC0 data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH2SEL_IDAC1      = 4,     /*!< IDAC1 : Service IDAC1 data requests.                                      */
  DMAXBAR_0_DMAXBAR0_CH2SEL_I2S0_TX    = 5,     /*!< I2S0_TX : Service I2S0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH2SEL_EPCA0_CONTROL = 6,  /*!< EPCA0_CONTROL : Service EPCA0 control data requests.                      */
  DMAXBAR_0_DMAXBAR0_CH2SEL_DMA0T0_RISE = 7,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH2SEL_DMA0T0_FALL = 8,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH2SEL_DMA0T1_RISE = 9,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH2SEL_DMA0T1_FALL = 10,   /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
} DMAXBAR_0_DMAXBAR0_CH2SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR0 CH3SEL [12..15]  =========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR0_CH3SEL                                                 */
  DMAXBAR_0_DMAXBAR0_CH3SEL_USB0_EP1_OUT = 0,   /*!< USB0_EP1_OUT : Service USB0 EP1 OUT data requests.                        */
  DMAXBAR_0_DMAXBAR0_CH3SEL_SARADC1    = 1,     /*!< SARADC1 : Service SARADC1 data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH3SEL_IDAC0      = 2,     /*!< IDAC0 : Service IDAC0 data requests.                                      */
  DMAXBAR_0_DMAXBAR0_CH3SEL_I2S0_TX    = 3,     /*!< I2S0_TX : Service I2S0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH3SEL_EPCA0_CAPTURE = 4,  /*!< EPCA0_CAPTURE : Service EPCA0 capture data requests.                      */
  DMAXBAR_0_DMAXBAR0_CH3SEL_DMA0T0_RISE = 5,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH3SEL_DMA0T0_FALL = 6,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH3SEL_DMA0T1_RISE = 7,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH3SEL_DMA0T1_FALL = 8,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH3SEL_TIMER1H    = 9,     /*!< TIMER1H : Service TIMER1H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR0_CH3SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR0 CH4SEL [16..19]  =========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR0_CH4SEL                                                 */
  DMAXBAR_0_DMAXBAR0_CH4SEL_USB0_EP4_IN = 0,    /*!< USB0_EP4_IN : Service USB0 EP4 IN data requests.                          */
  DMAXBAR_0_DMAXBAR0_CH4SEL_SPI1_TX    = 1,     /*!< SPI1_TX : Service SPI1 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH4SEL_USART0_TX  = 2,     /*!< USART0_TX : Service USART0 TX data requests.                              */
  DMAXBAR_0_DMAXBAR0_CH4SEL_SARADC0    = 3,     /*!< SARADC0 : Service SARADC0 data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH4SEL_I2S0_RX    = 4,     /*!< I2S0_RX : Service I2S0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH4SEL_EPCA0_CAPTURE = 5,  /*!< EPCA0_CAPTURE : Service EPCA0 capture data requests.                      */
  DMAXBAR_0_DMAXBAR0_CH4SEL_DMA0T0_RISE = 6,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH4SEL_DMA0T0_FALL = 7,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH4SEL_DMA0T1_RISE = 8,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH4SEL_DMA0T1_FALL = 9,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH4SEL_TIMER0H    = 10,    /*!< TIMER0H : Service TIMER0H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR0_CH4SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR0 CH5SEL [20..23]  =========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR0_CH5SEL                                                 */
  DMAXBAR_0_DMAXBAR0_CH5SEL_USB0_EP3_IN = 0,    /*!< USB0_EP3_IN : Service USB0 EP3 IN data requests.                          */
  DMAXBAR_0_DMAXBAR0_CH5SEL_AES0_TX    = 1,     /*!< AES0_TX : Service AES0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH5SEL_USART1_TX  = 2,     /*!< USART1_TX : Service USART1 TX data requests.                              */
  DMAXBAR_0_DMAXBAR0_CH5SEL_SARADC0    = 3,     /*!< SARADC0 : Service SARADC0 data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH5SEL_I2S0_RX    = 4,     /*!< I2S0_RX : Service I2S0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH5SEL_DMA0T0_RISE = 5,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH5SEL_DMA0T0_FALL = 6,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH5SEL_DMA0T1_RISE = 7,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH5SEL_DMA0T1_FALL = 8,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
} DMAXBAR_0_DMAXBAR0_CH5SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR0 CH6SEL [24..27]  =========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR0_CH6SEL                                                 */
  DMAXBAR_0_DMAXBAR0_CH6SEL_USB0_EP2_IN = 0,    /*!< USB0_EP2_IN : Service USB0 EP2 IN data requests.                          */
  DMAXBAR_0_DMAXBAR0_CH6SEL_AES0_RX    = 1,     /*!< AES0_RX : Service AES0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH6SEL_USART0_RX  = 2,     /*!< USART0_RX : Service USART0 RX data requests.                              */
  DMAXBAR_0_DMAXBAR0_CH6SEL_I2C0_RX    = 3,     /*!< I2C0_RX : Service I2C0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH6SEL_IDAC0      = 4,     /*!< IDAC0 : Service IDAC0 data requests.                                      */
  DMAXBAR_0_DMAXBAR0_CH6SEL_DMA0T0_RISE = 5,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH6SEL_DMA0T0_FALL = 6,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH6SEL_DMA0T1_RISE = 7,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH6SEL_DMA0T1_FALL = 8,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH6SEL_TIMER0H    = 9,     /*!< TIMER0H : Service TIMER0H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR0_CH6SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR0 CH7SEL [28..31]  =========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR0_CH7SEL                                                 */
  DMAXBAR_0_DMAXBAR0_CH7SEL_USB0_EP1_IN = 0,    /*!< USB0_EP1_IN : Service USB0 EP1 IN data requests.                          */
  DMAXBAR_0_DMAXBAR0_CH7SEL_AES0_XOR   = 1,     /*!< AES0_XOR : Service AES0 XOR data requests.                                */
  DMAXBAR_0_DMAXBAR0_CH7SEL_SPI1_TX    = 2,     /*!< SPI1_TX : Service SPI1 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR0_CH7SEL_USART0_TX  = 3,     /*!< USART0_TX : Service USART0 TX data requests.                              */
  DMAXBAR_0_DMAXBAR0_CH7SEL_DMA0T0_RISE = 4,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH7SEL_DMA0T0_FALL = 5,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH7SEL_DMA0T1_RISE = 6,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR0_CH7SEL_DMA0T1_FALL = 7,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR0_CH7SEL_TIMER0L    = 8,     /*!< TIMER0L : Service TIMER0L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR0_CH7SEL_TIMER1L    = 9,     /*!< TIMER1L : Service TIMER1L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR0_CH7SEL_TIMER1H    = 10,    /*!< TIMER1H : Service TIMER1H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR0_CH7SEL_Enum;

/* =======================================================  DMAXBAR1  ======================================================== */
/* ===========================================  DMAXBAR_0 DMAXBAR1 CH8SEL [0..3]  ============================================ */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR1_CH8SEL                                                 */
  DMAXBAR_0_DMAXBAR1_CH8SEL_USB0_EP4_OUT = 0,   /*!< USB0_EP4_OUT : Service USB0 EP4 OUT data requests.                        */
  DMAXBAR_0_DMAXBAR1_CH8SEL_USART1_RX  = 1,     /*!< USART1_RX : Service USART1 RX data requests.                              */
  DMAXBAR_0_DMAXBAR1_CH8SEL_SPI1_RX    = 2,     /*!< SPI1_RX : Service SPI1 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH8SEL_USART0_RX  = 3,     /*!< USART0_RX : Service USART0 RX data requests.                              */
  DMAXBAR_0_DMAXBAR1_CH8SEL_EPCA0_CAPTURE = 4,  /*!< EPCA0_CAPTURE : Service EPCA0 capture data requests.                      */
  DMAXBAR_0_DMAXBAR1_CH8SEL_DMA0T0_RISE = 5,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH8SEL_DMA0T0_FALL = 6,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH8SEL_DMA0T1_RISE = 7,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH8SEL_DMA0T1_FALL = 8,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
} DMAXBAR_0_DMAXBAR1_CH8SEL_Enum;

