chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  DMAXBAR_0 DMAXBAR1 CH9SEL [4..7]  ============================================ */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR1_CH9SEL                                                 */
  DMAXBAR_0_DMAXBAR1_CH9SEL_USB0_EP3_OUT = 0,   /*!< USB0_EP3_OUT : Service USB0 EP3 OUT data requests.                        */
  DMAXBAR_0_DMAXBAR1_CH9SEL_USART1_TX  = 1,     /*!< USART1_TX : Service USART1 TX data requests.                              */
  DMAXBAR_0_DMAXBAR1_CH9SEL_I2C0_TX    = 2,     /*!< I2C0_TX : Service I2C0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH9SEL_EPCA0_CAPTURE = 3,  /*!< EPCA0_CAPTURE : Service EPCA0 capture data requests.                      */
  DMAXBAR_0_DMAXBAR1_CH9SEL_DMA0T0_RISE = 4,    /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH9SEL_DMA0T0_FALL = 5,    /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH9SEL_DMA0T1_RISE = 6,    /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH9SEL_DMA0T1_FALL = 7,    /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH9SEL_TIMER0H    = 8,     /*!< TIMER0H : Service TIMER0H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR1_CH9SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR1 CH10SEL [8..11]  =========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR1_CH10SEL                                                */
  DMAXBAR_0_DMAXBAR1_CH10SEL_USB0_EP2_OUT = 0,  /*!< USB0_EP2_OUT : Service USB0 EP2 OUT data requests.                        */
  DMAXBAR_0_DMAXBAR1_CH10SEL_AES0_TX   = 1,     /*!< AES0_TX : Service AES0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH10SEL_SARADC1   = 2,     /*!< SARADC1 : Service SARADC1 data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH10SEL_I2S0_RX   = 3,     /*!< I2S0_RX : Service I2S0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH10SEL_DMA0T0_RISE = 4,   /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH10SEL_DMA0T0_FALL = 5,   /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH10SEL_DMA0T1_RISE = 6,   /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH10SEL_DMA0T1_FALL = 7,   /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH10SEL_TIMER1H   = 8,     /*!< TIMER1H : Service TIMER1H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR1_CH10SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR1 CH11SEL [12..15]  ========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR1_CH11SEL                                                */
  DMAXBAR_0_DMAXBAR1_CH11SEL_USB0_EP1_OUT = 0,  /*!< USB0_EP1_OUT : Service USB0 EP1 OUT data requests.                        */
  DMAXBAR_0_DMAXBAR1_CH11SEL_AES0_RX   = 1,     /*!< AES0_RX : Service AES0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH11SEL_USART1_RX = 2,     /*!< USART1_RX : Service USART1 RX data requests.                              */
  DMAXBAR_0_DMAXBAR1_CH11SEL_USART0_RX = 3,     /*!< USART0_RX : Service USART0 RX data requests.                              */
  DMAXBAR_0_DMAXBAR1_CH11SEL_I2C0_RX   = 4,     /*!< I2C0_RX : Service I2C0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH11SEL_I2S0_RX   = 5,     /*!< I2S0_RX : Service I2S0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH11SEL_DMA0T0_RISE = 6,   /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH11SEL_DMA0T0_FALL = 7,   /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH11SEL_DMA0T1_RISE = 8,   /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH11SEL_DMA0T1_FALL = 9,   /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH11SEL_TIMER0H   = 10,    /*!< TIMER0H : Service TIMER0H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR1_CH11SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR1 CH12SEL [16..19]  ========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR1_CH12SEL                                                */
  DMAXBAR_0_DMAXBAR1_CH12SEL_USB0_EP4_IN = 0,   /*!< USB0_EP4_IN : Service USB0 EP4 IN data requests.                          */
  DMAXBAR_0_DMAXBAR1_CH12SEL_AES0_XOR  = 1,     /*!< AES0_XOR : Service AES0 XOR data requests.                                */
  DMAXBAR_0_DMAXBAR1_CH12SEL_USART1_TX = 2,     /*!< USART1_TX : Service USART1 TX data requests.                              */
  DMAXBAR_0_DMAXBAR1_CH12SEL_SPI1_TX   = 3,     /*!< SPI1_TX : Service SPI1 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH12SEL_IDAC1     = 4,     /*!< IDAC1 : Service IDAC1 data requests.                                      */
  DMAXBAR_0_DMAXBAR1_CH12SEL_I2S0_TX   = 5,     /*!< I2S0_TX : Service I2S0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH12SEL_DMA0T0_RISE = 6,   /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH12SEL_DMA0T0_FALL = 7,   /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH12SEL_DMA0T1_RISE = 8,   /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH12SEL_DMA0T1_FALL = 9,   /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH12SEL_TIMER0L   = 10,    /*!< TIMER0L : Service TIMER0L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR1_CH12SEL_TIMER1L   = 11,    /*!< TIMER1L : Service TIMER1L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR1_CH12SEL_TIMER1H   = 12,    /*!< TIMER1H : Service TIMER1H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR1_CH12SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR1 CH13SEL [20..23]  ========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR1_CH13SEL                                                */
  DMAXBAR_0_DMAXBAR1_CH13SEL_USB0_EP3_IN = 0,   /*!< USB0_EP3_IN : Service USB0 EP3 IN data requests.                          */
  DMAXBAR_0_DMAXBAR1_CH13SEL_SPI0_RX   = 1,     /*!< SPI0_RX : Service SPI0 RX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH13SEL_USART0_RX = 2,     /*!< USART0_RX : Service USART0 RX data requests.                              */
  DMAXBAR_0_DMAXBAR1_CH13SEL_IDAC1     = 3,     /*!< IDAC1 : Service IDAC1 data requests.                                      */
  DMAXBAR_0_DMAXBAR1_CH13SEL_I2S0_TX   = 4,     /*!< I2S0_TX : Service I2S0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH13SEL_DMA0T0_RISE = 5,   /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH13SEL_DMA0T0_FALL = 6,   /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH13SEL_DMA0T1_RISE = 7,   /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH13SEL_DMA0T1_FALL = 8,   /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH13SEL_TIMER0H   = 9,     /*!< TIMER0H : Service TIMER0H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR1_CH13SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR1 CH14SEL [24..27]  ========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR1_CH14SEL                                                */
  DMAXBAR_0_DMAXBAR1_CH14SEL_USB0_EP2_IN = 0,   /*!< USB0_EP2_IN : Service USB0 EP2 IN data requests.                          */
  DMAXBAR_0_DMAXBAR1_CH14SEL_SPI0_TX   = 1,     /*!< SPI0_TX : Service SPI0 TX data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH14SEL_USART0_TX = 2,     /*!< USART0_TX : Service USART0 TX data requests.                              */
  DMAXBAR_0_DMAXBAR1_CH14SEL_IDAC0     = 3,     /*!< IDAC0 : Service IDAC0 data requests.                                      */
  DMAXBAR_0_DMAXBAR1_CH14SEL_EPCA0_CONTROL = 4, /*!< EPCA0_CONTROL : Service EPCA0 control data requests.                      */
  DMAXBAR_0_DMAXBAR1_CH14SEL_DMA0T0_RISE = 5,   /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH14SEL_DMA0T0_FALL = 6,   /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH14SEL_DMA0T1_RISE = 7,   /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH14SEL_DMA0T1_FALL = 8,   /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH14SEL_TIMER0L   = 9,     /*!< TIMER0L : Service TIMER0L overflow data requests.                         */
  DMAXBAR_0_DMAXBAR1_CH14SEL_TIMER1L   = 10,    /*!< TIMER1L : Service TIMER1L overflow data requests.                         */
} DMAXBAR_0_DMAXBAR1_CH14SEL_Enum;

/* ==========================================  DMAXBAR_0 DMAXBAR1 CH15SEL [28..31]  ========================================== */
typedef enum {                                  /*!< DMAXBAR_0_DMAXBAR1_CH15SEL                                                */
  DMAXBAR_0_DMAXBAR1_CH15SEL_USB0_EP1_IN = 0,   /*!< USB0_EP1_IN : Service USB0 EP1 IN data requests.                          */
  DMAXBAR_0_DMAXBAR1_CH15SEL_SARADC1   = 1,     /*!< SARADC1 : Service SARADC1 data requests.                                  */
  DMAXBAR_0_DMAXBAR1_CH15SEL_IDAC0     = 2,     /*!< IDAC0 : Service IDAC0 data requests.                                      */
  DMAXBAR_0_DMAXBAR1_CH15SEL_EPCA0_CONTROL = 3, /*!< EPCA0_CONTROL : Service EPCA0 control data requests.                      */
  DMAXBAR_0_DMAXBAR1_CH15SEL_DMA0T0_RISE = 4,   /*!< DMA0T0_RISE : Service DMAXT0 (PB1.10) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH15SEL_DMA0T0_FALL = 5,   /*!< DMA0T0_FALL : Service DMAXT0 (PB1.10) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH15SEL_DMA0T1_RISE = 6,   /*!< DMA0T1_RISE : Service DMAXT1 (PB1.11) rising edge data requests.          */
  DMAXBAR_0_DMAXBAR1_CH15SEL_DMA0T1_FALL = 7,   /*!< DMA0T1_FALL : Service DMAXT1 (PB1.11) falling edge data requests.         */
  DMAXBAR_0_DMAXBAR1_CH15SEL_TIMER0H   = 8,     /*!< TIMER0H : Service TIMER0H overflow data requests.                         */
  DMAXBAR_0_DMAXBAR1_CH15SEL_TIMER1H   = 9,     /*!< TIMER1H : Service TIMER1H overflow data requests.                         */
} DMAXBAR_0_DMAXBAR1_CH15SEL_Enum;



/* =========================================================================================================================== */
/* ================                                        DEVICEID_0                                         ================ */
/* =========================================================================================================================== */

/* =======================================================  DEVICEID0  ======================================================= */
/* ===========================================  DEVICEID_0 DEVICEID0 REVID [0..3]  =========================================== */
typedef enum {                                  /*!< DEVICEID_0_DEVICEID0_REVID                                                */
  DEVICEID_0_DEVICEID0_REVID_REVA      = 0,     /*!< REVA : Revision A.                                                        */
} DEVICEID_0_DEVICEID0_REVID_Enum;

/* =======================================================  DEVICEID1  ======================================================= */
/* =======================================================  DEVICEID2  ======================================================= */
/* =======================================================  DEVICEID3  ======================================================= */


/* =========================================================================================================================== */
/* ================                                          EMIF_0                                           ================ */
/* =========================================================================================================================== */

