chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  EMIF_0 CONTROL IF0EN [0..0]  ============================================== */
typedef enum {                                  /*!< EMIF_0_CONTROL_IF0EN                                                      */
  EMIF_0_CONTROL_IF0EN_DISABLED        = 0,     /*!< DISABLED : Disable interface 0.                                           */
  EMIF_0_CONTROL_IF0EN_ENABLED         = 1,     /*!< ENABLED : Enable interface 0.                                             */
} EMIF_0_CONTROL_IF0EN_Enum;

/* ==============================================  EMIF_0 CONTROL IF1EN [1..1]  ============================================== */
typedef enum {                                  /*!< EMIF_0_CONTROL_IF1EN                                                      */
  EMIF_0_CONTROL_IF1EN_DISABLED        = 0,     /*!< DISABLED : Disable interface 1.                                           */
  EMIF_0_CONTROL_IF1EN_ENABLED         = 1,     /*!< ENABLED : Enable interface 1.                                             */
} EMIF_0_CONTROL_IF1EN_Enum;

/* =============================================  EMIF_0 CONTROL OFFSTEN [4..4]  ============================================= */
typedef enum {                                  /*!< EMIF_0_CONTROL_OFFSTEN                                                    */
  EMIF_0_CONTROL_OFFSTEN_DISABLED      = 0,     /*!< DISABLED : EMIF will not enter the off state after 4 idle cycles.         */
  EMIF_0_CONTROL_OFFSTEN_ENABLED       = 1,     /*!< ENABLED : EMIF will enter the off state after 4 idle cycles.              */
} EMIF_0_CONTROL_OFFSTEN_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ==============================================  EMIF_0 STATUS OFFSTS [0..0]  ============================================== */
typedef enum {                                  /*!< EMIF_0_STATUS_OFFSTS                                                      */
  EMIF_0_STATUS_OFFSTS_ON              = 0,     /*!< ON : The EMIF bus is active.                                              */
  EMIF_0_STATUS_OFFSTS_OFF             = 1,     /*!< OFF : The EMIF is in the off bus state.                                   */
} EMIF_0_STATUS_OFFSTS_Enum;

/* =============================================  EMIF_0 STATUS IDLESTS [1..1]  ============================================== */
typedef enum {                                  /*!< EMIF_0_STATUS_IDLESTS                                                     */
  EMIF_0_STATUS_IDLESTS_NOT_IDLE       = 0,     /*!< NOT_IDLE : The EMIF has not been idle for four cycles.                    */
  EMIF_0_STATUS_IDLESTS_IDLE           = 1,     /*!< IDLE : The EMIF has been idle for four four cycles.                       */
} EMIF_0_STATUS_IDLESTS_Enum;

/* =======================================================  CONFIG_0  ======================================================== */
/* ============================================  EMIF_0 CONFIG_0 BUSWIDTH [0..0]  ============================================ */
typedef enum {                                  /*!< EMIF_0_CONFIG_0_BUSWIDTH                                                  */
  EMIF_0_CONFIG_0_BUSWIDTH_8BIT        = 0,     /*!< 8BIT : The data bus is 8-bits wide.                                       */
  EMIF_0_CONFIG_0_BUSWIDTH_16BIT       = 1,     /*!< 16BIT : The data bus is 16-bits wide.                                     */
} EMIF_0_CONFIG_0_BUSWIDTH_Enum;

/* =============================================  EMIF_0 CONFIG_0 MUXMD [2..2]  ============================================== */
typedef enum {                                  /*!< EMIF_0_CONFIG_0_MUXMD                                                     */
  EMIF_0_CONFIG_0_MUXMD_NONMUXED       = 0,     /*!< NONMUXED : The interface operates in non-multiplexed mode.                */
  EMIF_0_CONFIG_0_MUXMD_MUXED          = 1,     /*!< MUXED : The interface operates in multiplexed mode.                       */
} EMIF_0_CONFIG_0_MUXMD_Enum;

/* ==============================================  EMIF_0 CONFIG_0 ASEN [3..3]  ============================================== */
typedef enum {                                  /*!< EMIF_0_CONFIG_0_ASEN                                                      */
  EMIF_0_CONFIG_0_ASEN_DISABLED        = 0,     /*!< DISABLED : The address is not automatically shifted.                      */
  EMIF_0_CONFIG_0_ASEN_ENABLED         = 1,     /*!< ENABLED : The address is automatically shifted.                           */
} EMIF_0_CONFIG_0_ASEN_Enum;

/* ==============================================  EMIF_0 CONFIG_0 ROEN [4..4]  ============================================== */
typedef enum {                                  /*!< EMIF_0_CONFIG_0_ROEN                                                      */
  EMIF_0_CONFIG_0_ROEN_DISABLED        = 0,     /*!< DISABLED : The interface supports reads and writes.                       */
  EMIF_0_CONFIG_0_ROEN_ENABLED         = 1,     /*!< ENABLED : The interface supports only reads.                              */
} EMIF_0_CONFIG_0_ROEN_Enum;

/* =============================================  EMIF_0 CONFIG_0 WDHINH [8..8]  ============================================= */
typedef enum {                                  /*!< EMIF_0_CONFIG_0_WDHINH                                                    */
  EMIF_0_CONFIG_0_WDHINH_INACTIVE      = 0,     /*!< INACTIVE : Enable the write data hold state.                              */
  EMIF_0_CONFIG_0_WDHINH_ACTIVE        = 1,     /*!< ACTIVE : Inhibit the write data hold state.                               */
} EMIF_0_CONFIG_0_WDHINH_Enum;

/* ===========================================  EMIF_0 CONFIG_0 DELAYOE [12..12]  ============================================ */
typedef enum {                                  /*!< EMIF_0_CONFIG_0_DELAYOE                                                   */
  EMIF_0_CONFIG_0_DELAYOE_DISABLED     = 0,     /*!< DISABLED : The output enable signal (/OE) is not delayed.                 */
  EMIF_0_CONFIG_0_DELAYOE_ENABLED      = 1,     /*!< ENABLED : The output enable signal (/OE) is delayed.                      */
} EMIF_0_CONFIG_0_DELAYOE_Enum;

