chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  EMIF_0 CONFIG_0 KLREN [16..16]  ============================================= */
typedef enum {                                  /*!< EMIF_0_CONFIG_0_KLREN                                                     */
  EMIF_0_CONFIG_0_KLREN_DISABLED       = 0,     /*!< DISABLED : The bus is driven to the idle state between active
                                                     requests.                                                                 */
  EMIF_0_CONFIG_0_KLREN_ENABLED        = 1,     /*!< ENABLED : The bus drives the last value read on the interface
                                                     between active requests.                                                  */
} EMIF_0_CONFIG_0_KLREN_Enum;

/* ========================================================  IFRT_0  ========================================================= */
/* ========================================================  IFWT_0  ========================================================= */
/* =======================================================  IFRCST_0  ======================================================== */
/* =============================================  EMIF_0 IFRCST_0 CSRAS [0..0]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_CSRAS                                                     */
  EMIF_0_IFRCST_0_CSRAS_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the read address setup
                                                     state.                                                                    */
  EMIF_0_IFRCST_0_CSRAS_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the read address
                                                     setup state.                                                              */
} EMIF_0_IFRCST_0_CSRAS_Enum;

/* =============================================  EMIF_0 IFRCST_0 CSRAH [1..1]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_CSRAH                                                     */
  EMIF_0_IFRCST_0_CSRAH_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the read address hold
                                                     state.                                                                    */
  EMIF_0_IFRCST_0_CSRAH_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the read address
                                                     hold state.                                                               */
} EMIF_0_IFRCST_0_CSRAH_Enum;

/* =============================================  EMIF_0 IFRCST_0 CSRDW [2..2]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_CSRDW                                                     */
  EMIF_0_IFRCST_0_CSRDW_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the read data wait
                                                     state.                                                                    */
  EMIF_0_IFRCST_0_CSRDW_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the read data wait
                                                     state.                                                                    */
} EMIF_0_IFRCST_0_CSRDW_Enum;

/* =============================================  EMIF_0 IFRCST_0 CSRDH [3..3]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_CSRDH                                                     */
  EMIF_0_IFRCST_0_CSRDH_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the read data hold
                                                     state.                                                                    */
  EMIF_0_IFRCST_0_CSRDH_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the read data hold
                                                     state.                                                                    */
} EMIF_0_IFRCST_0_CSRDH_Enum;

/* =============================================  EMIF_0 IFRCST_0 OERAS [4..4]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_OERAS                                                     */
  EMIF_0_IFRCST_0_OERAS_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the read address
                                                     setup state.                                                              */
  EMIF_0_IFRCST_0_OERAS_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the read address
                                                     setup state.                                                              */
} EMIF_0_IFRCST_0_OERAS_Enum;

/* =============================================  EMIF_0 IFRCST_0 OERAH [5..5]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_OERAH                                                     */
  EMIF_0_IFRCST_0_OERAH_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the read address
                                                     hold state.                                                               */
  EMIF_0_IFRCST_0_OERAH_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the read address
                                                     hold state.                                                               */
} EMIF_0_IFRCST_0_OERAH_Enum;

/* =============================================  EMIF_0 IFRCST_0 OERDW [6..6]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_OERDW                                                     */
  EMIF_0_IFRCST_0_OERDW_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the read data wait
                                                     state.                                                                    */
  EMIF_0_IFRCST_0_OERDW_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the read data
                                                     wait state.                                                               */
} EMIF_0_IFRCST_0_OERDW_Enum;

/* =============================================  EMIF_0 IFRCST_0 OERDH [7..7]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_OERDH                                                     */
  EMIF_0_IFRCST_0_OERDH_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the read data hold
                                                     state.                                                                    */
  EMIF_0_IFRCST_0_OERDH_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the read data
                                                     hold state.                                                               */
} EMIF_0_IFRCST_0_OERDH_Enum;

/* =============================================  EMIF_0 IFRCST_0 WRRAS [8..8]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_WRRAS                                                     */
  EMIF_0_IFRCST_0_WRRAS_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the read address
                                                     setup state.                                                              */
  EMIF_0_IFRCST_0_WRRAS_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the read address
                                                     setup state.                                                              */
} EMIF_0_IFRCST_0_WRRAS_Enum;

/* =============================================  EMIF_0 IFRCST_0 WRRAH [9..9]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_WRRAH                                                     */
  EMIF_0_IFRCST_0_WRRAH_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the read address
                                                     hold state.                                                               */
  EMIF_0_IFRCST_0_WRRAH_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the read address
                                                     hold state.                                                               */
} EMIF_0_IFRCST_0_WRRAH_Enum;

/* ============================================  EMIF_0 IFRCST_0 WRRDW [10..10]  ============================================= */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_WRRDW                                                     */
  EMIF_0_IFRCST_0_WRRDW_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the read data wait
                                                     state.                                                                    */
  EMIF_0_IFRCST_0_WRRDW_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the read data wait
                                                     state.                                                                    */
} EMIF_0_IFRCST_0_WRRDW_Enum;

