chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  EMIF_0 IFRCST_0 WRRDH [11..11]  ============================================= */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_WRRDH                                                     */
  EMIF_0_IFRCST_0_WRRDH_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the read data hold
                                                     state.                                                                    */
  EMIF_0_IFRCST_0_WRRDH_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the read data hold
                                                     state.                                                                    */
} EMIF_0_IFRCST_0_WRRDH_Enum;

/* ============================================  EMIF_0 IFRCST_0 ALERAS [12..12]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_ALERAS                                                    */
  EMIF_0_IFRCST_0_ALERAS_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the read
                                                     address setup state.                                                      */
  EMIF_0_IFRCST_0_ALERAS_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the read
                                                     address setup state.                                                      */
} EMIF_0_IFRCST_0_ALERAS_Enum;

/* ============================================  EMIF_0 IFRCST_0 ALERAH [13..13]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_ALERAH                                                    */
  EMIF_0_IFRCST_0_ALERAH_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the read
                                                     address hold state.                                                       */
  EMIF_0_IFRCST_0_ALERAH_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the read
                                                     address hold state.                                                       */
} EMIF_0_IFRCST_0_ALERAH_Enum;

/* ============================================  EMIF_0 IFRCST_0 ALERDW [14..14]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_ALERDW                                                    */
  EMIF_0_IFRCST_0_ALERDW_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the read
                                                     data wait state.                                                          */
  EMIF_0_IFRCST_0_ALERDW_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the read
                                                     data wait state.                                                          */
} EMIF_0_IFRCST_0_ALERDW_Enum;

/* ============================================  EMIF_0 IFRCST_0 ALERDH [15..15]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFRCST_0_ALERDH                                                    */
  EMIF_0_IFRCST_0_ALERDH_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the read
                                                     data hold state.                                                          */
  EMIF_0_IFRCST_0_ALERDH_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the read
                                                     data hold state.                                                          */
} EMIF_0_IFRCST_0_ALERDH_Enum;

/* =======================================================  IFWCST_0  ======================================================== */
/* =============================================  EMIF_0 IFWCST_0 CSWAS [0..0]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_CSWAS                                                     */
  EMIF_0_IFWCST_0_CSWAS_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the write address
                                                     setup state.                                                              */
  EMIF_0_IFWCST_0_CSWAS_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the write address
                                                     setup state.                                                              */
} EMIF_0_IFWCST_0_CSWAS_Enum;

/* =============================================  EMIF_0 IFWCST_0 CSWAH [1..1]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_CSWAH                                                     */
  EMIF_0_IFWCST_0_CSWAH_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the write address
                                                     hold state.                                                               */
  EMIF_0_IFWCST_0_CSWAH_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the write address
                                                     hold state.                                                               */
} EMIF_0_IFWCST_0_CSWAH_Enum;

/* =============================================  EMIF_0 IFWCST_0 CSWDW [2..2]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_CSWDW                                                     */
  EMIF_0_IFWCST_0_CSWDW_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the write data wait
                                                     state.                                                                    */
  EMIF_0_IFWCST_0_CSWDW_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the write data wait
                                                     state.                                                                    */
} EMIF_0_IFWCST_0_CSWDW_Enum;

