chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  EMIF_0 IFWCST_0 CSWDH [3..3]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_CSWDH                                                     */
  EMIF_0_IFWCST_0_CSWDH_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the write data hold
                                                     state.                                                                    */
  EMIF_0_IFWCST_0_CSWDH_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the write data hold
                                                     state.                                                                    */
} EMIF_0_IFWCST_0_CSWDH_Enum;

/* =============================================  EMIF_0 IFWCST_0 OEWAS [4..4]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_OEWAS                                                     */
  EMIF_0_IFWCST_0_OEWAS_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the write address
                                                     setup state.                                                              */
  EMIF_0_IFWCST_0_OEWAS_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the write address
                                                     setup state.                                                              */
} EMIF_0_IFWCST_0_OEWAS_Enum;

/* =============================================  EMIF_0 IFWCST_0 OEWAH [5..5]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_OEWAH                                                     */
  EMIF_0_IFWCST_0_OEWAH_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the write address
                                                     hold state.                                                               */
  EMIF_0_IFWCST_0_OEWAH_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the write address
                                                     hold state.                                                               */
} EMIF_0_IFWCST_0_OEWAH_Enum;

/* =============================================  EMIF_0 IFWCST_0 OEWDW [6..6]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_OEWDW                                                     */
  EMIF_0_IFWCST_0_OEWDW_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the write data wait
                                                     state.                                                                    */
  EMIF_0_IFWCST_0_OEWDW_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the write data
                                                     wait state.                                                               */
} EMIF_0_IFWCST_0_OEWDW_Enum;

/* =============================================  EMIF_0 IFWCST_0 OEWDH [7..7]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_OEWDH                                                     */
  EMIF_0_IFWCST_0_OEWDH_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the write data hold
                                                     state.                                                                    */
  EMIF_0_IFWCST_0_OEWDH_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the write data
                                                     hold state.                                                               */
} EMIF_0_IFWCST_0_OEWDH_Enum;

/* =============================================  EMIF_0 IFWCST_0 WRWAS [8..8]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_WRWAS                                                     */
  EMIF_0_IFWCST_0_WRWAS_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the write address
                                                     setup state.                                                              */
  EMIF_0_IFWCST_0_WRWAS_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the write address
                                                     setup state.                                                              */
} EMIF_0_IFWCST_0_WRWAS_Enum;

/* =============================================  EMIF_0 IFWCST_0 WRWAH [9..9]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_WRWAH                                                     */
  EMIF_0_IFWCST_0_WRWAH_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the write address
                                                     hold state.                                                               */
  EMIF_0_IFWCST_0_WRWAH_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the write address
                                                     hold state.                                                               */
} EMIF_0_IFWCST_0_WRWAH_Enum;

/* ============================================  EMIF_0 IFWCST_0 WRWDW [10..10]  ============================================= */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_WRWDW                                                     */
  EMIF_0_IFWCST_0_WRWDW_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the write data wait
                                                     state.                                                                    */
  EMIF_0_IFWCST_0_WRWDW_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the write data
                                                     wait state.                                                               */
} EMIF_0_IFWCST_0_WRWDW_Enum;

/* ============================================  EMIF_0 IFWCST_0 WRWDH [11..11]  ============================================= */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_WRWDH                                                     */
  EMIF_0_IFWCST_0_WRWDH_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the write data hold
                                                     state.                                                                    */
  EMIF_0_IFWCST_0_WRWDH_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the write data
                                                     hold state.                                                               */
} EMIF_0_IFWCST_0_WRWDH_Enum;

/* ============================================  EMIF_0 IFWCST_0 ALEWAS [12..12]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_ALEWAS                                                    */
  EMIF_0_IFWCST_0_ALEWAS_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the write
                                                     address setup state.                                                      */
  EMIF_0_IFWCST_0_ALEWAS_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the write
                                                     address setup state.                                                      */
} EMIF_0_IFWCST_0_ALEWAS_Enum;

/* ============================================  EMIF_0 IFWCST_0 ALEWAH [13..13]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_ALEWAH                                                    */
  EMIF_0_IFWCST_0_ALEWAH_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the write
                                                     address hold state.                                                       */
  EMIF_0_IFWCST_0_ALEWAH_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the write
                                                     address hold state.                                                       */
} EMIF_0_IFWCST_0_ALEWAH_Enum;

