chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  EMIF_0 IFWCST_0 ALEWDW [14..14]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_ALEWDW                                                    */
  EMIF_0_IFWCST_0_ALEWDW_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the write
                                                     data wait state.                                                          */
  EMIF_0_IFWCST_0_ALEWDW_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the write
                                                     data wait state.                                                          */
} EMIF_0_IFWCST_0_ALEWDW_Enum;

/* ============================================  EMIF_0 IFWCST_0 ALEWDH [15..15]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFWCST_0_ALEWDH                                                    */
  EMIF_0_IFWCST_0_ALEWDH_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the write
                                                     data hold state.                                                          */
  EMIF_0_IFWCST_0_ALEWDH_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the write
                                                     data hold state.                                                          */
} EMIF_0_IFWCST_0_ALEWDH_Enum;

/* =======================================================  CONFIG_1  ======================================================== */
/* ============================================  EMIF_0 CONFIG_1 BUSWIDTH [0..0]  ============================================ */
typedef enum {                                  /*!< EMIF_0_CONFIG_1_BUSWIDTH                                                  */
  EMIF_0_CONFIG_1_BUSWIDTH_8BIT        = 0,     /*!< 8BIT : The data bus is 8-bits wide.                                       */
  EMIF_0_CONFIG_1_BUSWIDTH_16BIT       = 1,     /*!< 16BIT : The data bus is 16-bits wide.                                     */
} EMIF_0_CONFIG_1_BUSWIDTH_Enum;

/* =============================================  EMIF_0 CONFIG_1 MUXMD [2..2]  ============================================== */
typedef enum {                                  /*!< EMIF_0_CONFIG_1_MUXMD                                                     */
  EMIF_0_CONFIG_1_MUXMD_NONMUXED       = 0,     /*!< NONMUXED : The interface operates in non-multiplexed mode.                */
  EMIF_0_CONFIG_1_MUXMD_MUXED          = 1,     /*!< MUXED : The interface operates in multiplexed mode.                       */
} EMIF_0_CONFIG_1_MUXMD_Enum;

/* ==============================================  EMIF_0 CONFIG_1 ASEN [3..3]  ============================================== */
typedef enum {                                  /*!< EMIF_0_CONFIG_1_ASEN                                                      */
  EMIF_0_CONFIG_1_ASEN_DISABLED        = 0,     /*!< DISABLED : The address is not automatically shifted.                      */
  EMIF_0_CONFIG_1_ASEN_ENABLED         = 1,     /*!< ENABLED : The address is automatically shifted.                           */
} EMIF_0_CONFIG_1_ASEN_Enum;

/* ==============================================  EMIF_0 CONFIG_1 ROEN [4..4]  ============================================== */
typedef enum {                                  /*!< EMIF_0_CONFIG_1_ROEN                                                      */
  EMIF_0_CONFIG_1_ROEN_DISABLED        = 0,     /*!< DISABLED : The interface supports reads and writes.                       */
  EMIF_0_CONFIG_1_ROEN_ENABLED         = 1,     /*!< ENABLED : The interface supports only reads.                              */
} EMIF_0_CONFIG_1_ROEN_Enum;

/* =============================================  EMIF_0 CONFIG_1 WDHINH [8..8]  ============================================= */
typedef enum {                                  /*!< EMIF_0_CONFIG_1_WDHINH                                                    */
  EMIF_0_CONFIG_1_WDHINH_INACTIVE      = 0,     /*!< INACTIVE : Enable the write data hold state.                              */
  EMIF_0_CONFIG_1_WDHINH_ACTIVE        = 1,     /*!< ACTIVE : Inhibit the write data hold state.                               */
} EMIF_0_CONFIG_1_WDHINH_Enum;

/* ===========================================  EMIF_0 CONFIG_1 DELAYOE [12..12]  ============================================ */
typedef enum {                                  /*!< EMIF_0_CONFIG_1_DELAYOE                                                   */
  EMIF_0_CONFIG_1_DELAYOE_DISABLED     = 0,     /*!< DISABLED : The output enable signal (/OE) is not delayed.                 */
  EMIF_0_CONFIG_1_DELAYOE_ENABLED      = 1,     /*!< ENABLED : The output enable signal (/OE) is delayed.                      */
} EMIF_0_CONFIG_1_DELAYOE_Enum;

/* ============================================  EMIF_0 CONFIG_1 KLREN [16..16]  ============================================= */
typedef enum {                                  /*!< EMIF_0_CONFIG_1_KLREN                                                     */
  EMIF_0_CONFIG_1_KLREN_DISABLED       = 0,     /*!< DISABLED : The bus is driven to the idle state between active
                                                     requests.                                                                 */
  EMIF_0_CONFIG_1_KLREN_ENABLED        = 1,     /*!< ENABLED : The bus drives the last value read on the interface
                                                     between active requests.                                                  */
} EMIF_0_CONFIG_1_KLREN_Enum;

/* ========================================================  IFRT_1  ========================================================= */
/* ========================================================  IFWT_1  ========================================================= */
/* =======================================================  IFRCST_1  ======================================================== */
/* =============================================  EMIF_0 IFRCST_1 CSRAS [0..0]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_CSRAS                                                     */
  EMIF_0_IFRCST_1_CSRAS_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the read address setup
                                                     state.                                                                    */
  EMIF_0_IFRCST_1_CSRAS_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the read address
                                                     setup state.                                                              */
} EMIF_0_IFRCST_1_CSRAS_Enum;

/* =============================================  EMIF_0 IFRCST_1 CSRAH [1..1]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_CSRAH                                                     */
  EMIF_0_IFRCST_1_CSRAH_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the read address hold
                                                     state.                                                                    */
  EMIF_0_IFRCST_1_CSRAH_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the read address
                                                     hold state.                                                               */
} EMIF_0_IFRCST_1_CSRAH_Enum;

/* =============================================  EMIF_0 IFRCST_1 CSRDW [2..2]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_CSRDW                                                     */
  EMIF_0_IFRCST_1_CSRDW_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the read data wait
                                                     state.                                                                    */
  EMIF_0_IFRCST_1_CSRDW_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the read data wait
                                                     state.                                                                    */
} EMIF_0_IFRCST_1_CSRDW_Enum;

/* =============================================  EMIF_0 IFRCST_1 CSRDH [3..3]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_CSRDH                                                     */
  EMIF_0_IFRCST_1_CSRDH_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the read data hold
                                                     state.                                                                    */
  EMIF_0_IFRCST_1_CSRDH_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the read data hold
                                                     state.                                                                    */
} EMIF_0_IFRCST_1_CSRDH_Enum;

/* =============================================  EMIF_0 IFRCST_1 OERAS [4..4]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_OERAS                                                     */
  EMIF_0_IFRCST_1_OERAS_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the read address
                                                     setup state.                                                              */
  EMIF_0_IFRCST_1_OERAS_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the read address
                                                     setup state.                                                              */
} EMIF_0_IFRCST_1_OERAS_Enum;

/* =============================================  EMIF_0 IFRCST_1 OERAH [5..5]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_OERAH                                                     */
  EMIF_0_IFRCST_1_OERAH_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the read address
                                                     hold state.                                                               */
  EMIF_0_IFRCST_1_OERAH_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the read address
                                                     hold state.                                                               */
} EMIF_0_IFRCST_1_OERAH_Enum;

/* =============================================  EMIF_0 IFRCST_1 OERDW [6..6]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_OERDW                                                     */
  EMIF_0_IFRCST_1_OERDW_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the read data wait
                                                     state.                                                                    */
  EMIF_0_IFRCST_1_OERDW_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the read data
                                                     wait state.                                                               */
} EMIF_0_IFRCST_1_OERDW_Enum;

