chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  EMIF_0 IFRCST_1 OERDH [7..7]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_OERDH                                                     */
  EMIF_0_IFRCST_1_OERDH_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the read data hold
                                                     state.                                                                    */
  EMIF_0_IFRCST_1_OERDH_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the read data
                                                     hold state.                                                               */
} EMIF_0_IFRCST_1_OERDH_Enum;

/* =============================================  EMIF_0 IFRCST_1 WRRAS [8..8]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_WRRAS                                                     */
  EMIF_0_IFRCST_1_WRRAS_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the read address
                                                     setup state.                                                              */
  EMIF_0_IFRCST_1_WRRAS_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the read address
                                                     setup state.                                                              */
} EMIF_0_IFRCST_1_WRRAS_Enum;

/* =============================================  EMIF_0 IFRCST_1 WRRAH [9..9]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_WRRAH                                                     */
  EMIF_0_IFRCST_1_WRRAH_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the read address
                                                     hold state.                                                               */
  EMIF_0_IFRCST_1_WRRAH_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the read address
                                                     hold state.                                                               */
} EMIF_0_IFRCST_1_WRRAH_Enum;

/* ============================================  EMIF_0 IFRCST_1 WRRDW [10..10]  ============================================= */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_WRRDW                                                     */
  EMIF_0_IFRCST_1_WRRDW_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the read data wait
                                                     state.                                                                    */
  EMIF_0_IFRCST_1_WRRDW_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the read data wait
                                                     state.                                                                    */
} EMIF_0_IFRCST_1_WRRDW_Enum;

/* ============================================  EMIF_0 IFRCST_1 WRRDH [11..11]  ============================================= */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_WRRDH                                                     */
  EMIF_0_IFRCST_1_WRRDH_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the read data hold
                                                     state.                                                                    */
  EMIF_0_IFRCST_1_WRRDH_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the read data hold
                                                     state.                                                                    */
} EMIF_0_IFRCST_1_WRRDH_Enum;

/* ============================================  EMIF_0 IFRCST_1 ALERAS [12..12]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_ALERAS                                                    */
  EMIF_0_IFRCST_1_ALERAS_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the read
                                                     address setup state.                                                      */
  EMIF_0_IFRCST_1_ALERAS_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the read
                                                     address setup state.                                                      */
} EMIF_0_IFRCST_1_ALERAS_Enum;

/* ============================================  EMIF_0 IFRCST_1 ALERAH [13..13]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_ALERAH                                                    */
  EMIF_0_IFRCST_1_ALERAH_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the read
                                                     address hold state.                                                       */
  EMIF_0_IFRCST_1_ALERAH_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the read
                                                     address hold state.                                                       */
} EMIF_0_IFRCST_1_ALERAH_Enum;

/* ============================================  EMIF_0 IFRCST_1 ALERDW [14..14]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_ALERDW                                                    */
  EMIF_0_IFRCST_1_ALERDW_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the read
                                                     data wait state.                                                          */
  EMIF_0_IFRCST_1_ALERDW_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the read
                                                     data wait state.                                                          */
} EMIF_0_IFRCST_1_ALERDW_Enum;

/* ============================================  EMIF_0 IFRCST_1 ALERDH [15..15]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFRCST_1_ALERDH                                                    */
  EMIF_0_IFRCST_1_ALERDH_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the read
                                                     data hold state.                                                          */
  EMIF_0_IFRCST_1_ALERDH_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the read
                                                     data hold state.                                                          */
} EMIF_0_IFRCST_1_ALERDH_Enum;

/* =======================================================  IFWCST_1  ======================================================== */
/* =============================================  EMIF_0 IFWCST_1 CSWAS [0..0]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_CSWAS                                                     */
  EMIF_0_IFWCST_1_CSWAS_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the write address
                                                     setup state.                                                              */
  EMIF_0_IFWCST_1_CSWAS_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the write address
                                                     setup state.                                                              */
} EMIF_0_IFWCST_1_CSWAS_Enum;

/* =============================================  EMIF_0 IFWCST_1 CSWAH [1..1]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_CSWAH                                                     */
  EMIF_0_IFWCST_1_CSWAH_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the write address
                                                     hold state.                                                               */
  EMIF_0_IFWCST_1_CSWAH_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the write address
                                                     hold state.                                                               */
} EMIF_0_IFWCST_1_CSWAH_Enum;

/* =============================================  EMIF_0 IFWCST_1 CSWDW [2..2]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_CSWDW                                                     */
  EMIF_0_IFWCST_1_CSWDW_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the write data wait
                                                     state.                                                                    */
  EMIF_0_IFWCST_1_CSWDW_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the write data wait
                                                     state.                                                                    */
} EMIF_0_IFWCST_1_CSWDW_Enum;

/* =============================================  EMIF_0 IFWCST_1 CSWDH [3..3]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_CSWDH                                                     */
  EMIF_0_IFWCST_1_CSWDH_LOW            = 0,     /*!< LOW : Set chip select (CSx) to low during the write data hold
                                                     state.                                                                    */
  EMIF_0_IFWCST_1_CSWDH_HIGH           = 1,     /*!< HIGH : Set chip select (CSx) to high during the write data hold
                                                     state.                                                                    */
} EMIF_0_IFWCST_1_CSWDH_Enum;

/* =============================================  EMIF_0 IFWCST_1 OEWAS [4..4]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_OEWAS                                                     */
  EMIF_0_IFWCST_1_OEWAS_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the write address
                                                     setup state.                                                              */
  EMIF_0_IFWCST_1_OEWAS_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the write address
                                                     setup state.                                                              */
} EMIF_0_IFWCST_1_OEWAS_Enum;

/* =============================================  EMIF_0 IFWCST_1 OEWAH [5..5]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_OEWAH                                                     */
  EMIF_0_IFWCST_1_OEWAH_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the write address
                                                     hold state.                                                               */
  EMIF_0_IFWCST_1_OEWAH_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the write address
                                                     hold state.                                                               */
} EMIF_0_IFWCST_1_OEWAH_Enum;

/* =============================================  EMIF_0 IFWCST_1 OEWDW [6..6]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_OEWDW                                                     */
  EMIF_0_IFWCST_1_OEWDW_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the write data wait
                                                     state.                                                                    */
  EMIF_0_IFWCST_1_OEWDW_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the write data
                                                     wait state.                                                               */
} EMIF_0_IFWCST_1_OEWDW_Enum;

