chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  EMIF_0 IFWCST_1 OEWDH [7..7]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_OEWDH                                                     */
  EMIF_0_IFWCST_1_OEWDH_LOW            = 0,     /*!< LOW : Set output enable (/OE) to low during the write data hold
                                                     state.                                                                    */
  EMIF_0_IFWCST_1_OEWDH_HIGH           = 1,     /*!< HIGH : Set output enable (/OE) to high during the write data
                                                     hold state.                                                               */
} EMIF_0_IFWCST_1_OEWDH_Enum;

/* =============================================  EMIF_0 IFWCST_1 WRWAS [8..8]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_WRWAS                                                     */
  EMIF_0_IFWCST_1_WRWAS_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the write address
                                                     setup state.                                                              */
  EMIF_0_IFWCST_1_WRWAS_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the write address
                                                     setup state.                                                              */
} EMIF_0_IFWCST_1_WRWAS_Enum;

/* =============================================  EMIF_0 IFWCST_1 WRWAH [9..9]  ============================================== */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_WRWAH                                                     */
  EMIF_0_IFWCST_1_WRWAH_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the write address
                                                     hold state.                                                               */
  EMIF_0_IFWCST_1_WRWAH_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the write address
                                                     hold state.                                                               */
} EMIF_0_IFWCST_1_WRWAH_Enum;

/* ============================================  EMIF_0 IFWCST_1 WRWDW [10..10]  ============================================= */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_WRWDW                                                     */
  EMIF_0_IFWCST_1_WRWDW_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the write data wait
                                                     state.                                                                    */
  EMIF_0_IFWCST_1_WRWDW_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the write data
                                                     wait state.                                                               */
} EMIF_0_IFWCST_1_WRWDW_Enum;

/* ============================================  EMIF_0 IFWCST_1 WRWDH [11..11]  ============================================= */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_WRWDH                                                     */
  EMIF_0_IFWCST_1_WRWDH_LOW            = 0,     /*!< LOW : Set write signal (/WR) to low during the write data hold
                                                     state.                                                                    */
  EMIF_0_IFWCST_1_WRWDH_HIGH           = 1,     /*!< HIGH : Set write signal (/WR) to high during the write data
                                                     hold state.                                                               */
} EMIF_0_IFWCST_1_WRWDH_Enum;

/* ============================================  EMIF_0 IFWCST_1 ALEWAS [12..12]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_ALEWAS                                                    */
  EMIF_0_IFWCST_1_ALEWAS_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the write
                                                     address setup state.                                                      */
  EMIF_0_IFWCST_1_ALEWAS_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the write
                                                     address setup state.                                                      */
} EMIF_0_IFWCST_1_ALEWAS_Enum;

/* ============================================  EMIF_0 IFWCST_1 ALEWAH [13..13]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_ALEWAH                                                    */
  EMIF_0_IFWCST_1_ALEWAH_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the write
                                                     address hold state.                                                       */
  EMIF_0_IFWCST_1_ALEWAH_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the write
                                                     address hold state.                                                       */
} EMIF_0_IFWCST_1_ALEWAH_Enum;

/* ============================================  EMIF_0 IFWCST_1 ALEWDW [14..14]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_ALEWDW                                                    */
  EMIF_0_IFWCST_1_ALEWDW_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the write
                                                     data wait state.                                                          */
  EMIF_0_IFWCST_1_ALEWDW_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the write
                                                     data wait state.                                                          */
} EMIF_0_IFWCST_1_ALEWDW_Enum;

/* ============================================  EMIF_0 IFWCST_1 ALEWDH [15..15]  ============================================ */
typedef enum {                                  /*!< EMIF_0_IFWCST_1_ALEWDH                                                    */
  EMIF_0_IFWCST_1_ALEWDH_LOW           = 0,     /*!< LOW : Set address latch enable (ALEm) to low during the write
                                                     data hold state.                                                          */
  EMIF_0_IFWCST_1_ALEWDH_HIGH          = 1,     /*!< HIGH : Set address latch enable (ALEm) to high during the write
                                                     data hold state.                                                          */
} EMIF_0_IFWCST_1_ALEWDH_Enum;



/* =========================================================================================================================== */
/* ================                                          EPCA_0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  MODE  ========================================================== */
/* ==============================================  EPCA_0 MODE CLKSEL [10..12]  ============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_CLKSEL                                                        */
  EPCA_0_MODE_CLKSEL_APB               = 0,     /*!< APB : Set the APB as the input clock (FCLKIN).                            */
  EPCA_0_MODE_CLKSEL_TIMER0            = 1,     /*!< TIMER0 : Set Timer 0 low overflows divided by 2 as the input
                                                     clock (FCLKIN).                                                           */
  EPCA_0_MODE_CLKSEL_HL_ECI            = 2,     /*!< HL_ECI : Set high-to-low transitions on ECI divided by 2 as
                                                     the input clock (FCLKIN).                                                 */
  EPCA_0_MODE_CLKSEL_EXTOSCN           = 3,     /*!< EXTOSCN : Set the external oscillator module output (EXTOSCn)
                                                     divided by 2 as the input clock (FCLKIN).                                 */
  EPCA_0_MODE_CLKSEL_ECI               = 4,     /*!< ECI : Set ECI transitions divided by 2 as the input clock (FCLKIN).       */
} EPCA_0_MODE_CLKSEL_Enum;

/* ==============================================  EPCA_0 MODE HDOSEL [14..15]  ============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_HDOSEL                                                        */
  EPCA_0_MODE_HDOSEL_THREE_DIFF        = 0,     /*!< THREE_DIFF : Select three differential outputs from Channels
                                                     3, 4, and 5 for the High Drive pins.                                      */
  EPCA_0_MODE_HDOSEL_TWO_DIFF          = 1,     /*!< TWO_DIFF : Select the differential outputs from Channels 4 and
                                                     5 and non-differential outputs from Channels 2 and 3 for
                                                     the High Drive pins.                                                      */
  EPCA_0_MODE_HDOSEL_ONE_DIFF          = 2,     /*!< ONE_DIFF : Select the differential output from Channel 5 and
                                                     non-differential outputs from Channels 1-4 for the High
                                                     Drive pins.                                                               */
  EPCA_0_MODE_HDOSEL_NO_DIFF           = 3,     /*!< NO_DIFF : Select the non-differential channel outputs (Channels
                                                     0-5) for the High Drive pins.                                             */
} EPCA_0_MODE_HDOSEL_Enum;

/* ===============================================  EPCA_0 MODE DEND [16..18]  =============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_DEND                                                          */
  EPCA_0_MODE_DEND_LIMIT               = 0,     /*!< LIMIT : Set the last register in a DMA write transfer to LIMITUPD.        */
  EPCA_0_MODE_DEND_CH0                 = 1,     /*!< CH0 : Set the last register in a DMA write transfer to Channel
                                                     0 CCAPVUPD.                                                               */
  EPCA_0_MODE_DEND_CH1                 = 2,     /*!< CH1 : Set the last register in a DMA write transfer to Channel
                                                     1 CCAPVUPD.                                                               */
  EPCA_0_MODE_DEND_CH2                 = 3,     /*!< CH2 : Set the last register in a DMA write transfer to Channel
                                                     2 CCAPVUPD.                                                               */
  EPCA_0_MODE_DEND_CH3                 = 4,     /*!< CH3 : Set the last register in a DMA write transfer to Channel
                                                     3 CCAPVUPD.                                                               */
  EPCA_0_MODE_DEND_CH4                 = 5,     /*!< CH4 : Set the last register in a DMA write transfer to Channel
                                                     4 CCAPVUPD.                                                               */
  EPCA_0_MODE_DEND_CH5                 = 6,     /*!< CH5 : Set the last register in a DMA write transfer to Channel
                                                     5 CCAPVUPD.                                                               */
  EPCA_0_MODE_DEND_EMPTY               = 7,     /*!< EMPTY : Empty slot.                                                       */
} EPCA_0_MODE_DEND_Enum;

/* ===============================================  EPCA_0 MODE DPTR [19..21]  =============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_DPTR                                                          */
  EPCA_0_MODE_DPTR_LIMIT               = 0,     /*!< LIMIT : The DMA channel will write to LIMITUPD next.                      */
  EPCA_0_MODE_DPTR_CH0                 = 1,     /*!< CH0 : The DMA channel will write to Channel 0 CCAPVUPD next.              */
  EPCA_0_MODE_DPTR_CH1                 = 2,     /*!< CH1 : The DMA channel will write to Channel 1 CCAPVUPD next.              */
  EPCA_0_MODE_DPTR_CH2                 = 3,     /*!< CH2 : The DMA channel will write to Channel 2 CCAPVUPD next.              */
  EPCA_0_MODE_DPTR_CH3                 = 4,     /*!< CH3 : The DMA channel will write to Channel 3 CCAPVUPD next.              */
  EPCA_0_MODE_DPTR_CH4                 = 5,     /*!< CH4 : The DMA channel will write to Channel 4 CCAPVUPD next.              */
  EPCA_0_MODE_DPTR_CH5                 = 6,     /*!< CH5 : The DMA channel will write to Channel 5 CCAPVUPD next.              */
  EPCA_0_MODE_DPTR_EMPTY               = 7,     /*!< EMPTY : Empty slot.                                                       */
} EPCA_0_MODE_DPTR_Enum;

/* ==============================================  EPCA_0 MODE DSTART [22..24]  ============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_DSTART                                                        */
  EPCA_0_MODE_DSTART_LIMIT             = 0,     /*!< LIMIT : Set the first register in a DMA write transfer to LIMITUPD.       */
  EPCA_0_MODE_DSTART_CH0               = 1,     /*!< CH0 : Set the first register in a DMA write transfer to Channel
                                                     0 CCAPVUPD.                                                               */
  EPCA_0_MODE_DSTART_CH1               = 2,     /*!< CH1 : Set the first register in a DMA write transfer to Channel
                                                     1 CCAPVUPD.                                                               */
  EPCA_0_MODE_DSTART_CH2               = 3,     /*!< CH2 : Set the first register in a DMA write transfer to Channel
                                                     2 CCAPVUPD.                                                               */
  EPCA_0_MODE_DSTART_CH3               = 4,     /*!< CH3 : Set the first register in a DMA write transfer to Channel
                                                     3 CCAPVUPD.                                                               */
  EPCA_0_MODE_DSTART_CH4               = 5,     /*!< CH4 : Set the first register in a DMA write transfer to Channel
                                                     4 CCAPVUPD.                                                               */
  EPCA_0_MODE_DSTART_CH5               = 6,     /*!< CH5 : Set the first register in a DMA write transfer to Channel
                                                     5 CCAPVUPD.                                                               */
  EPCA_0_MODE_DSTART_EMPTY             = 7,     /*!< EMPTY : Empty slot.                                                       */
} EPCA_0_MODE_DSTART_Enum;

/* ==============================================  EPCA_0 MODE DBUSYF [25..25]  ============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_DBUSYF                                                        */
  EPCA_0_MODE_DBUSYF_IDLE              = 0,     /*!< IDLE : The DMA channel is not servicing an EPCA control transfer.         */
  EPCA_0_MODE_DBUSYF_BUSY              = 1,     /*!< BUSY : The DMA channel is busy servicing an EPCA control transfer.        */
} EPCA_0_MODE_DBUSYF_Enum;

/* =============================================  EPCA_0 MODE STDOSEL [27..28]  ============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_STDOSEL                                                       */
  EPCA_0_MODE_STDOSEL_NO_DIFF          = 0,     /*!< NO_DIFF : Select the non-differential channel outputs (Channels
                                                     0-5) for the standard PB pins.                                            */
  EPCA_0_MODE_STDOSEL_ONE_DIFF         = 1,     /*!< ONE_DIFF : Select the differential output from Channel 2 and
                                                     non-differential outputs from Channels 0, 1, 3, and 4 for
                                                     the standard PB pins.                                                     */
  EPCA_0_MODE_STDOSEL_TWO_DIFF         = 2,     /*!< TWO_DIFF : Select the differential outputs from Channels 1 and
                                                     2 and non-differential outputs from Channels 0 and 3 for
                                                     the standard PB pins.                                                     */
  EPCA_0_MODE_STDOSEL_THREE_DIFF       = 3,     /*!< THREE_DIFF : Select three differential outputs from Channels
                                                     0, 1, and 2 for the standard PB pins.                                     */
} EPCA_0_MODE_STDOSEL_Enum;

