chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* =============================================  EPCA_0 CONTROL OVFIEN [0..0]  ============================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_OVFIEN                                                     */
  EPCA_0_CONTROL_OVFIEN_DISABLED       = 0,     /*!< DISABLED : Disable the EPCA counter overflow/limit event interrupt.       */
  EPCA_0_CONTROL_OVFIEN_ENABLED        = 1,     /*!< ENABLED : Enable the EPCA counter overflow/limit event interrupt.         */
} EPCA_0_CONTROL_OVFIEN_Enum;

/* =============================================  EPCA_0 CONTROL OVFDEN [1..1]  ============================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_OVFDEN                                                     */
  EPCA_0_CONTROL_OVFDEN_DISABLED       = 0,     /*!< DISABLED : Do not request DMA data when a EPCA counter overflow/limit
                                                     event occurs.                                                             */
  EPCA_0_CONTROL_OVFDEN_ENABLED        = 1,     /*!< ENABLED : Request DMA data when a EPCA counter overflow/limit
                                                     event occurs.                                                             */
} EPCA_0_CONTROL_OVFDEN_Enum;

/* =============================================  EPCA_0 CONTROL OVFSEN [2..2]  ============================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_OVFSEN                                                     */
  EPCA_0_CONTROL_OVFSEN_DISABLED       = 0,     /*!< DISABLED : Do not send a synchronization signal when a EPCA
                                                     counter overflow/limit event occurs.                                      */
  EPCA_0_CONTROL_OVFSEN_ENABLED        = 1,     /*!< ENABLED : Send a synchronization signal when a EPCA counter
                                                     overflow/limit event occurs.                                              */
} EPCA_0_CONTROL_OVFSEN_Enum;

/* =============================================  EPCA_0 CONTROL HALTIEN [3..3]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_HALTIEN                                                    */
  EPCA_0_CONTROL_HALTIEN_DISABLED      = 0,     /*!< DISABLED : Do not generate an interrupt if the EPCA halt input
                                                     is high.                                                                  */
  EPCA_0_CONTROL_HALTIEN_ENABLED       = 1,     /*!< ENABLED : Generate an interrupt if the EPCA halt input is high.           */
} EPCA_0_CONTROL_HALTIEN_Enum;

/* ==============================================  EPCA_0 CONTROL NOUPD [4..4]  ============================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_NOUPD                                                      */
  EPCA_0_CONTROL_NOUPD_INACTIVE        = 0,     /*!< INACTIVE : The EPCA registers will automatically load any new
                                                     update values after an overflow/limit event occurs.                       */
  EPCA_0_CONTROL_NOUPD_ACTIVE          = 1,     /*!< ACTIVE : The EPCA registers will not load any new update values
                                                     after an overflow/limit event occurs.                                     */
} EPCA_0_CONTROL_NOUPD_Enum;

/* =============================================  EPCA_0 CONTROL IDLEBEN [5..5]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_IDLEBEN                                                    */
  EPCA_0_CONTROL_IDLEBEN_DISABLED      = 0,     /*!< DISABLED : The EPCA module will stop running when the core halts
                                                     (idle).                                                                   */
  EPCA_0_CONTROL_IDLEBEN_ENABLED       = 1,     /*!< ENABLED : The EPCA module will continue normal operation when
                                                     the core halts (idle).                                                    */
} EPCA_0_CONTROL_IDLEBEN_Enum;

/* ==============================================  EPCA_0 CONTROL DBGMD [6..6]  ============================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_DBGMD                                                      */
  EPCA_0_CONTROL_DBGMD_HALT            = 0,     /*!< HALT : A debug breakpoint will stop the EPCA counter/timer.               */
  EPCA_0_CONTROL_DBGMD_RUN             = 1,     /*!< RUN : The EPCA will continue to operate while the core is halted
                                                     in debug mode.                                                            */
} EPCA_0_CONTROL_DBGMD_Enum;

/* =============================================  EPCA_0 CONTROL HALTEN [9..9]  ============================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_HALTEN                                                     */
  EPCA_0_CONTROL_HALTEN_DISABLED       = 0,     /*!< DISABLED : The Halt input (PB_HDKill) does not affect the EPCA
                                                     counter/timer.                                                            */
  EPCA_0_CONTROL_HALTEN_ENABLED        = 1,     /*!< ENABLED : An assertion of the Halt input (PB_HDKill) will stop
                                                     the EPCA counter/timer.                                                   */
} EPCA_0_CONTROL_HALTEN_Enum;

/* =============================================  EPCA_0 CONTROL STSEL [11..12]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_STSEL                                                      */
  EPCA_0_CONTROL_STSEL_EPCANT0         = 0,     /*!< EPCANT0 : Select input trigger 0, EPCAnT0 (Comparator 0 Output).          */
  EPCA_0_CONTROL_STSEL_EPCANT1         = 1,     /*!< EPCANT1 : Select input trigger 1, EPCAnT1 (Comparator 1 Output).          */
  EPCA_0_CONTROL_STSEL_EPCANT2         = 2,     /*!< EPCANT2 : Select input trigger 2, EPCAnT2 (Timer 0 High Overflow
                                                     ).                                                                        */
  EPCA_0_CONTROL_STSEL_EPCANT3         = 3,     /*!< EPCANT3 : Select input trigger 3, EPCAnT3 (Timer 1 High Overflow).        */
} EPCA_0_CONTROL_STSEL_Enum;

