chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  EPCA_0 CONTROL STESEL [13..13]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_STESEL                                                     */
  EPCA_0_CONTROL_STESEL_FALLING        = 0,     /*!< FALLING : A high-to-low transition (falling edge) on EPCAnTx
                                                     will start the counter/timer.                                             */
  EPCA_0_CONTROL_STESEL_RISING         = 1,     /*!< RISING : A low-to-high transition (rising edge) on EPCAnTx will
                                                     start the counter/timer.                                                  */
} EPCA_0_CONTROL_STESEL_Enum;

/* =============================================  EPCA_0 CONTROL STEN [14..14]  ============================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_STEN                                                       */
  EPCA_0_CONTROL_STEN_DISABLED         = 0,     /*!< DISABLED : Disable the input trigger (EPCAnTx). The EPCA counter/timer
                                                     will continue to run if the RUN bit is set regardless of
                                                     the value on the input trigger.                                           */
  EPCA_0_CONTROL_STEN_ENABLED          = 1,     /*!< ENABLED : Enable the input trigger (EPCAnTx). If RUN is set
                                                     to 1, the EPCA counter/timer will start running when the
                                                     selected input trigger (STSEL) meets the criteria set by
                                                     STESEL. It will not stop running if the criteria is no
                                                     longer met.                                                               */
} EPCA_0_CONTROL_STEN_Enum;

/* =============================================  EPCA_0 CONTROL DIVST [21..21]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_DIVST                                                      */
  EPCA_0_CONTROL_DIVST_OUTPUT_HIGH     = 0,     /*!< OUTPUT_HIGH : The clock divider is currently in the first half-cycle.     */
  EPCA_0_CONTROL_DIVST_OUTPUT_LOW      = 1,     /*!< OUTPUT_LOW : The clock divider is currently in the second half-cycle.     */
} EPCA_0_CONTROL_DIVST_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ==============================================  EPCA_0 STATUS C0CCI [0..0]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_C0CCI                                                       */
  EPCA_0_STATUS_C0CCI_NOT_SET          = 0,     /*!< NOT_SET : A Channel 0 match or capture event did not occur.               */
  EPCA_0_STATUS_C0CCI_SET              = 1,     /*!< SET : A Channel 0 match or capture event occurred.                        */
} EPCA_0_STATUS_C0CCI_Enum;

/* ==============================================  EPCA_0 STATUS C1CCI [1..1]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_C1CCI                                                       */
  EPCA_0_STATUS_C1CCI_NOT_SET          = 0,     /*!< NOT_SET : A Channel 1 match or capture event did not occur.               */
  EPCA_0_STATUS_C1CCI_SET              = 1,     /*!< SET : A Channel 1 match or capture event occurred.                        */
} EPCA_0_STATUS_C1CCI_Enum;

/* ==============================================  EPCA_0 STATUS C2CCI [2..2]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_C2CCI                                                       */
  EPCA_0_STATUS_C2CCI_NOT_SET          = 0,     /*!< NOT_SET : A Channel 2 match or capture event did not occur.               */
  EPCA_0_STATUS_C2CCI_SET              = 1,     /*!< SET : A Channel 2 match or capture event occurred.                        */
} EPCA_0_STATUS_C2CCI_Enum;

/* ==============================================  EPCA_0 STATUS C3CCI [3..3]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_C3CCI                                                       */
  EPCA_0_STATUS_C3CCI_NOT_SET          = 0,     /*!< NOT_SET : A Channel 3 match or capture event did not occur.               */
  EPCA_0_STATUS_C3CCI_SET              = 1,     /*!< SET : A Channel 3 match or capture event occurred.                        */
} EPCA_0_STATUS_C3CCI_Enum;

/* ==============================================  EPCA_0 STATUS C4CCI [4..4]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_C4CCI                                                       */
  EPCA_0_STATUS_C4CCI_NOT_SET          = 0,     /*!< NOT_SET : A Channel 4 match or capture event did not occur.               */
  EPCA_0_STATUS_C4CCI_SET              = 1,     /*!< SET : A Channel 4 match or capture event occurred.                        */
} EPCA_0_STATUS_C4CCI_Enum;

/* ==============================================  EPCA_0 STATUS C5CCI [5..5]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_C5CCI                                                       */
  EPCA_0_STATUS_C5CCI_NOT_SET          = 0,     /*!< NOT_SET : A Channel 5 match or capture event did not occur.               */
  EPCA_0_STATUS_C5CCI_SET              = 1,     /*!< SET : A Channel 5 match or capture event occurred.                        */
} EPCA_0_STATUS_C5CCI_Enum;

/* ===============================================  EPCA_0 STATUS RUN [6..6]  ================================================ */
typedef enum {                                  /*!< EPCA_0_STATUS_RUN                                                         */
  EPCA_0_STATUS_RUN_STOP               = 0,     /*!< STOP : Stop the EPCA Counter/Timer.                                       */
  EPCA_0_STATUS_RUN_START              = 1,     /*!< START : Start the EPCA Counter/Timer.                                     */
} EPCA_0_STATUS_RUN_Enum;

/* ===============================================  EPCA_0 STATUS OVFI [7..7]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_OVFI                                                        */
  EPCA_0_STATUS_OVFI_NOT_SET           = 0,     /*!< NOT_SET : An EPCA Counter/Timer overflow/limit event did not
                                                     occur.                                                                    */
  EPCA_0_STATUS_OVFI_SET               = 1,     /*!< SET : An EPCA Counter/Timer overflow/limit event occurred.                */
} EPCA_0_STATUS_OVFI_Enum;

