chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  EPCA_0 STATUS UPDCF [8..8]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_UPDCF                                                       */
  EPCA_0_STATUS_UPDCF_EMPTY            = 0,     /*!< EMPTY : An EPCA register update completed or is not pending.              */
  EPCA_0_STATUS_UPDCF_FULL             = 1,     /*!< FULL : An EPCA register update has not completed and is still
                                                     pending.                                                                  */
} EPCA_0_STATUS_UPDCF_Enum;

/* ==============================================  EPCA_0 STATUS HALTI [9..9]  =============================================== */
typedef enum {                                  /*!< EPCA_0_STATUS_HALTI                                                       */
  EPCA_0_STATUS_HALTI_NOT_SET          = 0,     /*!< NOT_SET : The Halt input (PB_HDKill) was not asserted.                    */
  EPCA_0_STATUS_HALTI_SET              = 1,     /*!< SET : The Halt input (PB_HDKill) was asserted.                            */
} EPCA_0_STATUS_HALTI_Enum;

/* ============================================  EPCA_0 STATUS C0IOVFI [10..10]  ============================================= */
typedef enum {                                  /*!< EPCA_0_STATUS_C0IOVFI                                                     */
  EPCA_0_STATUS_C0IOVFI_NOT_SET        = 0,     /*!< NOT_SET : Channel 0 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  EPCA_0_STATUS_C0IOVFI_SET            = 1,     /*!< SET : Channel 0 counted past the channel n-bit mode limit.                */
} EPCA_0_STATUS_C0IOVFI_Enum;

/* ============================================  EPCA_0 STATUS C1IOVFI [11..11]  ============================================= */
typedef enum {                                  /*!< EPCA_0_STATUS_C1IOVFI                                                     */
  EPCA_0_STATUS_C1IOVFI_NOT_SET        = 0,     /*!< NOT_SET : Channel 1 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  EPCA_0_STATUS_C1IOVFI_SET            = 1,     /*!< SET : Channel 1 counted past the channel n-bit mode limit.                */
} EPCA_0_STATUS_C1IOVFI_Enum;

/* ============================================  EPCA_0 STATUS C2IOVFI [12..12]  ============================================= */
typedef enum {                                  /*!< EPCA_0_STATUS_C2IOVFI                                                     */
  EPCA_0_STATUS_C2IOVFI_NOT_SET        = 0,     /*!< NOT_SET : Channel 2 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  EPCA_0_STATUS_C2IOVFI_SET            = 1,     /*!< SET : Channel 2 counted past the channel n-bit mode limit.                */
} EPCA_0_STATUS_C2IOVFI_Enum;

/* ============================================  EPCA_0 STATUS C3IOVFI [13..13]  ============================================= */
typedef enum {                                  /*!< EPCA_0_STATUS_C3IOVFI                                                     */
  EPCA_0_STATUS_C3IOVFI_NOT_SET        = 0,     /*!< NOT_SET : Channel 3 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  EPCA_0_STATUS_C3IOVFI_SET            = 1,     /*!< SET : Channel 3 counted past the channel n-bit mode limit.                */
} EPCA_0_STATUS_C3IOVFI_Enum;

/* ============================================  EPCA_0 STATUS C4IOVFI [14..14]  ============================================= */
typedef enum {                                  /*!< EPCA_0_STATUS_C4IOVFI                                                     */
  EPCA_0_STATUS_C4IOVFI_NOT_SET        = 0,     /*!< NOT_SET : Channel 4 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  EPCA_0_STATUS_C4IOVFI_SET            = 1,     /*!< SET : Channel 4 counted past the channel n-bit mode limit.                */
} EPCA_0_STATUS_C4IOVFI_Enum;

/* ============================================  EPCA_0 STATUS C5IOVFI [15..15]  ============================================= */
typedef enum {                                  /*!< EPCA_0_STATUS_C5IOVFI                                                     */
  EPCA_0_STATUS_C5IOVFI_NOT_SET        = 0,     /*!< NOT_SET : Channel 5 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  EPCA_0_STATUS_C5IOVFI_SET            = 1,     /*!< SET : Channel 5 counted past the channel n-bit mode limit.                */
} EPCA_0_STATUS_C5IOVFI_Enum;

/* ========================================================  COUNTER  ======================================================== */
/* =========================================================  LIMIT  ========================================================= */
/* =======================================================  LIMITUPD  ======================================================== */
/* =========================================================  DTIME  ========================================================= */
/* ========================================================  DTARGET  ======================================================== */
/* ========================================================  MODE_0  ========================================================= */
/* ==============================================  EPCA_0 MODE_0 COSEL [0..1]  =============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_0_COSEL                                                       */
  EPCA_0_MODE_0_COSEL_TOGGLE_OUTPUT    = 0,     /*!< TOGGLE_OUTPUT : Toggle the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  EPCA_0_MODE_0_COSEL_SET_OUTPUT       = 1,     /*!< SET_OUTPUT : Set the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  EPCA_0_MODE_0_COSEL_CLEAR_OUTPUT     = 2,     /*!< CLEAR_OUTPUT : Clear the output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  EPCA_0_MODE_0_COSEL_NO_CHANGE        = 3,     /*!< NO_CHANGE : Capture/Compare, overflow, or intermediate events
                                                     do not control the output state.                                          */
} EPCA_0_MODE_0_COSEL_Enum;

