chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  EPCA_0 MODE_0 DIFGEN [6..6]  ============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_0_DIFGEN                                                      */
  EPCA_0_MODE_0_DIFGEN_DISABLED        = 0,     /*!< DISABLED : Disable the differential signal generator. The channel
                                                     will output a single non-differential output.                             */
  EPCA_0_MODE_0_DIFGEN_ENABLED         = 1,     /*!< ENABLED : Enable the differential signal generator. The channel
                                                     will output two differential outputs: X Phase (XPH) and
                                                     Y Phase (YPH).                                                            */
} EPCA_0_MODE_0_DIFGEN_Enum;

/* ===============================================  EPCA_0 MODE_0 CMD [8..10]  =============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_0_CMD                                                         */
  EPCA_0_MODE_0_CMD_EDGE_PWM           = 0,     /*!< EDGE_PWM : Configure the channel for edge-aligned PWM mode.               */
  EPCA_0_MODE_0_CMD_CENTER_ALIGNED_PWM = 1,     /*!< CENTER_ALIGNED_PWM : Configure the channel for center-aligned
                                                     PWM mode.                                                                 */
  EPCA_0_MODE_0_CMD_HF_SQUARE_WAVE     = 2,     /*!< HF_SQUARE_WAVE : Configure the channel for high-frequency/square-wave
                                                     mode.                                                                     */
  EPCA_0_MODE_0_CMD_TIMER_CAPTURE      = 3,     /*!< TIMER_CAPTURE : Configure the channel for timer/capture mode.             */
  EPCA_0_MODE_0_CMD_N_BIT_PWM          = 4,     /*!< N_BIT_PWM : Configure the channel for n-bit edge-aligned PWM
                                                     mode.                                                                     */
} EPCA_0_MODE_0_CMD_Enum;

/* =======================================================  CONTROL_0  ======================================================= */
/* ============================================  EPCA_0 CONTROL_0 COUTST [0..0]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_COUTST                                                   */
  EPCA_0_CONTROL_0_COUTST_LOW          = 0,     /*!< LOW : The channel output state is low.                                    */
  EPCA_0_CONTROL_0_COUTST_HIGH         = 1,     /*!< HIGH : The channel output state is high.                                  */
} EPCA_0_CONTROL_0_COUTST_Enum;

/* ============================================  EPCA_0 CONTROL_0 CPCAPEN [1..1]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CPCAPEN                                                  */
  EPCA_0_CONTROL_0_CPCAPEN_DISABLED    = 0,     /*!< DISABLED : Disable positive-edge input capture.                           */
  EPCA_0_CONTROL_0_CPCAPEN_ENABLED     = 1,     /*!< ENABLED : Enable positive-edge input capture.                             */
} EPCA_0_CONTROL_0_CPCAPEN_Enum;

/* ============================================  EPCA_0 CONTROL_0 CNCAPEN [2..2]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CNCAPEN                                                  */
  EPCA_0_CONTROL_0_CNCAPEN_DISABLED    = 0,     /*!< DISABLED : Disable negative-edge input capture.                           */
  EPCA_0_CONTROL_0_CNCAPEN_ENABLED     = 1,     /*!< ENABLED : Enable negative-edge input capture.                             */
} EPCA_0_CONTROL_0_CNCAPEN_Enum;

/* ============================================  EPCA_0 CONTROL_0 CUPDCF [3..3]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CUPDCF                                                   */
  EPCA_0_CONTROL_0_CUPDCF_NOT_SET      = 0,     /*!< NOT_SET : A EPCA channel register update completed or is not
                                                     pending.                                                                  */
  EPCA_0_CONTROL_0_CUPDCF_SET          = 1,     /*!< SET : A EPCA channel register update has not completed and is
                                                     still pending.                                                            */
} EPCA_0_CONTROL_0_CUPDCF_Enum;

/* =============================================  EPCA_0 CONTROL_0 YPHST [5..5]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_YPHST                                                    */
  EPCA_0_CONTROL_0_YPHST_LOW           = 0,     /*!< LOW : Set the Y Phase output state to low.                                */
  EPCA_0_CONTROL_0_YPHST_HIGH          = 1,     /*!< HIGH : Set the Y Phase output state to high.                              */
} EPCA_0_CONTROL_0_YPHST_Enum;

/* ===========================================  EPCA_0 CONTROL_0 ACTIVEPH [6..6]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_ACTIVEPH                                                 */
  EPCA_0_CONTROL_0_ACTIVEPH_YACTIVE    = 0,     /*!< YACTIVE : The Y Phase is active and X Phase is inactive.                  */
  EPCA_0_CONTROL_0_ACTIVEPH_XACTIVE    = 1,     /*!< XACTIVE : The X Phase is active and Y Phase is inactive.                  */
} EPCA_0_CONTROL_0_ACTIVEPH_Enum;

/* =============================================  EPCA_0 CONTROL_0 XPHST [7..7]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_XPHST                                                    */
  EPCA_0_CONTROL_0_XPHST_LOW           = 0,     /*!< LOW : Set the X Phase output state to low.                                */
  EPCA_0_CONTROL_0_XPHST_HIGH          = 1,     /*!< HIGH : Set the X Phase output state to high.                              */
} EPCA_0_CONTROL_0_XPHST_Enum;

/* =============================================  EPCA_0 CONTROL_0 CCIEN [8..8]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CCIEN                                                    */
  EPCA_0_CONTROL_0_CCIEN_DISABLED      = 0,     /*!< DISABLED : Disable the channel capture/compare interrupt.                 */
  EPCA_0_CONTROL_0_CCIEN_ENABLED       = 1,     /*!< ENABLED : Enable the channel capture/compare interrupt.                   */
} EPCA_0_CONTROL_0_CCIEN_Enum;

/* =============================================  EPCA_0 CONTROL_0 CCDEN [9..9]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CCDEN                                                    */
  EPCA_0_CONTROL_0_CCDEN_DISABLED      = 0,     /*!< DISABLED : Do not request DMA data when a channel capture/compare
                                                     event occurs.                                                             */
  EPCA_0_CONTROL_0_CCDEN_ENABLED       = 1,     /*!< ENABLED : Request DMA data when a channel capture/compare event
                                                     occurs.                                                                   */
} EPCA_0_CONTROL_0_CCDEN_Enum;

