chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  EPCA_0 CONTROL_0 CCSEN [10..10]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CCSEN                                                    */
  EPCA_0_CONTROL_0_CCSEN_DISABLED      = 0,     /*!< DISABLED : Do not send a synchronization signal when a channel
                                                     capture/compare event occurs.                                             */
  EPCA_0_CONTROL_0_CCSEN_ENABLED       = 1,     /*!< ENABLED : Send a synchronization signal when a channel capture/compare
                                                     event occurs.                                                             */
} EPCA_0_CONTROL_0_CCSEN_Enum;

/* ==========================================  EPCA_0 CONTROL_0 CIOVFIEN [11..11]  =========================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CIOVFIEN                                                 */
  EPCA_0_CONTROL_0_CIOVFIEN_DISABLED   = 0,     /*!< DISABLED : Disable the channel intermediate overflow interrupt.           */
  EPCA_0_CONTROL_0_CIOVFIEN_ENABLED    = 1,     /*!< ENABLED : Enable the channel intermediate overflow interrupt.             */
} EPCA_0_CONTROL_0_CIOVFIEN_Enum;

/* ==========================================  EPCA_0 CONTROL_0 CIOVFDEN [12..12]  =========================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CIOVFDEN                                                 */
  EPCA_0_CONTROL_0_CIOVFDEN_DISABLED   = 0,     /*!< DISABLED : Do not request DMA data when a channel intermediate
                                                     overflow event occurs.                                                    */
  EPCA_0_CONTROL_0_CIOVFDEN_ENABLED    = 1,     /*!< ENABLED : Request DMA data when a channel intermediate overflow
                                                     event occurs.                                                             */
} EPCA_0_CONTROL_0_CIOVFDEN_Enum;

/* ==========================================  EPCA_0 CONTROL_0 CIOVFSEN [13..13]  =========================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_0_CIOVFSEN                                                 */
  EPCA_0_CONTROL_0_CIOVFSEN_DISABLED   = 0,     /*!< DISABLED : Do not send a synchronization signal when a channel
                                                     intermediate overflow event occurs.                                       */
  EPCA_0_CONTROL_0_CIOVFSEN_ENABLED    = 1,     /*!< ENABLED : Send a synchronization signal when a channel intermediate
                                                     overflow occurs.                                                          */
} EPCA_0_CONTROL_0_CIOVFSEN_Enum;

/* ========================================================  CCAPV_0  ======================================================== */
/* ======================================================  CCAPVUPD_0  ======================================================= */
/* ========================================================  MODE_1  ========================================================= */
/* ==============================================  EPCA_0 MODE_1 COSEL [0..1]  =============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_1_COSEL                                                       */
  EPCA_0_MODE_1_COSEL_TOGGLE_OUTPUT    = 0,     /*!< TOGGLE_OUTPUT : Toggle the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  EPCA_0_MODE_1_COSEL_SET_OUTPUT       = 1,     /*!< SET_OUTPUT : Set the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  EPCA_0_MODE_1_COSEL_CLEAR_OUTPUT     = 2,     /*!< CLEAR_OUTPUT : Clear the output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  EPCA_0_MODE_1_COSEL_NO_CHANGE        = 3,     /*!< NO_CHANGE : Capture/Compare, overflow, or intermediate events
                                                     do not control the output state.                                          */
} EPCA_0_MODE_1_COSEL_Enum;

/* ==============================================  EPCA_0 MODE_1 DIFGEN [6..6]  ============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_1_DIFGEN                                                      */
  EPCA_0_MODE_1_DIFGEN_DISABLED        = 0,     /*!< DISABLED : Disable the differential signal generator. The channel
                                                     will output a single non-differential output.                             */
  EPCA_0_MODE_1_DIFGEN_ENABLED         = 1,     /*!< ENABLED : Enable the differential signal generator. The channel
                                                     will output two differential outputs: X Phase (XPH) and
                                                     Y Phase (YPH).                                                            */
} EPCA_0_MODE_1_DIFGEN_Enum;

/* ===============================================  EPCA_0 MODE_1 CMD [8..10]  =============================================== */
typedef enum {                                  /*!< EPCA_0_MODE_1_CMD                                                         */
  EPCA_0_MODE_1_CMD_EDGE_PWM           = 0,     /*!< EDGE_PWM : Configure the channel for edge-aligned PWM mode.               */
  EPCA_0_MODE_1_CMD_CENTER_ALIGNED_PWM = 1,     /*!< CENTER_ALIGNED_PWM : Configure the channel for center-aligned
                                                     PWM mode.                                                                 */
  EPCA_0_MODE_1_CMD_HF_SQUARE_WAVE     = 2,     /*!< HF_SQUARE_WAVE : Configure the channel for high-frequency/square-wave
                                                     mode.                                                                     */
  EPCA_0_MODE_1_CMD_TIMER_CAPTURE      = 3,     /*!< TIMER_CAPTURE : Configure the channel for timer/capture mode.             */
  EPCA_0_MODE_1_CMD_N_BIT_PWM          = 4,     /*!< N_BIT_PWM : Configure the channel for n-bit edge-aligned PWM
                                                     mode.                                                                     */
} EPCA_0_MODE_1_CMD_Enum;

/* =======================================================  CONTROL_1  ======================================================= */
/* ============================================  EPCA_0 CONTROL_1 COUTST [0..0]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_COUTST                                                   */
  EPCA_0_CONTROL_1_COUTST_LOW          = 0,     /*!< LOW : The channel output state is low.                                    */
  EPCA_0_CONTROL_1_COUTST_HIGH         = 1,     /*!< HIGH : The channel output state is high.                                  */
} EPCA_0_CONTROL_1_COUTST_Enum;

