chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  EPCA_0 CONTROL_1 CPCAPEN [1..1]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_CPCAPEN                                                  */
  EPCA_0_CONTROL_1_CPCAPEN_DISABLED    = 0,     /*!< DISABLED : Disable positive-edge input capture.                           */
  EPCA_0_CONTROL_1_CPCAPEN_ENABLED     = 1,     /*!< ENABLED : Enable positive-edge input capture.                             */
} EPCA_0_CONTROL_1_CPCAPEN_Enum;

/* ============================================  EPCA_0 CONTROL_1 CNCAPEN [2..2]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_CNCAPEN                                                  */
  EPCA_0_CONTROL_1_CNCAPEN_DISABLED    = 0,     /*!< DISABLED : Disable negative-edge input capture.                           */
  EPCA_0_CONTROL_1_CNCAPEN_ENABLED     = 1,     /*!< ENABLED : Enable negative-edge input capture.                             */
} EPCA_0_CONTROL_1_CNCAPEN_Enum;

/* ============================================  EPCA_0 CONTROL_1 CUPDCF [3..3]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_CUPDCF                                                   */
  EPCA_0_CONTROL_1_CUPDCF_NOT_SET      = 0,     /*!< NOT_SET : A EPCA channel register update completed or is not
                                                     pending.                                                                  */
  EPCA_0_CONTROL_1_CUPDCF_SET          = 1,     /*!< SET : A EPCA channel register update has not completed and is
                                                     still pending.                                                            */
} EPCA_0_CONTROL_1_CUPDCF_Enum;

/* =============================================  EPCA_0 CONTROL_1 YPHST [5..5]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_YPHST                                                    */
  EPCA_0_CONTROL_1_YPHST_LOW           = 0,     /*!< LOW : Set the Y Phase output state to low.                                */
  EPCA_0_CONTROL_1_YPHST_HIGH          = 1,     /*!< HIGH : Set the Y Phase output state to high.                              */
} EPCA_0_CONTROL_1_YPHST_Enum;

/* ===========================================  EPCA_0 CONTROL_1 ACTIVEPH [6..6]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_ACTIVEPH                                                 */
  EPCA_0_CONTROL_1_ACTIVEPH_YACTIVE    = 0,     /*!< YACTIVE : The Y Phase is active and X Phase is inactive.                  */
  EPCA_0_CONTROL_1_ACTIVEPH_XACTIVE    = 1,     /*!< XACTIVE : The X Phase is active and Y Phase is inactive.                  */
} EPCA_0_CONTROL_1_ACTIVEPH_Enum;

/* =============================================  EPCA_0 CONTROL_1 XPHST [7..7]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_XPHST                                                    */
  EPCA_0_CONTROL_1_XPHST_LOW           = 0,     /*!< LOW : Set the X Phase output state to low.                                */
  EPCA_0_CONTROL_1_XPHST_HIGH          = 1,     /*!< HIGH : Set the X Phase output state to high.                              */
} EPCA_0_CONTROL_1_XPHST_Enum;

/* =============================================  EPCA_0 CONTROL_1 CCIEN [8..8]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_CCIEN                                                    */
  EPCA_0_CONTROL_1_CCIEN_DISABLED      = 0,     /*!< DISABLED : Disable the channel capture/compare interrupt.                 */
  EPCA_0_CONTROL_1_CCIEN_ENABLED       = 1,     /*!< ENABLED : Enable the channel capture/compare interrupt.                   */
} EPCA_0_CONTROL_1_CCIEN_Enum;

/* =============================================  EPCA_0 CONTROL_1 CCDEN [9..9]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_CCDEN                                                    */
  EPCA_0_CONTROL_1_CCDEN_DISABLED      = 0,     /*!< DISABLED : Do not request DMA data when a channel capture/compare
                                                     event occurs.                                                             */
  EPCA_0_CONTROL_1_CCDEN_ENABLED       = 1,     /*!< ENABLED : Request DMA data when a channel capture/compare event
                                                     occurs.                                                                   */
} EPCA_0_CONTROL_1_CCDEN_Enum;

/* ============================================  EPCA_0 CONTROL_1 CCSEN [10..10]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_CCSEN                                                    */
  EPCA_0_CONTROL_1_CCSEN_DISABLED      = 0,     /*!< DISABLED : Do not send a synchronization signal when a channel
                                                     capture/compare event occurs.                                             */
  EPCA_0_CONTROL_1_CCSEN_ENABLED       = 1,     /*!< ENABLED : Send a synchronization signal when a channel capture/compare
                                                     event occurs.                                                             */
} EPCA_0_CONTROL_1_CCSEN_Enum;

/* ==========================================  EPCA_0 CONTROL_1 CIOVFIEN [11..11]  =========================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_1_CIOVFIEN                                                 */
  EPCA_0_CONTROL_1_CIOVFIEN_DISABLED   = 0,     /*!< DISABLED : Disable the channel intermediate overflow interrupt.           */
  EPCA_0_CONTROL_1_CIOVFIEN_ENABLED    = 1,     /*!< ENABLED : Enable the channel intermediate overflow interrupt.             */
} EPCA_0_CONTROL_1_CIOVFIEN_Enum;

