chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  CONTROL_5  ======================================================= */
/* ============================================  EPCA_0 CONTROL_5 COUTST [0..0]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_COUTST                                                   */
  EPCA_0_CONTROL_5_COUTST_LOW          = 0,     /*!< LOW : The channel output state is low.                                    */
  EPCA_0_CONTROL_5_COUTST_HIGH         = 1,     /*!< HIGH : The channel output state is high.                                  */
} EPCA_0_CONTROL_5_COUTST_Enum;

/* ============================================  EPCA_0 CONTROL_5 CPCAPEN [1..1]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CPCAPEN                                                  */
  EPCA_0_CONTROL_5_CPCAPEN_DISABLED    = 0,     /*!< DISABLED : Disable positive-edge input capture.                           */
  EPCA_0_CONTROL_5_CPCAPEN_ENABLED     = 1,     /*!< ENABLED : Enable positive-edge input capture.                             */
} EPCA_0_CONTROL_5_CPCAPEN_Enum;

/* ============================================  EPCA_0 CONTROL_5 CNCAPEN [2..2]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CNCAPEN                                                  */
  EPCA_0_CONTROL_5_CNCAPEN_DISABLED    = 0,     /*!< DISABLED : Disable negative-edge input capture.                           */
  EPCA_0_CONTROL_5_CNCAPEN_ENABLED     = 1,     /*!< ENABLED : Enable negative-edge input capture.                             */
} EPCA_0_CONTROL_5_CNCAPEN_Enum;

/* ============================================  EPCA_0 CONTROL_5 CUPDCF [3..3]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CUPDCF                                                   */
  EPCA_0_CONTROL_5_CUPDCF_NOT_SET      = 0,     /*!< NOT_SET : A EPCA channel register update completed or is not
                                                     pending.                                                                  */
  EPCA_0_CONTROL_5_CUPDCF_SET          = 1,     /*!< SET : A EPCA channel register update has not completed and is
                                                     still pending.                                                            */
} EPCA_0_CONTROL_5_CUPDCF_Enum;

/* =============================================  EPCA_0 CONTROL_5 YPHST [5..5]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_YPHST                                                    */
  EPCA_0_CONTROL_5_YPHST_LOW           = 0,     /*!< LOW : Set the Y Phase output state to low.                                */
  EPCA_0_CONTROL_5_YPHST_HIGH          = 1,     /*!< HIGH : Set the Y Phase output state to high.                              */
} EPCA_0_CONTROL_5_YPHST_Enum;

/* ===========================================  EPCA_0 CONTROL_5 ACTIVEPH [6..6]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_ACTIVEPH                                                 */
  EPCA_0_CONTROL_5_ACTIVEPH_YACTIVE    = 0,     /*!< YACTIVE : The Y Phase is active and X Phase is inactive.                  */
  EPCA_0_CONTROL_5_ACTIVEPH_XACTIVE    = 1,     /*!< XACTIVE : The X Phase is active and Y Phase is inactive.                  */
} EPCA_0_CONTROL_5_ACTIVEPH_Enum;

/* =============================================  EPCA_0 CONTROL_5 XPHST [7..7]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_XPHST                                                    */
  EPCA_0_CONTROL_5_XPHST_LOW           = 0,     /*!< LOW : Set the X Phase output state to low.                                */
  EPCA_0_CONTROL_5_XPHST_HIGH          = 1,     /*!< HIGH : Set the X Phase output state to high.                              */
} EPCA_0_CONTROL_5_XPHST_Enum;

/* =============================================  EPCA_0 CONTROL_5 CCIEN [8..8]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CCIEN                                                    */
  EPCA_0_CONTROL_5_CCIEN_DISABLED      = 0,     /*!< DISABLED : Disable the channel capture/compare interrupt.                 */
  EPCA_0_CONTROL_5_CCIEN_ENABLED       = 1,     /*!< ENABLED : Enable the channel capture/compare interrupt.                   */
} EPCA_0_CONTROL_5_CCIEN_Enum;

/* =============================================  EPCA_0 CONTROL_5 CCDEN [9..9]  ============================================= */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CCDEN                                                    */
  EPCA_0_CONTROL_5_CCDEN_DISABLED      = 0,     /*!< DISABLED : Do not request DMA data when a channel capture/compare
                                                     event occurs.                                                             */
  EPCA_0_CONTROL_5_CCDEN_ENABLED       = 1,     /*!< ENABLED : Request DMA data when a channel capture/compare event
                                                     occurs.                                                                   */
} EPCA_0_CONTROL_5_CCDEN_Enum;

/* ============================================  EPCA_0 CONTROL_5 CCSEN [10..10]  ============================================ */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CCSEN                                                    */
  EPCA_0_CONTROL_5_CCSEN_DISABLED      = 0,     /*!< DISABLED : Do not send a synchronization signal when a channel
                                                     capture/compare event occurs.                                             */
  EPCA_0_CONTROL_5_CCSEN_ENABLED       = 1,     /*!< ENABLED : Send a synchronization signal when a channel capture/compare
                                                     event occurs.                                                             */
} EPCA_0_CONTROL_5_CCSEN_Enum;

/* ==========================================  EPCA_0 CONTROL_5 CIOVFIEN [11..11]  =========================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CIOVFIEN                                                 */
  EPCA_0_CONTROL_5_CIOVFIEN_DISABLED   = 0,     /*!< DISABLED : Disable the channel intermediate overflow interrupt.           */
  EPCA_0_CONTROL_5_CIOVFIEN_ENABLED    = 1,     /*!< ENABLED : Enable the channel intermediate overflow interrupt.             */
} EPCA_0_CONTROL_5_CIOVFIEN_Enum;

/* ==========================================  EPCA_0 CONTROL_5 CIOVFDEN [12..12]  =========================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CIOVFDEN                                                 */
  EPCA_0_CONTROL_5_CIOVFDEN_DISABLED   = 0,     /*!< DISABLED : Do not request DMA data when a channel intermediate
                                                     overflow event occurs.                                                    */
  EPCA_0_CONTROL_5_CIOVFDEN_ENABLED    = 1,     /*!< ENABLED : Request DMA data when a channel intermediate overflow
                                                     event occurs.                                                             */
} EPCA_0_CONTROL_5_CIOVFDEN_Enum;

/* ==========================================  EPCA_0 CONTROL_5 CIOVFSEN [13..13]  =========================================== */
typedef enum {                                  /*!< EPCA_0_CONTROL_5_CIOVFSEN                                                 */
  EPCA_0_CONTROL_5_CIOVFSEN_DISABLED   = 0,     /*!< DISABLED : Do not send a synchronization signal when a channel
                                                     intermediate overflow event occurs.                                       */
  EPCA_0_CONTROL_5_CIOVFSEN_ENABLED    = 1,     /*!< ENABLED : Send a synchronization signal when a channel intermediate
                                                     overflow occurs.                                                          */
} EPCA_0_CONTROL_5_CIOVFSEN_Enum;

/* ========================================================  CCAPV_5  ======================================================== */
/* ======================================================  CCAPVUPD_5  ======================================================= */


/* =========================================================================================================================== */
/* ================                                        FLASHCTRL_0                                        ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* ============================================  FLASHCTRL_0 CONFIG SPMD [0..1]  ============================================= */
typedef enum {                                  /*!< FLASHCTRL_0_CONFIG_SPMD                                                   */
  FLASHCTRL_0_CONFIG_SPMD_MODE0        = 0,     /*!< MODE0 : Read and write the Flash at speed mode 0.                         */
  FLASHCTRL_0_CONFIG_SPMD_MODE1        = 1,     /*!< MODE1 : Read and write the Flash at speed mode 1.                         */
  FLASHCTRL_0_CONFIG_SPMD_MODE2        = 2,     /*!< MODE2 : Read and write the Flash at speed mode 2.                         */
  FLASHCTRL_0_CONFIG_SPMD_MODE3        = 3,     /*!< MODE3 : Read and write the Flash at speed mode 3.                         */
} FLASHCTRL_0_CONFIG_SPMD_Enum;

/* ============================================  FLASHCTRL_0 CONFIG RDSEN [4..4]  ============================================ */
typedef enum {                                  /*!< FLASHCTRL_0_CONFIG_RDSEN                                                  */
  FLASHCTRL_0_CONFIG_RDSEN_DISABLED    = 0,     /*!< DISABLED : Disable read store mode.                                       */
  FLASHCTRL_0_CONFIG_RDSEN_ENABLED     = 1,     /*!< ENABLED : Enable read store mode.                                         */
} FLASHCTRL_0_CONFIG_RDSEN_Enum;

/* ============================================  FLASHCTRL_0 CONFIG DPFEN [6..6]  ============================================ */
typedef enum {                                  /*!< FLASHCTRL_0_CONFIG_DPFEN                                                  */
  FLASHCTRL_0_CONFIG_DPFEN_DISABLED    = 0,     /*!< DISABLED : Data accesses are excluded from the prefetch buffer.           */
  FLASHCTRL_0_CONFIG_DPFEN_ENABLED     = 1,     /*!< ENABLED : Data accesses are included in the prefetch buffer.              */
} FLASHCTRL_0_CONFIG_DPFEN_Enum;

/* ============================================  FLASHCTRL_0 CONFIG PFINH [7..7]  ============================================ */
typedef enum {                                  /*!< FLASHCTRL_0_CONFIG_PFINH                                                  */
  FLASHCTRL_0_CONFIG_PFINH_INACTIVE    = 0,     /*!< INACTIVE : Any reads from Flash are prefetched until the prefetch
                                                     buffer is full.                                                           */
  FLASHCTRL_0_CONFIG_PFINH_ACTIVE      = 1,     /*!< ACTIVE : Inhibit the prefetch engine.                                     */
} FLASHCTRL_0_CONFIG_PFINH_Enum;

/* ===========================================  FLASHCTRL_0 CONFIG SQWEN [16..16]  =========================================== */
typedef enum {                                  /*!< FLASHCTRL_0_CONFIG_SQWEN                                                  */
  FLASHCTRL_0_CONFIG_SQWEN_DISABLED    = 0,     /*!< DISABLED : Disable sequential write mode.                                 */
  FLASHCTRL_0_CONFIG_SQWEN_ENABLED     = 1,     /*!< ENABLED : Enable sequential write mode.                                   */
} FLASHCTRL_0_CONFIG_SQWEN_Enum;

/* ==========================================  FLASHCTRL_0 CONFIG ERASEEN [18..18]  ========================================== */
typedef enum {                                  /*!< FLASHCTRL_0_CONFIG_ERASEEN                                                */
  FLASHCTRL_0_CONFIG_ERASEEN_DISABLED  = 0,     /*!< DISABLED : Writes to the WRDATA field will initiate a write
                                                     to Flash at the address in the WRADDR field.                              */
  FLASHCTRL_0_CONFIG_ERASEEN_ENABLED   = 1,     /*!< ENABLED : Writes to the WRDATA field will initiate an erase
                                                     of the Flash page containing the address in the WRADDR
                                                     field.                                                                    */
} FLASHCTRL_0_CONFIG_ERASEEN_Enum;

/* ==========================================  FLASHCTRL_0 CONFIG BUFSTS [19..19]  =========================================== */
typedef enum {                                  /*!< FLASHCTRL_0_CONFIG_BUFSTS                                                 */
  FLASHCTRL_0_CONFIG_BUFSTS_EMPTY      = 0,     /*!< EMPTY : The Flash controller write data buffer is empty.                  */
  FLASHCTRL_0_CONFIG_BUFSTS_FULL       = 1,     /*!< FULL : The Flash controller write data buffer is full.                    */
} FLASHCTRL_0_CONFIG_BUFSTS_Enum;

