chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  FLASHCTRL_0 CONFIG BUSYF [20..20]  =========================================== */
typedef enum {                                  /*!< FLASHCTRL_0_CONFIG_BUSYF                                                  */
  FLASHCTRL_0_CONFIG_BUSYF_NOT_SET     = 0,     /*!< NOT_SET : The Flash interface is not busy.                                */
  FLASHCTRL_0_CONFIG_BUSYF_SET         = 1,     /*!< SET : The Flash interface is busy with an operation.                      */
} FLASHCTRL_0_CONFIG_BUSYF_Enum;

/* ========================================================  WRADDR  ========================================================= */
/* ========================================================  WRDATA  ========================================================= */
/* ==========================================================  KEY  ========================================================== */
/* ==============================================  FLASHCTRL_0 KEY KEY [0..7]  =============================================== */
typedef enum {                                  /*!< FLASHCTRL_0_KEY_KEY                                                       */
  FLASHCTRL_0_KEY_KEY_MULTI_LOCK       = 90,    /*!< MULTI_LOCK : MULTI_LOCK                                                   */
  FLASHCTRL_0_KEY_KEY_INITIAL_UNLOCK   = 165,   /*!< INITIAL_UNLOCK : INITIAL_UNLOCK                                           */
  FLASHCTRL_0_KEY_KEY_SINGLE_UNLOCK    = 241,   /*!< SINGLE_UNLOCK : SINGLE_UNLOCK                                             */
  FLASHCTRL_0_KEY_KEY_MULTI_UNLOCK     = 242,   /*!< MULTI_UNLOCK : MULTI_UNLOCK                                               */
} FLASHCTRL_0_KEY_KEY_Enum;

/* =======================================================  TCONTROL  ======================================================== */
/* ==========================================  FLASHCTRL_0 TCONTROL FLRTMD [6..6]  =========================================== */
typedef enum {                                  /*!< FLASHCTRL_0_TCONTROL_FLRTMD                                               */
  FLASHCTRL_0_TCONTROL_FLRTMD_SLOW     = 0,     /*!< SLOW : Configure the Flash read controller for AHB clocks below
                                                     20 MHz.                                                                   */
  FLASHCTRL_0_TCONTROL_FLRTMD_FAST     = 1,     /*!< FAST : Configure the Flash read controller for AHB clocks above
                                                     20 MHz.                                                                   */
} FLASHCTRL_0_TCONTROL_FLRTMD_Enum;



/* =========================================================================================================================== */
/* ================                                           I2C_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  I2C_0 CONTROL BUSYF [0..0]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_BUSYF                                                       */
  I2C_0_CONTROL_BUSYF_NOT_SET          = 0,     /*!< NOT_SET : A transaction is not currently taking place.                    */
  I2C_0_CONTROL_BUSYF_SET              = 1,     /*!< SET : A transaction is currently taking place.                            */
} I2C_0_CONTROL_BUSYF_Enum;

/* ===============================================  I2C_0 CONTROL ACK [1..1]  ================================================ */
typedef enum {                                  /*!< I2C_0_CONTROL_ACK                                                         */
  I2C_0_CONTROL_ACK_NOT_SET            = 0,     /*!< NOT_SET : Read: ACK has not been received. Write: Do not send
                                                     an ACK.                                                                   */
  I2C_0_CONTROL_ACK_SET                = 1,     /*!< SET : Read: ACK received. Write: Send an ACK.                             */
} I2C_0_CONTROL_ACK_Enum;

/* ==============================================  I2C_0 CONTROL ARBLF [2..2]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_ARBLF                                                       */
  I2C_0_CONTROL_ARBLF_NOT_SET          = 0,     /*!< NOT_SET : Arbitration lost error has not occurred.                        */
  I2C_0_CONTROL_ARBLF_SET              = 1,     /*!< SET : Arbitration lost error occurred.                                    */
} I2C_0_CONTROL_ARBLF_Enum;

/* ==============================================  I2C_0 CONTROL ACKRQF [3..3]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_ACKRQF                                                      */
  I2C_0_CONTROL_ACKRQF_NOT_SET         = 0,     /*!< NOT_SET : ACK has not been requested.                                     */
  I2C_0_CONTROL_ACKRQF_SET             = 1,     /*!< SET : ACK requested.                                                      */
} I2C_0_CONTROL_ACKRQF_Enum;

/* ===============================================  I2C_0 CONTROL STO [4..4]  ================================================ */
typedef enum {                                  /*!< I2C_0_CONTROL_STO                                                         */
  I2C_0_CONTROL_STO_NOT_SET            = 0,     /*!< NOT_SET : Read: A stop is not pending and a stop / repeat start
                                                     has not been detected. Write: Clear the STO bit.                          */
  I2C_0_CONTROL_STO_SET                = 1,     /*!< SET : Read: Stop or stop / repeat start detected. This bit must
                                                     be cleared by firmware. Write: Generate a stop.                           */
} I2C_0_CONTROL_STO_Enum;

/* ===============================================  I2C_0 CONTROL STA [5..5]  ================================================ */
typedef enum {                                  /*!< I2C_0_CONTROL_STA                                                         */
  I2C_0_CONTROL_STA_NOT_SET            = 0,     /*!< NOT_SET : Read: A start is not pending and a repeat start has
                                                     not been detected. Write: Clear the STA bit.                              */
  I2C_0_CONTROL_STA_SET                = 1,     /*!< SET : Read: Start or repeat start detected. This bit must be
                                                     cleared by firmware. Write: Generate a start or repeat
                                                     start.                                                                    */
} I2C_0_CONTROL_STA_Enum;

