chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  I2C_0 CONTROL TXMDF [6..6]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_TXMDF                                                       */
  I2C_0_CONTROL_TXMDF_RECEIVE          = 0,     /*!< RECEIVE : Module is in receiver mode.                                     */
  I2C_0_CONTROL_TXMDF_TRANSMIT         = 1,     /*!< TRANSMIT : Module is in transmitter mode.                                 */
} I2C_0_CONTROL_TXMDF_Enum;

/* ==============================================  I2C_0 CONTROL MSMDF [7..7]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_MSMDF                                                       */
  I2C_0_CONTROL_MSMDF_SLAVE            = 0,     /*!< SLAVE : Module is operating in Slave mode.                                */
  I2C_0_CONTROL_MSMDF_MASTER           = 1,     /*!< MASTER : Module is operating in Master mode.                              */
} I2C_0_CONTROL_MSMDF_Enum;

/* ===============================================  I2C_0 CONTROL STOI [8..8]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_STOI                                                        */
  I2C_0_CONTROL_STOI_NOT_SET           = 0,     /*!< NOT_SET : Read: A stop interrupt has not occurred. Write: Clear
                                                     the stop interrupt flag (STOI).                                           */
  I2C_0_CONTROL_STOI_SET               = 1,     /*!< SET : Read: Stop interrupt detected. In Slave mode, a stop has
                                                     been detected on the bus. In Master mode, a stop has been
                                                     generated. Write: Force a stop interrupt.                                 */
} I2C_0_CONTROL_STOI_Enum;

/* ===============================================  I2C_0 CONTROL ACKI [9..9]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_ACKI                                                        */
  I2C_0_CONTROL_ACKI_NOT_SET           = 0,     /*!< NOT_SET : Read: An acknowledge interrupt has not occurred. Write:
                                                     Clear the acknowledge interrupt (ACKI).                                   */
  I2C_0_CONTROL_ACKI_SET               = 1,     /*!< SET : Read: An acknowledge interrupt occurred. Write: Force
                                                     an acknowledge interrupt.                                                 */
} I2C_0_CONTROL_ACKI_Enum;

/* ==============================================  I2C_0 CONTROL RXI [10..10]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_RXI                                                         */
  I2C_0_CONTROL_RXI_NOT_SET            = 0,     /*!< NOT_SET : Read: A receive done interrupt has not occurred. Write:
                                                     Clear the receive done interrupt (RXI).                                   */
  I2C_0_CONTROL_RXI_SET                = 1,     /*!< SET : Read: Receive done interrupt occurred. Write: Force a
                                                     receive done interrupt.                                                   */
} I2C_0_CONTROL_RXI_Enum;

/* ==============================================  I2C_0 CONTROL TXI [11..11]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_TXI                                                         */
  I2C_0_CONTROL_TXI_NOT_SET            = 0,     /*!< NOT_SET : Read: A transmit done interrupt has not occurred.
                                                     Write: Clear the transmit done interrupt (TXI).                           */
  I2C_0_CONTROL_TXI_SET                = 1,     /*!< SET : Read: Transmit done interrupt detected. If the transmit
                                                     is forced to abort by a NACK response, the acknowledge
                                                     interrupt (ACKI) will also be set. Write: Force a transmit
                                                     done interrupt.                                                           */
} I2C_0_CONTROL_TXI_Enum;

/* ==============================================  I2C_0 CONTROL STAI [12..12]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_STAI                                                        */
  I2C_0_CONTROL_STAI_NOT_SET           = 0,     /*!< NOT_SET : Read: Start interrupt has not occurred. Write: Clear
                                                     the start interrupt (STAI).                                               */
  I2C_0_CONTROL_STAI_SET               = 1,     /*!< SET : Read: Start or repeat start interrupt occurred. In Slave
                                                     mode, a start or repeat start is detected. In Master mode,
                                                     a start or repeat start has been generated.                               */
} I2C_0_CONTROL_STAI_Enum;

/* =============================================  I2C_0 CONTROL ARBLI [13..13]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_ARBLI                                                       */
  I2C_0_CONTROL_ARBLI_NOT_SET          = 0,     /*!< NOT_SET : Read: An arbitration lost interrupt has not occurred.
                                                     Write: Clear the arbitration lost interrupt (ARBLI).                      */
  I2C_0_CONTROL_ARBLI_SET              = 1,     /*!< SET : Read: Arbitration lost interrupt detected. Write: Force
                                                     an arbitration lost interrupt.                                            */
} I2C_0_CONTROL_ARBLI_Enum;

/* ==============================================  I2C_0 CONTROL T0I [14..14]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_T0I                                                         */
  I2C_0_CONTROL_T0I_NOT_SET            = 0,     /*!< NOT_SET : Read: A I2C Timer Byte 0 interrupt has not occurred.
                                                     Write: Clear the I2C Timer Byte 0 interrupt (T0I).                        */
  I2C_0_CONTROL_T0I_SET                = 1,     /*!< SET : Read: I2C Timer Byte 0 overflow interrupt detected. Write:
                                                     Force a I2C Timer Byte 0 interrupt.                                       */
} I2C_0_CONTROL_T0I_Enum;

/* ==============================================  I2C_0 CONTROL T1I [15..15]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_T1I                                                         */
  I2C_0_CONTROL_T1I_NOT_SET            = 0,     /*!< NOT_SET : Read: No interrupt occurred. Write: Clear the I2C
                                                     Timer Byte 1 interrupt (T1I).                                             */
  I2C_0_CONTROL_T1I_SET                = 1,     /*!< SET : Read: I2C Timer Byte 1 overflow interrupt is detected.
                                                     Write: Force a I2C Timer Byte 1 interrupt.                                */
} I2C_0_CONTROL_T1I_Enum;

/* ==============================================  I2C_0 CONTROL T2I [16..16]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_T2I                                                         */
  I2C_0_CONTROL_T2I_NOT_SET            = 0,     /*!< NOT_SET : Read: A I2C Timer Byte 2 interrupt has not occurred.
                                                     Write: Clear the I2C Timer Byte 2 interrupt (T2I).                        */
  I2C_0_CONTROL_T2I_SET                = 1,     /*!< SET : Read: I2C Timer Byte 2 overflow interrupt detected. Write:
                                                     Force a I2C Timer Byte 2 interrupt.                                       */
} I2C_0_CONTROL_T2I_Enum;

