chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  I2C_0 CONTROL T3I [17..17]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_T3I                                                         */
  I2C_0_CONTROL_T3I_NOT_SET            = 0,     /*!< NOT_SET : Read: A I2C Timer Byte 3 interrupt or SCL low timeout
                                                     has not occurred. Write: Clear the I2C Timer Byte 3 interrupt
                                                     (T3I).                                                                    */
  I2C_0_CONTROL_T3I_SET                = 1,     /*!< SET : Read: I2C Timer Byte 3 overflow or SCL low timeout interrupt
                                                     detected. Write: Force a I2C Timer Byte 3 interrupt.                      */
} I2C_0_CONTROL_T3I_Enum;

/* =============================================  I2C_0 CONTROL RXARM [18..18]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_RXARM                                                       */
  I2C_0_CONTROL_RXARM_DISABLED         = 0,     /*!< DISABLED : Disable data and address reception.                            */
  I2C_0_CONTROL_RXARM_ENABLED          = 1,     /*!< ENABLED : Enable the module to perform a receive operation.               */
} I2C_0_CONTROL_RXARM_Enum;

/* =============================================  I2C_0 CONTROL TXARM [19..19]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_TXARM                                                       */
  I2C_0_CONTROL_TXARM_DISABLED         = 0,     /*!< DISABLED : Disable data and address transmission.                         */
  I2C_0_CONTROL_TXARM_ENABLED          = 1,     /*!< ENABLED : Enable the module to perform a transmit operation.              */
} I2C_0_CONTROL_TXARM_Enum;

/* =============================================  I2C_0 CONTROL SLVAF [20..20]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_SLVAF                                                       */
  I2C_0_CONTROL_SLVAF_SLAVE_ADDRESS    = 0,     /*!< SLAVE_ADDRESS : Slave address detected.                                   */
  I2C_0_CONTROL_SLVAF_GENERAL_CALL     = 1,     /*!< GENERAL_CALL : General Call address detected.                             */
} I2C_0_CONTROL_SLVAF_Enum;

/* ============================================  I2C_0 CONTROL ATXRXEN [21..21]  ============================================= */
typedef enum {                                  /*!< I2C_0_CONTROL_ATXRXEN                                                     */
  I2C_0_CONTROL_ATXRXEN_DISABLED       = 0,     /*!< DISABLED : Do not automatically switch to transmit or receive
                                                     mode after a Start.                                                       */
  I2C_0_CONTROL_ATXRXEN_ENABLED        = 1,     /*!< ENABLED : If automatic hardware acknowledge mode is enabled
                                                     (HACKEN = 1), automatically switch to transmit or receive
                                                     mode after a Start.                                                       */
} I2C_0_CONTROL_ATXRXEN_Enum;

/* ==============================================  I2C_0 CONTROL FMD [22..22]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_FMD                                                         */
  I2C_0_CONTROL_FMD_DISABLED           = 0,     /*!< DISABLED : Disable the input filter.                                      */
  I2C_0_CONTROL_FMD_ENABLED            = 1,     /*!< ENABLED : Enable the input filter.                                        */
} I2C_0_CONTROL_FMD_Enum;

/* =============================================  I2C_0 CONTROL DBGMD [23..23]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_DBGMD                                                       */
  I2C_0_CONTROL_DBGMD_RUN              = 0,     /*!< RUN : The I2C module will continue to operate while the core
                                                     is halted in debug mode.                                                  */
  I2C_0_CONTROL_DBGMD_HALT             = 1,     /*!< HALT : A debug breakpoint will cause the I2C module to halt.              */
} I2C_0_CONTROL_DBGMD_Enum;

/* =============================================  I2C_0 CONTROL SMINH [24..24]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_SMINH                                                       */
  I2C_0_CONTROL_SMINH_INACTIVE         = 0,     /*!< INACTIVE : Enable Slave modes.                                            */
  I2C_0_CONTROL_SMINH_ACTIVE           = 1,     /*!< ACTIVE : Inhibit Slave modes. The module will not respond to
                                                     a Master on the bus.                                                      */
} I2C_0_CONTROL_SMINH_Enum;

/* =============================================  I2C_0 CONTROL HACKEN [25..25]  ============================================= */
typedef enum {                                  /*!< I2C_0_CONTROL_HACKEN                                                      */
  I2C_0_CONTROL_HACKEN_DISABLED        = 0,     /*!< DISABLED : Disable automatic hardware acknowledge.                        */
  I2C_0_CONTROL_HACKEN_ENABLED         = 1,     /*!< ENABLED : Enable automatic hardware acknowledge.                          */
} I2C_0_CONTROL_HACKEN_Enum;

/* =============================================  I2C_0 CONTROL SLVAMD [26..26]  ============================================= */
typedef enum {                                  /*!< I2C_0_CONTROL_SLVAMD                                                      */
  I2C_0_CONTROL_SLVAMD_7BIT            = 0,     /*!< 7BIT : Slave addresses are 7 bits.                                        */
  I2C_0_CONTROL_SLVAMD_10BIT           = 1,     /*!< 10BIT : Slave addresses are 10 bits.                                      */
} I2C_0_CONTROL_SLVAMD_Enum;

/* ============================================  I2C_0 CONTROL LBACKEN [27..27]  ============================================= */
typedef enum {                                  /*!< I2C_0_CONTROL_LBACKEN                                                     */
  I2C_0_CONTROL_LBACKEN_DISABLED       = 0,     /*!< DISABLED : NACK after the last byte is received.                          */
  I2C_0_CONTROL_LBACKEN_ENABLED        = 1,     /*!< ENABLED : ACK after the last byte is received.                            */
} I2C_0_CONTROL_LBACKEN_Enum;

/* ==============================================  I2C_0 CONTROL GCEN [29..29]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_GCEN                                                        */
  I2C_0_CONTROL_GCEN_DISABLED          = 0,     /*!< DISABLED : Disable General Call address decoding.                         */
  I2C_0_CONTROL_GCEN_ENABLED           = 1,     /*!< ENABLED : Enable General Call address decoding.                           */
} I2C_0_CONTROL_GCEN_Enum;

/* =============================================  I2C_0 CONTROL RESET [30..30]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_RESET                                                       */
  I2C_0_CONTROL_RESET_INACTIVE         = 0,     /*!< INACTIVE : I2C module is not in soft reset.                               */
  I2C_0_CONTROL_RESET_ACTIVE           = 1,     /*!< ACTIVE : I2C module is in soft reset and firmware cannot access
                                                     all bits in the module.                                                   */
} I2C_0_CONTROL_RESET_Enum;

/* =============================================  I2C_0 CONTROL I2CEN [31..31]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONTROL_I2CEN                                                       */
  I2C_0_CONTROL_I2CEN_DISABLED         = 0,     /*!< DISABLED : Disable the I2C module.                                        */
  I2C_0_CONTROL_I2CEN_ENABLED          = 1,     /*!< ENABLED : Enable the I2C module.                                          */
} I2C_0_CONTROL_I2CEN_Enum;

/* ========================================================  CONFIG  ========================================================= */
/* ==============================================  I2C_0 CONFIG STOIEN [8..8]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_STOIEN                                                       */
  I2C_0_CONFIG_STOIEN_DISABLED         = 0,     /*!< DISABLED : Disable the stop interrupt.                                    */
  I2C_0_CONFIG_STOIEN_ENABLED          = 1,     /*!< ENABLED : Enable the stop interrupt (STOI).                               */
} I2C_0_CONFIG_STOIEN_Enum;

/* ==============================================  I2C_0 CONFIG ACKIEN [9..9]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_ACKIEN                                                       */
  I2C_0_CONFIG_ACKIEN_DISABLED         = 0,     /*!< DISABLED : Disable the acknowledge interrupt.                             */
  I2C_0_CONFIG_ACKIEN_ENABLED          = 1,     /*!< ENABLED : Enable the acknowledge interrupt (ACKI).                        */
} I2C_0_CONFIG_ACKIEN_Enum;

/* ==============================================  I2C_0 CONFIG RXIEN [10..10]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_RXIEN                                                        */
  I2C_0_CONFIG_RXIEN_DISABLED          = 0,     /*!< DISABLED : Disable the receive done interrupt.                            */
  I2C_0_CONFIG_RXIEN_ENABLED           = 1,     /*!< ENABLED : Enable the receive done interrupt (RXI).                        */
} I2C_0_CONFIG_RXIEN_Enum;

/* ==============================================  I2C_0 CONFIG TXIEN [11..11]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_TXIEN                                                        */
  I2C_0_CONFIG_TXIEN_DISABLED          = 0,     /*!< DISABLED : Disable the transmit done interrupt.                           */
  I2C_0_CONFIG_TXIEN_ENABLED           = 1,     /*!< ENABLED : Enable the transmit done interrupt (TXI).                       */
} I2C_0_CONFIG_TXIEN_Enum;

/* =============================================  I2C_0 CONFIG STAIEN [12..12]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_STAIEN                                                       */
  I2C_0_CONFIG_STAIEN_DISABLED         = 0,     /*!< DISABLED : Disable the start interrupt.                                   */
  I2C_0_CONFIG_STAIEN_ENABLED          = 1,     /*!< ENABLED : Enable the start interrupt (STAI).                              */
} I2C_0_CONFIG_STAIEN_Enum;

/* =============================================  I2C_0 CONFIG ARBLIEN [13..13]  ============================================= */
typedef enum {                                  /*!< I2C_0_CONFIG_ARBLIEN                                                      */
  I2C_0_CONFIG_ARBLIEN_DISABLED        = 0,     /*!< DISABLED : Disable the arbitration lost interrupt.                        */
  I2C_0_CONFIG_ARBLIEN_ENABLED         = 1,     /*!< ENABLED : Enable the arbitration lost interrupt (ARBLI).                  */
} I2C_0_CONFIG_ARBLIEN_Enum;

/* ==============================================  I2C_0 CONFIG T0IEN [14..14]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_T0IEN                                                        */
  I2C_0_CONFIG_T0IEN_DISABLED          = 0,     /*!< DISABLED : Disable the I2C Timer Byte 0 interrupt.                        */
  I2C_0_CONFIG_T0IEN_ENABLED           = 1,     /*!< ENABLED : Enable the I2C Timer Byte 0 interrupt (T0I).                    */
} I2C_0_CONFIG_T0IEN_Enum;

/* ==============================================  I2C_0 CONFIG T1IEN [15..15]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_T1IEN                                                        */
  I2C_0_CONFIG_T1IEN_DISABLED          = 0,     /*!< DISABLED : Disable the I2C Timer Byte 1 interrupt.                        */
  I2C_0_CONFIG_T1IEN_ENABLED           = 1,     /*!< ENABLED : Enable the I2C Timer Byte 1 interrupt (T1I).                    */
} I2C_0_CONFIG_T1IEN_Enum;

/* ==============================================  I2C_0 CONFIG T2IEN [16..16]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_T2IEN                                                        */
  I2C_0_CONFIG_T2IEN_DISABLED          = 0,     /*!< DISABLED : Disable the I2C Timer Byte 2 interrupt.                        */
  I2C_0_CONFIG_T2IEN_ENABLED           = 1,     /*!< ENABLED : Enable the I2C Timer Byte 2 interrupt (T2I).                    */
} I2C_0_CONFIG_T2IEN_Enum;

/* ==============================================  I2C_0 CONFIG T3IEN [17..17]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_T3IEN                                                        */
  I2C_0_CONFIG_T3IEN_DISABLED          = 0,     /*!< DISABLED : Disable the I2C Timer Byte 3 and SCL low timeout
                                                     interrupt.                                                                */
  I2C_0_CONFIG_T3IEN_ENABLED           = 1,     /*!< ENABLED : Enable the I2C Timer Byte 3 and SCL low timeout interrupt
                                                     (T3I).                                                                    */
} I2C_0_CONFIG_T3IEN_Enum;

/* ==============================================  I2C_0 CONFIG T0RUN [24..24]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_T0RUN                                                        */
  I2C_0_CONFIG_T0RUN_STOP              = 0,     /*!< STOP : Stop Timer Byte 0.                                                 */
  I2C_0_CONFIG_T0RUN_START             = 1,     /*!< START : Start Timer Byte 0 running.                                       */
} I2C_0_CONFIG_T0RUN_Enum;

/* ==============================================  I2C_0 CONFIG T1RUN [25..25]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_T1RUN                                                        */
  I2C_0_CONFIG_T1RUN_STOP              = 0,     /*!< STOP : Stop Timer Byte 1.                                                 */
  I2C_0_CONFIG_T1RUN_START             = 1,     /*!< START : Start Timer Byte 1 running.                                       */
} I2C_0_CONFIG_T1RUN_Enum;

/* ==============================================  I2C_0 CONFIG T2RUN [26..26]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_T2RUN                                                        */
  I2C_0_CONFIG_T2RUN_STOP              = 0,     /*!< STOP : Stop Timer Byte 2.                                                 */
  I2C_0_CONFIG_T2RUN_START             = 1,     /*!< START : Start Timer Byte 2 running.                                       */
} I2C_0_CONFIG_T2RUN_Enum;

/* ==============================================  I2C_0 CONFIG T3RUN [27..27]  ============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_T3RUN                                                        */
  I2C_0_CONFIG_T3RUN_STOP              = 0,     /*!< STOP : Stop Timer Byte 3.                                                 */
  I2C_0_CONFIG_T3RUN_START             = 1,     /*!< START : Start Timer Byte 3 running.                                       */
} I2C_0_CONFIG_T3RUN_Enum;

/* ===============================================  I2C_0 CONFIG TMD [28..29]  =============================================== */
typedef enum {                                  /*!< I2C_0_CONFIG_TMD                                                          */
  I2C_0_CONFIG_TMD_MODE0               = 0,     /*!< MODE0 : I2C Timer Mode 0: Operate the I2C timer as a single
                                                     32-bit timer : Timer Bytes [3 : 2 : 1 : 0].                               */
  I2C_0_CONFIG_TMD_MODE1               = 1,     /*!< MODE1 : I2C Timer Mode 1: Operate the I2C timer as two 16-bit
                                                     timers : Timer Bytes [3 : 2] and Timer Bytes [1 : 0].                     */
  I2C_0_CONFIG_TMD_MODE2               = 2,     /*!< MODE2 : I2C Timer Mode 2: Operate the I2C timer as four independent
                                                     8-bit timers : Timer Byte 3, Timer Byte 2, Timer Byte 1,
                                                     and Timer Byte 0.                                                         */
  I2C_0_CONFIG_TMD_MODE3               = 3,     /*!< MODE3 : I2C Timer Mode 3: Operate the I2C timer as one 16-bit
                                                     and two 8-bit timers : Timer Bytes [3 : 2], Timer Byte
                                                     1, and Timer Byte 0.                                                      */
} I2C_0_CONFIG_TMD_Enum;

/* =============================================  I2C_0 CONFIG TIMEREN [31..31]  ============================================= */
typedef enum {                                  /*!< I2C_0_CONFIG_TIMEREN                                                      */
  I2C_0_CONFIG_TIMEREN_DISABLED        = 0,     /*!< DISABLED : Disable I2C Timer.                                             */
  I2C_0_CONFIG_TIMEREN_ENABLED         = 1,     /*!< ENABLED : Enable I2C Timer for general purpose use. This setting
                                                     should not be used when the I2C module is enabled (I2CEN
                                                     = 1).                                                                     */
} I2C_0_CONFIG_TIMEREN_Enum;

/* =======================================================  SADDRESS  ======================================================== */
/* =========================================================  SMASK  ========================================================= */
/* =========================================================  DATA  ========================================================== */
/* =========================================================  TIMER  ========================================================= */
/* ========================================================  TIMERRL  ======================================================== */
/* ========================================================  SCONFIG  ======================================================== */
/* ========================================================  I2CDMA  ========================================================= */
/* ==============================================  I2C_0 I2CDMA DMAEN [31..31]  ============================================== */
typedef enum {                                  /*!< I2C_0_I2CDMA_DMAEN                                                        */
  I2C_0_I2CDMA_DMAEN_DISABLED          = 0,     /*!< DISABLED : Disable I2C DMA data requests.                                 */
  I2C_0_I2CDMA_DMAEN_ENABLED           = 1,     /*!< ENABLED : Enable I2C DMA data requests.                                   */
} I2C_0_I2CDMA_DMAEN_Enum;



/* =========================================================================================================================== */
/* ================                                           I2S_0                                           ================ */
/* =========================================================================================================================== */

/* =======================================================  TXCONTROL  ======================================================= */
/* =============================================  I2S_0 TXCONTROL FSGEN [0..0]  ============================================== */
typedef enum {                                  /*!< I2S_0_TXCONTROL_FSGEN                                                     */
  I2S_0_TXCONTROL_FSGEN_DISABLED       = 0,     /*!< DISABLED : Disable the internal DFS generator.                            */
  I2S_0_TXCONTROL_FSGEN_ENABLED        = 1,     /*!< ENABLED : Enable the internal DFS generator.                              */
} I2S_0_TXCONTROL_FSGEN_Enum;

/* =============================================  I2S_0 TXCONTROL FSSEN [1..1]  ============================================== */
typedef enum {                                  /*!< I2S_0_TXCONTROL_FSSEN                                                     */
  I2S_0_TXCONTROL_FSSEN_DISABLED       = 0,     /*!< DISABLED : The internal DFS generator starts immediately when
                                                     FSGEN is set to 1.                                                        */
  I2S_0_TXCONTROL_FSSEN_ENABLED        = 1,     /*!< ENABLED : Synchronize the rising edge of the internally generated
                                                     WS signal from the DFS generator to the rising edge of
                                                     the external WS input signal.                                             */
} I2S_0_TXCONTROL_FSSEN_Enum;

/* ==============================================  I2S_0 TXCONTROL DDIS [5..5]  ============================================== */
typedef enum {                                  /*!< I2S_0_TXCONTROL_DDIS                                                      */
  I2S_0_TXCONTROL_DDIS_INACTIVE        = 0,     /*!< INACTIVE : The first data bit is sent on the second or later
                                                     rising edge of SCK after WS changes.                                      */
  I2S_0_TXCONTROL_DDIS_ACTIVE          = 1,     /*!< ACTIVE : The first data bit is sent on the first rising edge
                                                     of SCK after WS changes.                                                  */
} I2S_0_TXCONTROL_DDIS_Enum;

