chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  I2S_0 TXCONTROL FSSRCSEL [14..14]  =========================================== */
typedef enum {                                  /*!< I2S_0_TXCONTROL_FSSRCSEL                                                  */
  I2S_0_TXCONTROL_FSSRCSEL_FSIN_EXT    = 0,     /*!< FSIN_EXT : The word select or frame sync is input from the WS
                                                     pin.                                                                      */
  I2S_0_TXCONTROL_FSSRCSEL_FSIN_INT    = 1,     /*!< FSIN_INT : The word select or frame sync is input from the internal
                                                     DFS generator.                                                            */
} I2S_0_TXCONTROL_FSSRCSEL_Enum;

/* ===========================================  I2S_0 TXCONTROL FILLSEL [15..16]  ============================================ */
typedef enum {                                  /*!< I2S_0_TXCONTROL_FILLSEL                                                   */
  I2S_0_TXCONTROL_FILLSEL_ZEROS        = 0,     /*!< ZEROS : Send zeros during unused bit cycles.                              */
  I2S_0_TXCONTROL_FILLSEL_ONES         = 1,     /*!< ONES : Send ones during unused bit cycles.                                */
  I2S_0_TXCONTROL_FILLSEL_SIGN         = 2,     /*!< SIGN : Send the sign bit of the current sample (MSB-first format)
                                                     or last sample (LSB-first format) during unused bit cycles.               */
  I2S_0_TXCONTROL_FILLSEL_RANDOM       = 3,     /*!< RANDOM : Send pseudo-random data generated by an 8-bit LFSR
                                                     during unused bit cycles.                                                 */
} I2S_0_TXCONTROL_FILLSEL_Enum;

/* =============================================  I2S_0 TXCONTROL JSEL [17..17]  ============================================= */
typedef enum {                                  /*!< I2S_0_TXCONTROL_JSEL                                                      */
  I2S_0_TXCONTROL_JSEL_LEFT            = 0,     /*!< LEFT : Use left-justified or I2S-style formats.                           */
  I2S_0_TXCONTROL_JSEL_RIGHT           = 1,     /*!< RIGHT : Use right-justified format.                                       */
} I2S_0_TXCONTROL_JSEL_Enum;

/* ===========================================  I2S_0 TXCONTROL FSINVEN [20..20]  ============================================ */
typedef enum {                                  /*!< I2S_0_TXCONTROL_FSINVEN                                                   */
  I2S_0_TXCONTROL_FSINVEN_DISABLED     = 0,     /*!< DISABLED : Don't invert the WS signal. Use this setting for
                                                     I2S format.                                                               */
  I2S_0_TXCONTROL_FSINVEN_ENABLED      = 1,     /*!< ENABLED : Invert the WS signal.                                           */
} I2S_0_TXCONTROL_FSINVEN_Enum;

/* ==========================================  I2S_0 TXCONTROL SCLKINVEN [21..21]  =========================================== */
typedef enum {                                  /*!< I2S_0_TXCONTROL_SCLKINVEN                                                 */
  I2S_0_TXCONTROL_SCLKINVEN_DISABLED   = 0,     /*!< DISABLED : Do not invert the transmitter bit clock.                       */
  I2S_0_TXCONTROL_SCLKINVEN_ENABLED    = 1,     /*!< ENABLED : Invert the transmitter bit clock.                               */
} I2S_0_TXCONTROL_SCLKINVEN_Enum;

/* ============================================  I2S_0 TXCONTROL ORDER [22..22]  ============================================= */
typedef enum {                                  /*!< I2S_0_TXCONTROL_ORDER                                                     */
  I2S_0_TXCONTROL_ORDER_LEFT_RIGHT     = 0,     /*!< LEFT_RIGHT : Left sample transmitted first, right sample transmitted
                                                     second. Use this setting for I2S format.                                  */
  I2S_0_TXCONTROL_ORDER_RIGHT_LEFT     = 1,     /*!< RIGHT_LEFT : Right sample transmitted first, left sample transmitted
                                                     second.                                                                   */
} I2S_0_TXCONTROL_ORDER_Enum;

/* ============================================  I2S_0 TXCONTROL MBSEL [24..26]  ============================================= */
typedef enum {                                  /*!< I2S_0_TXCONTROL_MBSEL                                                     */
  I2S_0_TXCONTROL_MBSEL_8BITS          = 0,     /*!< 8BITS : 8 bits are sent per mono sample.                                  */
  I2S_0_TXCONTROL_MBSEL_9BITS          = 1,     /*!< 9BITS : 9 bits are sent per mono sample.                                  */
  I2S_0_TXCONTROL_MBSEL_16BITS         = 2,     /*!< 16BITS : 16 bits are sent per mono sample.                                */
  I2S_0_TXCONTROL_MBSEL_24BITS         = 3,     /*!< 24BITS : 24 bits are sent per mono sample.                                */
  I2S_0_TXCONTROL_MBSEL_32BITS         = 4,     /*!< 32BITS : 32 bits are sent per mono sample.                                */
} I2S_0_TXCONTROL_MBSEL_Enum;

/* =============================================  I2S_0 TXCONTROL TXEN [29..29]  ============================================= */
typedef enum {                                  /*!< I2S_0_TXCONTROL_TXEN                                                      */
  I2S_0_TXCONTROL_TXEN_DISABLED        = 0,     /*!< DISABLED : Disable the I2S transmitter.                                   */
  I2S_0_TXCONTROL_TXEN_ENABLED         = 1,     /*!< ENABLED : Enable the I2S transmitter.                                     */
} I2S_0_TXCONTROL_TXEN_Enum;

/* ========================================================  TXMODE  ========================================================= */
/* ==============================================  I2S_0 TXMODE DEDIS [25..25]  ============================================== */
typedef enum {                                  /*!< I2S_0_TXMODE_DEDIS                                                        */
  I2S_0_TXMODE_DEDIS_INACTIVE          = 0,     /*!< INACTIVE : Drive the output during every cycle of the transmitter's
                                                     assigned slot(s), including the last clock cycle.                         */
  I2S_0_TXMODE_DEDIS_ACTIVE            = 1,     /*!< ACTIVE : Drive the output for every cycle of the transmitter's
                                                     assigned slot(s), except for the last clock cycle of the
                                                     last slot.                                                                */
} I2S_0_TXMODE_DEDIS_Enum;

/* ==============================================  I2S_0 TXMODE DIMD [26..26]  =============================================== */
typedef enum {                                  /*!< I2S_0_TXMODE_DIMD                                                         */
  I2S_0_TXMODE_DIMD_ZERO               = 0,     /*!< ZERO : Drive zero on the data output pin during non-active slots.         */
  I2S_0_TXMODE_DIMD_HIGH_Z             = 1,     /*!< HIGH_Z : Don't drive the data output pin. The data output pin
                                                     is tristated.                                                             */
} I2S_0_TXMODE_DIMD_Enum;

