chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  I2S_0 TXMODE TDMEN [27..27]  ============================================== */
typedef enum {                                  /*!< I2S_0_TXMODE_TDMEN                                                        */
  I2S_0_TXMODE_TDMEN_DISABLED          = 0,     /*!< DISABLED : Disable the time division multiplexing (TDM) feature.          */
  I2S_0_TXMODE_TDMEN_ENABLED           = 1,     /*!< ENABLED : Enable the time division multiplexing (TDM) feature.            */
} I2S_0_TXMODE_TDMEN_Enum;

/* ========================================================  FSDUTY  ========================================================= */
/* =======================================================  RXCONTROL  ======================================================= */
/* ==============================================  I2S_0 RXCONTROL JSEL [8..8]  ============================================== */
typedef enum {                                  /*!< I2S_0_RXCONTROL_JSEL                                                      */
  I2S_0_RXCONTROL_JSEL_LEFT            = 0,     /*!< LEFT : Use left-justified or I2S-style formats.                           */
  I2S_0_RXCONTROL_JSEL_RIGHT           = 1,     /*!< RIGHT : Use right-justified format.                                       */
} I2S_0_RXCONTROL_JSEL_Enum;

/* ==============================================  I2S_0 RXCONTROL DDIS [9..9]  ============================================== */
typedef enum {                                  /*!< I2S_0_RXCONTROL_DDIS                                                      */
  I2S_0_RXCONTROL_DDIS_INACTIVE        = 0,     /*!< INACTIVE : The first data bit is captured on the second or later
                                                     rising edge of SCK after WS changes.                                      */
  I2S_0_RXCONTROL_DDIS_ACTIVE          = 1,     /*!< ACTIVE : The first data bit is captured by the receiver on the
                                                     first rising edge of SCK after WS changes.                                */
} I2S_0_RXCONTROL_DDIS_Enum;

/* ===========================================  I2S_0 RXCONTROL FSINVEN [11..11]  ============================================ */
typedef enum {                                  /*!< I2S_0_RXCONTROL_FSINVEN                                                   */
  I2S_0_RXCONTROL_FSINVEN_DISABLED     = 0,     /*!< DISABLED : Don't invert the WS signal. Use this setting for
                                                     I2S format.                                                               */
  I2S_0_RXCONTROL_FSINVEN_ENABLED      = 1,     /*!< ENABLED : Invert the WS signal.                                           */
} I2S_0_RXCONTROL_FSINVEN_Enum;

/* ==========================================  I2S_0 RXCONTROL SCLKINVEN [12..12]  =========================================== */
typedef enum {                                  /*!< I2S_0_RXCONTROL_SCLKINVEN                                                 */
  I2S_0_RXCONTROL_SCLKINVEN_DISABLED   = 0,     /*!< DISABLED : Do not invert the receiver bit clock.                          */
  I2S_0_RXCONTROL_SCLKINVEN_ENABLED    = 1,     /*!< ENABLED : Invert the receiver bit clock.                                  */
} I2S_0_RXCONTROL_SCLKINVEN_Enum;

/* ============================================  I2S_0 RXCONTROL ORDER [13..13]  ============================================= */
typedef enum {                                  /*!< I2S_0_RXCONTROL_ORDER                                                     */
  I2S_0_RXCONTROL_ORDER_LEFT_RIGHT     = 0,     /*!< LEFT_RIGHT : Left sample received first, right sample received
                                                     second. Use this setting for I2S format.                                  */
  I2S_0_RXCONTROL_ORDER_RIGHT_LEFT     = 1,     /*!< RIGHT_LEFT : Right sample received first, left sample received
                                                     second.                                                                   */
} I2S_0_RXCONTROL_ORDER_Enum;

/* ============================================  I2S_0 RXCONTROL MBSEL [15..17]  ============================================= */
typedef enum {                                  /*!< I2S_0_RXCONTROL_MBSEL                                                     */
  I2S_0_RXCONTROL_MBSEL_8BITS          = 0,     /*!< 8BITS : 8 bits are received per mono sample.                              */
  I2S_0_RXCONTROL_MBSEL_9BITS          = 1,     /*!< 9BITS : 9 bits are received per mono sample.                              */
  I2S_0_RXCONTROL_MBSEL_16BITS         = 2,     /*!< 16BITS : 16 bits are received per mono sample.                            */
  I2S_0_RXCONTROL_MBSEL_24BITS         = 3,     /*!< 24BITS : 24 bits are received per mono sample.                            */
  I2S_0_RXCONTROL_MBSEL_32BITS         = 4,     /*!< 32BITS : 32 bits are received per mono sample.                            */
} I2S_0_RXCONTROL_MBSEL_Enum;

/* ===========================================  I2S_0 RXCONTROL FSSRCSEL [20..20]  =========================================== */
typedef enum {                                  /*!< I2S_0_RXCONTROL_FSSRCSEL                                                  */
  I2S_0_RXCONTROL_FSSRCSEL_FSIN_EXT    = 0,     /*!< FSIN_EXT : The word select or frame sync is input from the WS
                                                     pin.                                                                      */
  I2S_0_RXCONTROL_FSSRCSEL_FSIN_INT    = 1,     /*!< FSIN_INT : The word select or frame sync is input from the internal
                                                     DFS generator.                                                            */
} I2S_0_RXCONTROL_FSSRCSEL_Enum;

/* =============================================  I2S_0 RXCONTROL RXEN [21..21]  ============================================= */
typedef enum {                                  /*!< I2S_0_RXCONTROL_RXEN                                                      */
  I2S_0_RXCONTROL_RXEN_DISABLED        = 0,     /*!< DISABLED : Disable the I2S receiver.                                      */
  I2S_0_RXCONTROL_RXEN_ENABLED         = 1,     /*!< ENABLED : Enable the I2S receiver.                                        */
} I2S_0_RXCONTROL_RXEN_Enum;

