chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  RXMODE  ========================================================= */
/* ==============================================  I2S_0 RXMODE TDMEN [27..27]  ============================================== */
typedef enum {                                  /*!< I2S_0_RXMODE_TDMEN                                                        */
  I2S_0_RXMODE_TDMEN_DISABLED          = 0,     /*!< DISABLED : Disable the time division multiplexing (TDM) feature.          */
  I2S_0_RXMODE_TDMEN_ENABLED           = 1,     /*!< ENABLED : Enable the time division multiplexing (TDM) feature.            */
} I2S_0_RXMODE_TDMEN_Enum;

/* ======================================================  CLKCONTROL  ======================================================= */
/* ===========================================  I2S_0 CLKCONTROL DUTYMD [18..18]  ============================================ */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_DUTYMD                                                   */
  I2S_0_CLKCONTROL_DUTYMD_MORE         = 0,     /*!< MORE : When the division is fractional, the clock high time
                                                     will be greater than 50% (by half of the source clock period).            */
  I2S_0_CLKCONTROL_DUTYMD_LESS         = 1,     /*!< LESS : When the division is fractional, the clock low time will
                                                     be greater than 50% (by half of the source clock period).                 */
} I2S_0_CLKCONTROL_DUTYMD_Enum;

/* ===========================================  I2S_0 CLKCONTROL CLKUPD [19..19]  ============================================ */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_CLKUPD                                                   */
  I2S_0_CLKCONTROL_CLKUPD_UPDATE       = 1,     /*!< UPDATE : Update the clock divider with new values of INTDIV,
                                                     FRACDIV, and DIVEN.                                                       */
} I2S_0_CLKCONTROL_CLKUPD_Enum;

/* ============================================  I2S_0 CLKCONTROL DIVEN [20..20]  ============================================ */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_DIVEN                                                    */
  I2S_0_CLKCONTROL_DIVEN_DISABLED      = 0,     /*!< DISABLED : Disable the clock divider.                                     */
  I2S_0_CLKCONTROL_DIVEN_ENABLED       = 1,     /*!< ENABLED : Enable the clock divider.                                       */
} I2S_0_CLKCONTROL_DIVEN_Enum;

/* ==========================================  I2S_0 CLKCONTROL TXCLKSEL [21..21]  =========================================== */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_TXCLKSEL                                                 */
  I2S_0_CLKCONTROL_TXCLKSEL_INTERNAL   = 0,     /*!< INTERNAL : The I2S transmitter is clocked from the internal
                                                     clock divider.                                                            */
  I2S_0_CLKCONTROL_TXCLKSEL_EXTERNAL   = 1,     /*!< EXTERNAL : The I2S transmitter is clocked from the SCK pin.               */
} I2S_0_CLKCONTROL_TXCLKSEL_Enum;

/* ==========================================  I2S_0 CLKCONTROL RXCLKSEL [22..22]  =========================================== */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_RXCLKSEL                                                 */
  I2S_0_CLKCONTROL_RXCLKSEL_INTERNAL   = 0,     /*!< INTERNAL : The I2S receiver is clocked from the internal clock
                                                     divider.                                                                  */
  I2S_0_CLKCONTROL_RXCLKSEL_EXTERNAL   = 1,     /*!< EXTERNAL : The I2S receiver is clocked from the SCK pin.                  */
} I2S_0_CLKCONTROL_RXCLKSEL_Enum;

/* ============================================  I2S_0 CLKCONTROL RESET [23..23]  ============================================ */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_RESET                                                    */
  I2S_0_CLKCONTROL_RESET_ACTIVE        = 1,     /*!< ACTIVE : Reset the I2S module.                                            */
} I2S_0_CLKCONTROL_RESET_Enum;

/* ===========================================  I2S_0 CLKCONTROL RXCLKEN [24..24]  =========================================== */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_RXCLKEN                                                  */
  I2S_0_CLKCONTROL_RXCLKEN_DISABLED    = 0,     /*!< DISABLED : Disable the I2S receiver clock.                                */
  I2S_0_CLKCONTROL_RXCLKEN_ENABLED     = 1,     /*!< ENABLED : Enable the I2S receiver clock.                                  */
} I2S_0_CLKCONTROL_RXCLKEN_Enum;

/* ===========================================  I2S_0 CLKCONTROL TXCLKEN [25..25]  =========================================== */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_TXCLKEN                                                  */
  I2S_0_CLKCONTROL_TXCLKEN_DISABLED    = 0,     /*!< DISABLED : Disable the I2S transmitter clock.                             */
  I2S_0_CLKCONTROL_TXCLKEN_ENABLED     = 1,     /*!< ENABLED : Enable the I2S transmitter clock.                               */
} I2S_0_CLKCONTROL_TXCLKEN_Enum;

/* ==========================================  I2S_0 CLKCONTROL RXSCLKMD [26..26]  =========================================== */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_RXSCLKMD                                                 */
  I2S_0_CLKCONTROL_RXSCLKMD_SCK_OUTPUT = 0,     /*!< SCK_OUTPUT : The I2S receiver SCK signal is an output.                    */
  I2S_0_CLKCONTROL_RXSCLKMD_SCK_INPUT  = 1,     /*!< SCK_INPUT : The I2S receiver SCK signal is an input.                      */
} I2S_0_CLKCONTROL_RXSCLKMD_Enum;

/* ==========================================  I2S_0 CLKCONTROL TXSCLKMD [27..27]  =========================================== */
typedef enum {                                  /*!< I2S_0_CLKCONTROL_TXSCLKMD                                                 */
  I2S_0_CLKCONTROL_TXSCLKMD_SCK_OUTPUT = 0,     /*!< SCK_OUTPUT : The I2S transmitter SCK signal is an output.                 */
  I2S_0_CLKCONTROL_TXSCLKMD_SCK_INPUT  = 1,     /*!< SCK_INPUT : The I2S transmitter SCK signal is an input.                   */
} I2S_0_CLKCONTROL_TXSCLKMD_Enum;

/* ========================================================  TXFIFO  ========================================================= */
/* ========================================================  RXFIFO  ========================================================= */
/* ======================================================  FIFOSTATUS  ======================================================= */
/* ======================================================  FIFOCONTROL  ====================================================== */
/* ==========================================  I2S_0 FIFOCONTROL TXFIFOFL [21..21]  ========================================== */
typedef enum {                                  /*!< I2S_0_FIFOCONTROL_TXFIFOFL                                                */
  I2S_0_FIFOCONTROL_TXFIFOFL_SET       = 1,     /*!< SET : Flush the I2S transmitter FIFO.                                     */
} I2S_0_FIFOCONTROL_TXFIFOFL_Enum;

