chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==========================================  I2S_0 FIFOCONTROL RXFIFOFL [22..22]  ========================================== */
typedef enum {                                  /*!< I2S_0_FIFOCONTROL_RXFIFOFL                                                */
  I2S_0_FIFOCONTROL_RXFIFOFL_SET       = 1,     /*!< SET : Flush the I2S receiver FIFO.                                        */
} I2S_0_FIFOCONTROL_RXFIFOFL_Enum;

/* ======================================================  INTCONTROL  ======================================================= */
/* ============================================  I2S_0 INTCONTROL TXUFIEN [0..0]  ============================================ */
typedef enum {                                  /*!< I2S_0_INTCONTROL_TXUFIEN                                                  */
  I2S_0_INTCONTROL_TXUFIEN_DISABLED    = 0,     /*!< DISABLED : Disable the transmit underflow interrupt.                      */
  I2S_0_INTCONTROL_TXUFIEN_ENABLED     = 1,     /*!< ENABLED : Enable the transmit underflow interrupt.                        */
} I2S_0_INTCONTROL_TXUFIEN_Enum;

/* ============================================  I2S_0 INTCONTROL RXOFIEN [1..1]  ============================================ */
typedef enum {                                  /*!< I2S_0_INTCONTROL_RXOFIEN                                                  */
  I2S_0_INTCONTROL_RXOFIEN_DISABLED    = 0,     /*!< DISABLED : Disable the receive overflow interrupt.                        */
  I2S_0_INTCONTROL_RXOFIEN_ENABLED     = 1,     /*!< ENABLED : Enable the receive overflow interrupt.                          */
} I2S_0_INTCONTROL_RXOFIEN_Enum;

/* ===========================================  I2S_0 INTCONTROL TXLWMIEN [2..2]  ============================================ */
typedef enum {                                  /*!< I2S_0_INTCONTROL_TXLWMIEN                                                 */
  I2S_0_INTCONTROL_TXLWMIEN_DISABLED   = 0,     /*!< DISABLED : Disable the transmit FIFO low watermark interrupt.             */
  I2S_0_INTCONTROL_TXLWMIEN_ENABLED    = 1,     /*!< ENABLED : Enable the transmit FIFO low watermark interrupt.               */
} I2S_0_INTCONTROL_TXLWMIEN_Enum;

/* ===========================================  I2S_0 INTCONTROL RXHWMIEN [3..3]  ============================================ */
typedef enum {                                  /*!< I2S_0_INTCONTROL_RXHWMIEN                                                 */
  I2S_0_INTCONTROL_RXHWMIEN_DISABLED   = 0,     /*!< DISABLED : Disable the receive FIFO high watermark interrupt.             */
  I2S_0_INTCONTROL_RXHWMIEN_ENABLED    = 1,     /*!< ENABLED : Enable the receive FIFO high watermark interrupt.               */
} I2S_0_INTCONTROL_RXHWMIEN_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ===============================================  I2S_0 STATUS TXUFI [0..0]  =============================================== */
typedef enum {                                  /*!< I2S_0_STATUS_TXUFI                                                        */
  I2S_0_STATUS_TXUFI_NOT_SET           = 0,     /*!< NOT_SET : A transmit underflow has not occurred.                          */
  I2S_0_STATUS_TXUFI_SET               = 1,     /*!< SET : A transmit underflow occurred.                                      */
} I2S_0_STATUS_TXUFI_Enum;

/* ===============================================  I2S_0 STATUS RXOFI [1..1]  =============================================== */
typedef enum {                                  /*!< I2S_0_STATUS_RXOFI                                                        */
  I2S_0_STATUS_RXOFI_NOT_SET           = 0,     /*!< NOT_SET : A receive overflow has not occurred.                            */
  I2S_0_STATUS_RXOFI_SET               = 1,     /*!< SET : A receive overflow occurred.                                        */
} I2S_0_STATUS_RXOFI_Enum;

/* ==============================================  I2S_0 STATUS TXLWMI [2..2]  =============================================== */
typedef enum {                                  /*!< I2S_0_STATUS_TXLWMI                                                       */
  I2S_0_STATUS_TXLWMI_NOT_SET          = 0,     /*!< NOT_SET : Transmit FIFO level is above the low watermark.                 */
  I2S_0_STATUS_TXLWMI_SET              = 1,     /*!< SET : Transmit FIFO level is at or below the low watermark.               */
} I2S_0_STATUS_TXLWMI_Enum;

/* ==============================================  I2S_0 STATUS RXHWMI [3..3]  =============================================== */
typedef enum {                                  /*!< I2S_0_STATUS_RXHWMI                                                       */
  I2S_0_STATUS_RXHWMI_NOT_SET          = 0,     /*!< NOT_SET : Receive FIFO level is below the high watermark.                 */
  I2S_0_STATUS_RXHWMI_SET              = 1,     /*!< SET : Receive FIFO level is at or above the high watermark.               */
} I2S_0_STATUS_RXHWMI_Enum;

/* ==============================================  I2S_0 STATUS CDBUSYF [4..4]  ============================================== */
typedef enum {                                  /*!< I2S_0_STATUS_CDBUSYF                                                      */
  I2S_0_STATUS_CDBUSYF_NOT_BUSY        = 0,     /*!< NOT_BUSY : The divider is not busy and an update is not pending.          */
  I2S_0_STATUS_CDBUSYF_BUSY            = 1,     /*!< BUSY : The divider is busy and an update is pending.                      */
} I2S_0_STATUS_CDBUSYF_Enum;

/* ===============================================  I2S_0 STATUS CDSTS [5..5]  =============================================== */
typedef enum {                                  /*!< I2S_0_STATUS_CDSTS                                                        */
  I2S_0_STATUS_CDSTS_RUNNING           = 0,     /*!< RUNNING : Divided clock output is running.                                */
  I2S_0_STATUS_CDSTS_HALTED            = 1,     /*!< HALTED : Divided clock output is halted.                                  */
} I2S_0_STATUS_CDSTS_Enum;

/* ============================================  I2S_0 STATUS TXCLKSELRF [6..6]  ============================================= */
typedef enum {                                  /*!< I2S_0_STATUS_TXCLKSELRF                                                   */
  I2S_0_STATUS_TXCLKSELRF_NOT_SET      = 0,     /*!< NOT_SET : The transmit clock is not synchronized.                         */
  I2S_0_STATUS_TXCLKSELRF_SET          = 1,     /*!< SET : The transmit clock is synchronized and the transmitter
                                                     is ready to send data.                                                    */
} I2S_0_STATUS_TXCLKSELRF_Enum;

/* ============================================  I2S_0 STATUS RXCLKSELRF [7..7]  ============================================= */
typedef enum {                                  /*!< I2S_0_STATUS_RXCLKSELRF                                                   */
  I2S_0_STATUS_RXCLKSELRF_NOT_SET      = 0,     /*!< NOT_SET : The receive clock is not synchronized.                          */
  I2S_0_STATUS_RXCLKSELRF_SET          = 1,     /*!< SET : The receive clock is synchronized and the receiver is
                                                     ready to accept data.                                                     */
} I2S_0_STATUS_RXCLKSELRF_Enum;

/* =============================================  I2S_0 STATUS TXCLKENRF [8..8]  ============================================= */
typedef enum {                                  /*!< I2S_0_STATUS_TXCLKENRF                                                    */
  I2S_0_STATUS_TXCLKENRF_NOT_SET       = 0,     /*!< NOT_SET : The transmit clock is not synchronized.                         */
  I2S_0_STATUS_TXCLKENRF_SET           = 1,     /*!< SET : The transmit clock is synchronized and the transmitter
                                                     is ready to send data.                                                    */
} I2S_0_STATUS_TXCLKENRF_Enum;

