chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  I2S_0 STATUS RXCLKENRF [9..9]  ============================================= */
typedef enum {                                  /*!< I2S_0_STATUS_RXCLKENRF                                                    */
  I2S_0_STATUS_RXCLKENRF_NOT_SET       = 0,     /*!< NOT_SET : The receive clock is not synchronized.                          */
  I2S_0_STATUS_RXCLKENRF_SET           = 1,     /*!< SET : The receive clock is synchronized and the receiver is
                                                     ready to accept data.                                                     */
} I2S_0_STATUS_RXCLKENRF_Enum;

/* ======================================================  DMACONTROL  ======================================================= */
/* ============================================  I2S_0 DMACONTROL TXDMAEN [0..0]  ============================================ */
typedef enum {                                  /*!< I2S_0_DMACONTROL_TXDMAEN                                                  */
  I2S_0_DMACONTROL_TXDMAEN_DISABLED    = 0,     /*!< DISABLED : Disable transmitter DMA data requests.                         */
  I2S_0_DMACONTROL_TXDMAEN_ENABLED     = 1,     /*!< ENABLED : Enable transmitter DMA data requests.                           */
} I2S_0_DMACONTROL_TXDMAEN_Enum;

/* ============================================  I2S_0 DMACONTROL RXDMAEN [1..1]  ============================================ */
typedef enum {                                  /*!< I2S_0_DMACONTROL_RXDMAEN                                                  */
  I2S_0_DMACONTROL_RXDMAEN_DISABLED    = 0,     /*!< DISABLED : Disable receiver DMA data transfer requests.                   */
  I2S_0_DMACONTROL_RXDMAEN_ENABLED     = 1,     /*!< ENABLED : Enable receiver DMA data transfer requests.                     */
} I2S_0_DMACONTROL_RXDMAEN_Enum;

/* ===========================================  I2S_0 DMACONTROL TXDMABMD [2..2]  ============================================ */
typedef enum {                                  /*!< I2S_0_DMACONTROL_TXDMABMD                                                 */
  I2S_0_DMACONTROL_TXDMABMD_ONE_WORD   = 0,     /*!< ONE_WORD : The transmitter transmits one word at a time. Whenever
                                                     there is any room in the transmit FIFO, a single word burst
                                                     DMA data request is generated.                                            */
  I2S_0_DMACONTROL_TXDMABMD_FOUR_WORDS = 1,     /*!< FOUR_WORDS : The transmitter transmits four words at a time.
                                                     Whenever the FIFO depth drops below five, a DMA burst request
                                                     is generated for four words.                                              */
} I2S_0_DMACONTROL_TXDMABMD_Enum;

/* ===========================================  I2S_0 DMACONTROL RXDMABMD [3..3]  ============================================ */
typedef enum {                                  /*!< I2S_0_DMACONTROL_RXDMABMD                                                 */
  I2S_0_DMACONTROL_RXDMABMD_ONE_WORD   = 0,     /*!< ONE_WORD : The receiver receives one word at a time. Whenever
                                                     there is at least one word in the receive FIFO, a single
                                                     word burst DMA request is generated.                                      */
  I2S_0_DMACONTROL_RXDMABMD_FOUR_WORDS = 1,     /*!< FOUR_WORDS : The receiver receives four words at a time. Whenever
                                                     the FIFO depth rises above three, a DMA burst request is
                                                     generated for four words.                                                 */
} I2S_0_DMACONTROL_RXDMABMD_Enum;

/* ======================================================  DBGCONTROL  ======================================================= */
/* ===========================================  I2S_0 DBGCONTROL TXDBGHEN [0..0]  ============================================ */
typedef enum {                                  /*!< I2S_0_DBGCONTROL_TXDBGHEN                                                 */
  I2S_0_DBGCONTROL_TXDBGHEN_DISABLED   = 0,     /*!< DISABLED : Transmit DMA requests continue while the core is
                                                     debug mode.                                                               */
  I2S_0_DBGCONTROL_TXDBGHEN_ENABLED    = 1,     /*!< ENABLED : Transmit DMA requests stop while the core is debug
                                                     mode.                                                                     */
} I2S_0_DBGCONTROL_TXDBGHEN_Enum;

/* ===========================================  I2S_0 DBGCONTROL RXDBGHEN [1..1]  ============================================ */
typedef enum {                                  /*!< I2S_0_DBGCONTROL_RXDBGHEN                                                 */
  I2S_0_DBGCONTROL_RXDBGHEN_DISABLED   = 0,     /*!< DISABLED : Receive DMA requests continue while the core is debug
                                                     mode.                                                                     */
  I2S_0_DBGCONTROL_RXDBGHEN_ENABLED    = 1,     /*!< ENABLED : Receive DMA requests stop while the core is debug
                                                     mode.                                                                     */
} I2S_0_DBGCONTROL_RXDBGHEN_Enum;

/* ============================================  I2S_0 DBGCONTROL TXDBGMD [2..2]  ============================================ */
typedef enum {                                  /*!< I2S_0_DBGCONTROL_TXDBGMD                                                  */
  I2S_0_DBGCONTROL_TXDBGMD_RUN         = 0,     /*!< RUN : The clock to the I2S transmitter is active in debug mode.           */
  I2S_0_DBGCONTROL_TXDBGMD_HALT        = 1,     /*!< HALT : The clock to the I2S transmitter is not active in debug
                                                     mode. The clock divider keeps running and the clock will
                                                     be disabled when two samples are ready to be sent by the
                                                     transmitter.                                                              */
} I2S_0_DBGCONTROL_TXDBGMD_Enum;

/* ============================================  I2S_0 DBGCONTROL RXDBGMD [3..3]  ============================================ */
typedef enum {                                  /*!< I2S_0_DBGCONTROL_RXDBGMD                                                  */
  I2S_0_DBGCONTROL_RXDBGMD_RUN         = 0,     /*!< RUN : The clock to the I2S receiver is active in debug mode.              */
  I2S_0_DBGCONTROL_RXDBGMD_HALT        = 1,     /*!< HALT : The clock to the I2S receiver is not active in debug
                                                     mode. The clock divider keeps running and the clock will
                                                     be disabled when two samples are captured in the receiver.                */
} I2S_0_DBGCONTROL_RXDBGMD_Enum;



/* =========================================================================================================================== */
/* ================                                          IDAC_0                                           ================ */
/* =========================================================================================================================== */

