chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  IDAC_0 CONTROL WEIEN [22..22]  ============================================= */
typedef enum {                                  /*!< IDAC_0_CONTROL_WEIEN                                                      */
  IDAC_0_CONTROL_WEIEN_DISABLED        = 0,     /*!< DISABLED : Disable the FIFO went empty interrupt (WEI).                   */
  IDAC_0_CONTROL_WEIEN_ENABLED         = 1,     /*!< ENABLED : Enable the FIFO went empty interrupt (WEI).                     */
} IDAC_0_CONTROL_WEIEN_Enum;

/* =============================================  IDAC_0 CONTROL DBGMD [29..29]  ============================================= */
typedef enum {                                  /*!< IDAC_0_CONTROL_DBGMD                                                      */
  IDAC_0_CONTROL_DBGMD_RUN             = 0,     /*!< RUN : The IDAC module will continue to operate while the core
                                                     is halted in debug mode.                                                  */
  IDAC_0_CONTROL_DBGMD_HALT            = 1,     /*!< HALT : A debug breakpoint will cause the IDAC module to halt.             */
} IDAC_0_CONTROL_DBGMD_Enum;

/* ============================================  IDAC_0 CONTROL LOADEN [30..30]  ============================================= */
typedef enum {                                  /*!< IDAC_0_CONTROL_LOADEN                                                     */
  IDAC_0_CONTROL_LOADEN_DISABLED       = 0,     /*!< DISABLED : Disable the internal load resistor.                            */
  IDAC_0_CONTROL_LOADEN_ENABLED        = 1,     /*!< ENABLED : Enable the internal load resistor.                              */
} IDAC_0_CONTROL_LOADEN_Enum;

/* ============================================  IDAC_0 CONTROL IDACEN [31..31]  ============================================= */
typedef enum {                                  /*!< IDAC_0_CONTROL_IDACEN                                                     */
  IDAC_0_CONTROL_IDACEN_DISABLED       = 0,     /*!< DISABLED : Disable the IDAC.                                              */
  IDAC_0_CONTROL_IDACEN_ENABLED        = 1,     /*!< ENABLED : Enable the IDAC.                                                */
} IDAC_0_CONTROL_IDACEN_Enum;

/* =========================================================  DATA  ========================================================== */
/* =======================================================  BUFSTATUS  ======================================================= */
/* =============================================  IDAC_0 BUFSTATUS LEVEL [0..2]  ============================================= */
typedef enum {                                  /*!< IDAC_0_BUFSTATUS_LEVEL                                                    */
  IDAC_0_BUFSTATUS_LEVEL_EMPTY         = 0,     /*!< EMPTY : The data FIFO is empty.                                           */
  IDAC_0_BUFSTATUS_LEVEL_1WORD         = 1,     /*!< 1WORD : The data FIFO contains one word.                                  */
  IDAC_0_BUFSTATUS_LEVEL_2WORDS        = 2,     /*!< 2WORDS : The data FIFO contains two words.                                */
  IDAC_0_BUFSTATUS_LEVEL_3WORDS        = 3,     /*!< 3WORDS : The data FIFO contains three words.                              */
  IDAC_0_BUFSTATUS_LEVEL_4WORDS        = 4,     /*!< 4WORDS : The data FIFO is full and contains four words.                   */
} IDAC_0_BUFSTATUS_LEVEL_Enum;

/* ==============================================  IDAC_0 BUFSTATUS ORI [4..4]  ============================================== */
typedef enum {                                  /*!< IDAC_0_BUFSTATUS_ORI                                                      */
  IDAC_0_BUFSTATUS_ORI_NOT_SET         = 0,     /*!< NOT_SET : Read: A FIFO overrun has not occurred. Write: Clear
                                                     the interrupt.                                                            */
  IDAC_0_BUFSTATUS_ORI_SET             = 1,     /*!< SET : Read: A FIFO overrun occurred. Write: Force a FIFO overrun
                                                     interrupt.                                                                */
} IDAC_0_BUFSTATUS_ORI_Enum;

/* ==============================================  IDAC_0 BUFSTATUS URI [5..5]  ============================================== */
typedef enum {                                  /*!< IDAC_0_BUFSTATUS_URI                                                      */
  IDAC_0_BUFSTATUS_URI_NOT_SET         = 0,     /*!< NOT_SET : Read: A FIFO underrun has not occurred. Write: Clear
                                                     the interrupt.                                                            */
  IDAC_0_BUFSTATUS_URI_SET             = 1,     /*!< SET : Read: A FIFO underrun occurred. Write: Force a FIFO underrun
                                                     interrupt.                                                                */
} IDAC_0_BUFSTATUS_URI_Enum;

/* ==============================================  IDAC_0 BUFSTATUS WEI [6..6]  ============================================== */
typedef enum {                                  /*!< IDAC_0_BUFSTATUS_WEI                                                      */
  IDAC_0_BUFSTATUS_WEI_NOT_SET         = 0,     /*!< NOT_SET : Read: A FIFO went empty condition has not occurred.
                                                     Write: Clear the interrupt.                                               */
  IDAC_0_BUFSTATUS_WEI_SET             = 1,     /*!< SET : Read: The FIFO is empty. Write: Force a FIFO went empty
                                                     interrupt.                                                                */
} IDAC_0_BUFSTATUS_WEI_Enum;

/* =======================================================  BUFFER10  ======================================================== */
/* =======================================================  BUFFER32  ======================================================== */
/* ========================================================  GAINADJ  ======================================================== */


/* =========================================================================================================================== */
/* ================                                          IDAC_1                                           ================ */
/* =========================================================================================================================== */

