chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  IDAC_1 CONTROL OUPDT [0..2]  ============================================== */
typedef enum {                                  /*!< IDAC_1_CONTROL_OUPDT                                                      */
  IDAC_1_CONTROL_OUPDT_DACNT8          = 0,     /*!< DACNT8 : The IDAC output updates using the DACnT8 (Timer 0 Low
                                                     Overflow) trigger source.                                                 */
  IDAC_1_CONTROL_OUPDT_DACNT9          = 1,     /*!< DACNT9 : The IDAC output updates using the DACnT9 (Timer 1 High
                                                     Overflow) trigger source.                                                 */
  IDAC_1_CONTROL_OUPDT_DACNT10         = 2,     /*!< DACNT10 : The IDAC output updates using the DACnT10 (Timer 1
                                                     Low Overflow) trigger source.                                             */
  IDAC_1_CONTROL_OUPDT_DACNT11         = 3,     /*!< DACNT11 : The IDAC output updates using the DACnT11 (Timer 1
                                                     High Overflow) trigger source.                                            */
  IDAC_1_CONTROL_OUPDT_DACNT12         = 4,     /*!< DACNT12 : The IDAC output updates on the rising edge of the
                                                     trigger source selected by ETRIG.                                         */
  IDAC_1_CONTROL_OUPDT_DACNT13         = 5,     /*!< DACNT13 : The IDAC output updates on the falling edge of the
                                                     trigger source selected by ETRIG.                                         */
  IDAC_1_CONTROL_OUPDT_DACNT14         = 6,     /*!< DACNT14 : The IDAC output updates on any edge of the trigger
                                                     source selected by ETRIG.                                                 */
  IDAC_1_CONTROL_OUPDT_DACNT15         = 7,     /*!< DACNT15 : The IDAC output updates on write to DATA register
                                                     (On Demand).                                                              */
} IDAC_1_CONTROL_OUPDT_Enum;

/* ==============================================  IDAC_1 CONTROL ETRIG [3..5]  ============================================== */
typedef enum {                                  /*!< IDAC_1_CONTROL_ETRIG                                                      */
  IDAC_1_CONTROL_ETRIG_DACNT0          = 0,     /*!< DACNT0 : Select DACnT0 (PB3.2) as the IDAC external trigger
                                                     source.                                                                   */
  IDAC_1_CONTROL_ETRIG_DACNT1          = 1,     /*!< DACNT1 : Select DACnT1 (PB3.3) as the IDAC external trigger
                                                     source.                                                                   */
  IDAC_1_CONTROL_ETRIG_DACNT2          = 2,     /*!< DACNT2 : Select DACnT2 (PB3.5) as the IDAC external trigger
                                                     source.                                                                   */
  IDAC_1_CONTROL_ETRIG_DACNT3          = 3,     /*!< DACNT3 : Select DACnT3 (PB3.6) as the IDAC external trigger
                                                     source.                                                                   */
  IDAC_1_CONTROL_ETRIG_DACNT4          = 4,     /*!< DACNT4 : Select DACnT4 (PB3.7) as the IDAC external trigger
                                                     source.                                                                   */
  IDAC_1_CONTROL_ETRIG_DACNT5          = 5,     /*!< DACNT5 : Select DACnT5 (PB3.8) as the IDAC external trigger
                                                     source.                                                                   */
  IDAC_1_CONTROL_ETRIG_DACNT6          = 6,     /*!< DACNT6 : Select DACnT6 (PB3.9) as the IDAC external trigger
                                                     source.                                                                   */
  IDAC_1_CONTROL_ETRIG_DACNT7          = 7,     /*!< DACNT7 : Select DACnT7 (SSG0 EX3) as the IDAC external trigger
                                                     source.                                                                   */
} IDAC_1_CONTROL_ETRIG_Enum;

/* ==============================================  IDAC_1 CONTROL OUTMD [6..7]  ============================================== */
typedef enum {                                  /*!< IDAC_1_CONTROL_OUTMD                                                      */
  IDAC_1_CONTROL_OUTMD_0P5_MA          = 0,     /*!< 0P5_MA : The full-scale output current is 0.5 mA.                         */
  IDAC_1_CONTROL_OUTMD_1_MA            = 1,     /*!< 1_MA : The full-scale output current is 1 mA.                             */
  IDAC_1_CONTROL_OUTMD_2_MA            = 2,     /*!< 2_MA : The full-scale output current is 2 mA.                             */
} IDAC_1_CONTROL_OUTMD_Enum;

/* ==============================================  IDAC_1 CONTROL INFMT [8..9]  ============================================== */
typedef enum {                                  /*!< IDAC_1_CONTROL_INFMT                                                      */
  IDAC_1_CONTROL_INFMT_1_10_BIT        = 0,     /*!< 1_10_BIT : Writes are interpreted as one 10-bit sample.                   */
  IDAC_1_CONTROL_INFMT_2_10_BIT        = 1,     /*!< 2_10_BIT : Writes are interpreted as two 10-bit samples.                  */
  IDAC_1_CONTROL_INFMT_4_8_BIT         = 2,     /*!< 4_8_BIT : Writes are interpreted as four 8-bit samples.                   */
} IDAC_1_CONTROL_INFMT_Enum;

/* ============================================  IDAC_1 CONTROL DMARUN [10..10]  ============================================= */
typedef enum {                                  /*!< IDAC_1_CONTROL_DMARUN                                                     */
  IDAC_1_CONTROL_DMARUN_DISABLED       = 0,     /*!< DISABLED : Read: No DMA operations are occurring or the DMA
                                                     is done. Write: No effect.                                                */
  IDAC_1_CONTROL_DMARUN_ENABLED        = 1,     /*!< ENABLED : Read: A DMA operation is currently in progress. Write:
                                                     Start a DMA operation.                                                    */
} IDAC_1_CONTROL_DMARUN_Enum;

/* =============================================  IDAC_1 CONTROL JSEL [11..11]  ============================================== */
typedef enum {                                  /*!< IDAC_1_CONTROL_JSEL                                                       */
  IDAC_1_CONTROL_JSEL_RIGHT            = 0,     /*!< RIGHT : Data is right-justified.                                          */
  IDAC_1_CONTROL_JSEL_LEFT             = 1,     /*!< LEFT : Data is left-justified.                                            */
} IDAC_1_CONTROL_JSEL_Enum;

/* ===========================================  IDAC_1 CONTROL BUFRESET [12..12]  ============================================ */
typedef enum {                                  /*!< IDAC_1_CONTROL_BUFRESET                                                   */
  IDAC_1_CONTROL_BUFRESET_RESET        = 1,     /*!< RESET : Initiate a data buffer reset.                                     */
} IDAC_1_CONTROL_BUFRESET_Enum;

