chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  IDAC_1 CONTROL TRIGINH [13..13]  ============================================ */
typedef enum {                                  /*!< IDAC_1_CONTROL_TRIGINH                                                    */
  IDAC_1_CONTROL_TRIGINH_INACTIVE      = 0,     /*!< INACTIVE : The selected trigger source will cause the IDAC output
                                                     to update.                                                                */
  IDAC_1_CONTROL_TRIGINH_ACTIVE        = 1,     /*!< ACTIVE : The selected trigger source will not update the IDAC
                                                     output, except for On-Demand DATA writes.                                 */
} IDAC_1_CONTROL_TRIGINH_Enum;

/* ============================================  IDAC_1 CONTROL WRAPEN [16..16]  ============================================= */
typedef enum {                                  /*!< IDAC_1_CONTROL_WRAPEN                                                     */
  IDAC_1_CONTROL_WRAPEN_DISABLED       = 0,     /*!< DISABLED : The IDAC will not wrap when it reaches the end of
                                                     the data buffer.                                                          */
  IDAC_1_CONTROL_WRAPEN_ENABLED        = 1,     /*!< ENABLED : The IDAC will cycle through the data buffer contents.           */
} IDAC_1_CONTROL_WRAPEN_Enum;

/* =============================================  IDAC_1 CONTROL ORIEN [20..20]  ============================================= */
typedef enum {                                  /*!< IDAC_1_CONTROL_ORIEN                                                      */
  IDAC_1_CONTROL_ORIEN_DISABLED        = 0,     /*!< DISABLED : Disable the FIFO overrun interrupt (ORI).                      */
  IDAC_1_CONTROL_ORIEN_ENABLED         = 1,     /*!< ENABLED : Enable the FIFO overrun interrupt (ORI).                        */
} IDAC_1_CONTROL_ORIEN_Enum;

/* =============================================  IDAC_1 CONTROL URIEN [21..21]  ============================================= */
typedef enum {                                  /*!< IDAC_1_CONTROL_URIEN                                                      */
  IDAC_1_CONTROL_URIEN_DISABLED        = 0,     /*!< DISABLED : Disable the FIFO underrun interrupt (URI).                     */
  IDAC_1_CONTROL_URIEN_ENABLED         = 1,     /*!< ENABLED : Enable the FIFO underrun interrupt (URI).                       */
} IDAC_1_CONTROL_URIEN_Enum;

/* =============================================  IDAC_1 CONTROL WEIEN [22..22]  ============================================= */
typedef enum {                                  /*!< IDAC_1_CONTROL_WEIEN                                                      */
  IDAC_1_CONTROL_WEIEN_DISABLED        = 0,     /*!< DISABLED : Disable the FIFO went empty interrupt (WEI).                   */
  IDAC_1_CONTROL_WEIEN_ENABLED         = 1,     /*!< ENABLED : Enable the FIFO went empty interrupt (WEI).                     */
} IDAC_1_CONTROL_WEIEN_Enum;

/* =============================================  IDAC_1 CONTROL DBGMD [29..29]  ============================================= */
typedef enum {                                  /*!< IDAC_1_CONTROL_DBGMD                                                      */
  IDAC_1_CONTROL_DBGMD_RUN             = 0,     /*!< RUN : The IDAC module will continue to operate while the core
                                                     is halted in debug mode.                                                  */
  IDAC_1_CONTROL_DBGMD_HALT            = 1,     /*!< HALT : A debug breakpoint will cause the IDAC module to halt.             */
} IDAC_1_CONTROL_DBGMD_Enum;

/* ============================================  IDAC_1 CONTROL LOADEN [30..30]  ============================================= */
typedef enum {                                  /*!< IDAC_1_CONTROL_LOADEN                                                     */
  IDAC_1_CONTROL_LOADEN_DISABLED       = 0,     /*!< DISABLED : Disable the internal load resistor.                            */
  IDAC_1_CONTROL_LOADEN_ENABLED        = 1,     /*!< ENABLED : Enable the internal load resistor.                              */
} IDAC_1_CONTROL_LOADEN_Enum;

/* ============================================  IDAC_1 CONTROL IDACEN [31..31]  ============================================= */
typedef enum {                                  /*!< IDAC_1_CONTROL_IDACEN                                                     */
  IDAC_1_CONTROL_IDACEN_DISABLED       = 0,     /*!< DISABLED : Disable the IDAC.                                              */
  IDAC_1_CONTROL_IDACEN_ENABLED        = 1,     /*!< ENABLED : Enable the IDAC.                                                */
} IDAC_1_CONTROL_IDACEN_Enum;

/* =========================================================  DATA  ========================================================== */
/* =======================================================  BUFSTATUS  ======================================================= */
/* =============================================  IDAC_1 BUFSTATUS LEVEL [0..2]  ============================================= */
typedef enum {                                  /*!< IDAC_1_BUFSTATUS_LEVEL                                                    */
  IDAC_1_BUFSTATUS_LEVEL_EMPTY         = 0,     /*!< EMPTY : The data FIFO is empty.                                           */
  IDAC_1_BUFSTATUS_LEVEL_1WORD         = 1,     /*!< 1WORD : The data FIFO contains one word.                                  */
  IDAC_1_BUFSTATUS_LEVEL_2WORDS        = 2,     /*!< 2WORDS : The data FIFO contains two words.                                */
  IDAC_1_BUFSTATUS_LEVEL_3WORDS        = 3,     /*!< 3WORDS : The data FIFO contains three words.                              */
  IDAC_1_BUFSTATUS_LEVEL_4WORDS        = 4,     /*!< 4WORDS : The data FIFO is full and contains four words.                   */
} IDAC_1_BUFSTATUS_LEVEL_Enum;

/* ==============================================  IDAC_1 BUFSTATUS ORI [4..4]  ============================================== */
typedef enum {                                  /*!< IDAC_1_BUFSTATUS_ORI                                                      */
  IDAC_1_BUFSTATUS_ORI_NOT_SET         = 0,     /*!< NOT_SET : Read: A FIFO overrun has not occurred. Write: Clear
                                                     the interrupt.                                                            */
  IDAC_1_BUFSTATUS_ORI_SET             = 1,     /*!< SET : Read: A FIFO overrun occurred. Write: Force a FIFO overrun
                                                     interrupt.                                                                */
} IDAC_1_BUFSTATUS_ORI_Enum;

/* ==============================================  IDAC_1 BUFSTATUS URI [5..5]  ============================================== */
typedef enum {                                  /*!< IDAC_1_BUFSTATUS_URI                                                      */
  IDAC_1_BUFSTATUS_URI_NOT_SET         = 0,     /*!< NOT_SET : Read: A FIFO underrun has not occurred. Write: Clear
                                                     the interrupt.                                                            */
  IDAC_1_BUFSTATUS_URI_SET             = 1,     /*!< SET : Read: A FIFO underrun occurred. Write: Force a FIFO underrun
                                                     interrupt.                                                                */
} IDAC_1_BUFSTATUS_URI_Enum;

