chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  IDAC_1 BUFSTATUS WEI [6..6]  ============================================== */
typedef enum {                                  /*!< IDAC_1_BUFSTATUS_WEI                                                      */
  IDAC_1_BUFSTATUS_WEI_NOT_SET         = 0,     /*!< NOT_SET : Read: A FIFO went empty condition has not occurred.
                                                     Write: Clear the interrupt.                                               */
  IDAC_1_BUFSTATUS_WEI_SET             = 1,     /*!< SET : Read: The FIFO is empty. Write: Force a FIFO went empty
                                                     interrupt.                                                                */
} IDAC_1_BUFSTATUS_WEI_Enum;

/* =======================================================  BUFFER10  ======================================================== */
/* =======================================================  BUFFER32  ======================================================== */
/* ========================================================  GAINADJ  ======================================================== */


/* =========================================================================================================================== */
/* ================                                           IVC_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* =============================================  IVC_0 CONTROL IN0RANGE [0..2]  ============================================= */
typedef enum {                                  /*!< IVC_0_CONTROL_IN0RANGE                                                    */
  IVC_0_CONTROL_IN0RANGE_6_MA          = 0,     /*!< 6_MA : Input range is 0-6 mA.                                             */
  IVC_0_CONTROL_IN0RANGE_5_MA          = 1,     /*!< 5_MA : Input range is 0-5 mA.                                             */
  IVC_0_CONTROL_IN0RANGE_4_MA          = 2,     /*!< 4_MA : Input range is 0-4 mA.                                             */
  IVC_0_CONTROL_IN0RANGE_3_MA          = 3,     /*!< 3_MA : Input range is 0-3 mA.                                             */
  IVC_0_CONTROL_IN0RANGE_2_MA          = 4,     /*!< 2_MA : Input range is 0-2 mA.                                             */
  IVC_0_CONTROL_IN0RANGE_1_MA          = 5,     /*!< 1_MA : Input range is 0-1 mA.                                             */
} IVC_0_CONTROL_IN0RANGE_Enum;

/* =============================================  IVC_0 CONTROL IN1RANGE [4..6]  ============================================= */
typedef enum {                                  /*!< IVC_0_CONTROL_IN1RANGE                                                    */
  IVC_0_CONTROL_IN1RANGE_6_MA          = 0,     /*!< 6_MA : Input range is 0-6 mA.                                             */
  IVC_0_CONTROL_IN1RANGE_5_MA          = 1,     /*!< 5_MA : Input range is 0-5 mA.                                             */
  IVC_0_CONTROL_IN1RANGE_4_MA          = 2,     /*!< 4_MA : Input range is 0-4 mA.                                             */
  IVC_0_CONTROL_IN1RANGE_3_MA          = 3,     /*!< 3_MA : Input range is 0-3 mA.                                             */
  IVC_0_CONTROL_IN1RANGE_2_MA          = 4,     /*!< 2_MA : Input range is 0-2 mA.                                             */
  IVC_0_CONTROL_IN1RANGE_1_MA          = 5,     /*!< 1_MA : Input range is 0-1 mA.                                             */
} IVC_0_CONTROL_IN1RANGE_Enum;

/* ==============================================  IVC_0 CONTROL C0EN [30..30]  ============================================== */
typedef enum {                                  /*!< IVC_0_CONTROL_C0EN                                                        */
  IVC_0_CONTROL_C0EN_DISABLED          = 0,     /*!< DISABLED : Disable IVC channel 0.                                         */
  IVC_0_CONTROL_C0EN_ENABLED           = 1,     /*!< ENABLED : Enable IVC channel 0.                                           */
} IVC_0_CONTROL_C0EN_Enum;

/* ==============================================  IVC_0 CONTROL C1EN [31..31]  ============================================== */
typedef enum {                                  /*!< IVC_0_CONTROL_C1EN                                                        */
  IVC_0_CONTROL_C1EN_DISABLED          = 0,     /*!< DISABLED : Disable IVC channel 1.                                         */
  IVC_0_CONTROL_C1EN_ENABLED           = 1,     /*!< ENABLED : Enable IVC channel 1.                                           */
} IVC_0_CONTROL_C1EN_Enum;



/* =========================================================================================================================== */
/* ================                                          LOCK_0                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  KEY  ========================================================== */
/* =================================================  LOCK_0 KEY KEY [0..7]  ================================================= */
typedef enum {                                  /*!< LOCK_0_KEY_KEY                                                            */
  LOCK_0_KEY_KEY_LOCKED                = 0,     /*!< LOCKED : PERIPHLOCK registers are locked and no valid values
                                                     have been written to KEY.                                                 */
  LOCK_0_KEY_KEY_INTERMEDIATE          = 1,     /*!< INTERMEDIATE : PERIPHLOCK registers are locked and the first
                                                     valid value (0xA5) has been written to KEY.                               */
  LOCK_0_KEY_KEY_UNLOCKED              = 2,     /*!< UNLOCKED : PERIPHLOCK registers are unlocked. Any subsequent
                                                     writes to KEY will lock the interface.                                    */
} LOCK_0_KEY_KEY_Enum;

/* ======================================================  PERIPHLOCK0  ====================================================== */
/* ===========================================  LOCK_0 PERIPHLOCK0 USARTL [0..0]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_USARTL                                                 */
  LOCK_0_PERIPHLOCK0_USARTL_UNLOCKED   = 0,     /*!< UNLOCKED : Unlock the USART0, USART1, UART0, and UART1 Module
                                                     registers.                                                                */
  LOCK_0_PERIPHLOCK0_USARTL_LOCKED     = 1,     /*!< LOCKED : Lock the USART0, USART1, UART0, and UART1 Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_USARTL_Enum;

/* ============================================  LOCK_0 PERIPHLOCK0 SPIL [1..1]  ============================================= */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_SPIL                                                   */
  LOCK_0_PERIPHLOCK0_SPIL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the SPI0, SPI1, and SPI2 Module registers.              */
  LOCK_0_PERIPHLOCK0_SPIL_LOCKED       = 1,     /*!< LOCKED : Lock the SPI0, SPI1, and SPI2 Module registers (bits
                                                     can still be read).                                                       */
} LOCK_0_PERIPHLOCK0_SPIL_Enum;

/* ============================================  LOCK_0 PERIPHLOCK0 I2CL [2..2]  ============================================= */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_I2CL                                                   */
  LOCK_0_PERIPHLOCK0_I2CL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the I2C0 and I2C1 Module registers.                     */
  LOCK_0_PERIPHLOCK0_I2CL_LOCKED       = 1,     /*!< LOCKED : Lock the I2C0 and I2C1 Module registers (bits can still
                                                     be read).                                                                 */
} LOCK_0_PERIPHLOCK0_I2CL_Enum;

/* ============================================  LOCK_0 PERIPHLOCK0 PCAL [3..3]  ============================================= */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_PCAL                                                   */
  LOCK_0_PERIPHLOCK0_PCAL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the EPCA0, PCA0, and PCA1 Module registers.             */
  LOCK_0_PERIPHLOCK0_PCAL_LOCKED       = 1,     /*!< LOCKED : Lock the EPCA0, PCA0, and PCA1 Module registers (bits
                                                     can still be read).                                                       */
} LOCK_0_PERIPHLOCK0_PCAL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 TIMERL [4..4]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_TIMERL                                                 */
  LOCK_0_PERIPHLOCK0_TIMERL_UNLOCKED   = 0,     /*!< UNLOCKED : Unlock the TIMER0 and TIMER1 Module registers.                 */
  LOCK_0_PERIPHLOCK0_TIMERL_LOCKED     = 1,     /*!< LOCKED : Lock the TIMER0 and TIMER1 Module registers (bits can
                                                     still be read).                                                           */
} LOCK_0_PERIPHLOCK0_TIMERL_Enum;

