chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  LOCK_0 PERIPHLOCK0 USBL [5..5]  ============================================= */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_USBL                                                   */
  LOCK_0_PERIPHLOCK0_USBL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the USB0 Module registers.                              */
  LOCK_0_PERIPHLOCK0_USBL_LOCKED       = 1,     /*!< LOCKED : Lock the USB0 Module registers (bits can still be read).         */
} LOCK_0_PERIPHLOCK0_USBL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 SARADCL [6..6]  =========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_SARADCL                                                */
  LOCK_0_PERIPHLOCK0_SARADCL_UNLOCKED  = 0,     /*!< UNLOCKED : Unlock the SARADC0 and SARADC1 Module registers.               */
  LOCK_0_PERIPHLOCK0_SARADCL_LOCKED    = 1,     /*!< LOCKED : Lock the SARADC0 and SARADC1 Module registers (bits
                                                     can still be read).                                                       */
} LOCK_0_PERIPHLOCK0_SARADCL_Enum;

/* ============================================  LOCK_0 PERIPHLOCK0 SSGL [7..7]  ============================================= */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_SSGL                                                   */
  LOCK_0_PERIPHLOCK0_SSGL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the SSG0 Module registers.                              */
  LOCK_0_PERIPHLOCK0_SSGL_LOCKED       = 1,     /*!< LOCKED : Lock the SSG0 Module registers (bits can still be read).         */
} LOCK_0_PERIPHLOCK0_SSGL_Enum;

/* ============================================  LOCK_0 PERIPHLOCK0 CMPL [8..8]  ============================================= */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_CMPL                                                   */
  LOCK_0_PERIPHLOCK0_CMPL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the Comparator 0 and Comparator 1 Module registers.     */
  LOCK_0_PERIPHLOCK0_CMPL_LOCKED       = 1,     /*!< LOCKED : Lock the Comparator 0 and Comparator 1 Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_CMPL_Enum;

/* =============================================  LOCK_0 PERIPHLOCK0 CSL [9..9]  ============================================= */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_CSL                                                    */
  LOCK_0_PERIPHLOCK0_CSL_UNLOCKED      = 0,     /*!< UNLOCKED : Unlock the Capacitive Sensing (CAPSENSE0) Module
                                                     registers.                                                                */
  LOCK_0_PERIPHLOCK0_CSL_LOCKED        = 1,     /*!< LOCKED : Lock the Capacitive Sensing (CAPSENSE0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_CSL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 EMIFL [10..10]  =========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_EMIFL                                                  */
  LOCK_0_PERIPHLOCK0_EMIFL_UNLOCKED    = 0,     /*!< UNLOCKED : Unlock the External Memory Interface (EMIF0) Module
                                                     registers.                                                                */
  LOCK_0_PERIPHLOCK0_EMIFL_LOCKED      = 1,     /*!< LOCKED : Lock the External Memory Interface (EMIF0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_EMIFL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 AESL [11..11]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_AESL                                                   */
  LOCK_0_PERIPHLOCK0_AESL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the AES0 Module registers.                              */
  LOCK_0_PERIPHLOCK0_AESL_LOCKED       = 1,     /*!< LOCKED : Lock the AES0 Module registers (bits can still be read).         */
} LOCK_0_PERIPHLOCK0_AESL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 CRCL [12..12]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_CRCL                                                   */
  LOCK_0_PERIPHLOCK0_CRCL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the CRC0 Module registers.                              */
  LOCK_0_PERIPHLOCK0_CRCL_LOCKED       = 1,     /*!< LOCKED : Lock the CRC0 Module registers (bits can still be read).         */
} LOCK_0_PERIPHLOCK0_CRCL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 RTCL [13..13]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_RTCL                                                   */
  LOCK_0_PERIPHLOCK0_RTCL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the RTC0 Module registers.                              */
  LOCK_0_PERIPHLOCK0_RTCL_LOCKED       = 1,     /*!< LOCKED : Lock the RTC0 Module registers (bits can still be read).         */
} LOCK_0_PERIPHLOCK0_RTCL_Enum;

/* ==========================================  LOCK_0 PERIPHLOCK0 CLKRSTL [14..14]  ========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_CLKRSTL                                                */
  LOCK_0_PERIPHLOCK0_CLKRSTL_UNLOCKED  = 0,     /*!< UNLOCKED : Unlock the Clock Control (CLKCTRL) and Reset Sources
                                                     (RSTSRC) Module registers.                                                */
  LOCK_0_PERIPHLOCK0_CLKRSTL_LOCKED    = 1,     /*!< LOCKED : Lock the Clock Control (CLKCTRL) and Reset Sources
                                                     (RSTSRC) Module registers (bits can still be read).                       */
} LOCK_0_PERIPHLOCK0_CLKRSTL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 VMONL [15..15]  =========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_VMONL                                                  */
  LOCK_0_PERIPHLOCK0_VMONL_UNLOCKED    = 0,     /*!< UNLOCKED : Unlock the Voltage Supply Monitor (VMON0) Module
                                                     registers.                                                                */
  LOCK_0_PERIPHLOCK0_VMONL_LOCKED      = 1,     /*!< LOCKED : Lock the Voltage Supply Monitor (VMON0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_VMONL_Enum;

