chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  LOCK_0 PERIPHLOCK0 IDACL [16..16]  =========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_IDACL                                                  */
  LOCK_0_PERIPHLOCK0_IDACL_UNLOCKED    = 0,     /*!< UNLOCKED : Unlock the IDAC0 and IDAC1 Module registers.                   */
  LOCK_0_PERIPHLOCK0_IDACL_LOCKED      = 1,     /*!< LOCKED : Lock the IDAC0 and IDAC1 Module registers (bits can
                                                     still be read).                                                           */
} LOCK_0_PERIPHLOCK0_IDACL_Enum;

/* =========================================  LOCK_0 PERIPHLOCK0 DMACTRLL [17..17]  ========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_DMACTRLL                                               */
  LOCK_0_PERIPHLOCK0_DMACTRLL_UNLOCKED = 0,     /*!< UNLOCKED : Unlock the DMA Controller (DMACTRL0) Module registers.         */
  LOCK_0_PERIPHLOCK0_DMACTRLL_LOCKED   = 1,     /*!< LOCKED : Lock the DMA Controller (DMACTRL0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_DMACTRLL_Enum;

/* =========================================  LOCK_0 PERIPHLOCK0 DMAXBARL [18..18]  ========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_DMAXBARL                                               */
  LOCK_0_PERIPHLOCK0_DMAXBARL_UNLOCKED = 0,     /*!< UNLOCKED : Unlock the DMA Crossbar (DMAXBAR0) Module registers.           */
  LOCK_0_PERIPHLOCK0_DMAXBARL_LOCKED   = 1,     /*!< LOCKED : Lock the DMA Crossbar (DMAXBAR0) Module registers (bits
                                                     can still be read).                                                       */
} LOCK_0_PERIPHLOCK0_DMAXBARL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 LPTL [19..19]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_LPTL                                                   */
  LOCK_0_PERIPHLOCK0_LPTL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the Low Power Timer (LPTIMER0) Module registers.        */
  LOCK_0_PERIPHLOCK0_LPTL_LOCKED       = 1,     /*!< LOCKED : Lock the Low Power Timer (LPTIMER0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_LPTL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 VREFL [20..20]  =========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_VREFL                                                  */
  LOCK_0_PERIPHLOCK0_VREFL_UNLOCKED    = 0,     /*!< UNLOCKED : Unlock the Voltage Reference (VREF0) Module registers.         */
  LOCK_0_PERIPHLOCK0_VREFL_LOCKED      = 1,     /*!< LOCKED : Lock the Voltage Reference (VREF0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_VREFL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 I2SL [21..21]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_I2SL                                                   */
  LOCK_0_PERIPHLOCK0_I2SL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the I2S0 Module registers.                              */
  LOCK_0_PERIPHLOCK0_I2SL_LOCKED       = 1,     /*!< LOCKED : Lock the I2S0 Module registers (bits can still be read).         */
} LOCK_0_PERIPHLOCK0_I2SL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 PLLL [22..22]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_PLLL                                                   */
  LOCK_0_PERIPHLOCK0_PLLL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the PLL0 Module registers.                              */
  LOCK_0_PERIPHLOCK0_PLLL_LOCKED       = 1,     /*!< LOCKED : Lock the PLL0 Module registers (bits can still be read).         */
} LOCK_0_PERIPHLOCK0_PLLL_Enum;

/* ==========================================  LOCK_0 PERIPHLOCK0 EXTOSCL [23..23]  ========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_EXTOSCL                                                */
  LOCK_0_PERIPHLOCK0_EXTOSCL_UNLOCKED  = 0,     /*!< UNLOCKED : Unlock the External Oscillator (EXTOSC0) Module registers.     */
  LOCK_0_PERIPHLOCK0_EXTOSCL_LOCKED    = 1,     /*!< LOCKED : Lock the External Oscillator (EXTOSC0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_EXTOSCL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 VREGL [24..24]  =========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_VREGL                                                  */
  LOCK_0_PERIPHLOCK0_VREGL_UNLOCKED    = 0,     /*!< UNLOCKED : Unlock the Voltage Regulator (VREG0) Module registers.         */
  LOCK_0_PERIPHLOCK0_VREGL_LOCKED      = 1,     /*!< LOCKED : Lock the Voltage Regulator (VREG0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_VREGL_Enum;

/* ==========================================  LOCK_0 PERIPHLOCK0 LPOSCL [25..25]  =========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_LPOSCL                                                 */
  LOCK_0_PERIPHLOCK0_LPOSCL_UNLOCKED   = 0,     /*!< UNLOCKED : Unlock the Low Power Oscillator (LPOSC0) Module registers.     */
  LOCK_0_PERIPHLOCK0_LPOSCL_LOCKED     = 1,     /*!< LOCKED : Lock the Low Power Oscillator (LPOSC0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_LPOSCL_Enum;

