chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==========================================  LOCK_0 PERIPHLOCK0 EVREGL [26..26]  =========================================== */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_EVREGL                                                 */
  LOCK_0_PERIPHLOCK0_EVREGL_UNLOCKED   = 0,     /*!< UNLOCKED : Unlock the External Regulator (EXTVREG0) Module registers.     */
  LOCK_0_PERIPHLOCK0_EVREGL_LOCKED     = 1,     /*!< LOCKED : Lock the External Regulator (EXTVREG0) Module registers
                                                     (bits can still be read).                                                 */
} LOCK_0_PERIPHLOCK0_EVREGL_Enum;

/* ===========================================  LOCK_0 PERIPHLOCK0 IVCL [28..28]  ============================================ */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK0_IVCL                                                   */
  LOCK_0_PERIPHLOCK0_IVCL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the IVC0 Module registers.                              */
  LOCK_0_PERIPHLOCK0_IVCL_LOCKED       = 1,     /*!< LOCKED : Lock the IVC0 Module registers (bits can still be read).         */
} LOCK_0_PERIPHLOCK0_IVCL_Enum;

/* ======================================================  PERIPHLOCK1  ====================================================== */
/* ============================================  LOCK_0 PERIPHLOCK1 PMUL [0..0]  ============================================= */
typedef enum {                                  /*!< LOCK_0_PERIPHLOCK1_PMUL                                                   */
  LOCK_0_PERIPHLOCK1_PMUL_UNLOCKED     = 0,     /*!< UNLOCKED : Unlock the PMU Module registers.                               */
  LOCK_0_PERIPHLOCK1_PMUL_LOCKED       = 1,     /*!< LOCKED : Lock the PMU Module registers (bits can still be read).          */
} LOCK_0_PERIPHLOCK1_PMUL_Enum;



/* =========================================================================================================================== */
/* ================                                         LPTIMER_0                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* =============================================  LPTIMER_0 CONTROL CMD [0..1]  ============================================== */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_CMD                                                     */
  LPTIMER_0_CONTROL_CMD_FREE           = 0,     /*!< FREE : The timer is free running mode on the RTCn module clock
                                                     (RTCnOSC or LFOSCn).                                                      */
  LPTIMER_0_CONTROL_CMD_RISING_EDGE    = 1,     /*!< RISING_EDGE : The timer is incremented on the rising edges of
                                                     the selected external trigger (LPTnTx).                                   */
  LPTIMER_0_CONTROL_CMD_FALLING_EDGE   = 2,     /*!< FALLING_EDGE : The timer is incremented on the falling edges
                                                     of the selected external trigger (LPTnTx).                                */
  LPTIMER_0_CONTROL_CMD_ANY_EDGE       = 3,     /*!< ANY_EDGE : The timer is incremented on both edges of the selected
                                                     external trigger (LPTnTx).                                                */
} LPTIMER_0_CONTROL_CMD_Enum;

/* ============================================  LPTIMER_0 CONTROL EXTSEL [4..7]  ============================================ */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_EXTSEL                                                  */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT0      = 0,     /*!< LPTNT0 : Select external trigger LPTnT0 (PB3.2).                          */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT1      = 1,     /*!< LPTNT1 : Select external trigger LPTnT1 (PB3.8).                          */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT2      = 2,     /*!< LPTNT2 : Select external trigger LPTnT2 (PB3.9).                          */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT3      = 3,     /*!< LPTNT3 : Select external trigger LPTnT3 (Comparator 0 Output).            */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT4      = 4,     /*!< LPTNT4 : Select external trigger LPTnT4 (RESERVED).                       */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT5      = 5,     /*!< LPTNT5 : Select external trigger LPTnT5 (RESERVED).                       */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT6      = 6,     /*!< LPTNT6 : Select external trigger LPTnT6 (RESERVED).                       */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT7      = 7,     /*!< LPTNT7 : Select external trigger LPTnT7 (RESERVED).                       */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT8      = 8,     /*!< LPTNT8 : Select external trigger LPTnT8 (RESERVED).                       */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT9      = 9,     /*!< LPTNT9 : Select external trigger LPTnT9 (RESERVED).                       */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT10     = 10,    /*!< LPTNT10 : Select external trigger LPTnT10 (RESERVED).                     */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT11     = 11,    /*!< LPTNT11 : Select external trigger LPTnT11 (RESERVED).                     */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT12     = 12,    /*!< LPTNT12 : Select external trigger LPTnT12 (RESERVED).                     */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT13     = 13,    /*!< LPTNT13 : Select external trigger LPTnT13 (RESERVED).                     */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT14     = 14,    /*!< LPTNT14 : Select external trigger LPTnT14 (RESERVED).                     */
  LPTIMER_0_CONTROL_EXTSEL_LPTNT15     = 15,    /*!< LPTNT15 : Select external trigger LPTnT15 (RESERVED).                     */
} LPTIMER_0_CONTROL_EXTSEL_Enum;

/* ============================================  LPTIMER_0 CONTROL TMRSET [8..8]  ============================================ */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_TMRSET                                                  */
  LPTIMER_0_CONTROL_TMRSET_SET         = 1,     /*!< SET : Writing a 1 to TMRSET initiates a copy of the value from
                                                     the DATA register into the internal timer register. This
                                                     field is automatically cleared by hardware when the copy
                                                     is complete and does not need to be cleared by software.                  */
} LPTIMER_0_CONTROL_TMRSET_Enum;

