chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  LPTIMER_0 CONTROL TMRCAP [9..9]  ============================================ */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_TMRCAP                                                  */
  LPTIMER_0_CONTROL_TMRCAP_SET         = 1,     /*!< SET : Writing a 1 to TMRCAP initiates a read of internal timer
                                                     register into the DATA register. This field is automatically
                                                     cleared by hardware when the operation completes and does
                                                     not need to be cleared by software.                                       */
} LPTIMER_0_CONTROL_TMRCAP_Enum;

/* ===========================================  LPTIMER_0 CONTROL CMPSET [10..10]  =========================================== */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_CMPSET                                                  */
  LPTIMER_0_CONTROL_CMPSET_SET         = 1,     /*!< SET : Writing a 1 to CMPSET initiates a copy of the value in
                                                     DATA into the internal timer comparator register. This
                                                     field is automatically cleared by hardware when the copy
                                                     is complete and does not need to be cleared by software.                  */
} LPTIMER_0_CONTROL_CMPSET_Enum;

/* ===========================================  LPTIMER_0 CONTROL CMPCAP [11..11]  =========================================== */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_CMPCAP                                                  */
  LPTIMER_0_CONTROL_CMPCAP_SET         = 1,     /*!< SET : Writing a 1 to CMPCAP initiates a read of the internal
                                                     comparator register into the DATA register. This field
                                                     is automatically cleared by hardware when the operation
                                                     completes and does not need to be cleared by software.                    */
} LPTIMER_0_CONTROL_CMPCAP_Enum;

/* ===========================================  LPTIMER_0 CONTROL OVFIEN [16..16]  =========================================== */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_OVFIEN                                                  */
  LPTIMER_0_CONTROL_OVFIEN_DISABLED    = 0,     /*!< DISABLED : Disable the timer overflow interrupt.                          */
  LPTIMER_0_CONTROL_OVFIEN_ENABLED     = 1,     /*!< ENABLED : Enable the timer overflow interrupt.                            */
} LPTIMER_0_CONTROL_OVFIEN_Enum;

/* ===========================================  LPTIMER_0 CONTROL CMPIEN [17..17]  =========================================== */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_CMPIEN                                                  */
  LPTIMER_0_CONTROL_CMPIEN_DISABLED    = 0,     /*!< DISABLED : Disable the timer compare event interrupt.                     */
  LPTIMER_0_CONTROL_CMPIEN_ENABLED     = 1,     /*!< ENABLED : Enable the timer compare event interrupt.                       */
} LPTIMER_0_CONTROL_CMPIEN_Enum;

/* ===========================================  LPTIMER_0 CONTROL OVFTMD [18..18]  =========================================== */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_OVFTMD                                                  */
  LPTIMER_0_CONTROL_OVFTMD_DISABLED    = 0,     /*!< DISABLED : Timer overflows do not toggle the Low Power Timer
                                                     output.                                                                   */
  LPTIMER_0_CONTROL_OVFTMD_ENABLED     = 1,     /*!< ENABLED : Timer overflows toggle the Low Power Timer output.              */
} LPTIMER_0_CONTROL_OVFTMD_Enum;

/* ===========================================  LPTIMER_0 CONTROL CMPTMD [19..19]  =========================================== */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_CMPTMD                                                  */
  LPTIMER_0_CONTROL_CMPTMD_DISABLED    = 0,     /*!< DISABLED : Timer compare events do not toggle the Low Power
                                                     Timer output.                                                             */
  LPTIMER_0_CONTROL_CMPTMD_ENABLED     = 1,     /*!< ENABLED : Timer compare events toggle the Low Power Timer output.         */
} LPTIMER_0_CONTROL_CMPTMD_Enum;

/* ==========================================  LPTIMER_0 CONTROL CMPRSTEN [24..24]  ========================================== */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_CMPRSTEN                                                */
  LPTIMER_0_CONTROL_CMPRSTEN_DISABLED  = 0,     /*!< DISABLED : Timer compare events do not reset the timer.                   */
  LPTIMER_0_CONTROL_CMPRSTEN_ENABLED   = 1,     /*!< ENABLED : Timer compare events reset the timer.                           */
} LPTIMER_0_CONTROL_CMPRSTEN_Enum;

/* ===========================================  LPTIMER_0 CONTROL DBGMD [30..30]  ============================================ */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_DBGMD                                                   */
  LPTIMER_0_CONTROL_DBGMD_RUN          = 0,     /*!< RUN : The Low Power Timer module will continue to operate while
                                                     the core is halted in debug mode.                                         */
  LPTIMER_0_CONTROL_DBGMD_HALT         = 1,     /*!< HALT : A debug breakpoint will cause the Low Power Timer module
                                                     to halt.                                                                  */
} LPTIMER_0_CONTROL_DBGMD_Enum;

/* ============================================  LPTIMER_0 CONTROL RUN [31..31]  ============================================= */
typedef enum {                                  /*!< LPTIMER_0_CONTROL_RUN                                                     */
  LPTIMER_0_CONTROL_RUN_STOP           = 0,     /*!< STOP : Stop the timer and disable the compare threshold.                  */
  LPTIMER_0_CONTROL_RUN_START          = 1,     /*!< START : Start the timer running and enable the compare threshold.         */
} LPTIMER_0_CONTROL_RUN_Enum;

/* =========================================================  DATA  ========================================================== */
/* ========================================================  STATUS  ========================================================= */
/* =============================================  LPTIMER_0 STATUS OVFI [0..0]  ============================================== */
typedef enum {                                  /*!< LPTIMER_0_STATUS_OVFI                                                     */
  LPTIMER_0_STATUS_OVFI_NOT_SET        = 0,     /*!< NOT_SET : A timer overflow has not occurred.                              */
  LPTIMER_0_STATUS_OVFI_SET            = 1,     /*!< SET : A timer overflow occurred.                                          */
} LPTIMER_0_STATUS_OVFI_Enum;

/* =============================================  LPTIMER_0 STATUS CMPI [1..1]  ============================================== */
typedef enum {                                  /*!< LPTIMER_0_STATUS_CMPI                                                     */
  LPTIMER_0_STATUS_CMPI_NOT_SET        = 0,     /*!< NOT_SET : A timer compare event has not occurred.                         */
  LPTIMER_0_STATUS_CMPI_SET            = 1,     /*!< SET : A timer compare event occurred.                                     */
} LPTIMER_0_STATUS_CMPI_Enum;



/* =========================================================================================================================== */
/* ================                                           PLL_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  DIVIDER  ======================================================== */
/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  PLL_0 CONTROL LLMTF [0..0]  =============================================== */
typedef enum {                                  /*!< PLL_0_CONTROL_LLMTF                                                       */
  PLL_0_CONTROL_LLMTF_NOT_SET          = 0,     /*!< NOT_SET : DCO period is not saturated low.                                */
  PLL_0_CONTROL_LLMTF_SET              = 1,     /*!< SET : DCO period is saturated low.                                        */
} PLL_0_CONTROL_LLMTF_Enum;

/* ==============================================  PLL_0 CONTROL HLMTF [1..1]  =============================================== */
typedef enum {                                  /*!< PLL_0_CONTROL_HLMTF                                                       */
  PLL_0_CONTROL_HLMTF_NOT_SET          = 0,     /*!< NOT_SET : DCO period is not saturated high.                               */
  PLL_0_CONTROL_HLMTF_SET              = 1,     /*!< SET : DCO period is saturated high.                                       */
} PLL_0_CONTROL_HLMTF_Enum;

/* ===============================================  PLL_0 CONTROL LCKI [2..2]  =============================================== */
typedef enum {                                  /*!< PLL_0_CONTROL_LCKI                                                        */
  PLL_0_CONTROL_LCKI_NOT_SET           = 0,     /*!< NOT_SET : DCO is disabled or not locked.                                  */
  PLL_0_CONTROL_LCKI_SET               = 1,     /*!< SET : DCO is enabled and locked.                                          */
} PLL_0_CONTROL_LCKI_Enum;

