chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  PLL_0 CONTROL LMTIEN [9..9]  ============================================== */
typedef enum {                                  /*!< PLL_0_CONTROL_LMTIEN                                                      */
  PLL_0_CONTROL_LMTIEN_DISABLED        = 0,     /*!< DISABLED : Saturation (high and low) interrupt disabled.                  */
  PLL_0_CONTROL_LMTIEN_ENABLED         = 1,     /*!< ENABLED : Saturation (high and low) interrupt enabled.                    */
} PLL_0_CONTROL_LMTIEN_Enum;

/* =============================================  PLL_0 CONTROL LCKIEN [10..10]  ============================================= */
typedef enum {                                  /*!< PLL_0_CONTROL_LCKIEN                                                      */
  PLL_0_CONTROL_LCKIEN_DISABLED        = 0,     /*!< DISABLED : The PLL locking does not cause an interrupt                    */
  PLL_0_CONTROL_LCKIEN_ENABLED         = 1,     /*!< ENABLED : An interrupt is generated if LCKI matches the state
                                                     selected by LCKPOL.                                                       */
} PLL_0_CONTROL_LCKIEN_Enum;

/* =============================================  PLL_0 CONTROL LCKPOL [11..11]  ============================================= */
typedef enum {                                  /*!< PLL_0_CONTROL_LCKPOL                                                      */
  PLL_0_CONTROL_LCKPOL_ACTIVE_LOW      = 0,     /*!< ACTIVE_LOW : The lock state PLL interrupt will occur when LCKI
                                                     is 0.                                                                     */
  PLL_0_CONTROL_LCKPOL_ACTIVE_HIGH     = 1,     /*!< ACTIVE_HIGH : The lock state PLL interrupt will occur when LCKI
                                                     is 1.                                                                     */
} PLL_0_CONTROL_LCKPOL_Enum;

/* =============================================  PLL_0 CONTROL REFSEL [16..17]  ============================================= */
typedef enum {                                  /*!< PLL_0_CONTROL_REFSEL                                                      */
  PLL_0_CONTROL_REFSEL_RTC0OSC         = 0,     /*!< RTC0OSC : PLL reference clock (FREF) is the RTC0 oscillator
                                                     (RTC0OSC).                                                                */
  PLL_0_CONTROL_REFSEL_LPOSC0DIV       = 1,     /*!< LPOSC0DIV : PLL reference clock (FREF) is the divided Low Power
                                                     Oscillator (LPOSC0).                                                      */
  PLL_0_CONTROL_REFSEL_EXTOSC0         = 2,     /*!< EXTOSC0 : PLL reference clock (FREF) is the external oscillator
                                                     output (EXTOSC0).                                                         */
  PLL_0_CONTROL_REFSEL_USBOSC0         = 3,     /*!< USBOSC0 : PLL reference clock (FREF) is the USB0 oscillator
                                                     (USB0OSC).                                                                */
} PLL_0_CONTROL_REFSEL_Enum;

/* =============================================  PLL_0 CONTROL STALL [26..26]  ============================================== */
typedef enum {                                  /*!< PLL_0_CONTROL_STALL                                                       */
  PLL_0_CONTROL_STALL_DISABLED         = 0,     /*!< DISABLED : In phase-lock and frequency-lock modes, spectrum
                                                     spreading, and dithering operate normally, if enabled.                    */
  PLL_0_CONTROL_STALL_ENABLED          = 1,     /*!< ENABLED : In phase-lock and frequency-lock modes, spectrum spreading,
                                                     and dithering are prevented from updating the output of
                                                     the DCO.                                                                  */
} PLL_0_CONTROL_STALL_Enum;

/* =============================================  PLL_0 CONTROL DITHEN [28..28]  ============================================= */
typedef enum {                                  /*!< PLL_0_CONTROL_DITHEN                                                      */
  PLL_0_CONTROL_DITHEN_DISABLED        = 0,     /*!< DISABLED : Automatic DCO output dithering disabled.                       */
  PLL_0_CONTROL_DITHEN_ENABLED         = 1,     /*!< ENABLED : Automatic DCO output dithering enabled.                         */
} PLL_0_CONTROL_DITHEN_Enum;

/* =============================================  PLL_0 CONTROL EDGSEL [29..29]  ============================================= */
typedef enum {                                  /*!< PLL_0_CONTROL_EDGSEL                                                      */
  PLL_0_CONTROL_EDGSEL_FALLING_EDGE    = 0,     /*!< FALLING_EDGE : Lock DCO output frequency to the falling edge
                                                     of the reference frequency.                                               */
  PLL_0_CONTROL_EDGSEL_RISING_EDGE     = 1,     /*!< RISING_EDGE : Lock DCO output frequency to the rising edge of
                                                     the reference frequency.                                                  */
} PLL_0_CONTROL_EDGSEL_Enum;

/* =============================================  PLL_0 CONTROL OUTMD [30..31]  ============================================== */
typedef enum {                                  /*!< PLL_0_CONTROL_OUTMD                                                       */
  PLL_0_CONTROL_OUTMD_OFF              = 0,     /*!< OFF : DCO output is off.                                                  */
  PLL_0_CONTROL_OUTMD_DCO              = 1,     /*!< DCO : DCO output is in Free-Running DCO mode.                             */
  PLL_0_CONTROL_OUTMD_FLL              = 2,     /*!< FLL : DCO output is in frequency-lock mode (reference source
                                                     required).                                                                */
  PLL_0_CONTROL_OUTMD_PLL              = 3,     /*!< PLL : DCO output is in phase-lock mode (reference source required).       */
} PLL_0_CONTROL_OUTMD_Enum;

/* =========================================================  SSPR  ========================================================== */
/* ================================================  PLL_0 SSPR SSAMP [0..2]  ================================================ */
typedef enum {                                  /*!< PLL_0_SSPR_SSAMP                                                          */
  PLL_0_SSPR_SSAMP_DISABLED            = 0,     /*!< DISABLED : Disable Spectrum Spreading.                                    */
  PLL_0_SSPR_SSAMP_SETTING1            = 1,     /*!< SETTING1 : Spectrum Spreading set to approximately +/- 0.1%
                                                     of TDCO.                                                                  */
  PLL_0_SSPR_SSAMP_SETTING2            = 2,     /*!< SETTING2 : Spectrum Spreading set to approximately +/- 0.2%
                                                     of TDCO.                                                                  */
  PLL_0_SSPR_SSAMP_SETTING3            = 3,     /*!< SETTING3 : Spectrum Spreading set to approximately +/- 0.4%
                                                     of TDCO.                                                                  */
  PLL_0_SSPR_SSAMP_SETTING4            = 4,     /*!< SETTING4 : Spectrum Spreading set to approximately +/- 0.8%
                                                     of TDCO.                                                                  */
  PLL_0_SSPR_SSAMP_SETTING5            = 5,     /*!< SETTING5 : Spectrum Spreading set to approximately +/- 1.6%
                                                     of TDCO.                                                                  */
} PLL_0_SSPR_SSAMP_Enum;

/* =======================================================  CALCONFIG  ======================================================= */
/* ============================================  PLL_0 CALCONFIG RANGE [16..18]  ============================================= */
typedef enum {                                  /*!< PLL_0_CALCONFIG_RANGE                                                     */
  PLL_0_CALCONFIG_RANGE_RANGE0         = 0,     /*!< RANGE0 : DCO operates from 23 to 37 MHz.                                  */
  PLL_0_CALCONFIG_RANGE_RANGE1         = 1,     /*!< RANGE1 : DCO operates from 33 to 54 MHz.                                  */
  PLL_0_CALCONFIG_RANGE_RANGE2         = 2,     /*!< RANGE2 : DCO operates from 45 to 71 MHz.                                  */
  PLL_0_CALCONFIG_RANGE_RANGE3         = 3,     /*!< RANGE3 : DCO operates from 53 to 80 MHz.                                  */
  PLL_0_CALCONFIG_RANGE_RANGE4         = 4,     /*!< RANGE4 : DCO operates from 73 to 80 MHz.                                  */
} PLL_0_CALCONFIG_RANGE_Enum;



/* =========================================================================================================================== */
/* ================                                         EXTOSC_0                                          ================ */
/* =========================================================================================================================== */

