chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* ============================================  EXTOSC_0 CONTROL FREQCN [0..2]  ============================================= */
typedef enum {                                  /*!< EXTOSC_0_CONTROL_FREQCN                                                   */
  EXTOSC_0_CONTROL_FREQCN_RANGE0       = 0,     /*!< RANGE0 : Set the external oscillator to range 0.                          */
  EXTOSC_0_CONTROL_FREQCN_RANGE1       = 1,     /*!< RANGE1 : Set the external oscillator to range 1.                          */
  EXTOSC_0_CONTROL_FREQCN_RANGE2       = 2,     /*!< RANGE2 : Set the external oscillator to range 2.                          */
  EXTOSC_0_CONTROL_FREQCN_RANGE3       = 3,     /*!< RANGE3 : Set the external oscillator to range 3.                          */
  EXTOSC_0_CONTROL_FREQCN_RANGE4       = 4,     /*!< RANGE4 : Set the external oscillator to range 4.                          */
  EXTOSC_0_CONTROL_FREQCN_RANGE5       = 5,     /*!< RANGE5 : Set the external oscillator to range 5.                          */
  EXTOSC_0_CONTROL_FREQCN_RANGE6       = 6,     /*!< RANGE6 : Set the external oscillator to range 6.                          */
  EXTOSC_0_CONTROL_FREQCN_RANGE7       = 7,     /*!< RANGE7 : Set the external oscillator to range 7.                          */
} EXTOSC_0_CONTROL_FREQCN_Enum;

/* ============================================  EXTOSC_0 CONTROL OSCVLDF [3..3]  ============================================ */
typedef enum {                                  /*!< EXTOSC_0_CONTROL_OSCVLDF                                                  */
  EXTOSC_0_CONTROL_OSCVLDF_NOT_SET     = 0,     /*!< NOT_SET : The external oscillator is unused or not yet stable.            */
  EXTOSC_0_CONTROL_OSCVLDF_SET         = 1,     /*!< SET : The external oscillator is running and stable.                      */
} EXTOSC_0_CONTROL_OSCVLDF_Enum;

/* =============================================  EXTOSC_0 CONTROL OSCMD [4..6]  ============================================= */
typedef enum {                                  /*!< EXTOSC_0_CONTROL_OSCMD                                                    */
  EXTOSC_0_CONTROL_OSCMD_OFF           = 0,     /*!< OFF : External oscillator off.                                            */
  EXTOSC_0_CONTROL_OSCMD_CMOS          = 2,     /*!< CMOS : External CMOS clock mode.                                          */
  EXTOSC_0_CONTROL_OSCMD_CMOSDIV2      = 3,     /*!< CMOSDIV2 : External CMOS with divide by 2 stage.                          */
  EXTOSC_0_CONTROL_OSCMD_RC            = 4,     /*!< RC : RC oscillator mode with divide by 2 stage.                           */
  EXTOSC_0_CONTROL_OSCMD_C             = 5,     /*!< C : C oscillator mode with divide by 2 stage.                             */
  EXTOSC_0_CONTROL_OSCMD_XTAL          = 6,     /*!< XTAL : Crystal oscillator mode.                                           */
  EXTOSC_0_CONTROL_OSCMD_XTALDIV2      = 7,     /*!< XTALDIV2 : Crystal oscillator mode with divide by 2 stage.                */
} EXTOSC_0_CONTROL_OSCMD_Enum;



/* =========================================================================================================================== */
/* ================                                          LPOSC_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  OSCVAL  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           PCA_0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  MODE  ========================================================== */
/* ==============================================  PCA_0 MODE CLKSEL [10..12]  =============================================== */
typedef enum {                                  /*!< PCA_0_MODE_CLKSEL                                                         */
  PCA_0_MODE_CLKSEL_APB                = 0,     /*!< APB : Set the APB as the input clock (FCLKIN).                            */
  PCA_0_MODE_CLKSEL_TIMER0             = 1,     /*!< TIMER0 : Set Timer 0 low overflows divided by 2 as the input
                                                     clock (FCLKIN).                                                           */
  PCA_0_MODE_CLKSEL_HL_ECI             = 2,     /*!< HL_ECI : Set high-to-low transitions on ECI divided by 2 as
                                                     the input clock (FCLKIN).                                                 */
  PCA_0_MODE_CLKSEL_EXTOSCN            = 3,     /*!< EXTOSCN : Set the external oscillator module output (EXTOSCn)
                                                     divided by 2 as the input clock (FCLKIN).                                 */
  PCA_0_MODE_CLKSEL_ECI                = 4,     /*!< ECI : Set ECI transitions divided by 2 as the input clock (FCLKIN).       */
} PCA_0_MODE_CLKSEL_Enum;

/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  PCA_0 CONTROL OVFIEN [0..0]  ============================================== */
typedef enum {                                  /*!< PCA_0_CONTROL_OVFIEN                                                      */
  PCA_0_CONTROL_OVFIEN_DISABLED        = 0,     /*!< DISABLED : Disable the PCA counter overflow/limit event interrupt.        */
  PCA_0_CONTROL_OVFIEN_ENABLED         = 1,     /*!< ENABLED : Enable the PCA counter overflow/limit event interrupt.          */
} PCA_0_CONTROL_OVFIEN_Enum;

/* ==============================================  PCA_0 CONTROL DBGMD [6..6]  =============================================== */
typedef enum {                                  /*!< PCA_0_CONTROL_DBGMD                                                       */
  PCA_0_CONTROL_DBGMD_HALT             = 0,     /*!< HALT : A debug breakpoint will cause the PCA to halt.                     */
  PCA_0_CONTROL_DBGMD_RUN              = 1,     /*!< RUN : The PCA will continue to operate while the core is halted
                                                     in debug mode.                                                            */
} PCA_0_CONTROL_DBGMD_Enum;

/* =============================================  PCA_0 CONTROL DIVST [21..21]  ============================================== */
typedef enum {                                  /*!< PCA_0_CONTROL_DIVST                                                       */
  PCA_0_CONTROL_DIVST_OUTPUT_HIGH      = 0,     /*!< OUTPUT_HIGH : The clock divider is currently in the first half-cycle.     */
  PCA_0_CONTROL_DIVST_OUTPUT_LOW       = 1,     /*!< OUTPUT_LOW : The clock divider is currently in the second half-cycle.     */
} PCA_0_CONTROL_DIVST_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ===============================================  PCA_0 STATUS C0CCI [0..0]  =============================================== */
typedef enum {                                  /*!< PCA_0_STATUS_C0CCI                                                        */
  PCA_0_STATUS_C0CCI_NOT_SET           = 0,     /*!< NOT_SET : A Channel 0 match or capture event did not occur.               */
  PCA_0_STATUS_C0CCI_SET               = 1,     /*!< SET : A Channel 0 match or capture event occurred.                        */
} PCA_0_STATUS_C0CCI_Enum;

/* ===============================================  PCA_0 STATUS C1CCI [1..1]  =============================================== */
typedef enum {                                  /*!< PCA_0_STATUS_C1CCI                                                        */
  PCA_0_STATUS_C1CCI_NOT_SET           = 0,     /*!< NOT_SET : A Channel 1 match or capture event did not occur.               */
  PCA_0_STATUS_C1CCI_SET               = 1,     /*!< SET : A Channel 1 match or capture event occurred.                        */
} PCA_0_STATUS_C1CCI_Enum;

/* ================================================  PCA_0 STATUS RUN [6..6]  ================================================ */
typedef enum {                                  /*!< PCA_0_STATUS_RUN                                                          */
  PCA_0_STATUS_RUN_STOP                = 0,     /*!< STOP : Stop the PCA Counter/Timer.                                        */
  PCA_0_STATUS_RUN_START               = 1,     /*!< START : Start the PCA Counter/Timer.                                      */
} PCA_0_STATUS_RUN_Enum;

/* ===============================================  PCA_0 STATUS OVFI [7..7]  ================================================ */
typedef enum {                                  /*!< PCA_0_STATUS_OVFI                                                         */
  PCA_0_STATUS_OVFI_NOT_SET            = 0,     /*!< NOT_SET : A PCA Counter/Timer overflow/limit event did not occur.         */
  PCA_0_STATUS_OVFI_SET                = 1,     /*!< SET : A PCA Counter/Timer overflow/limit event occurred.                  */
} PCA_0_STATUS_OVFI_Enum;

/* =============================================  PCA_0 STATUS C0IOVFI [10..10]  ============================================= */
typedef enum {                                  /*!< PCA_0_STATUS_C0IOVFI                                                      */
  PCA_0_STATUS_C0IOVFI_NOT_SET         = 0,     /*!< NOT_SET : Channel 0 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  PCA_0_STATUS_C0IOVFI_SET             = 1,     /*!< SET : Channel 0 counted past the channel n-bit mode limit.                */
} PCA_0_STATUS_C0IOVFI_Enum;

/* =============================================  PCA_0 STATUS C1IOVFI [11..11]  ============================================= */
typedef enum {                                  /*!< PCA_0_STATUS_C1IOVFI                                                      */
  PCA_0_STATUS_C1IOVFI_NOT_SET         = 0,     /*!< NOT_SET : Channel 1 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  PCA_0_STATUS_C1IOVFI_SET             = 1,     /*!< SET : Channel 1 counted past the channel n-bit mode limit.                */
} PCA_0_STATUS_C1IOVFI_Enum;

/* ========================================================  COUNTER  ======================================================== */
/* =========================================================  LIMIT  ========================================================= */
/* ========================================================  MODE_0  ========================================================= */
/* ===============================================  PCA_0 MODE_0 COSEL [0..1]  =============================================== */
typedef enum {                                  /*!< PCA_0_MODE_0_COSEL                                                        */
  PCA_0_MODE_0_COSEL_TOGGLE_OUTPUT     = 0,     /*!< TOGGLE_OUTPUT : Toggle the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_0_MODE_0_COSEL_SET_OUTPUT        = 1,     /*!< SET_OUTPUT : Set the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_0_MODE_0_COSEL_CLEAR_OUTPUT      = 2,     /*!< CLEAR_OUTPUT : Clear the output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_0_MODE_0_COSEL_NO_CHANGE         = 3,     /*!< NO_CHANGE : Capture/Compare, overflow, or intermediate events
                                                     do not control the output state.                                          */
} PCA_0_MODE_0_COSEL_Enum;

/* ===============================================  PCA_0 MODE_0 CMD [8..10]  ================================================ */
typedef enum {                                  /*!< PCA_0_MODE_0_CMD                                                          */
  PCA_0_MODE_0_CMD_EDGE_PWM            = 0,     /*!< EDGE_PWM : Configure the channel for edge-aligned PWM mode.               */
  PCA_0_MODE_0_CMD_CENTER_ALIGNED_PWM  = 1,     /*!< CENTER_ALIGNED_PWM : Configure the channel for center-aligned
                                                     PWM mode.                                                                 */
  PCA_0_MODE_0_CMD_HF_SQUARE_WAVE      = 2,     /*!< HF_SQUARE_WAVE : Configure the channel for high-frequency/square-wave
                                                     mode.                                                                     */
  PCA_0_MODE_0_CMD_TIMER_CAPTURE       = 3,     /*!< TIMER_CAPTURE : Configure the channel for timer/capture mode.             */
  PCA_0_MODE_0_CMD_N_BIT_PWM           = 4,     /*!< N_BIT_PWM : Configure the channel for n-bit edge-aligned PWM
                                                     mode.                                                                     */
} PCA_0_MODE_0_CMD_Enum;

/* =======================================================  CONTROL_0  ======================================================= */
/* =============================================  PCA_0 CONTROL_0 COUTST [0..0]  ============================================= */
typedef enum {                                  /*!< PCA_0_CONTROL_0_COUTST                                                    */
  PCA_0_CONTROL_0_COUTST_LOW           = 0,     /*!< LOW : The channel output state is low.                                    */
  PCA_0_CONTROL_0_COUTST_HIGH          = 1,     /*!< HIGH : The channel output state is high.                                  */
} PCA_0_CONTROL_0_COUTST_Enum;

