chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  PCA_1 CONTROL OVFIEN [0..0]  ============================================== */
typedef enum {                                  /*!< PCA_1_CONTROL_OVFIEN                                                      */
  PCA_1_CONTROL_OVFIEN_DISABLED        = 0,     /*!< DISABLED : Disable the PCA counter overflow/limit event interrupt.        */
  PCA_1_CONTROL_OVFIEN_ENABLED         = 1,     /*!< ENABLED : Enable the PCA counter overflow/limit event interrupt.          */
} PCA_1_CONTROL_OVFIEN_Enum;

/* ==============================================  PCA_1 CONTROL DBGMD [6..6]  =============================================== */
typedef enum {                                  /*!< PCA_1_CONTROL_DBGMD                                                       */
  PCA_1_CONTROL_DBGMD_HALT             = 0,     /*!< HALT : A debug breakpoint will cause the PCA to halt.                     */
  PCA_1_CONTROL_DBGMD_RUN              = 1,     /*!< RUN : The PCA will continue to operate while the core is halted
                                                     in debug mode.                                                            */
} PCA_1_CONTROL_DBGMD_Enum;

/* =============================================  PCA_1 CONTROL DIVST [21..21]  ============================================== */
typedef enum {                                  /*!< PCA_1_CONTROL_DIVST                                                       */
  PCA_1_CONTROL_DIVST_OUTPUT_HIGH      = 0,     /*!< OUTPUT_HIGH : The clock divider is currently in the first half-cycle.     */
  PCA_1_CONTROL_DIVST_OUTPUT_LOW       = 1,     /*!< OUTPUT_LOW : The clock divider is currently in the second half-cycle.     */
} PCA_1_CONTROL_DIVST_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ===============================================  PCA_1 STATUS C0CCI [0..0]  =============================================== */
typedef enum {                                  /*!< PCA_1_STATUS_C0CCI                                                        */
  PCA_1_STATUS_C0CCI_NOT_SET           = 0,     /*!< NOT_SET : A Channel 0 match or capture event did not occur.               */
  PCA_1_STATUS_C0CCI_SET               = 1,     /*!< SET : A Channel 0 match or capture event occurred.                        */
} PCA_1_STATUS_C0CCI_Enum;

/* ===============================================  PCA_1 STATUS C1CCI [1..1]  =============================================== */
typedef enum {                                  /*!< PCA_1_STATUS_C1CCI                                                        */
  PCA_1_STATUS_C1CCI_NOT_SET           = 0,     /*!< NOT_SET : A Channel 1 match or capture event did not occur.               */
  PCA_1_STATUS_C1CCI_SET               = 1,     /*!< SET : A Channel 1 match or capture event occurred.                        */
} PCA_1_STATUS_C1CCI_Enum;

/* ================================================  PCA_1 STATUS RUN [6..6]  ================================================ */
typedef enum {                                  /*!< PCA_1_STATUS_RUN                                                          */
  PCA_1_STATUS_RUN_STOP                = 0,     /*!< STOP : Stop the PCA Counter/Timer.                                        */
  PCA_1_STATUS_RUN_START               = 1,     /*!< START : Start the PCA Counter/Timer.                                      */
} PCA_1_STATUS_RUN_Enum;

/* ===============================================  PCA_1 STATUS OVFI [7..7]  ================================================ */
typedef enum {                                  /*!< PCA_1_STATUS_OVFI                                                         */
  PCA_1_STATUS_OVFI_NOT_SET            = 0,     /*!< NOT_SET : A PCA Counter/Timer overflow/limit event did not occur.         */
  PCA_1_STATUS_OVFI_SET                = 1,     /*!< SET : A PCA Counter/Timer overflow/limit event occurred.                  */
} PCA_1_STATUS_OVFI_Enum;

/* =============================================  PCA_1 STATUS C0IOVFI [10..10]  ============================================= */
typedef enum {                                  /*!< PCA_1_STATUS_C0IOVFI                                                      */
  PCA_1_STATUS_C0IOVFI_NOT_SET         = 0,     /*!< NOT_SET : Channel 0 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  PCA_1_STATUS_C0IOVFI_SET             = 1,     /*!< SET : Channel 0 counted past the channel n-bit mode limit.                */
} PCA_1_STATUS_C0IOVFI_Enum;

/* =============================================  PCA_1 STATUS C1IOVFI [11..11]  ============================================= */
typedef enum {                                  /*!< PCA_1_STATUS_C1IOVFI                                                      */
  PCA_1_STATUS_C1IOVFI_NOT_SET         = 0,     /*!< NOT_SET : Channel 1 did not count past the channel n-bit mode
                                                     limit.                                                                    */
  PCA_1_STATUS_C1IOVFI_SET             = 1,     /*!< SET : Channel 1 counted past the channel n-bit mode limit.                */
} PCA_1_STATUS_C1IOVFI_Enum;

/* ========================================================  COUNTER  ======================================================== */
/* =========================================================  LIMIT  ========================================================= */
/* ========================================================  MODE_0  ========================================================= */
/* ===============================================  PCA_1 MODE_0 COSEL [0..1]  =============================================== */
typedef enum {                                  /*!< PCA_1_MODE_0_COSEL                                                        */
  PCA_1_MODE_0_COSEL_TOGGLE_OUTPUT     = 0,     /*!< TOGGLE_OUTPUT : Toggle the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_1_MODE_0_COSEL_SET_OUTPUT        = 1,     /*!< SET_OUTPUT : Set the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_1_MODE_0_COSEL_CLEAR_OUTPUT      = 2,     /*!< CLEAR_OUTPUT : Clear the output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_1_MODE_0_COSEL_NO_CHANGE         = 3,     /*!< NO_CHANGE : Capture/Compare, overflow, or intermediate events
                                                     do not control the output state.                                          */
} PCA_1_MODE_0_COSEL_Enum;

/* ===============================================  PCA_1 MODE_0 CMD [8..10]  ================================================ */
typedef enum {                                  /*!< PCA_1_MODE_0_CMD                                                          */
  PCA_1_MODE_0_CMD_EDGE_PWM            = 0,     /*!< EDGE_PWM : Configure the channel for edge-aligned PWM mode.               */
  PCA_1_MODE_0_CMD_CENTER_ALIGNED_PWM  = 1,     /*!< CENTER_ALIGNED_PWM : Configure the channel for center-aligned
                                                     PWM mode.                                                                 */
  PCA_1_MODE_0_CMD_HF_SQUARE_WAVE      = 2,     /*!< HF_SQUARE_WAVE : Configure the channel for high-frequency/square-wave
                                                     mode.                                                                     */
  PCA_1_MODE_0_CMD_TIMER_CAPTURE       = 3,     /*!< TIMER_CAPTURE : Configure the channel for timer/capture mode.             */
  PCA_1_MODE_0_CMD_N_BIT_PWM           = 4,     /*!< N_BIT_PWM : Configure the channel for n-bit edge-aligned PWM
                                                     mode.                                                                     */
} PCA_1_MODE_0_CMD_Enum;

/* =======================================================  CONTROL_0  ======================================================= */
/* =============================================  PCA_1 CONTROL_0 COUTST [0..0]  ============================================= */
typedef enum {                                  /*!< PCA_1_CONTROL_0_COUTST                                                    */
  PCA_1_CONTROL_0_COUTST_LOW           = 0,     /*!< LOW : The channel output state is low.                                    */
  PCA_1_CONTROL_0_COUTST_HIGH          = 1,     /*!< HIGH : The channel output state is high.                                  */
} PCA_1_CONTROL_0_COUTST_Enum;

/* ============================================  PCA_1 CONTROL_0 CPCAPEN [1..1]  ============================================= */
typedef enum {                                  /*!< PCA_1_CONTROL_0_CPCAPEN                                                   */
  PCA_1_CONTROL_0_CPCAPEN_DISABLED     = 0,     /*!< DISABLED : Disable positive-edge input capture.                           */
  PCA_1_CONTROL_0_CPCAPEN_ENABLED      = 1,     /*!< ENABLED : Enable positive-edge input capture.                             */
} PCA_1_CONTROL_0_CPCAPEN_Enum;

