chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  PCA_1 CONTROL_0 CNCAPEN [2..2]  ============================================= */
typedef enum {                                  /*!< PCA_1_CONTROL_0_CNCAPEN                                                   */
  PCA_1_CONTROL_0_CNCAPEN_DISABLED     = 0,     /*!< DISABLED : Disable negative-edge input capture.                           */
  PCA_1_CONTROL_0_CNCAPEN_ENABLED      = 1,     /*!< ENABLED : Enable negative-edge input capture.                             */
} PCA_1_CONTROL_0_CNCAPEN_Enum;

/* =============================================  PCA_1 CONTROL_0 CUPDCF [3..3]  ============================================= */
typedef enum {                                  /*!< PCA_1_CONTROL_0_CUPDCF                                                    */
  PCA_1_CONTROL_0_CUPDCF_NOT_SET       = 0,     /*!< NOT_SET : A PCA channel register update completed or is not
                                                     pending.                                                                  */
  PCA_1_CONTROL_0_CUPDCF_SET           = 1,     /*!< SET : A PCA channel register update has not completed and is
                                                     still pending.                                                            */
} PCA_1_CONTROL_0_CUPDCF_Enum;

/* =============================================  PCA_1 CONTROL_0 CCIEN [8..8]  ============================================== */
typedef enum {                                  /*!< PCA_1_CONTROL_0_CCIEN                                                     */
  PCA_1_CONTROL_0_CCIEN_DISABLED       = 0,     /*!< DISABLED : Disable the channel capture/compare interrupt.                 */
  PCA_1_CONTROL_0_CCIEN_ENABLED        = 1,     /*!< ENABLED : Enable the channel capture/compare interrupt.                   */
} PCA_1_CONTROL_0_CCIEN_Enum;

/* ===========================================  PCA_1 CONTROL_0 CIOVFIEN [11..11]  =========================================== */
typedef enum {                                  /*!< PCA_1_CONTROL_0_CIOVFIEN                                                  */
  PCA_1_CONTROL_0_CIOVFIEN_DISABLED    = 0,     /*!< DISABLED : Disable the channel intermediate overflow interrupt.           */
  PCA_1_CONTROL_0_CIOVFIEN_ENABLED     = 1,     /*!< ENABLED : Enable the channel intermediate overflow interrupt.             */
} PCA_1_CONTROL_0_CIOVFIEN_Enum;

/* ========================================================  CCAPV_0  ======================================================== */
/* ======================================================  CCAPVUPD_0  ======================================================= */
/* ========================================================  MODE_1  ========================================================= */
/* ===============================================  PCA_1 MODE_1 COSEL [0..1]  =============================================== */
typedef enum {                                  /*!< PCA_1_MODE_1_COSEL                                                        */
  PCA_1_MODE_1_COSEL_TOGGLE_OUTPUT     = 0,     /*!< TOGGLE_OUTPUT : Toggle the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_1_MODE_1_COSEL_SET_OUTPUT        = 1,     /*!< SET_OUTPUT : Set the channel output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_1_MODE_1_COSEL_CLEAR_OUTPUT      = 2,     /*!< CLEAR_OUTPUT : Clear the output at the next capture/compare,
                                                     overflow, or intermediate event.                                          */
  PCA_1_MODE_1_COSEL_NO_CHANGE         = 3,     /*!< NO_CHANGE : Capture/Compare, overflow, or intermediate events
                                                     do not control the output state.                                          */
} PCA_1_MODE_1_COSEL_Enum;

/* ===============================================  PCA_1 MODE_1 CMD [8..10]  ================================================ */
typedef enum {                                  /*!< PCA_1_MODE_1_CMD                                                          */
  PCA_1_MODE_1_CMD_EDGE_PWM            = 0,     /*!< EDGE_PWM : Configure the channel for edge-aligned PWM mode.               */
  PCA_1_MODE_1_CMD_CENTER_ALIGNED_PWM  = 1,     /*!< CENTER_ALIGNED_PWM : Configure the channel for center-aligned
                                                     PWM mode.                                                                 */
  PCA_1_MODE_1_CMD_HF_SQUARE_WAVE      = 2,     /*!< HF_SQUARE_WAVE : Configure the channel for high-frequency/square-wave
                                                     mode.                                                                     */
  PCA_1_MODE_1_CMD_TIMER_CAPTURE       = 3,     /*!< TIMER_CAPTURE : Configure the channel for timer/capture mode.             */
  PCA_1_MODE_1_CMD_N_BIT_PWM           = 4,     /*!< N_BIT_PWM : Configure the channel for n-bit edge-aligned PWM
                                                     mode.                                                                     */
} PCA_1_MODE_1_CMD_Enum;

/* =======================================================  CONTROL_1  ======================================================= */
/* =============================================  PCA_1 CONTROL_1 COUTST [0..0]  ============================================= */
typedef enum {                                  /*!< PCA_1_CONTROL_1_COUTST                                                    */
  PCA_1_CONTROL_1_COUTST_LOW           = 0,     /*!< LOW : The channel output state is low.                                    */
  PCA_1_CONTROL_1_COUTST_HIGH          = 1,     /*!< HIGH : The channel output state is high.                                  */
} PCA_1_CONTROL_1_COUTST_Enum;

/* ============================================  PCA_1 CONTROL_1 CPCAPEN [1..1]  ============================================= */
typedef enum {                                  /*!< PCA_1_CONTROL_1_CPCAPEN                                                   */
  PCA_1_CONTROL_1_CPCAPEN_DISABLED     = 0,     /*!< DISABLED : Disable positive-edge input capture.                           */
  PCA_1_CONTROL_1_CPCAPEN_ENABLED      = 1,     /*!< ENABLED : Enable positive-edge input capture.                             */
} PCA_1_CONTROL_1_CPCAPEN_Enum;

/* ============================================  PCA_1 CONTROL_1 CNCAPEN [2..2]  ============================================= */
typedef enum {                                  /*!< PCA_1_CONTROL_1_CNCAPEN                                                   */
  PCA_1_CONTROL_1_CNCAPEN_DISABLED     = 0,     /*!< DISABLED : Disable negative-edge input capture.                           */
  PCA_1_CONTROL_1_CNCAPEN_ENABLED      = 1,     /*!< ENABLED : Enable negative-edge input capture.                             */
} PCA_1_CONTROL_1_CNCAPEN_Enum;

