chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  PCA_1 CONTROL_1 CUPDCF [3..3]  ============================================= */
typedef enum {                                  /*!< PCA_1_CONTROL_1_CUPDCF                                                    */
  PCA_1_CONTROL_1_CUPDCF_NOT_SET       = 0,     /*!< NOT_SET : A PCA channel register update completed or is not
                                                     pending.                                                                  */
  PCA_1_CONTROL_1_CUPDCF_SET           = 1,     /*!< SET : A PCA channel register update has not completed and is
                                                     still pending.                                                            */
} PCA_1_CONTROL_1_CUPDCF_Enum;

/* =============================================  PCA_1 CONTROL_1 CCIEN [8..8]  ============================================== */
typedef enum {                                  /*!< PCA_1_CONTROL_1_CCIEN                                                     */
  PCA_1_CONTROL_1_CCIEN_DISABLED       = 0,     /*!< DISABLED : Disable the channel capture/compare interrupt.                 */
  PCA_1_CONTROL_1_CCIEN_ENABLED        = 1,     /*!< ENABLED : Enable the channel capture/compare interrupt.                   */
} PCA_1_CONTROL_1_CCIEN_Enum;

/* ===========================================  PCA_1 CONTROL_1 CIOVFIEN [11..11]  =========================================== */
typedef enum {                                  /*!< PCA_1_CONTROL_1_CIOVFIEN                                                  */
  PCA_1_CONTROL_1_CIOVFIEN_DISABLED    = 0,     /*!< DISABLED : Disable the channel intermediate overflow interrupt.           */
  PCA_1_CONTROL_1_CIOVFIEN_ENABLED     = 1,     /*!< ENABLED : Enable the channel intermediate overflow interrupt.             */
} PCA_1_CONTROL_1_CIOVFIEN_Enum;

/* ========================================================  CCAPV_1  ======================================================== */
/* ======================================================  CCAPVUPD_1  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           PMU_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* =============================================  PMU_0 CONTROL WAKECLR [0..0]  ============================================== */
typedef enum {                                  /*!< PMU_0_CONTROL_WAKECLR                                                     */
  PMU_0_CONTROL_WAKECLR_CLEAR          = 0,     /*!< CLEAR : Clear all wakeup sources.                                         */
} PMU_0_CONTROL_WAKECLR_Enum;

/* =============================================  PMU_0 CONTROL PERILPEN [1..1]  ============================================= */
typedef enum {                                  /*!< PMU_0_CONTROL_PERILPEN                                                    */
  PMU_0_CONTROL_PERILPEN_DISABLED      = 0,     /*!< DISABLED : Disable the peripheral low power state.                        */
  PMU_0_CONTROL_PERILPEN_ENABLED       = 1,     /*!< ENABLED : Enable the peripheral low power state. The peripherals
                                                     will not be accessible in this state.                                     */
} PMU_0_CONTROL_PERILPEN_Enum;

/* =============================================  PMU_0 CONTROL PINLPEN [2..2]  ============================================== */
typedef enum {                                  /*!< PMU_0_CONTROL_PINLPEN                                                     */
  PMU_0_CONTROL_PINLPEN_DISABLED       = 0,     /*!< DISABLED : Disable the pin low power state.                               */
  PMU_0_CONTROL_PINLPEN_ENABLED        = 1,     /*!< ENABLED : Enable the pin low power state. The pins will not
                                                     be accessible in this state.                                              */
} PMU_0_CONTROL_PINLPEN_Enum;

/* =============================================  PMU_0 CONTROL PWAKEEN [3..3]  ============================================== */
typedef enum {                                  /*!< PMU_0_CONTROL_PWAKEEN                                                     */
  PMU_0_CONTROL_PWAKEEN_DISABLED       = 0,     /*!< DISABLED : Disable Pin Wake.                                              */
  PMU_0_CONTROL_PWAKEEN_ENABLED        = 1,     /*!< ENABLED : Enable Pin Wake.                                                */
} PMU_0_CONTROL_PWAKEEN_Enum;

/* ============================================  PMU_0 CONTROL PMUASLPEN [4..4]  ============================================= */
typedef enum {                                  /*!< PMU_0_CONTROL_PMUASLPEN                                                   */
  PMU_0_CONTROL_PMUASLPEN_DISABLED     = 0,     /*!< DISABLED : Disable the PMU Asleep pin.                                    */
  PMU_0_CONTROL_PMUASLPEN_ENABLED      = 1,     /*!< ENABLED : Enable the PMU Asleep pin.                                      */
} PMU_0_CONTROL_PMUASLPEN_Enum;

/* ========================================================  CONFIG  ========================================================= */
/* =============================================  PMU_0 CONFIG RTC0FREN [8..8]  ============================================== */
typedef enum {                                  /*!< PMU_0_CONFIG_RTC0FREN                                                     */
  PMU_0_CONFIG_RTC0FREN_DISABLED       = 0,     /*!< DISABLED : An RTC0 fail event does not cause the RTC0 and LPTIMER0
                                                     modules to reset.                                                         */
  PMU_0_CONFIG_RTC0FREN_ENABLED        = 1,     /*!< ENABLED : An RTC0 fail event causes the RTC0 and LPTIMER0 modules
                                                     to reset.                                                                 */
} PMU_0_CONFIG_RTC0FREN_Enum;

/* =============================================  PMU_0 CONFIG RTC0AREN [9..9]  ============================================== */
typedef enum {                                  /*!< PMU_0_CONFIG_RTC0AREN                                                     */
  PMU_0_CONFIG_RTC0AREN_DISABLED       = 0,     /*!< DISABLED : An RTC0 alarm event does not cause the RTC0 and LPTIMER0
                                                     modules to reset.                                                         */
  PMU_0_CONFIG_RTC0AREN_ENABLED        = 1,     /*!< ENABLED : An RTC0 alarm event causes the RTC0 and LPTIMER0 modules
                                                     to reset.                                                                 */
} PMU_0_CONFIG_RTC0AREN_Enum;

/* =============================================  PMU_0 CONFIG CMP0REN [13..13]  ============================================= */
typedef enum {                                  /*!< PMU_0_CONFIG_CMP0REN                                                      */
  PMU_0_CONFIG_CMP0REN_DISABLED        = 0,     /*!< DISABLED : A Comparator 0 event does not cause the RTC0 and
                                                     LPTIMER0 modules to reset.                                                */
  PMU_0_CONFIG_CMP0REN_ENABLED         = 1,     /*!< ENABLED : A Comparator 0 event causes the RTC0 and LPTIMER0
                                                     modules to reset.                                                         */
} PMU_0_CONFIG_CMP0REN_Enum;

/* ============================================  PMU_0 CONFIG PWAKEREN [14..14]  ============================================= */
typedef enum {                                  /*!< PMU_0_CONFIG_PWAKEREN                                                     */
  PMU_0_CONFIG_PWAKEREN_DISABLED       = 0,     /*!< DISABLED : A Pin Wake event does not cause the RTC0 and LPTIMER0
                                                     modules to reset.                                                         */
  PMU_0_CONFIG_PWAKEREN_ENABLED        = 1,     /*!< ENABLED : A Pin Wake event causes the RTC0 and LPTIMER0 modules
                                                     to reset.                                                                 */
} PMU_0_CONFIG_PWAKEREN_Enum;

