chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  PMU_0 CONFIG LPT0REN [15..15]  ============================================= */
typedef enum {                                  /*!< PMU_0_CONFIG_LPT0REN                                                      */
  PMU_0_CONFIG_LPT0REN_DISABLED        = 0,     /*!< DISABLED : An LPTIMER0 event does not cause the RTC0 and LPTIMER0
                                                     modules to reset.                                                         */
  PMU_0_CONFIG_LPT0REN_ENABLED         = 1,     /*!< ENABLED : An LPTIMER0 event causes the RTC0 and LPTIMER0 modules
                                                     to reset.                                                                 */
} PMU_0_CONFIG_LPT0REN_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ===============================================  PMU_0 STATUS PM9EF [0..0]  =============================================== */
typedef enum {                                  /*!< PMU_0_STATUS_PM9EF                                                        */
  PMU_0_STATUS_PM9EF_NOT_SET           = 0,     /*!< NOT_SET : The device has not exited Power Mode 9.                         */
  PMU_0_STATUS_PM9EF_SET               = 1,     /*!< SET : The device has exited Power Mode 9. This bit must be cleared
                                                     by firmware.                                                              */
} PMU_0_STATUS_PM9EF_Enum;

/* ==============================================  PMU_0 STATUS PWAKEF [1..1]  =============================================== */
typedef enum {                                  /*!< PMU_0_STATUS_PWAKEF                                                       */
  PMU_0_STATUS_PWAKEF_SET              = 0,     /*!< SET : A Pin Wake event has occurred.                                      */
  PMU_0_STATUS_PWAKEF_NOT_SET          = 1,     /*!< NOT_SET : A Pin Wake event has not occurred.                              */
} PMU_0_STATUS_PWAKEF_Enum;

/* ===============================================  PMU_0 STATUS PORF [2..2]  ================================================ */
typedef enum {                                  /*!< PMU_0_STATUS_PORF                                                         */
  PMU_0_STATUS_PORF_NOT_SET            = 0,     /*!< NOT_SET : A power-on reset did not occur since the last time
                                                     PORF was cleared.                                                         */
  PMU_0_STATUS_PORF_SET                = 1,     /*!< SET : A power-on reset occurred.                                          */
} PMU_0_STATUS_PORF_Enum;

/* ========================================================  WAKEEN  ========================================================= */
/* =============================================  PMU_0 WAKEEN RTC0FWEN [0..0]  ============================================== */
typedef enum {                                  /*!< PMU_0_WAKEEN_RTC0FWEN                                                     */
  PMU_0_WAKEEN_RTC0FWEN_DISABLED       = 0,     /*!< DISABLED : An RTC0 fail event does not wake the device.                   */
  PMU_0_WAKEEN_RTC0FWEN_ENABLED        = 1,     /*!< ENABLED : An RTC0 fail event awakens the device.                          */
} PMU_0_WAKEEN_RTC0FWEN_Enum;

/* =============================================  PMU_0 WAKEEN RTC0AWEN [1..1]  ============================================== */
typedef enum {                                  /*!< PMU_0_WAKEEN_RTC0AWEN                                                     */
  PMU_0_WAKEEN_RTC0AWEN_DISABLED       = 0,     /*!< DISABLED : An RTC0 alarm event does not wake the device.                  */
  PMU_0_WAKEEN_RTC0AWEN_ENABLED        = 1,     /*!< ENABLED : An RTC0 alarm event awakens the device.                         */
} PMU_0_WAKEEN_RTC0AWEN_Enum;

/* ==============================================  PMU_0 WAKEEN CMP0WEN [5..5]  ============================================== */
typedef enum {                                  /*!< PMU_0_WAKEEN_CMP0WEN                                                      */
  PMU_0_WAKEEN_CMP0WEN_DISABLED        = 0,     /*!< DISABLED : A Comparator 0 event does not wake the device.                 */
  PMU_0_WAKEEN_CMP0WEN_ENABLED         = 1,     /*!< ENABLED : A Comparator 0 event awakens the device.                        */
} PMU_0_WAKEEN_CMP0WEN_Enum;

/* =============================================  PMU_0 WAKEEN PWAKEWEN [6..6]  ============================================== */
typedef enum {                                  /*!< PMU_0_WAKEEN_PWAKEWEN                                                     */
  PMU_0_WAKEEN_PWAKEWEN_DISABLED       = 0,     /*!< DISABLED : A Pin Wake event does not wake the device.                     */
  PMU_0_WAKEEN_PWAKEWEN_ENABLED        = 1,     /*!< ENABLED : A Pin Wake event awakens the device.                            */
} PMU_0_WAKEEN_PWAKEWEN_Enum;

/* ==============================================  PMU_0 WAKEEN LPT0WEN [7..7]  ============================================== */
typedef enum {                                  /*!< PMU_0_WAKEEN_LPT0WEN                                                      */
  PMU_0_WAKEEN_LPT0WEN_DISABLED        = 0,     /*!< DISABLED : An LPTIMER0 event does not wake the device.                    */
  PMU_0_WAKEEN_LPT0WEN_ENABLED         = 1,     /*!< ENABLED : An LPTIMER0 event awakens the device.                           */
} PMU_0_WAKEEN_LPT0WEN_Enum;

/* ==============================================  PMU_0 WAKEEN RSTWEN [8..8]  =============================================== */
typedef enum {                                  /*!< PMU_0_WAKEEN_RSTWEN                                                       */
  PMU_0_WAKEEN_RSTWEN_DISABLED         = 0,     /*!< DISABLED : A /RESET Pin event does not wake the device.                   */
  PMU_0_WAKEEN_RSTWEN_ENABLED          = 1,     /*!< ENABLED : A /RESET Pin event awakens the device.                          */
} PMU_0_WAKEEN_RSTWEN_Enum;

/* ======================================================  WAKESTATUS  ======================================================= */
/* ============================================  PMU_0 WAKESTATUS RTC0FWF [0..0]  ============================================ */
typedef enum {                                  /*!< PMU_0_WAKESTATUS_RTC0FWF                                                  */
  PMU_0_WAKESTATUS_RTC0FWF_NOT_SET     = 0,     /*!< NOT_SET : An RTC0 fail event did not wake the device.                     */
  PMU_0_WAKESTATUS_RTC0FWF_SET         = 1,     /*!< SET : An RTC0 fail event woke the device.                                 */
} PMU_0_WAKESTATUS_RTC0FWF_Enum;

/* ============================================  PMU_0 WAKESTATUS RTC0AWF [1..1]  ============================================ */
typedef enum {                                  /*!< PMU_0_WAKESTATUS_RTC0AWF                                                  */
  PMU_0_WAKESTATUS_RTC0AWF_NOT_SET     = 0,     /*!< NOT_SET : An RTC0 alarm event did not wake the device.                    */
  PMU_0_WAKESTATUS_RTC0AWF_SET         = 1,     /*!< SET : An RTC0 alarm event woke the device.                                */
} PMU_0_WAKESTATUS_RTC0AWF_Enum;

/* ============================================  PMU_0 WAKESTATUS CMP0WF [5..5]  ============================================= */
typedef enum {                                  /*!< PMU_0_WAKESTATUS_CMP0WF                                                   */
  PMU_0_WAKESTATUS_CMP0WF_NOT_SET      = 0,     /*!< NOT_SET : A Comparator 0 event did not wake the device.                   */
  PMU_0_WAKESTATUS_CMP0WF_SET          = 1,     /*!< SET : A Comparator 0 event woke the device.                               */
} PMU_0_WAKESTATUS_CMP0WF_Enum;

/* ============================================  PMU_0 WAKESTATUS PWAKEWF [6..6]  ============================================ */
typedef enum {                                  /*!< PMU_0_WAKESTATUS_PWAKEWF                                                  */
  PMU_0_WAKESTATUS_PWAKEWF_NOT_SET     = 0,     /*!< NOT_SET : A Pin Wake event did not wake the device.                       */
  PMU_0_WAKESTATUS_PWAKEWF_SET         = 1,     /*!< SET : A Pin Wake event woke the device.                                   */
} PMU_0_WAKESTATUS_PWAKEWF_Enum;

