chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  PMU_0 WAKESTATUS LPT0WF [7..7]  ============================================= */
typedef enum {                                  /*!< PMU_0_WAKESTATUS_LPT0WF                                                   */
  PMU_0_WAKESTATUS_LPT0WF_NOT_SET      = 0,     /*!< NOT_SET : An LPTIMER0 event did not wake the device.                      */
  PMU_0_WAKESTATUS_LPT0WF_SET          = 1,     /*!< SET : An LPTIMER0 event woke the device.                                  */
} PMU_0_WAKESTATUS_LPT0WF_Enum;

/* =============================================  PMU_0 WAKESTATUS RSTWF [8..8]  ============================================= */
typedef enum {                                  /*!< PMU_0_WAKESTATUS_RSTWF                                                    */
  PMU_0_WAKESTATUS_RSTWF_NOT_SET       = 0,     /*!< NOT_SET : A /RESET Pin event did not wake the device.                     */
  PMU_0_WAKESTATUS_RSTWF_SET           = 1,     /*!< SET : A /RESET Pin event woke the device.                                 */
} PMU_0_WAKESTATUS_RSTWF_Enum;

/* =========================================================  PWEN  ========================================================== */
/* ================================================  PMU_0 PWEN PW0EN [0..0]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW0EN                                                          */
  PMU_0_PWEN_PW0EN_DISABLED            = 0,     /*!< DISABLED : WAKE.0 (PB1.13) is not used in the Pin Wake comparison.        */
  PMU_0_PWEN_PW0EN_ENABLED             = 1,     /*!< ENABLED : WAKE.0 (PB1.13) is used in the Pin Wake comparison.             */
} PMU_0_PWEN_PW0EN_Enum;

/* ================================================  PMU_0 PWEN PW1EN [1..1]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW1EN                                                          */
  PMU_0_PWEN_PW1EN_DISABLED            = 0,     /*!< DISABLED : WAKE.1 (PB1.14) is not used in the Pin Wake comparison.        */
  PMU_0_PWEN_PW1EN_ENABLED             = 1,     /*!< ENABLED : WAKE.1 (PB1.14) is used in the Pin Wake comparison.             */
} PMU_0_PWEN_PW1EN_Enum;

/* ================================================  PMU_0 PWEN PW2EN [2..2]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW2EN                                                          */
  PMU_0_PWEN_PW2EN_DISABLED            = 0,     /*!< DISABLED : WAKE.2 (PB1.15) is not used in the Pin Wake comparison.        */
  PMU_0_PWEN_PW2EN_ENABLED             = 1,     /*!< ENABLED : WAKE.2 (PB1.15) is used in the Pin Wake comparison.             */
} PMU_0_PWEN_PW2EN_Enum;

/* ================================================  PMU_0 PWEN PW3EN [3..3]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW3EN                                                          */
  PMU_0_PWEN_PW3EN_DISABLED            = 0,     /*!< DISABLED : WAKE.3 (PB2.0) is not used in the Pin Wake comparison.         */
  PMU_0_PWEN_PW3EN_ENABLED             = 1,     /*!< ENABLED : WAKE.3 (PB2.0) is used in the Pin Wake comparison.              */
} PMU_0_PWEN_PW3EN_Enum;

/* ================================================  PMU_0 PWEN PW4EN [4..4]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW4EN                                                          */
  PMU_0_PWEN_PW4EN_DISABLED            = 0,     /*!< DISABLED : WAKE.4 (PB2.1) is not used in the Pin Wake comparison.         */
  PMU_0_PWEN_PW4EN_ENABLED             = 1,     /*!< ENABLED : WAKE.4 (PB2.1) is used in the Pin Wake comparison.              */
} PMU_0_PWEN_PW4EN_Enum;

/* ================================================  PMU_0 PWEN PW5EN [5..5]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW5EN                                                          */
  PMU_0_PWEN_PW5EN_DISABLED            = 0,     /*!< DISABLED : WAKE.5 (PB2.2) is not used in the Pin Wake comparison.         */
  PMU_0_PWEN_PW5EN_ENABLED             = 1,     /*!< ENABLED : WAKE.5 (PB2.2) is used in the Pin Wake comparison.              */
} PMU_0_PWEN_PW5EN_Enum;

/* ================================================  PMU_0 PWEN PW6EN [6..6]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW6EN                                                          */
  PMU_0_PWEN_PW6EN_DISABLED            = 0,     /*!< DISABLED : WAKE.6 (PB2.3) is not used in the Pin Wake comparison.         */
  PMU_0_PWEN_PW6EN_ENABLED             = 1,     /*!< ENABLED : WAKE.6 (PB2.3) is used in the Pin Wake comparison.              */
} PMU_0_PWEN_PW6EN_Enum;

/* ================================================  PMU_0 PWEN PW7EN [7..7]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW7EN                                                          */
  PMU_0_PWEN_PW7EN_DISABLED            = 0,     /*!< DISABLED : WAKE.7 (PB2.4) is not used in the Pin Wake comparison.         */
  PMU_0_PWEN_PW7EN_ENABLED             = 1,     /*!< ENABLED : WAKE.7 (PB2.4) is used in the Pin Wake comparison.              */
} PMU_0_PWEN_PW7EN_Enum;

/* ================================================  PMU_0 PWEN PW8EN [8..8]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW8EN                                                          */
  PMU_0_PWEN_PW8EN_DISABLED            = 0,     /*!< DISABLED : WAKE.8 (PB3.4) is not used in the Pin Wake comparison.         */
  PMU_0_PWEN_PW8EN_ENABLED             = 1,     /*!< ENABLED : WAKE.8 (PB3.4) is used in the Pin Wake comparison.              */
} PMU_0_PWEN_PW8EN_Enum;

/* ================================================  PMU_0 PWEN PW9EN [9..9]  ================================================ */
typedef enum {                                  /*!< PMU_0_PWEN_PW9EN                                                          */
  PMU_0_PWEN_PW9EN_DISABLED            = 0,     /*!< DISABLED : WAKE.9 (PB3.5) is not used in the Pin Wake comparison.         */
  PMU_0_PWEN_PW9EN_ENABLED             = 1,     /*!< ENABLED : WAKE.9 (PB3.5) is used in the Pin Wake comparison.              */
} PMU_0_PWEN_PW9EN_Enum;

/* ==============================================  PMU_0 PWEN PW10EN [10..10]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWEN_PW10EN                                                         */
  PMU_0_PWEN_PW10EN_DISABLED           = 0,     /*!< DISABLED : WAKE.10 (PB3.6) is not used in the Pin Wake comparison.        */
  PMU_0_PWEN_PW10EN_ENABLED            = 1,     /*!< ENABLED : WAKE.10 (PB3.6) is used in the Pin Wake comparison.             */
} PMU_0_PWEN_PW10EN_Enum;

/* ==============================================  PMU_0 PWEN PW11EN [11..11]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWEN_PW11EN                                                         */
  PMU_0_PWEN_PW11EN_DISABLED           = 0,     /*!< DISABLED : WAKE.11 (PB3.7) is not used in the Pin Wake comparison.        */
  PMU_0_PWEN_PW11EN_ENABLED            = 1,     /*!< ENABLED : WAKE.11 (PB3.7) is used in the Pin Wake comparison.             */
} PMU_0_PWEN_PW11EN_Enum;

