chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  PMU_0 PWEN PW12EN [12..12]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWEN_PW12EN                                                         */
  PMU_0_PWEN_PW12EN_DISABLED           = 0,     /*!< DISABLED : WAKE.12 (PB3.8) is not used in the Pin Wake comparison.        */
  PMU_0_PWEN_PW12EN_ENABLED            = 1,     /*!< ENABLED : WAKE.12 (PB3.8) is used in the Pin Wake comparison.             */
} PMU_0_PWEN_PW12EN_Enum;

/* ==============================================  PMU_0 PWEN PW13EN [13..13]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWEN_PW13EN                                                         */
  PMU_0_PWEN_PW13EN_DISABLED           = 0,     /*!< DISABLED : WAKE.13 (PB3.9) is not used in the Pin Wake comparison.        */
  PMU_0_PWEN_PW13EN_ENABLED            = 1,     /*!< ENABLED : WAKE.13 (PB3.9) is used in the Pin Wake comparison.             */
} PMU_0_PWEN_PW13EN_Enum;

/* ==============================================  PMU_0 PWEN PW14EN [14..14]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWEN_PW14EN                                                         */
  PMU_0_PWEN_PW14EN_DISABLED           = 0,     /*!< DISABLED : WAKE.14 (PB3.10) is not used in the Pin Wake comparison.       */
  PMU_0_PWEN_PW14EN_ENABLED            = 1,     /*!< ENABLED : WAKE.14 (PB3.10) is used in the Pin Wake comparison.            */
} PMU_0_PWEN_PW14EN_Enum;

/* ==============================================  PMU_0 PWEN PW15EN [15..15]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWEN_PW15EN                                                         */
  PMU_0_PWEN_PW15EN_DISABLED           = 0,     /*!< DISABLED : WAKE.15 (PB3.11) is not used in the Pin Wake comparison.       */
  PMU_0_PWEN_PW15EN_ENABLED            = 1,     /*!< ENABLED : WAKE.15 (PB3.11) is used in the Pin Wake comparison.            */
} PMU_0_PWEN_PW15EN_Enum;

/* =========================================================  PWPOL  ========================================================= */
/* ===============================================  PMU_0 PWPOL PW0POL [0..0]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW0POL                                                        */
  PMU_0_PWPOL_PW0POL_LOW               = 0,     /*!< LOW : The WAKE.0 (PB1.13) comparison value is logic low.                  */
  PMU_0_PWPOL_PW0POL_HIGH              = 1,     /*!< HIGH : The WAKE.0 (PB1.13) comparison value is logic high.                */
} PMU_0_PWPOL_PW0POL_Enum;

/* ===============================================  PMU_0 PWPOL PW1POL [1..1]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW1POL                                                        */
  PMU_0_PWPOL_PW1POL_LOW               = 0,     /*!< LOW : The WAKE.1 (PB1.14) comparison value is logic low.                  */
  PMU_0_PWPOL_PW1POL_HIGH              = 1,     /*!< HIGH : The WAKE.1 (PB1.14) comparison value is logic high.                */
} PMU_0_PWPOL_PW1POL_Enum;

/* ===============================================  PMU_0 PWPOL PW2POL [2..2]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW2POL                                                        */
  PMU_0_PWPOL_PW2POL_LOW               = 0,     /*!< LOW : The WAKE.2 (PB1.15) comparison value is logic low.                  */
  PMU_0_PWPOL_PW2POL_HIGH              = 1,     /*!< HIGH : The WAKE.2 (PB1.15) comparison value is logic high.                */
} PMU_0_PWPOL_PW2POL_Enum;

/* ===============================================  PMU_0 PWPOL PW3POL [3..3]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW3POL                                                        */
  PMU_0_PWPOL_PW3POL_LOW               = 0,     /*!< LOW : The WAKE.3 (PB2.0) comparison value is logic low.                   */
  PMU_0_PWPOL_PW3POL_HIGH              = 1,     /*!< HIGH : The WAKE.3 (PB2.0) comparison value is logic high.                 */
} PMU_0_PWPOL_PW3POL_Enum;

/* ===============================================  PMU_0 PWPOL PW4POL [4..4]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW4POL                                                        */
  PMU_0_PWPOL_PW4POL_LOW               = 0,     /*!< LOW : The WAKE.4 (PB2.1) comparison value is logic low.                   */
  PMU_0_PWPOL_PW4POL_HIGH              = 1,     /*!< HIGH : The WAKE.4 (PB2.1) comparison value is logic high.                 */
} PMU_0_PWPOL_PW4POL_Enum;

/* ===============================================  PMU_0 PWPOL PW5POL [5..5]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW5POL                                                        */
  PMU_0_PWPOL_PW5POL_LOW               = 0,     /*!< LOW : The WAKE.5 (PB2.2) comparison value is logic low.                   */
  PMU_0_PWPOL_PW5POL_HIGH              = 1,     /*!< HIGH : The WAKE.5 (PB2.2) comparison value is logic high.                 */
} PMU_0_PWPOL_PW5POL_Enum;

/* ===============================================  PMU_0 PWPOL PW6POL [6..6]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW6POL                                                        */
  PMU_0_PWPOL_PW6POL_LOW               = 0,     /*!< LOW : The WAKE.6 (PB2.3) comparison value is logic low.                   */
  PMU_0_PWPOL_PW6POL_HIGH              = 1,     /*!< HIGH : The WAKE.6 (PB2.3) comparison value is logic high.                 */
} PMU_0_PWPOL_PW6POL_Enum;

/* ===============================================  PMU_0 PWPOL PW7POL [7..7]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW7POL                                                        */
  PMU_0_PWPOL_PW7POL_LOW               = 0,     /*!< LOW : The WAKE.7 (PB2.4) comparison value is logic low.                   */
  PMU_0_PWPOL_PW7POL_HIGH              = 1,     /*!< HIGH : The WAKE.7 (PB2.4) comparison value is logic high.                 */
} PMU_0_PWPOL_PW7POL_Enum;

/* ===============================================  PMU_0 PWPOL PW8POL [8..8]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW8POL                                                        */
  PMU_0_PWPOL_PW8POL_LOW               = 0,     /*!< LOW : The WAKE.8 (PB3.4) comparison value is logic low.                   */
  PMU_0_PWPOL_PW8POL_HIGH              = 1,     /*!< HIGH : The WAKE.8 (PB3.4) comparison value is logic high.                 */
} PMU_0_PWPOL_PW8POL_Enum;

