chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===============================================  PMU_0 PWPOL PW9POL [9..9]  =============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW9POL                                                        */
  PMU_0_PWPOL_PW9POL_LOW               = 0,     /*!< LOW : The WAKE.9 (PB3.5) comparison value is logic low.                   */
  PMU_0_PWPOL_PW9POL_HIGH              = 1,     /*!< HIGH : The WAKE.9 (PB3.5) comparison value is logic high.                 */
} PMU_0_PWPOL_PW9POL_Enum;

/* =============================================  PMU_0 PWPOL PW10POL [10..10]  ============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW10POL                                                       */
  PMU_0_PWPOL_PW10POL_LOW              = 0,     /*!< LOW : The WAKE.10 (PB3.6) comparison value is logic low.                  */
  PMU_0_PWPOL_PW10POL_HIGH             = 1,     /*!< HIGH : The WAKE.10 (PB3.6) comparison value is logic high.                */
} PMU_0_PWPOL_PW10POL_Enum;

/* =============================================  PMU_0 PWPOL PW11POL [11..11]  ============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW11POL                                                       */
  PMU_0_PWPOL_PW11POL_LOW              = 0,     /*!< LOW : The WAKE.11 (PB3.7) comparison value is logic low.                  */
  PMU_0_PWPOL_PW11POL_HIGH             = 1,     /*!< HIGH : The WAKE.11 (PB3.7) comparison value is logic high.                */
} PMU_0_PWPOL_PW11POL_Enum;

/* =============================================  PMU_0 PWPOL PW12POL [12..12]  ============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW12POL                                                       */
  PMU_0_PWPOL_PW12POL_LOW              = 0,     /*!< LOW : The WAKE.12 (PB3.8) comparison value is logic low.                  */
  PMU_0_PWPOL_PW12POL_HIGH             = 1,     /*!< HIGH : The WAKE.12 (PB3.8) comparison value is logic high.                */
} PMU_0_PWPOL_PW12POL_Enum;

/* =============================================  PMU_0 PWPOL PW13POL [13..13]  ============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW13POL                                                       */
  PMU_0_PWPOL_PW13POL_LOW              = 0,     /*!< LOW : The WAKE.13 (PB3.9) comparison value is logic low.                  */
  PMU_0_PWPOL_PW13POL_HIGH             = 1,     /*!< HIGH : The WAKE.13 (PB3.9) comparison value is logic high.                */
} PMU_0_PWPOL_PW13POL_Enum;

/* =============================================  PMU_0 PWPOL PW14POL [14..14]  ============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW14POL                                                       */
  PMU_0_PWPOL_PW14POL_LOW              = 0,     /*!< LOW : The WAKE.14 (PB3.10) comparison value is logic low.                 */
  PMU_0_PWPOL_PW14POL_HIGH             = 1,     /*!< HIGH : The WAKE.14 (PB3.10) comparison value is logic high.               */
} PMU_0_PWPOL_PW14POL_Enum;

/* =============================================  PMU_0 PWPOL PW15POL [15..15]  ============================================== */
typedef enum {                                  /*!< PMU_0_PWPOL_PW15POL                                                       */
  PMU_0_PWPOL_PW15POL_LOW              = 0,     /*!< LOW : The WAKE.15 (PB3.11) comparison value is logic low.                 */
  PMU_0_PWPOL_PW15POL_HIGH             = 1,     /*!< HIGH : The WAKE.15 (PB3.11) comparison value is logic high.               */
} PMU_0_PWPOL_PW15POL_Enum;



/* =========================================================================================================================== */
/* ================                                          PBCFG_0                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  CONTROL0  ======================================================== */
/* ============================================  PBCFG_0 CONTROL0 INT0SEL [0..3]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_INT0SEL                                                  */
  PBCFG_0_CONTROL0_INT0SEL_INT0_0      = 0,     /*!< INT0_0 : Select INT0.0 (PB2.0)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_1      = 1,     /*!< INT0_1 : Select INT0.1 (PB2.1)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_2      = 2,     /*!< INT0_2 : Select INT0.2 (PB2.2)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_3      = 3,     /*!< INT0_3 : Select INT0.3 (PB2.3)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_4      = 4,     /*!< INT0_4 : Select INT0.4 (PB2.4)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_5      = 5,     /*!< INT0_5 : Select INT0.5 (PB2.5)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_6      = 6,     /*!< INT0_6 : Select INT0.6 (PB2.6)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_7      = 7,     /*!< INT0_7 : Select INT0.7 (PB2.7)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_8      = 8,     /*!< INT0_8 : Select INT0.8 (PB3.3)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_9      = 9,     /*!< INT0_9 : Select INT0.9 (PB3.4)                                            */
  PBCFG_0_CONTROL0_INT0SEL_INT0_10     = 10,    /*!< INT0_10 : Select INT0.10 (PB3.5)                                          */
  PBCFG_0_CONTROL0_INT0SEL_INT0_11     = 11,    /*!< INT0_11 : Select INT0.11 (PB3.6)                                          */
  PBCFG_0_CONTROL0_INT0SEL_INT0_12     = 12,    /*!< INT0_12 : Select INT0.12 (PB3.7)                                          */
  PBCFG_0_CONTROL0_INT0SEL_INT0_13     = 13,    /*!< INT0_13 : Select INT0.13 (PB3.8)                                          */
  PBCFG_0_CONTROL0_INT0SEL_INT0_14     = 14,    /*!< INT0_14 : Select INT0.14 (PB3.9)                                          */
  PBCFG_0_CONTROL0_INT0SEL_INT0_15     = 15,    /*!< INT0_15 : Select INT0.15 (PB3.10)                                         */
} PBCFG_0_CONTROL0_INT0SEL_Enum;

/* ============================================  PBCFG_0 CONTROL0 INT0POL [4..4]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_INT0POL                                                  */
  PBCFG_0_CONTROL0_INT0POL_LOW         = 0,     /*!< LOW : A low value or falling edge on the selected pin will cause
                                                     interrupt.                                                                */
  PBCFG_0_CONTROL0_INT0POL_HIGH        = 1,     /*!< HIGH : A high value or rising edge on the selected pin will
                                                     cause interrupt.                                                          */
} PBCFG_0_CONTROL0_INT0POL_Enum;

/* ============================================  PBCFG_0 CONTROL0 INT0MD [5..5]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_INT0MD                                                   */
  PBCFG_0_CONTROL0_INT0MD_LEVEL        = 0,     /*!< LEVEL : Interrupt based on level sensitivity.                             */
  PBCFG_0_CONTROL0_INT0MD_EDGE         = 1,     /*!< EDGE : Interrupt based on edge sensitivity.                               */
} PBCFG_0_CONTROL0_INT0MD_Enum;

