chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  PBCFG_0 CONTROL0 INT0EN [7..7]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_INT0EN                                                   */
  PBCFG_0_CONTROL0_INT0EN_DISABLED     = 0,     /*!< DISABLED : Disable external interrupt 0.                                  */
  PBCFG_0_CONTROL0_INT0EN_ENABLED      = 1,     /*!< ENABLED : Enable external interrupt 0.                                    */
} PBCFG_0_CONTROL0_INT0EN_Enum;

/* ===========================================  PBCFG_0 CONTROL0 INT1SEL [8..11]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_INT1SEL                                                  */
  PBCFG_0_CONTROL0_INT1SEL_INT1_0      = 0,     /*!< INT1_0 : Select INT1.0 (PB2.0)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_1      = 1,     /*!< INT1_1 : Select INT1.1 (PB2.1)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_2      = 2,     /*!< INT1_2 : Select INT1.2 (PB2.2)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_3      = 3,     /*!< INT1_3 : Select INT1.3 (PB2.3)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_4      = 4,     /*!< INT1_4 : Select INT1.4 (PB2.4)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_5      = 5,     /*!< INT1_5 : Select INT1.5 (PB2.5)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_6      = 6,     /*!< INT1_6 : Select INT1.6 (PB2.6)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_7      = 7,     /*!< INT1_7 : Select INT1.7 (PB2.7)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_8      = 8,     /*!< INT1_8 : Select INT1.8 (PB3.3)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_9      = 9,     /*!< INT1_9 : Select INT1.9 (PB3.4)                                            */
  PBCFG_0_CONTROL0_INT1SEL_INT1_10     = 10,    /*!< INT1_10 : Select INT1.10 (PB3.5)                                          */
  PBCFG_0_CONTROL0_INT1SEL_INT1_11     = 11,    /*!< INT1_11 : Select INT1.11 (PB3.6)                                          */
  PBCFG_0_CONTROL0_INT1SEL_INT1_12     = 12,    /*!< INT1_12 : Select INT1.12 (PB3.7)                                          */
  PBCFG_0_CONTROL0_INT1SEL_INT1_13     = 13,    /*!< INT1_13 : Select INT1.13 (PB3.8)                                          */
  PBCFG_0_CONTROL0_INT1SEL_INT1_14     = 14,    /*!< INT1_14 : Select INT1.14 (PB3.9)                                          */
  PBCFG_0_CONTROL0_INT1SEL_INT1_15     = 15,    /*!< INT1_15 : Select INT1.15 (PB3.10)                                         */
} PBCFG_0_CONTROL0_INT1SEL_Enum;

/* ===========================================  PBCFG_0 CONTROL0 INT1POL [12..12]  =========================================== */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_INT1POL                                                  */
  PBCFG_0_CONTROL0_INT1POL_LOW         = 0,     /*!< LOW : A low value or falling edge on the selected pin will cause
                                                     interrupt.                                                                */
  PBCFG_0_CONTROL0_INT1POL_HIGH        = 1,     /*!< HIGH : A high value or rising edge on the selected pin will
                                                     cause interrupt.                                                          */
} PBCFG_0_CONTROL0_INT1POL_Enum;

/* ===========================================  PBCFG_0 CONTROL0 INT1MD [13..13]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_INT1MD                                                   */
  PBCFG_0_CONTROL0_INT1MD_LEVEL        = 0,     /*!< LEVEL : Interrupt based on level sensitivity.                             */
  PBCFG_0_CONTROL0_INT1MD_EDGE         = 1,     /*!< EDGE : Interrupt based on edge sensitivity.                               */
} PBCFG_0_CONTROL0_INT1MD_Enum;

/* ===========================================  PBCFG_0 CONTROL0 INT1EN [15..15]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_INT1EN                                                   */
  PBCFG_0_CONTROL0_INT1EN_DISABLED     = 0,     /*!< DISABLED : Disable external interrupt 1.                                  */
  PBCFG_0_CONTROL0_INT1EN_ENABLED      = 1,     /*!< ENABLED : Enable external interrupt 1.                                    */
} PBCFG_0_CONTROL0_INT1EN_Enum;

/* ===========================================  PBCFG_0 CONTROL0 PGDONEF [31..31]  =========================================== */
typedef enum {                                  /*!< PBCFG_0_CONTROL0_PGDONEF                                                  */
  PBCFG_0_CONTROL0_PGDONEF_NOT_SET     = 0,     /*!< NOT_SET : Firmware has written to the PBPGPHASE register, but
                                                     the Pulse Generator timer has not expired.                                */
  PBCFG_0_CONTROL0_PGDONEF_SET         = 1,     /*!< SET : The Pulse Generator cycle finished since the last time
                                                     PBPGPHASE was written.                                                    */
} PBCFG_0_CONTROL0_PGDONEF_Enum;

/* =====================================================  CONTROL0_SET  ====================================================== */
/* =====================================================  CONTROL0_CLR  ====================================================== */
/* =======================================================  CONTROL1  ======================================================== */
/* ============================================  PBCFG_0 CONTROL1 JTAGEN [0..0]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_JTAGEN                                                   */
  PBCFG_0_CONTROL1_JTAGEN_DISABLED     = 0,     /*!< DISABLED : JTAG functionality is not pinned out.                          */
  PBCFG_0_CONTROL1_JTAGEN_ENABLED      = 1,     /*!< ENABLED : JTAG functionality is pinned out.                               */
} PBCFG_0_CONTROL1_JTAGEN_Enum;

/* =============================================  PBCFG_0 CONTROL1 ETMEN [1..1]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_ETMEN                                                    */
  PBCFG_0_CONTROL1_ETMEN_DISABLED      = 0,     /*!< DISABLED : ETM not pinned out.                                            */
  PBCFG_0_CONTROL1_ETMEN_ENABLED       = 1,     /*!< ENABLED : ETM is enabled and pinned out.                                  */
} PBCFG_0_CONTROL1_ETMEN_Enum;

