chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==========================================  PBCFG_0 CONTROL1 EMIFBE0BEN [7..7]  =========================================== */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_EMIFBE0BEN                                               */
  PBCFG_0_CONTROL1_EMIFBE0BEN_DISABLED = 0,     /*!< DISABLED : Disable the EMIF /BE0 pin.                                     */
  PBCFG_0_CONTROL1_EMIFBE0BEN_ENABLED  = 1,     /*!< ENABLED : Enable the /BE0 pin if EMIFEN is also set to 1.                 */
} PBCFG_0_CONTROL1_EMIFBE0BEN_Enum;

/* ===========================================  PBCFG_0 CONTROL1 EMIFCS1EN [8..8]  =========================================== */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_EMIFCS1EN                                                */
  PBCFG_0_CONTROL1_EMIFCS1EN_DISABLED  = 0,     /*!< DISABLED : Disable the EMIF CS1 pin.                                      */
  PBCFG_0_CONTROL1_EMIFCS1EN_ENABLED   = 1,     /*!< ENABLED : Enable the CS1 pin if EMIFEN is also set to 1.                  */
} PBCFG_0_CONTROL1_EMIFCS1EN_Enum;

/* ============================================  PBCFG_0 CONTROL1 EMIFEN [9..9]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_EMIFEN                                                   */
  PBCFG_0_CONTROL1_EMIFEN_DISABLED     = 0,     /*!< DISABLED : Disable the EMIF pins.                                         */
  PBCFG_0_CONTROL1_EMIFEN_ENABLED      = 1,     /*!< ENABLED : EMIF is enabled and pinned out.                                 */
} PBCFG_0_CONTROL1_EMIFEN_Enum;

/* ==========================================  PBCFG_0 CONTROL1 EMIFWIDTH [10..15]  ========================================== */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_EMIFWIDTH                                                */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_8  = 0,     /*!< AWIDTH_8 : EMIF Address[7:0]                                              */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_9  = 1,     /*!< AWIDTH_9 : EMIF Address[8:0], PB2.8 = A[8]                                */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_10 = 2,     /*!< AWIDTH_10 : EMIF Address[9:0], PB2.7 = A[9]                               */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_11 = 3,     /*!< AWIDTH_11 : EMIF Address[10:0], PB2.6 = A[10]                             */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_12 = 4,     /*!< AWIDTH_12 : EMIF Address[11:0], PB2.5 = A[11]                             */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_13 = 5,     /*!< AWIDTH_13 : EMIF Address[12:0], PB2.4 = A[12]                             */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_14 = 6,     /*!< AWIDTH_14 : EMIF Address[13:0], PB2.3 = A[13]                             */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_15 = 7,     /*!< AWIDTH_15 : EMIF Address[14:0], PB2.2 = A[14]                             */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_16 = 8,     /*!< AWIDTH_16 : EMIF Address[15:0], PB2.1 = A[15]                             */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_17 = 9,     /*!< AWIDTH_17 : EMIF Address[16:0], PB2.0 = A[16]                             */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_18 = 10,    /*!< AWIDTH_18 : EMIF Address[17:0], PB1.15 = A[17]                            */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_19 = 11,    /*!< AWIDTH_19 : EMIF Address[18:0], PB1.14 = A[18]                            */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_20 = 12,    /*!< AWIDTH_20 : EMIF Address[19:0], PB1.13 = A[19]                            */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_21 = 13,    /*!< AWIDTH_21 : EMIF Address[20:0], PB1.12 = A[20]                            */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_22 = 14,    /*!< AWIDTH_22 : EMIF Address[21:0], PB1.11 = A[21]                            */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_23 = 15,    /*!< AWIDTH_23 : EMIF Address[22:0], PB1.10 = A[22]                            */
  PBCFG_0_CONTROL1_EMIFWIDTH_AWIDTH_24 = 16,    /*!< AWIDTH_24 : EMIF Address[23:0], PB1.10 = A[23]                            */
} PBCFG_0_CONTROL1_EMIFWIDTH_Enum;

/* ============================================  PBCFG_0 CONTROL1 MATMD [16..17]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_MATMD                                                    */
  PBCFG_0_CONTROL1_MATMD_PINMATCH      = 0,     /*!< PINMATCH : Port Match registers used to provide interrupt /
                                                     wake sources.                                                             */
  PBCFG_0_CONTROL1_MATMD_CAPSENSE_TX   = 1,     /*!< CAPSENSE_TX : Port Match registers used to monitor output pin
                                                     activity for Capacitive Sensing measurements.                             */
  PBCFG_0_CONTROL1_MATMD_CAPSENSE_RX   = 2,     /*!< CAPSENSE_RX : Port Match registers used to monitor input pin
                                                     activity for Capacitive Sensing measurements.                             */
} PBCFG_0_CONTROL1_MATMD_Enum;

/* ==========================================  PBCFG_0 CONTROL1 EVREGRMD [23..23]  =========================================== */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_EVREGRMD                                                 */
  PBCFG_0_CONTROL1_EVREGRMD_RESET_ON_ANY = 0,   /*!< RESET_ON_ANY : The pins used by the external regulator will
                                                     default to digital inputs with weak pull-up enabled on
                                                     any reset.                                                                */
  PBCFG_0_CONTROL1_EVREGRMD_RESET_ON_POR = 1,   /*!< RESET_ON_POR : The pins used by the external regulator will
                                                     default to digital inputs with weak pull-up enabled only
                                                     on Power-On Reset. Their configured mode will be preserved
                                                     through all other resets.                                                 */
} PBCFG_0_CONTROL1_EVREGRMD_Enum;

/* ============================================  PBCFG_0 CONTROL1 LOCK [31..31]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_CONTROL1_LOCK                                                     */
  PBCFG_0_CONTROL1_LOCK_UNLOCKED       = 0,     /*!< UNLOCKED : Port Bank Configuration and Control registers are
                                                     unlocked.                                                                 */
  PBCFG_0_CONTROL1_LOCK_LOCKED         = 1,     /*!< LOCKED : The following registers are locked from write access:
                                                     CONTROL1, XBAR0L, XBAR0H, XBAR1, and all PBSKIP registers.                */
} PBCFG_0_CONTROL1_LOCK_Enum;

/* =====================================================  CONTROL1_SET  ====================================================== */
/* =====================================================  CONTROL1_CLR  ====================================================== */
/* ========================================================  XBAR0L  ========================================================= */
/* ============================================  PBCFG_0 XBAR0L USART0EN [0..0]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_USART0EN                                                   */
  PBCFG_0_XBAR0L_USART0EN_DISABLED     = 0,     /*!< DISABLED : Disable USART0 RX and TX on Crossbar 0.                        */
  PBCFG_0_XBAR0L_USART0EN_ENABLED      = 1,     /*!< ENABLED : Enable USART0 RX and TX on Crossbar 0.                          */
} PBCFG_0_XBAR0L_USART0EN_Enum;

/* ===========================================  PBCFG_0 XBAR0L USART0FCEN [1..1]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_USART0FCEN                                                 */
  PBCFG_0_XBAR0L_USART0FCEN_DISABLED   = 0,     /*!< DISABLED : Disable USART0 flow control on Crossbar 0.                     */
  PBCFG_0_XBAR0L_USART0FCEN_ENABLED    = 1,     /*!< ENABLED : Enable USART0 flow control on Crossbar 0.                       */
} PBCFG_0_XBAR0L_USART0FCEN_Enum;

