chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  PBCFG_0 XBAR0L USART0CEN [2..2]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_USART0CEN                                                  */
  PBCFG_0_XBAR0L_USART0CEN_DISABLED    = 0,     /*!< DISABLED : Disable USART0 clock on Crossbar 0.                            */
  PBCFG_0_XBAR0L_USART0CEN_ENABLED     = 1,     /*!< ENABLED : Enable USART0 clock on Crossbar 0.                              */
} PBCFG_0_XBAR0L_USART0CEN_Enum;

/* =============================================  PBCFG_0 XBAR0L SPI0EN [3..3]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_SPI0EN                                                     */
  PBCFG_0_XBAR0L_SPI0EN_DISABLED       = 0,     /*!< DISABLED : Disable SPI0 SCK, MISO, and MOSI on Crossbar 0.                */
  PBCFG_0_XBAR0L_SPI0EN_ENABLED        = 1,     /*!< ENABLED : Enable SPI0 SCK, MISO, and MOSI on Crossbar 0.                  */
} PBCFG_0_XBAR0L_SPI0EN_Enum;

/* ============================================  PBCFG_0 XBAR0L SPI0NSSEN [4..4]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_SPI0NSSEN                                                  */
  PBCFG_0_XBAR0L_SPI0NSSEN_DISABLED    = 0,     /*!< DISABLED : Disable SPI0 NSS on Crossbar 0.                                */
  PBCFG_0_XBAR0L_SPI0NSSEN_ENABLED     = 1,     /*!< ENABLED : Enable SPI0 NSS on Crossbar 0.                                  */
} PBCFG_0_XBAR0L_SPI0NSSEN_Enum;

/* ============================================  PBCFG_0 XBAR0L USART1EN [5..5]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_USART1EN                                                   */
  PBCFG_0_XBAR0L_USART1EN_DISABLED     = 0,     /*!< DISABLED : Disable USART1 RX and TX on Crossbar 0.                        */
  PBCFG_0_XBAR0L_USART1EN_ENABLED      = 1,     /*!< ENABLED : Enable USART1 RX and TX on Crossbar 0.                          */
} PBCFG_0_XBAR0L_USART1EN_Enum;

/* ===========================================  PBCFG_0 XBAR0L USART1FCEN [6..6]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_USART1FCEN                                                 */
  PBCFG_0_XBAR0L_USART1FCEN_DISABLED   = 0,     /*!< DISABLED : Disable USART1 flow control on Crossbar 0.                     */
  PBCFG_0_XBAR0L_USART1FCEN_ENABLED    = 1,     /*!< ENABLED : Enable USART1 flow control on Crossbar 0.                       */
} PBCFG_0_XBAR0L_USART1FCEN_Enum;

/* ============================================  PBCFG_0 XBAR0L USART1CEN [7..7]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_USART1CEN                                                  */
  PBCFG_0_XBAR0L_USART1CEN_DISABLED    = 0,     /*!< DISABLED : Disable USART1 clock on Crossbar 0.                            */
  PBCFG_0_XBAR0L_USART1CEN_ENABLED     = 1,     /*!< ENABLED : Enable USART1 clock on Crossbar 0.                              */
} PBCFG_0_XBAR0L_USART1CEN_Enum;

/* ============================================  PBCFG_0 XBAR0L EPCA0EN [8..10]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_EPCA0EN                                                    */
  PBCFG_0_XBAR0L_EPCA0EN_NONE          = 0,     /*!< NONE : Disable all EPCA0 channels on Crossbar 0.                          */
  PBCFG_0_XBAR0L_EPCA0EN_STD_CEX0      = 1,     /*!< STD_CEX0 : Enable EPCA0 STD_CEX0 on Crossbar 0.                           */
  PBCFG_0_XBAR0L_EPCA0EN_STD_CEX0_1    = 2,     /*!< STD_CEX0_1 : Enable EPCA0 STD_CEX0 and STD_CEX1 on Crossbar
                                                     0.                                                                        */
  PBCFG_0_XBAR0L_EPCA0EN_STD_CEX0_2    = 3,     /*!< STD_CEX0_2 : Enable EPCA0 STD_CEX0, STD_CEX1, and STD_CEX2 on
                                                     Crossbar 0.                                                               */
  PBCFG_0_XBAR0L_EPCA0EN_STD_CEX0_3    = 4,     /*!< STD_CEX0_3 : Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, and
                                                     STD_CEX3 on Crossbar 0.                                                   */
  PBCFG_0_XBAR0L_EPCA0EN_STD_CEX0_4    = 5,     /*!< STD_CEX0_4 : Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, STD_CEX3,
                                                     and STD_CEX4 on Crossbar 0.                                               */
  PBCFG_0_XBAR0L_EPCA0EN_STD_CEX0_5    = 6,     /*!< STD_CEX0_5 : Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, STD_CEX3,
                                                     STD_CEX4, and STD_CEX5 on Crossbar 0.                                     */
} PBCFG_0_XBAR0L_EPCA0EN_Enum;

/* ============================================  PBCFG_0 XBAR0L PCA0EN [14..15]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_PCA0EN                                                     */
  PBCFG_0_XBAR0L_PCA0EN_NONE           = 0,     /*!< NONE : Disable all PCA0 channels on Crossbar 0.                           */
  PBCFG_0_XBAR0L_PCA0EN_CEX0           = 1,     /*!< CEX0 : Enable PCA0 CEX0 on Crossbar 0.                                    */
  PBCFG_0_XBAR0L_PCA0EN_CEX0_1         = 3,     /*!< CEX0_1 : Enable PCA0 CEX0 and CEX1 on Crossbar 0.                         */
} PBCFG_0_XBAR0L_PCA0EN_Enum;

/* ============================================  PBCFG_0 XBAR0L PCA1EN [16..17]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_PCA1EN                                                     */
  PBCFG_0_XBAR0L_PCA1EN_NONE           = 0,     /*!< NONE : Disable all PCA1 channels on Crossbar 0.                           */
  PBCFG_0_XBAR0L_PCA1EN_CEX0           = 1,     /*!< CEX0 : Enable PCA1 CEX0 on Crossbar 0.                                    */
  PBCFG_0_XBAR0L_PCA1EN_CEX0_1         = 3,     /*!< CEX0_1 : Enable PCA1 CEX0 and CEX1 on Crossbar 0.                         */
} PBCFG_0_XBAR0L_PCA1EN_Enum;

