chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  PBCFG_0 XBAR0L EECI0EN [18..18]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_EECI0EN                                                    */
  PBCFG_0_XBAR0L_EECI0EN_DISABLED      = 0,     /*!< DISABLED : Disable EPCA0 ECI on Crossbar 0.                               */
  PBCFG_0_XBAR0L_EECI0EN_ENABLED       = 1,     /*!< ENABLED : Enable EPCA0 ECI on Crossbar 0.                                 */
} PBCFG_0_XBAR0L_EECI0EN_Enum;

/* ============================================  PBCFG_0 XBAR0L ECI0EN [19..19]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_ECI0EN                                                     */
  PBCFG_0_XBAR0L_ECI0EN_DISABLED       = 0,     /*!< DISABLED : Disable PCA0 ECI on Crossbar 0.                                */
  PBCFG_0_XBAR0L_ECI0EN_ENABLED        = 1,     /*!< ENABLED : Enable PCA0 ECI on Crossbar 0.                                  */
} PBCFG_0_XBAR0L_ECI0EN_Enum;

/* ============================================  PBCFG_0 XBAR0L ECI1EN [20..20]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_ECI1EN                                                     */
  PBCFG_0_XBAR0L_ECI1EN_DISABLED       = 0,     /*!< DISABLED : Disable PCA1 ECI on Crossbar 0.                                */
  PBCFG_0_XBAR0L_ECI1EN_ENABLED        = 1,     /*!< ENABLED : Enable PCA1 ECI on Crossbar 0.                                  */
} PBCFG_0_XBAR0L_ECI1EN_Enum;

/* ===========================================  PBCFG_0 XBAR0L I2S0TXEN [21..21]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_I2S0TXEN                                                   */
  PBCFG_0_XBAR0L_I2S0TXEN_DISABLED     = 0,     /*!< DISABLED : Disable I2S0 TX on Crossbar 0.                                 */
  PBCFG_0_XBAR0L_I2S0TXEN_ENABLED      = 1,     /*!< ENABLED : Enable I2S0 TX on Crossbar 0.                                   */
} PBCFG_0_XBAR0L_I2S0TXEN_Enum;

/* ============================================  PBCFG_0 XBAR0L I2C0EN [22..22]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_I2C0EN                                                     */
  PBCFG_0_XBAR0L_I2C0EN_DISABLED       = 0,     /*!< DISABLED : Disable I2C0 SDA and SCL on Crossbar 0.                        */
  PBCFG_0_XBAR0L_I2C0EN_ENABLED        = 1,     /*!< ENABLED : Enable I2C0 SDA and SCL on Crossbar 0.                          */
} PBCFG_0_XBAR0L_I2C0EN_Enum;

/* ============================================  PBCFG_0 XBAR0L CMP0SEN [23..23]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_CMP0SEN                                                    */
  PBCFG_0_XBAR0L_CMP0SEN_DISABLED      = 0,     /*!< DISABLED : Disable Comparator 0 Synchronous Output (CMP0S) on
                                                     Crossbar 0.                                                               */
  PBCFG_0_XBAR0L_CMP0SEN_ENABLED       = 1,     /*!< ENABLED : Enable Comparator 0 Synchronous Output (CMP0S) on
                                                     Crossbar 0.                                                               */
} PBCFG_0_XBAR0L_CMP0SEN_Enum;

/* ============================================  PBCFG_0 XBAR0L CMP0AEN [24..24]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_CMP0AEN                                                    */
  PBCFG_0_XBAR0L_CMP0AEN_DISABLED      = 0,     /*!< DISABLED : Disable Comparator 0 Asynchronous Output (CMP0A)
                                                     on Crossbar 0.                                                            */
  PBCFG_0_XBAR0L_CMP0AEN_ENABLED       = 1,     /*!< ENABLED : Enable Comparator 0 Asynchronous Output (CMP0A) on
                                                     Crossbar 0.                                                               */
} PBCFG_0_XBAR0L_CMP0AEN_Enum;

/* ============================================  PBCFG_0 XBAR0L CMP1SEN [25..25]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_CMP1SEN                                                    */
  PBCFG_0_XBAR0L_CMP1SEN_DISABLED      = 0,     /*!< DISABLED : Disable Comparator 1 Synchronous Output (CMP1S) on
                                                     Crossbar 0.                                                               */
  PBCFG_0_XBAR0L_CMP1SEN_ENABLED       = 1,     /*!< ENABLED : Enable Comparator 1 Synchronous Output (CMP1S) on
                                                     Crossbar 0.                                                               */
} PBCFG_0_XBAR0L_CMP1SEN_Enum;

/* ============================================  PBCFG_0 XBAR0L CMP1AEN [26..26]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_CMP1AEN                                                    */
  PBCFG_0_XBAR0L_CMP1AEN_DISABLED      = 0,     /*!< DISABLED : Disable Comparator 1 Asynchronous Output (CMP1A)
                                                     on Crossbar 0.                                                            */
  PBCFG_0_XBAR0L_CMP1AEN_ENABLED       = 1,     /*!< ENABLED : Enable Comparator 1 Asynchronous Output (CMP1A) on
                                                     Crossbar 0.                                                               */
} PBCFG_0_XBAR0L_CMP1AEN_Enum;

/* ===========================================  PBCFG_0 XBAR0L TMR0CTEN [27..27]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_TMR0CTEN                                                   */
  PBCFG_0_XBAR0L_TMR0CTEN_DISABLED     = 0,     /*!< DISABLED : Disable TIMER0 CT on Crossbar 0.                               */
  PBCFG_0_XBAR0L_TMR0CTEN_ENABLED      = 1,     /*!< ENABLED : Enable TIMER0 CT on Crossbar 0.                                 */
} PBCFG_0_XBAR0L_TMR0CTEN_Enum;

