chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  PBCFG_0 XBAR0L TMR0EXEN [28..28]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_TMR0EXEN                                                   */
  PBCFG_0_XBAR0L_TMR0EXEN_DISABLED     = 0,     /*!< DISABLED : Disable TIMER0 EX on Crossbar 0.                               */
  PBCFG_0_XBAR0L_TMR0EXEN_ENABLED      = 1,     /*!< ENABLED : Enable TIMER0 EX on Crossbar 0.                                 */
} PBCFG_0_XBAR0L_TMR0EXEN_Enum;

/* ===========================================  PBCFG_0 XBAR0L TMR1CTEN [29..29]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_TMR1CTEN                                                   */
  PBCFG_0_XBAR0L_TMR1CTEN_DISABLED     = 0,     /*!< DISABLED : Disable TIMER1 CT on Crossbar 0.                               */
  PBCFG_0_XBAR0L_TMR1CTEN_ENABLED      = 1,     /*!< ENABLED : Enable TIMER1 CT on Crossbar 0.                                 */
} PBCFG_0_XBAR0L_TMR1CTEN_Enum;

/* ===========================================  PBCFG_0 XBAR0L TMR1EXEN [30..30]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0L_TMR1EXEN                                                   */
  PBCFG_0_XBAR0L_TMR1EXEN_DISABLED     = 0,     /*!< DISABLED : Disable TIMER1 EX on Crossbar 0.                               */
  PBCFG_0_XBAR0L_TMR1EXEN_ENABLED      = 1,     /*!< ENABLED : Enable TIMER1 EX on Crossbar 0.                                 */
} PBCFG_0_XBAR0L_TMR1EXEN_Enum;

/* ======================================================  XBAR0L_SET  ======================================================= */
/* ======================================================  XBAR0L_CLR  ======================================================= */
/* ========================================================  XBAR0H  ========================================================= */
/* =============================================  PBCFG_0 XBAR0H UART0EN [0..0]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_UART0EN                                                    */
  PBCFG_0_XBAR0H_UART0EN_DISABLED      = 0,     /*!< DISABLED : Disable UART0 RX and TX on Crossbar 0.                         */
  PBCFG_0_XBAR0H_UART0EN_ENABLED       = 1,     /*!< ENABLED : Enable UART0 RX and TX on Crossbar 0.                           */
} PBCFG_0_XBAR0H_UART0EN_Enum;

/* ============================================  PBCFG_0 XBAR0H UART0FCEN [1..1]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_UART0FCEN                                                  */
  PBCFG_0_XBAR0H_UART0FCEN_DISABLED    = 0,     /*!< DISABLED : Disable UART0 flow control on Crossbar 0.                      */
  PBCFG_0_XBAR0H_UART0FCEN_ENABLED     = 1,     /*!< ENABLED : Enable UART0 flow control on Crossbar 0.                        */
} PBCFG_0_XBAR0H_UART0FCEN_Enum;

/* =============================================  PBCFG_0 XBAR0H UART1EN [2..2]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_UART1EN                                                    */
  PBCFG_0_XBAR0H_UART1EN_DISABLED      = 0,     /*!< DISABLED : Disable UART1 RX and TX on Crossbar 0.                         */
  PBCFG_0_XBAR0H_UART1EN_ENABLED       = 1,     /*!< ENABLED : Enable UART1 RX and TX on Crossbar 0.                           */
} PBCFG_0_XBAR0H_UART1EN_Enum;

/* =============================================  PBCFG_0 XBAR0H SPI1EN [3..3]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_SPI1EN                                                     */
  PBCFG_0_XBAR0H_SPI1EN_DISABLED       = 0,     /*!< DISABLED : Disable SPI1 SCK, MISO, and MOSI on Crossbar 0.                */
  PBCFG_0_XBAR0H_SPI1EN_ENABLED        = 1,     /*!< ENABLED : Enable SPI1 SCK, MISO, and MOSI on Crossbar 0.                  */
} PBCFG_0_XBAR0H_SPI1EN_Enum;

/* ============================================  PBCFG_0 XBAR0H SPI1NSSEN [4..4]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_SPI1NSSEN                                                  */
  PBCFG_0_XBAR0H_SPI1NSSEN_DISABLED    = 0,     /*!< DISABLED : Disable SPI1 NSS on Crossbar 0.                                */
  PBCFG_0_XBAR0H_SPI1NSSEN_ENABLED     = 1,     /*!< ENABLED : Enable SPI1 NSS on Crossbar 0.                                  */
} PBCFG_0_XBAR0H_SPI1NSSEN_Enum;

/* =============================================  PBCFG_0 XBAR0H SPI2EN [5..5]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_SPI2EN                                                     */
  PBCFG_0_XBAR0H_SPI2EN_DISABLED       = 0,     /*!< DISABLED : Disable SPI2 SCK, MISO, and MOSI on Crossbar 0.                */
  PBCFG_0_XBAR0H_SPI2EN_ENABLED        = 1,     /*!< ENABLED : Enable SPI2 SCK, MISO, and MOSI on Crossbar 0.                  */
} PBCFG_0_XBAR0H_SPI2EN_Enum;

/* ============================================  PBCFG_0 XBAR0H SPI2NSSEN [6..6]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_SPI2NSSEN                                                  */
  PBCFG_0_XBAR0H_SPI2NSSEN_DISABLED    = 0,     /*!< DISABLED : Disable SPI2 NSS on Crossbar 0.                                */
  PBCFG_0_XBAR0H_SPI2NSSEN_ENABLED     = 1,     /*!< ENABLED : Enable SPI2 NSS on Crossbar 0.                                  */
} PBCFG_0_XBAR0H_SPI2NSSEN_Enum;

/* ==============================================  PBCFG_0 XBAR0H AHBEN [7..7]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_AHBEN                                                      */
  PBCFG_0_XBAR0H_AHBEN_DISABLED        = 0,     /*!< DISABLED : Disable the AHB Clock / 16 output on Crossbar 0.               */
  PBCFG_0_XBAR0H_AHBEN_ENABLED         = 1,     /*!< ENABLED : Enable the AHB Clock / 16 output on Crossbar 0.                 */
} PBCFG_0_XBAR0H_AHBEN_Enum;

/* ============================================  PBCFG_0 XBAR0H XBAR0EN [31..31]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR0H_XBAR0EN                                                    */
  PBCFG_0_XBAR0H_XBAR0EN_DISABLED      = 0,     /*!< DISABLED : Disable Crossbar 0.                                            */
  PBCFG_0_XBAR0H_XBAR0EN_ENABLED       = 1,     /*!< ENABLED : Enable Crossbar 0.                                              */
} PBCFG_0_XBAR0H_XBAR0EN_Enum;

/* ======================================================  XBAR0H_SET  ======================================================= */
/* ======================================================  XBAR0H_CLR  ======================================================= */
/* =========================================================  XBAR1  ========================================================= */
/* ==============================================  PBCFG_0 XBAR1 SSG0EN [0..1]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR1_SSG0EN                                                      */
  PBCFG_0_XBAR1_SSG0EN_NONE            = 0,     /*!< NONE : Disable all SSG0 channels on Crossbar 1.                           */
  PBCFG_0_XBAR1_SSG0EN_EX0             = 1,     /*!< EX0 : Enable SSG0 EX0 on Crossbar 1.                                      */
  PBCFG_0_XBAR1_SSG0EN_EX0_1           = 2,     /*!< EX0_1 : Enable SSG0 EX0 and EX1 on Crossbar 1.                            */
  PBCFG_0_XBAR1_SSG0EN_EX0_3           = 3,     /*!< EX0_3 : Enable SSG0 EX0, EX1, EX2, and EX3 on Crossbar 1.                 */
} PBCFG_0_XBAR1_SSG0EN_Enum;

/* =============================================  PBCFG_0 XBAR1 CMP0SEN [2..2]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR1_CMP0SEN                                                     */
  PBCFG_0_XBAR1_CMP0SEN_DISABLED       = 0,     /*!< DISABLED : Disable Comparator 0 Synchronous Output (CMP0S) on
                                                     Crossbar 1.                                                               */
  PBCFG_0_XBAR1_CMP0SEN_ENABLED        = 1,     /*!< ENABLED : Enable Comparator 0 Synchronous Output (CMP0S) on
                                                     Crossbar 1.                                                               */
} PBCFG_0_XBAR1_CMP0SEN_Enum;

/* =============================================  PBCFG_0 XBAR1 CMP1SEN [3..3]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR1_CMP1SEN                                                     */
  PBCFG_0_XBAR1_CMP1SEN_DISABLED       = 0,     /*!< DISABLED : Disable Comparator 1 Synchronous Output (CMP1S) on
                                                     Crossbar 1.                                                               */
  PBCFG_0_XBAR1_CMP1SEN_ENABLED        = 1,     /*!< ENABLED : Enable Comparator 1 Synchronous Output (CMP1S) on
                                                     Crossbar 1.                                                               */
} PBCFG_0_XBAR1_CMP1SEN_Enum;

/* ==============================================  PBCFG_0 XBAR1 SPI1EN [4..4]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR1_SPI1EN                                                      */
  PBCFG_0_XBAR1_SPI1EN_DISABLED        = 0,     /*!< DISABLED : Disable SPI1 SCK, MISO, and MOSI on Crossbar 1.                */
  PBCFG_0_XBAR1_SPI1EN_ENABLED         = 1,     /*!< ENABLED : Enable SPI1 SCK, MISO, and MOSI on Crossbar 1.                  */
} PBCFG_0_XBAR1_SPI1EN_Enum;

/* ============================================  PBCFG_0 XBAR1 SPI1NSSEN [5..5]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_SPI1NSSEN                                                   */
  PBCFG_0_XBAR1_SPI1NSSEN_DISABLED     = 0,     /*!< DISABLED : Disable SPI1 NSS on Crossbar 1.                                */
  PBCFG_0_XBAR1_SPI1NSSEN_ENABLED      = 1,     /*!< ENABLED : Enable SPI1 NSS on Crossbar 1.                                  */
} PBCFG_0_XBAR1_SPI1NSSEN_Enum;

/* ==============================================  PBCFG_0 XBAR1 RTC0EN [6..6]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR1_RTC0EN                                                      */
  PBCFG_0_XBAR1_RTC0EN_DISABLED        = 0,     /*!< DISABLED : Disable RTC0 Output on Crossbar 1.                             */
  PBCFG_0_XBAR1_RTC0EN_ENABLED         = 1,     /*!< ENABLED : Enable RTC0 Output on Crossbar 1.                               */
} PBCFG_0_XBAR1_RTC0EN_Enum;

