chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  PBCFG_0 XBAR1 SPI2EN [7..7]  ============================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR1_SPI2EN                                                      */
  PBCFG_0_XBAR1_SPI2EN_DISABLED        = 0,     /*!< DISABLED : Disable SPI2 SCK, MISO, and MOSI on Crossbar 1.                */
  PBCFG_0_XBAR1_SPI2EN_ENABLED         = 1,     /*!< ENABLED : Enable SPI2 SCK, MISO, and MOSI on Crossbar 1.                  */
} PBCFG_0_XBAR1_SPI2EN_Enum;

/* ============================================  PBCFG_0 XBAR1 SPI2NSSEN [8..8]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_SPI2NSSEN                                                   */
  PBCFG_0_XBAR1_SPI2NSSEN_DISABLED     = 0,     /*!< DISABLED : Disable SPI2 NSS on Crossbar 1.                                */
  PBCFG_0_XBAR1_SPI2NSSEN_ENABLED      = 1,     /*!< ENABLED : Enable SPI2 NSS on Crossbar 1.                                  */
} PBCFG_0_XBAR1_SPI2NSSEN_Enum;

/* =============================================  PBCFG_0 XBAR1 USART1EN [9..9]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_USART1EN                                                    */
  PBCFG_0_XBAR1_USART1EN_DISABLED      = 0,     /*!< DISABLED : Disable USART1 RX and TX on Crossbar 1.                        */
  PBCFG_0_XBAR1_USART1EN_ENABLED       = 1,     /*!< ENABLED : Enable USART1 RX and TX on Crossbar 1.                          */
} PBCFG_0_XBAR1_USART1EN_Enum;

/* ===========================================  PBCFG_0 XBAR1 USART1FCEN [10..10]  =========================================== */
typedef enum {                                  /*!< PBCFG_0_XBAR1_USART1FCEN                                                  */
  PBCFG_0_XBAR1_USART1FCEN_DISABLED    = 0,     /*!< DISABLED : Disable USART1 flow control on Crossbar 1.                     */
  PBCFG_0_XBAR1_USART1FCEN_ENABLED     = 1,     /*!< ENABLED : Enable USART1 flow control on Crossbar 1.                       */
} PBCFG_0_XBAR1_USART1FCEN_Enum;

/* ===========================================  PBCFG_0 XBAR1 USART1CEN [11..11]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR1_USART1CEN                                                   */
  PBCFG_0_XBAR1_USART1CEN_DISABLED     = 0,     /*!< DISABLED : Disable USART1 clock on Crossbar 1.                            */
  PBCFG_0_XBAR1_USART1CEN_ENABLED      = 1,     /*!< ENABLED : Enable USART1 clock on Crossbar 1.                              */
} PBCFG_0_XBAR1_USART1CEN_Enum;

/* ============================================  PBCFG_0 XBAR1 UART0EN [12..12]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_UART0EN                                                     */
  PBCFG_0_XBAR1_UART0EN_DISABLED       = 0,     /*!< DISABLED : Disable UART0 RX and TX on Crossbar 1.                         */
  PBCFG_0_XBAR1_UART0EN_ENABLED        = 1,     /*!< ENABLED : Enable UART0 RX and TX on Crossbar 1.                           */
} PBCFG_0_XBAR1_UART0EN_Enum;

/* ===========================================  PBCFG_0 XBAR1 UART0FCEN [13..13]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR1_UART0FCEN                                                   */
  PBCFG_0_XBAR1_UART0FCEN_DISABLED     = 0,     /*!< DISABLED : Disable UART0 flow control on Crossbar 1.                      */
  PBCFG_0_XBAR1_UART0FCEN_ENABLED      = 1,     /*!< ENABLED : Enable UART0 flow control on Crossbar1.                         */
} PBCFG_0_XBAR1_UART0FCEN_Enum;

/* ============================================  PBCFG_0 XBAR1 I2S0TXEN [14..14]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR1_I2S0TXEN                                                    */
  PBCFG_0_XBAR1_I2S0TXEN_DISABLED      = 0,     /*!< DISABLED : Disable I2S0 TX on Crossbar 1.                                 */
  PBCFG_0_XBAR1_I2S0TXEN_ENABLED       = 1,     /*!< ENABLED : Enable I2S0 TX on Crossbar 1.                                   */
} PBCFG_0_XBAR1_I2S0TXEN_Enum;

/* =============================================  PBCFG_0 XBAR1 I2C0EN [15..15]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_I2C0EN                                                      */
  PBCFG_0_XBAR1_I2C0EN_DISABLED        = 0,     /*!< DISABLED : Disable I2C0 SDA and SCL on Crossbar 1.                        */
  PBCFG_0_XBAR1_I2C0EN_ENABLED         = 1,     /*!< ENABLED : Enable I2C0 SDA and SCL on Crossbar 1.                          */
} PBCFG_0_XBAR1_I2C0EN_Enum;

/* ============================================  PBCFG_0 XBAR1 UART1EN [16..16]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_UART1EN                                                     */
  PBCFG_0_XBAR1_UART1EN_DISABLED       = 0,     /*!< DISABLED : Disable UART1 RX and TX on Crossbar 1.                         */
  PBCFG_0_XBAR1_UART1EN_ENABLED        = 1,     /*!< ENABLED : Enable UART1 RX and TX on Crossbar 1.                           */
} PBCFG_0_XBAR1_UART1EN_Enum;

/* ============================================  PBCFG_0 XBAR1 I2S0RXEN [17..17]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR1_I2S0RXEN                                                    */
  PBCFG_0_XBAR1_I2S0RXEN_DISABLED      = 0,     /*!< DISABLED : Disable I2S0 RX on Crossbar 1.                                 */
  PBCFG_0_XBAR1_I2S0RXEN_ENABLED       = 1,     /*!< ENABLED : Enable I2S0 RX on Crossbar 1.                                   */
} PBCFG_0_XBAR1_I2S0RXEN_Enum;

/* ============================================  PBCFG_0 XBAR1 LPT0OEN [19..19]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_LPT0OEN                                                     */
  PBCFG_0_XBAR1_LPT0OEN_DISABLED       = 0,     /*!< DISABLED : Disable LPTIMER0 Output on Crossbar 1.                         */
  PBCFG_0_XBAR1_LPT0OEN_ENABLED        = 1,     /*!< ENABLED : Enable LPTIMER0 Output on Crossbar 1.                           */
} PBCFG_0_XBAR1_LPT0OEN_Enum;

/* =============================================  PBCFG_0 XBAR1 I2C1EN [20..20]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_I2C1EN                                                      */
  PBCFG_0_XBAR1_I2C1EN_DISABLED        = 0,     /*!< DISABLED : Disable I2C1 SDA and SCL on Crossbar 1.                        */
  PBCFG_0_XBAR1_I2C1EN_ENABLED         = 1,     /*!< ENABLED : Enable I2C1 SDA and SCL on Crossbar 1.                          */
} PBCFG_0_XBAR1_I2C1EN_Enum;

/* ============================================  PBCFG_0 XBAR1 KILLHDEN [21..21]  ============================================ */
typedef enum {                                  /*!< PBCFG_0_XBAR1_KILLHDEN                                                    */
  PBCFG_0_XBAR1_KILLHDEN_DISABLED      = 0,     /*!< DISABLED : Disable the PB High Drive Kill Pin on Crossbar 1.              */
  PBCFG_0_XBAR1_KILLHDEN_ENABLED       = 1,     /*!< ENABLED : Enable the PB High Drive Kill Pin on Crossbar 1.                */
} PBCFG_0_XBAR1_KILLHDEN_Enum;

/* ============================================  PBCFG_0 XBAR1 XBAR1EN [31..31]  ============================================= */
typedef enum {                                  /*!< PBCFG_0_XBAR1_XBAR1EN                                                     */
  PBCFG_0_XBAR1_XBAR1EN_DISABLED       = 0,     /*!< DISABLED : Disable Crossbar 1.                                            */
  PBCFG_0_XBAR1_XBAR1EN_ENABLED        = 1,     /*!< ENABLED : Enable Crossbar 1.                                              */
} PBCFG_0_XBAR1_XBAR1EN_Enum;

