chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  XBAR1_SET  ======================================================= */
/* =======================================================  XBAR1_CLR  ======================================================= */
/* =========================================================  PBKEY  ========================================================= */
/* ===============================================  PBCFG_0 PBKEY KEY [0..7]  ================================================ */
typedef enum {                                  /*!< PBCFG_0_PBKEY_KEY                                                         */
  PBCFG_0_PBKEY_KEY_LOCKED             = 0,     /*!< LOCKED : Port Bank 2, 3, and 4 registers are locked and no valid
                                                     values have been written to PBKEY.                                        */
  PBCFG_0_PBKEY_KEY_INTERMEDIATE       = 1,     /*!< INTERMEDIATE : Port Bank 2, 3, and 4 registers are locked and
                                                     the first valid value (0xA5) has been written to PBKEY.                   */
  PBCFG_0_PBKEY_KEY_UNLOCKED           = 2,     /*!< UNLOCKED : Port Bank 2, 3, and 4 registers are unlocked. Any
                                                     subsequent writes to the Port Bank 2, 3, or 4 registers
                                                     or PBKEY will lock the interface.                                         */
} PBCFG_0_PBKEY_KEY_Enum;



/* =========================================================================================================================== */
/* ================                                          PBHD_4                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  PB  =========================================================== */
/* =========================================================  PBPIN  ========================================================= */
/* ========================================================  PBMDSEL  ======================================================== */
/* =========================================================  PBDEN  ========================================================= */
/* =========================================================  PBDRV  ========================================================= */
/* =============================================  PBHD_4 PBDRV PBPUEN [16..16]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBDRV_PBPUEN                                                       */
  PBHD_4_PBDRV_PBPUEN_DISABLED         = 0,     /*!< DISABLED : Disable weak pull-ups for this port.                           */
  PBHD_4_PBDRV_PBPUEN_ENABLED          = 1,     /*!< ENABLED : Enable weak pull-ups for this port.                             */
} PBHD_4_PBDRV_PBPUEN_Enum;

/* =============================================  PBHD_4 PBDRV PBLVMD [17..17]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBDRV_PBLVMD                                                       */
  PBHD_4_PBDRV_PBLVMD_NORMAL           = 0,     /*!< NORMAL : Port configured for normal mode.                                 */
  PBHD_4_PBDRV_PBLVMD_LOW              = 1,     /*!< LOW : Port configured for low power mode.                                 */
} PBHD_4_PBDRV_PBLVMD_Enum;

/* =============================================  PBHD_4 PBDRV PBSLEW [18..19]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBDRV_PBSLEW                                                       */
  PBHD_4_PBDRV_PBSLEW_FASTEST          = 0,     /*!< FASTEST : Select the fastest transition speed for this port
                                                     bank.                                                                     */
  PBHD_4_PBDRV_PBSLEW_FASTER           = 1,     /*!< FASTER : Select the faster transition speed for this port bank.           */
  PBHD_4_PBDRV_PBSLEW_SLOWER           = 2,     /*!< SLOWER : Select the slower transition speed for this port bank.           */
  PBHD_4_PBDRV_PBSLEW_SLOWEST          = 3,     /*!< SLOWEST : Select the slowest transition speed for this port
                                                     bank.                                                                     */
} PBHD_4_PBDRV_PBSLEW_Enum;

/* ============================================  PBHD_4 PBDRV PBBIASEN [21..21]  ============================================= */
typedef enum {                                  /*!< PBHD_4_PBDRV_PBBIASEN                                                     */
  PBHD_4_PBDRV_PBBIASEN_DISABLED       = 0,     /*!< DISABLED : Disable the biasing to the port pins.                          */
  PBHD_4_PBDRV_PBBIASEN_ENABLED        = 1,     /*!< ENABLED : Enable the biasing to the port pins.                            */
} PBHD_4_PBDRV_PBBIASEN_Enum;

/* =============================================  PBHD_4 PBDRV PBDRVEN [22..22]  ============================================= */
typedef enum {                                  /*!< PBHD_4_PBDRV_PBDRVEN                                                      */
  PBHD_4_PBDRV_PBDRVEN_DISABLED        = 0,     /*!< DISABLED : Disable the port drivers.                                      */
  PBHD_4_PBDRV_PBDRVEN_ENABLED         = 1,     /*!< ENABLED : Enable the port drivers.                                        */
} PBHD_4_PBDRV_PBDRVEN_Enum;

/* ============================================  PBHD_4 PBDRV PBVTRKEN [23..23]  ============================================= */
typedef enum {                                  /*!< PBHD_4_PBDRV_PBVTRKEN                                                     */
  PBHD_4_PBDRV_PBVTRKEN_DISABLED       = 0,     /*!< DISABLED : Disable VIOHD tracking.                                        */
  PBHD_4_PBDRV_PBVTRKEN_ENABLED        = 1,     /*!< ENABLED : Enable VIOHD tracking.                                          */
} PBHD_4_PBDRV_PBVTRKEN_Enum;

