chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  PBILIMIT  ======================================================== */
/* ===========================================  PBHD_4 PBILIMIT NILIMIT [16..19]  ============================================ */
typedef enum {                                  /*!< PBHD_4_PBILIMIT_NILIMIT                                                   */
  PBHD_4_PBILIMIT_NILIMIT_MODE0        = 0,     /*!< MODE0 : Set sink limit to mode 0.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE1        = 1,     /*!< MODE1 : Set sink limit to mode 1.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE2        = 2,     /*!< MODE2 : Set sink limit to mode 2.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE3        = 3,     /*!< MODE3 : Set sink limit to mode 3.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE4        = 4,     /*!< MODE4 : Set sink limit to mode 4.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE5        = 5,     /*!< MODE5 : Set sink limit to mode 5.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE6        = 6,     /*!< MODE6 : Set sink limit to mode 6.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE7        = 7,     /*!< MODE7 : Set sink limit to mode 7.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE8        = 8,     /*!< MODE8 : Set sink limit to mode 8.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE9        = 9,     /*!< MODE9 : Set sink limit to mode 9.                                         */
  PBHD_4_PBILIMIT_NILIMIT_MODE10       = 10,    /*!< MODE10 : Set sink limit to mode 10.                                       */
  PBHD_4_PBILIMIT_NILIMIT_MODE11       = 11,    /*!< MODE11 : Set sink limit to mode 11.                                       */
  PBHD_4_PBILIMIT_NILIMIT_MODE12       = 12,    /*!< MODE12 : Set sink limit to mode 12.                                       */
  PBHD_4_PBILIMIT_NILIMIT_MODE13       = 13,    /*!< MODE13 : Set sink limit to mode 13.                                       */
  PBHD_4_PBILIMIT_NILIMIT_MODE14       = 14,    /*!< MODE14 : Set sink limit to mode 14.                                       */
  PBHD_4_PBILIMIT_NILIMIT_MODE15       = 15,    /*!< MODE15 : Set sink limit to mode 15.                                       */
} PBHD_4_PBILIMIT_NILIMIT_Enum;

/* ===========================================  PBHD_4 PBILIMIT PILIMIT [20..23]  ============================================ */
typedef enum {                                  /*!< PBHD_4_PBILIMIT_PILIMIT                                                   */
  PBHD_4_PBILIMIT_PILIMIT_MODE0        = 0,     /*!< MODE0 : Set source limit to mode 0.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE1        = 1,     /*!< MODE1 : Set source limit to mode 1.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE2        = 2,     /*!< MODE2 : Set source limit to mode 2.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE3        = 3,     /*!< MODE3 : Set source limit to mode 3.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE4        = 4,     /*!< MODE4 : Set source limit to mode 4.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE5        = 5,     /*!< MODE5 : Set source limit to mode 5.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE6        = 6,     /*!< MODE6 : Set source limit to mode 6.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE7        = 7,     /*!< MODE7 : Set source limit to mode 7.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE8        = 8,     /*!< MODE8 : Set source limit to mode 8.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE9        = 9,     /*!< MODE9 : Set source limit to mode 9.                                       */
  PBHD_4_PBILIMIT_PILIMIT_MODE10       = 10,    /*!< MODE10 : Set source limit to mode 10.                                     */
  PBHD_4_PBILIMIT_PILIMIT_MODE11       = 11,    /*!< MODE11 : Set source limit to mode 11.                                     */
  PBHD_4_PBILIMIT_PILIMIT_MODE12       = 12,    /*!< MODE12 : Set source limit to mode 12.                                     */
  PBHD_4_PBILIMIT_PILIMIT_MODE13       = 13,    /*!< MODE13 : Set source limit to mode 13.                                     */
  PBHD_4_PBILIMIT_PILIMIT_MODE14       = 14,    /*!< MODE14 : Set source limit to mode 14.                                     */
  PBHD_4_PBILIMIT_PILIMIT_MODE15       = 15,    /*!< MODE15 : Set source limit to mode 15.                                     */
} PBHD_4_PBILIMIT_PILIMIT_Enum;

/* ========================================================  PBFSEL  ========================================================= */
/* ==============================================  PBHD_4 PBFSEL PB0SEL [0..1]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBFSEL_PB0SEL                                                      */
  PBHD_4_PBFSEL_PB0SEL_GPIO            = 0,     /*!< GPIO : Pin configured for GPIO.                                           */
  PBHD_4_PBFSEL_PB0SEL_PMLS            = 1,     /*!< PMLS : Pin configured for Port Mapped Level Shift.                        */
  PBHD_4_PBFSEL_PB0SEL_EPCA0           = 2,     /*!< EPCA0 : Pin configured for EPCA0 output.                                  */
} PBHD_4_PBFSEL_PB0SEL_Enum;

/* ==============================================  PBHD_4 PBFSEL PB1SEL [2..3]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBFSEL_PB1SEL                                                      */
  PBHD_4_PBFSEL_PB1SEL_GPIO            = 0,     /*!< GPIO : Pin configured for GPIO.                                           */
  PBHD_4_PBFSEL_PB1SEL_PMLS            = 1,     /*!< PMLS : Pin configured for Port Mapped Level Shift.                        */
  PBHD_4_PBFSEL_PB1SEL_EPCA0           = 2,     /*!< EPCA0 : Pin configured for EPCA0 output.                                  */
} PBHD_4_PBFSEL_PB1SEL_Enum;

/* ==============================================  PBHD_4 PBFSEL PB2SEL [4..5]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBFSEL_PB2SEL                                                      */
  PBHD_4_PBFSEL_PB2SEL_GPIO            = 0,     /*!< GPIO : Pin configured for GPIO.                                           */
  PBHD_4_PBFSEL_PB2SEL_PMLS            = 1,     /*!< PMLS : Pin configured for Port Mapped Level Shift.                        */
  PBHD_4_PBFSEL_PB2SEL_EPCA0           = 2,     /*!< EPCA0 : Pin configured for EPCA0 output.                                  */
  PBHD_4_PBFSEL_PB2SEL_UART1           = 3,     /*!< UART1 : Pin configured for UART1 TX.                                      */
} PBHD_4_PBFSEL_PB2SEL_Enum;

/* ==============================================  PBHD_4 PBFSEL PB3SEL [6..7]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBFSEL_PB3SEL                                                      */
  PBHD_4_PBFSEL_PB3SEL_GPIO            = 0,     /*!< GPIO : Pin configured for GPIO.                                           */
  PBHD_4_PBFSEL_PB3SEL_PMLS            = 1,     /*!< PMLS : Pin configured for Port Mapped Level Shift.                        */
  PBHD_4_PBFSEL_PB3SEL_EPCA0           = 2,     /*!< EPCA0 : Pin configured for EPCA0 output.                                  */
  PBHD_4_PBFSEL_PB3SEL_UART1           = 3,     /*!< UART1 : Pin configured for UART1 RX.                                      */
} PBHD_4_PBFSEL_PB3SEL_Enum;

