chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  PBHD_4 PBFSEL PB4SEL [8..9]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBFSEL_PB4SEL                                                      */
  PBHD_4_PBFSEL_PB4SEL_GPIO            = 0,     /*!< GPIO : Pin configured for GPIO.                                           */
  PBHD_4_PBFSEL_PB4SEL_PMLS            = 1,     /*!< PMLS : Pin configured for Port Mapped Level Shift.                        */
  PBHD_4_PBFSEL_PB4SEL_EPCA0           = 2,     /*!< EPCA0 : Pin configured for EPCA0 output.                                  */
  PBHD_4_PBFSEL_PB4SEL_UART1           = 3,     /*!< UART1 : Pin configured for UART1 RTS.                                     */
} PBHD_4_PBFSEL_PB4SEL_Enum;

/* =============================================  PBHD_4 PBFSEL PB5SEL [10..12]  ============================================= */
typedef enum {                                  /*!< PBHD_4_PBFSEL_PB5SEL                                                      */
  PBHD_4_PBFSEL_PB5SEL_GPIO            = 0,     /*!< GPIO : Pin configured for GPIO.                                           */
  PBHD_4_PBFSEL_PB5SEL_PMLS            = 1,     /*!< PMLS : Pin configured for Port Mapped Level Shift.                        */
  PBHD_4_PBFSEL_PB5SEL_EPCA0           = 2,     /*!< EPCA0 : Pin configured for EPCA0 output.                                  */
  PBHD_4_PBFSEL_PB5SEL_UART1           = 3,     /*!< UART1 : Pin configured for UART1 CTS.                                     */
  PBHD_4_PBFSEL_PB5SEL_LPTIMER0        = 4,     /*!< LPTIMER0 : Pin configured for LPTIMER0 toggle output.                     */
} PBHD_4_PBFSEL_PB5SEL_Enum;

/* =========================================================  PBSS  ========================================================== */
/* ==============================================  PBHD_4 PBSS PB0SSSEL [0..1]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBSS_PB0SSSEL                                                      */
  PBHD_4_PBSS_PB0SSSEL_HIZ             = 0,     /*!< HIZ : Place PBn.0 in a High Impedance state.                              */
  PBHD_4_PBSS_PB0SSSEL_HIGH            = 1,     /*!< HIGH : Drive PBn.0 High.                                                  */
  PBHD_4_PBSS_PB0SSSEL_LOW             = 2,     /*!< LOW : Drive PBn.0 Low.                                                    */
  PBHD_4_PBSS_PB0SSSEL_DISABLED        = 3,     /*!< DISABLED : Ignore the safe state signal (weak pull-ups disabled).         */
} PBHD_4_PBSS_PB0SSSEL_Enum;

/* ==============================================  PBHD_4 PBSS PB1SSSEL [2..3]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBSS_PB1SSSEL                                                      */
  PBHD_4_PBSS_PB1SSSEL_HIZ             = 0,     /*!< HIZ : Place PBn.1 in a High Impedance state.                              */
  PBHD_4_PBSS_PB1SSSEL_HIGH            = 1,     /*!< HIGH : Drive PBn.1 High.                                                  */
  PBHD_4_PBSS_PB1SSSEL_LOW             = 2,     /*!< LOW : Drive PBn.1 Low.                                                    */
  PBHD_4_PBSS_PB1SSSEL_DISABLED        = 3,     /*!< DISABLED : Ignore the safe state signal (weak pull-ups disabled).         */
} PBHD_4_PBSS_PB1SSSEL_Enum;

/* ==============================================  PBHD_4 PBSS PB2SSSEL [4..5]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBSS_PB2SSSEL                                                      */
  PBHD_4_PBSS_PB2SSSEL_HIZ             = 0,     /*!< HIZ : Place PBn.2 in a High Impedance state.                              */
  PBHD_4_PBSS_PB2SSSEL_HIGH            = 1,     /*!< HIGH : Drive PBn.2 High.                                                  */
  PBHD_4_PBSS_PB2SSSEL_LOW             = 2,     /*!< LOW : Drive PBn.2 Low.                                                    */
  PBHD_4_PBSS_PB2SSSEL_DISABLED        = 3,     /*!< DISABLED : Ignore the safe state signal (weak pull-ups disabled).         */
} PBHD_4_PBSS_PB2SSSEL_Enum;

/* ==============================================  PBHD_4 PBSS PB3SSSEL [6..7]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBSS_PB3SSSEL                                                      */
  PBHD_4_PBSS_PB3SSSEL_HIZ             = 0,     /*!< HIZ : Place PBn.3 in a High Impedance state.                              */
  PBHD_4_PBSS_PB3SSSEL_HIGH            = 1,     /*!< HIGH : Drive PBn.3 High.                                                  */
  PBHD_4_PBSS_PB3SSSEL_LOW             = 2,     /*!< LOW : Drive PBn.3 Low.                                                    */
  PBHD_4_PBSS_PB3SSSEL_DISABLED        = 3,     /*!< DISABLED : Ignore the safe state signal (weak pull-ups disabled).         */
} PBHD_4_PBSS_PB3SSSEL_Enum;

/* ==============================================  PBHD_4 PBSS PB4SSSEL [8..9]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBSS_PB4SSSEL                                                      */
  PBHD_4_PBSS_PB4SSSEL_HIZ             = 0,     /*!< HIZ : Place PBn.4 in a High Impedance state.                              */
  PBHD_4_PBSS_PB4SSSEL_HIGH            = 1,     /*!< HIGH : Drive PBn.4 High.                                                  */
  PBHD_4_PBSS_PB4SSSEL_LOW             = 2,     /*!< LOW : Drive PBn.4 Low.                                                    */
  PBHD_4_PBSS_PB4SSSEL_DISABLED        = 3,     /*!< DISABLED : Ignore the safe state signal (weak pull-ups disabled).         */
} PBHD_4_PBSS_PB4SSSEL_Enum;

/* =============================================  PBHD_4 PBSS PB5SSSEL [10..11]  ============================================= */
typedef enum {                                  /*!< PBHD_4_PBSS_PB5SSSEL                                                      */
  PBHD_4_PBSS_PB5SSSEL_HIZ             = 0,     /*!< HIZ : Place PBn.5 in a High Impedance state.                              */
  PBHD_4_PBSS_PB5SSSEL_HIGH            = 1,     /*!< HIGH : Drive PBn.5 High.                                                  */
  PBHD_4_PBSS_PB5SSSEL_LOW             = 2,     /*!< LOW : Drive PBn.5 Low.                                                    */
  PBHD_4_PBSS_PB5SSSEL_DISABLED        = 3,     /*!< DISABLED : Ignore the safe state signal (weak pull-ups disabled).         */
} PBHD_4_PBSS_PB5SSSEL_Enum;

/* ==============================================  PBHD_4 PBSS SSMDEN [16..16]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBSS_SSMDEN                                                        */
  PBHD_4_PBSS_SSMDEN_DISABLED          = 0,     /*!< DISABLED : Disable Safe State.                                            */
  PBHD_4_PBSS_SSMDEN_ENABLED           = 1,     /*!< ENABLED : Enter Safe State. Each PBn.x pin will enter the states
                                                     defined by PBxSSSEL.                                                      */
} PBHD_4_PBSS_SSMDEN_Enum;

/* =============================================  PBHD_4 PBSS PBSSSMD [17..17]  ============================================== */
typedef enum {                                  /*!< PBHD_4_PBSS_PBSSSMD                                                       */
  PBHD_4_PBSS_PBSSSMD_DEGLITCH         = 0,     /*!< DEGLITCH : Enable deglitching on the kill signal input. The
                                                     kill signal must be asserted for two APB clocks to be recognized.         */
  PBHD_4_PBSS_PBSSSMD_IMMEDIATE        = 1,     /*!< IMMEDIATE : Disable deglitching on the kill signal input. The
                                                     kill signal will take immediate effect.                                   */
} PBHD_4_PBSS_PBSSSMD_Enum;

/* ========================================================  PBLOCK  ========================================================= */


/* =========================================================================================================================== */
/* ================                                          PBSTD_0                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  PB  =========================================================== */
/* ========================================================  PB_SET  ========================================================= */
/* ========================================================  PB_CLR  ========================================================= */
/* ========================================================  PB_MSK  ========================================================= */
/* =========================================================  PBPIN  ========================================================= */
/* ========================================================  PBMDSEL  ======================================================== */
/* ======================================================  PBMDSEL_SET  ====================================================== */
/* ======================================================  PBMDSEL_CLR  ====================================================== */
/* =======================================================  PBSKIPEN  ======================================================== */
/* =====================================================  PBSKIPEN_SET  ====================================================== */
/* =====================================================  PBSKIPEN_CLR  ====================================================== */
/* ========================================================  PBOUTMD  ======================================================== */
/* ======================================================  PBOUTMD_SET  ====================================================== */
/* ======================================================  PBOUTMD_CLR  ====================================================== */
/* =========================================================  PBDRV  ========================================================= */
/* =============================================  PBSTD_0 PBDRV PBPUEN [16..16]  ============================================= */
typedef enum {                                  /*!< PBSTD_0_PBDRV_PBPUEN                                                      */
  PBSTD_0_PBDRV_PBPUEN_DISABLED        = 0,     /*!< DISABLED : Disable weak pull-ups for this port.                           */
  PBSTD_0_PBDRV_PBPUEN_ENABLED         = 1,     /*!< ENABLED : Enable weak pull-ups for this port.                             */
} PBSTD_0_PBDRV_PBPUEN_Enum;

/* =======================================================  PBDRV_SET  ======================================================= */
/* =======================================================  PBDRV_CLR  ======================================================= */
/* ==========================================================  PM  =========================================================== */
/* ========================================================  PM_SET  ========================================================= */
/* ========================================================  PM_CLR  ========================================================= */
/* =========================================================  PMEN  ========================================================== */
/* =======================================================  PMEN_SET  ======================================================== */
/* =======================================================  PMEN_CLR  ======================================================== */
/* ========================================================  PBLOCK  ========================================================= */
/* ========================================================  PBPGEN  ========================================================= */
/* =======================================================  PBPGPHASE  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           RTC_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* =============================================  RTC_0 CONFIG ALM0AREN [0..0]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_ALM0AREN                                                     */
  RTC_0_CONFIG_ALM0AREN_DISABLED       = 0,     /*!< DISABLED : Disable the Alarm 0 automatic reset.                           */
  RTC_0_CONFIG_ALM0AREN_ENABLED        = 1,     /*!< ENABLED : Enable the Alarm 0 automatic reset.                             */
} RTC_0_CONFIG_ALM0AREN_Enum;

/* ================================================  RTC_0 CONFIG RUN [1..1]  ================================================ */
typedef enum {                                  /*!< RTC_0_CONFIG_RUN                                                          */
  RTC_0_CONFIG_RUN_STOP                = 0,     /*!< STOP : Stop the RTC timer.                                                */
  RTC_0_CONFIG_RUN_START               = 1,     /*!< START : Start the RTC timer running.                                      */
} RTC_0_CONFIG_RUN_Enum;

/* ==============================================  RTC_0 CONFIG MCLKEN [2..2]  =============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_MCLKEN                                                       */
  RTC_0_CONFIG_MCLKEN_DISABLED         = 0,     /*!< DISABLED : Disable the missing clock detector.                            */
  RTC_0_CONFIG_MCLKEN_ENABLED          = 1,     /*!< ENABLED : Enable the missing clock detector. If the missing
                                                     clock detector triggers, it will generate an RTC Fail event.              */
} RTC_0_CONFIG_MCLKEN_Enum;

/* ===============================================  RTC_0 CONFIG ASEN [3..3]  ================================================ */
typedef enum {                                  /*!< RTC_0_CONFIG_ASEN                                                         */
  RTC_0_CONFIG_ASEN_DISABLED           = 0,     /*!< DISABLED : Disable automatic load capacitance stepping.                   */
  RTC_0_CONFIG_ASEN_ENABLED            = 1,     /*!< ENABLED : Enable automatic load capacitance stepping.                     */
} RTC_0_CONFIG_ASEN_Enum;

/* ==============================================  RTC_0 CONFIG BDEN [16..16]  =============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_BDEN                                                         */
  RTC_0_CONFIG_BDEN_DISABLED           = 0,     /*!< DISABLED : Disable the bias doubler, saving power.                        */
  RTC_0_CONFIG_BDEN_ENABLED            = 1,     /*!< ENABLED : Enable the bias doubler, allowing for faster oscillator
                                                     start up time.                                                            */
} RTC_0_CONFIG_BDEN_Enum;

/* =============================================  RTC_0 CONFIG CRYSEN [17..17]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_CRYSEN                                                       */
  RTC_0_CONFIG_CRYSEN_DISABLED         = 0,     /*!< DISABLED : Disable the crystal oscillator circuitry.                      */
  RTC_0_CONFIG_CRYSEN_ENABLED          = 1,     /*!< ENABLED : Enable the crystal oscillator circuitry.                        */
} RTC_0_CONFIG_CRYSEN_Enum;

/* ==============================================  RTC_0 CONFIG AGCEN [18..18]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_AGCEN                                                        */
  RTC_0_CONFIG_AGCEN_DISABLED          = 0,     /*!< DISABLED : Disable automatic gain control.                                */
  RTC_0_CONFIG_AGCEN_ENABLED           = 1,     /*!< ENABLED : Enable automatic gain control, saving power.                    */
} RTC_0_CONFIG_AGCEN_Enum;

