chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  RTC_0 CONFIG ALM0EN [24..24]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_ALM0EN                                                       */
  RTC_0_CONFIG_ALM0EN_DISABLED         = 0,     /*!< DISABLED : Disable RTC Alarm 0.                                           */
  RTC_0_CONFIG_ALM0EN_ENABLED          = 1,     /*!< ENABLED : Enable RTC Alarm 0.                                             */
} RTC_0_CONFIG_ALM0EN_Enum;

/* =============================================  RTC_0 CONFIG ALM1EN [25..25]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_ALM1EN                                                       */
  RTC_0_CONFIG_ALM1EN_DISABLED         = 0,     /*!< DISABLED : Disable RTC Alarm 1.                                           */
  RTC_0_CONFIG_ALM1EN_ENABLED          = 1,     /*!< ENABLED : Enable RTC Alarm 1.                                             */
} RTC_0_CONFIG_ALM1EN_Enum;

/* =============================================  RTC_0 CONFIG ALM2EN [26..26]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_ALM2EN                                                       */
  RTC_0_CONFIG_ALM2EN_DISABLED         = 0,     /*!< DISABLED : Disable RTC Alarm 2.                                           */
  RTC_0_CONFIG_ALM2EN_ENABLED          = 1,     /*!< ENABLED : Enable RTC Alarm 2.                                             */
} RTC_0_CONFIG_ALM2EN_Enum;

/* =============================================  RTC_0 CONFIG RTCOEN [29..29]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_RTCOEN                                                       */
  RTC_0_CONFIG_RTCOEN_DISABLED         = 0,     /*!< DISABLED : Disable the external RTCnOSC output.                           */
  RTC_0_CONFIG_RTCOEN_ENABLED          = 1,     /*!< ENABLED : Enable the external RTCnOSC output.                             */
} RTC_0_CONFIG_RTCOEN_Enum;

/* =============================================  RTC_0 CONFIG CLKSEL [30..30]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_CLKSEL                                                       */
  RTC_0_CONFIG_CLKSEL_RTCNOSC          = 0,     /*!< RTCNOSC : Select the RTC clock (RTCnOSC) as the RTC Timer clock.          */
  RTC_0_CONFIG_CLKSEL_LFOSCN           = 1,     /*!< LFOSCN : Select the Low Frequency Oscillator (LFOSCn) clock
                                                     as the RTC Timer clock.                                                   */
} RTC_0_CONFIG_CLKSEL_Enum;

/* ==============================================  RTC_0 CONFIG RTCEN [31..31]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONFIG_RTCEN                                                        */
  RTC_0_CONFIG_RTCEN_DISABLED          = 0,     /*!< DISABLED : Disable the RTC Oscillator and Timer.                          */
  RTC_0_CONFIG_RTCEN_ENABLED           = 1,     /*!< ENABLED : Enable the RTC Oscillator and Timer.                            */
} RTC_0_CONFIG_RTCEN_Enum;

/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  RTC_0 CONTROL ALM0I [0..0]  =============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_ALM0I                                                       */
  RTC_0_CONTROL_ALM0I_NOT_SET          = 0,     /*!< NOT_SET : Alarm 0 event has not occurred.                                 */
  RTC_0_CONTROL_ALM0I_SET              = 1,     /*!< SET : Alarm 0 event occurred.                                             */
} RTC_0_CONTROL_ALM0I_Enum;

/* ==============================================  RTC_0 CONTROL ALM1I [1..1]  =============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_ALM1I                                                       */
  RTC_0_CONTROL_ALM1I_NOT_SET          = 0,     /*!< NOT_SET : Alarm 1 event has not occurred.                                 */
  RTC_0_CONTROL_ALM1I_SET              = 1,     /*!< SET : Alarm 1 event occurred.                                             */
} RTC_0_CONTROL_ALM1I_Enum;

/* ==============================================  RTC_0 CONTROL ALM2I [2..2]  =============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_ALM2I                                                       */
  RTC_0_CONTROL_ALM2I_NOT_SET          = 0,     /*!< NOT_SET : Alarm 2 event has not occurred.                                 */
  RTC_0_CONTROL_ALM2I_SET              = 1,     /*!< SET : Alarm 2 event occurred.                                             */
} RTC_0_CONTROL_ALM2I_Enum;

/* ==============================================  RTC_0 CONTROL TMRCAP [3..3]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_TMRCAP                                                      */
  RTC_0_CONTROL_TMRCAP_NOT_SET         = 0,     /*!< NOT_SET : RTC timer capture operation is complete.                        */
  RTC_0_CONTROL_TMRCAP_SET             = 1,     /*!< SET : Start the RTC timer capture.                                        */
} RTC_0_CONTROL_TMRCAP_Enum;

/* ==============================================  RTC_0 CONTROL TMRSET [4..4]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_TMRSET                                                      */
  RTC_0_CONTROL_TMRSET_NOT_SET         = 0,     /*!< NOT_SET : RTC timer set operation is complete.                            */
  RTC_0_CONTROL_TMRSET_SET             = 1,     /*!< SET : Start the RTC timer set.                                            */
} RTC_0_CONTROL_TMRSET_Enum;

