chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  RTC_0 CONTROL CLKVF [5..5]  =============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_CLKVF                                                       */
  RTC_0_CONTROL_CLKVF_NOT_SET          = 0,     /*!< NOT_SET : External oscillator is not valid.                               */
  RTC_0_CONTROL_CLKVF_SET              = 1,     /*!< SET : External oscillator is valid.                                       */
} RTC_0_CONTROL_CLKVF_Enum;

/* ==============================================  RTC_0 CONTROL OSCFI [6..6]  =============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_OSCFI                                                       */
  RTC_0_CONTROL_OSCFI_NOT_SET          = 0,     /*!< NOT_SET : Oscillator is running.                                          */
  RTC_0_CONTROL_OSCFI_SET              = 1,     /*!< SET : Oscillator has failed.                                              */
} RTC_0_CONTROL_OSCFI_Enum;

/* ==============================================  RTC_0 CONTROL HSMDEN [7..7]  ============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_HSMDEN                                                      */
  RTC_0_CONTROL_HSMDEN_DISABLED        = 0,     /*!< DISABLED : Disable high speed mode.                                       */
  RTC_0_CONTROL_HSMDEN_ENABLED         = 1,     /*!< ENABLED : Enable high speed mode.                                         */
} RTC_0_CONTROL_HSMDEN_Enum;

/* ==============================================  RTC_0 CONTROL LRDYF [8..8]  =============================================== */
typedef enum {                                  /*!< RTC_0_CONTROL_LRDYF                                                       */
  RTC_0_CONTROL_LRDYF_NOT_SET          = 0,     /*!< NOT_SET : The load capacitance is currently stepping.                     */
  RTC_0_CONTROL_LRDYF_SET              = 1,     /*!< SET : The load capacitance has reached its programmed value.              */
} RTC_0_CONTROL_LRDYF_Enum;

/* ========================================================  ALARM0  ========================================================= */
/* ========================================================  ALARM1  ========================================================= */
/* ========================================================  ALARM2  ========================================================= */
/* ========================================================  SETCAP  ========================================================= */
/* ======================================================  LFOCONTROL  ======================================================= */
/* ===========================================  RTC_0 LFOCONTROL LFOSCEN [31..31]  =========================================== */
typedef enum {                                  /*!< RTC_0_LFOCONTROL_LFOSCEN                                                  */
  RTC_0_LFOCONTROL_LFOSCEN_DISABLED    = 0,     /*!< DISABLED : Disable the Low Frequency Oscillator (LFOSCn).                 */
  RTC_0_LFOCONTROL_LFOSCEN_ENABLED     = 1,     /*!< ENABLED : Enable the Low Frequency Oscillator (LFOSCn).                   */
} RTC_0_LFOCONTROL_LFOSCEN_Enum;

/* =======================================================  LFOSCADJ  ======================================================== */


/* =========================================================================================================================== */
/* ================                                         RSTSRC_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  RESETEN  ======================================================== */
/* ============================================  RSTSRC_0 RESETEN VMONREN [2..2]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_VMONREN                                                  */
  RSTSRC_0_RESETEN_VMONREN_DISABLED    = 0,     /*!< DISABLED : Disable the Voltage Supply Monitor VDD event as a
                                                     reset source.                                                             */
  RSTSRC_0_RESETEN_VMONREN_ENABLED     = 1,     /*!< ENABLED : Enable the Voltage Supply Monitor VDD event as a reset
                                                     source.                                                                   */
} RSTSRC_0_RESETEN_VMONREN_Enum;

/* ============================================  RSTSRC_0 RESETEN MCDREN [4..4]  ============================================= */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_MCDREN                                                   */
  RSTSRC_0_RESETEN_MCDREN_DISABLED     = 0,     /*!< DISABLED : Disable the Missing Clock Detector event as a reset
                                                     source.                                                                   */
  RSTSRC_0_RESETEN_MCDREN_ENABLED      = 1,     /*!< ENABLED : Enable the Missing Clock Detector event as a reset
                                                     source.                                                                   */
} RSTSRC_0_RESETEN_MCDREN_Enum;

/* ============================================  RSTSRC_0 RESETEN WDTREN [5..5]  ============================================= */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_WDTREN                                                   */
  RSTSRC_0_RESETEN_WDTREN_DISABLED     = 0,     /*!< DISABLED : Disable the Watchdog Timer event as a reset source.            */
  RSTSRC_0_RESETEN_WDTREN_ENABLED      = 1,     /*!< ENABLED : Enable the Watchdog Timer event as a reset source.              */
} RSTSRC_0_RESETEN_WDTREN_Enum;

/* =============================================  RSTSRC_0 RESETEN SWREN [6..6]  ============================================= */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_SWREN                                                    */
  RSTSRC_0_RESETEN_SWREN_DISABLED      = 0,     /*!< DISABLED : Do not generate a Software Reset.                              */
  RSTSRC_0_RESETEN_SWREN_ENABLED       = 1,     /*!< ENABLED : Generate a Software Reset.                                      */
} RSTSRC_0_RESETEN_SWREN_Enum;

