chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  RSTSRC_0 RESETEN CMP0REN [7..7]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_CMP0REN                                                  */
  RSTSRC_0_RESETEN_CMP0REN_DISABLED    = 0,     /*!< DISABLED : Disable the Comparator 0 event as a reset source.              */
  RSTSRC_0_RESETEN_CMP0REN_ENABLED     = 1,     /*!< ENABLED : Enable the Comparator 0 event as a reset source.                */
} RSTSRC_0_RESETEN_CMP0REN_Enum;

/* ============================================  RSTSRC_0 RESETEN CMP1REN [8..8]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_CMP1REN                                                  */
  RSTSRC_0_RESETEN_CMP1REN_DISABLED    = 0,     /*!< DISABLED : Disable the Comparator 1 event as a reset source.              */
  RSTSRC_0_RESETEN_CMP1REN_ENABLED     = 1,     /*!< ENABLED : Enable the Comparator 1 event as a reset source.                */
} RSTSRC_0_RESETEN_CMP1REN_Enum;

/* ============================================  RSTSRC_0 RESETEN USB0REN [9..9]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_USB0REN                                                  */
  RSTSRC_0_RESETEN_USB0REN_DISABLED    = 0,     /*!< DISABLED : Disable the USB0 reset event as a reset source.                */
  RSTSRC_0_RESETEN_USB0REN_ENABLED     = 1,     /*!< ENABLED : Enable the USB0 reset event as a reset source.                  */
} RSTSRC_0_RESETEN_USB0REN_Enum;

/* ===========================================  RSTSRC_0 RESETEN RTC0REN [10..10]  =========================================== */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_RTC0REN                                                  */
  RSTSRC_0_RESETEN_RTC0REN_DISABLED    = 0,     /*!< DISABLED : Disable the RTC0 event as a reset source.                      */
  RSTSRC_0_RESETEN_RTC0REN_ENABLED     = 1,     /*!< ENABLED : Enable the RTC0 event as a reset source.                        */
} RSTSRC_0_RESETEN_RTC0REN_Enum;

/* ===========================================  RSTSRC_0 RESETEN WAKEREN [11..11]  =========================================== */
typedef enum {                                  /*!< RSTSRC_0_RESETEN_WAKEREN                                                  */
  RSTSRC_0_RESETEN_WAKEREN_ENABLED     = 1,     /*!< ENABLED : Enable the PMU Wakeup event as a reset source.                  */
} RSTSRC_0_RESETEN_WAKEREN_Enum;

/* =======================================================  RESETFLAG  ======================================================= */
/* ============================================  RSTSRC_0 RESETFLAG PINRF [0..0]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_PINRF                                                  */
  RSTSRC_0_RESETFLAG_PINRF_NOT_SET     = 0,     /*!< NOT_SET : A /RESET pin event did not cause the last system reset.         */
  RSTSRC_0_RESETFLAG_PINRF_SET         = 1,     /*!< SET : A /RESET pin event caused the last system reset.                    */
} RSTSRC_0_RESETFLAG_PINRF_Enum;

/* ============================================  RSTSRC_0 RESETFLAG PORRF [1..1]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_PORRF                                                  */
  RSTSRC_0_RESETFLAG_PORRF_NOT_SET     = 0,     /*!< NOT_SET : A Power-On Reset event did not cause the last system
                                                     reset.                                                                    */
  RSTSRC_0_RESETFLAG_PORRF_SET         = 1,     /*!< SET : A Power-On Reset event caused the last system reset.                */
} RSTSRC_0_RESETFLAG_PORRF_Enum;

/* ===========================================  RSTSRC_0 RESETFLAG VMONRF [2..2]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_VMONRF                                                 */
  RSTSRC_0_RESETFLAG_VMONRF_NOT_SET    = 0,     /*!< NOT_SET : A Voltage Supply Monitor VDD Reset event did not cause
                                                     the last system reset.                                                    */
  RSTSRC_0_RESETFLAG_VMONRF_SET        = 1,     /*!< SET : A Voltage Supply Monitor VDD Reset event caused the last
                                                     system reset.                                                             */
} RSTSRC_0_RESETFLAG_VMONRF_Enum;

/* ===========================================  RSTSRC_0 RESETFLAG CORERF [3..3]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_CORERF                                                 */
  RSTSRC_0_RESETFLAG_CORERF_NOT_SET    = 0,     /*!< NOT_SET : A Core Reset event did not cause the last system reset.         */
  RSTSRC_0_RESETFLAG_CORERF_SET        = 1,     /*!< SET : A Core Reset event caused the last system reset.                    */
} RSTSRC_0_RESETFLAG_CORERF_Enum;

/* ============================================  RSTSRC_0 RESETFLAG MCDRF [4..4]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_MCDRF                                                  */
  RSTSRC_0_RESETFLAG_MCDRF_NOT_SET     = 0,     /*!< NOT_SET : A Missing Clock Detector event did not cause the last
                                                     system reset.                                                             */
  RSTSRC_0_RESETFLAG_MCDRF_SET         = 1,     /*!< SET : A Missing Clock Detector event caused the last system
                                                     reset.                                                                    */
} RSTSRC_0_RESETFLAG_MCDRF_Enum;

/* ============================================  RSTSRC_0 RESETFLAG WDTRF [5..5]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_WDTRF                                                  */
  RSTSRC_0_RESETFLAG_WDTRF_NOT_SET     = 0,     /*!< NOT_SET : A Watchdog Timer event did not cause the last system
                                                     reset.                                                                    */
  RSTSRC_0_RESETFLAG_WDTRF_SET         = 1,     /*!< SET : A Watchdog Timer event caused the last system reset.                */
} RSTSRC_0_RESETFLAG_WDTRF_Enum;

/* ============================================  RSTSRC_0 RESETFLAG SWRF [6..6]  ============================================= */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_SWRF                                                   */
  RSTSRC_0_RESETFLAG_SWRF_NOT_SET      = 0,     /*!< NOT_SET : A Software Reset event did not cause the last system
                                                     reset.                                                                    */
  RSTSRC_0_RESETFLAG_SWRF_SET          = 1,     /*!< SET : A Software Reset event caused the last system reset.                */
} RSTSRC_0_RESETFLAG_SWRF_Enum;

/* ===========================================  RSTSRC_0 RESETFLAG CMP0RF [7..7]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_CMP0RF                                                 */
  RSTSRC_0_RESETFLAG_CMP0RF_NOT_SET    = 0,     /*!< NOT_SET : A Comparator 0 event did not cause the last system
                                                     reset.                                                                    */
  RSTSRC_0_RESETFLAG_CMP0RF_SET        = 1,     /*!< SET : A Comparator 0 event caused the last system reset.                  */
} RSTSRC_0_RESETFLAG_CMP0RF_Enum;

/* ===========================================  RSTSRC_0 RESETFLAG CMP1RF [8..8]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_CMP1RF                                                 */
  RSTSRC_0_RESETFLAG_CMP1RF_NOT_SET    = 0,     /*!< NOT_SET : A Comparator 1 event did not cause the last system
                                                     reset.                                                                    */
  RSTSRC_0_RESETFLAG_CMP1RF_SET        = 1,     /*!< SET : A Comparator 1 event caused the last system reset.                  */
} RSTSRC_0_RESETFLAG_CMP1RF_Enum;

/* ===========================================  RSTSRC_0 RESETFLAG USB0RF [9..9]  ============================================ */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_USB0RF                                                 */
  RSTSRC_0_RESETFLAG_USB0RF_NOT_SET    = 0,     /*!< NOT_SET : A USB0 Reset event did not cause the last system reset.         */
  RSTSRC_0_RESETFLAG_USB0RF_SET        = 1,     /*!< SET : A USB0 Reset event caused the last system reset.                    */
} RSTSRC_0_RESETFLAG_USB0RF_Enum;

