chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==========================================  RSTSRC_0 RESETFLAG RTC0RF [10..10]  =========================================== */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_RTC0RF                                                 */
  RSTSRC_0_RESETFLAG_RTC0RF_NOT_SET    = 0,     /*!< NOT_SET : An RTC0 event did not cause the last system reset.              */
  RSTSRC_0_RESETFLAG_RTC0RF_SET        = 1,     /*!< SET : An RTC0 event caused the last system reset.                         */
} RSTSRC_0_RESETFLAG_RTC0RF_Enum;

/* ==========================================  RSTSRC_0 RESETFLAG WAKERF [11..11]  =========================================== */
typedef enum {                                  /*!< RSTSRC_0_RESETFLAG_WAKERF                                                 */
  RSTSRC_0_RESETFLAG_WAKERF_NOT_SET    = 0,     /*!< NOT_SET : A PMU Wakeup event did not cause the last system reset.         */
  RSTSRC_0_RESETFLAG_WAKERF_SET        = 1,     /*!< SET : A PMU Wakeup event caused the last system reset.                    */
} RSTSRC_0_RESETFLAG_WAKERF_Enum;

/* ========================================================  CONFIG  ========================================================= */
/* =============================================  RSTSRC_0 CONFIG PMSEL [0..0]  ============================================== */
typedef enum {                                  /*!< RSTSRC_0_CONFIG_PMSEL                                                     */
  RSTSRC_0_CONFIG_PMSEL_PM9_DIS        = 0,     /*!< PM9_DIS : Power Mode < PM9.                                               */
  RSTSRC_0_CONFIG_PMSEL_PM9_EN         = 1,     /*!< PM9_EN : Power Mode = PM9.                                                */
} RSTSRC_0_CONFIG_PMSEL_Enum;



/* =========================================================================================================================== */
/* ================                                           SPI_0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  DATA  ========================================================== */
/* ========================================================  CONTROL  ======================================================== */
/* ==============================================  SPI_0 CONTROL RFRQI [0..0]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_RFRQI                                                       */
  SPI_0_CONTROL_RFRQI_NOT_SET          = 0,     /*!< NOT_SET : The RX FIFO has fewer bytes than the level defined
                                                     by RFTH.                                                                  */
  SPI_0_CONTROL_RFRQI_SET              = 1,     /*!< SET : The RX FIFO has equal or more bytes than the level defined
                                                     by RFTH.                                                                  */
} SPI_0_CONTROL_RFRQI_Enum;

/* ==============================================  SPI_0 CONTROL RFORI [1..1]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_RFORI                                                       */
  SPI_0_CONTROL_RFORI_NOT_SET          = 0,     /*!< NOT_SET : Read: A receive FIFO overrun has not occurred. Write:
                                                     Clear the flag.                                                           */
  SPI_0_CONTROL_RFORI_SET              = 1,     /*!< SET : Read: A receive FIFO overrun occurred. Write: Force a
                                                     receive overrun interrupt.                                                */
} SPI_0_CONTROL_RFORI_Enum;

/* ==============================================  SPI_0 CONTROL TFRQI [2..2]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_TFRQI                                                       */
  SPI_0_CONTROL_TFRQI_NOT_SET          = 0,     /*!< NOT_SET : The TX FIFO has fewer bytes than the level defined
                                                     by TFTH.                                                                  */
  SPI_0_CONTROL_TFRQI_SET              = 1,     /*!< SET : The TX FIFO has equal or more bytes than the level defined
                                                     by TFTH.                                                                  */
} SPI_0_CONTROL_TFRQI_Enum;

/* ==============================================  SPI_0 CONTROL TFORI [3..3]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_TFORI                                                       */
  SPI_0_CONTROL_TFORI_NOT_SET          = 0,     /*!< NOT_SET : Read: A transmit FIFO overrun has not occurred. Write:
                                                     Clear the flag.                                                           */
  SPI_0_CONTROL_TFORI_SET              = 1,     /*!< SET : Read: A transmit FIFO overrun occurred. Write: Force a
                                                     transmit overrun interrupt.                                               */
} SPI_0_CONTROL_TFORI_Enum;

/* =============================================  SPI_0 CONTROL SLVSELI [4..4]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_SLVSELI                                                     */
  SPI_0_CONTROL_SLVSELI_NOT_SET        = 0,     /*!< NOT_SET : The slave select signal (NSS) is not active.                    */
  SPI_0_CONTROL_SLVSELI_SET            = 1,     /*!< SET : The slave select signal (NSS) is active.                            */
} SPI_0_CONTROL_SLVSELI_Enum;

/* ===============================================  SPI_0 CONTROL MDFI [5..5]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_MDFI                                                        */
  SPI_0_CONTROL_MDFI_NOT_SET           = 0,     /*!< NOT_SET : Read: A master mode collision is not detected. Write:
                                                     Clear the flag.                                                           */
  SPI_0_CONTROL_MDFI_SET               = 1,     /*!< SET : Read: A master mode collision occurred. Write: Force a
                                                     mode fault interrupt.                                                     */
} SPI_0_CONTROL_MDFI_Enum;

/* ===============================================  SPI_0 CONTROL URI [6..6]  ================================================ */
typedef enum {                                  /*!< SPI_0_CONTROL_URI                                                         */
  SPI_0_CONTROL_URI_NOT_SET            = 0,     /*!< NOT_SET : Read: A data transfer is still in progress. Write:
                                                     Clear the flag.                                                           */
  SPI_0_CONTROL_URI_SET                = 1,     /*!< SET : Read: The transmit FIFO and shift register are empty and
                                                     the data transfer has ended. Write: Force an underrun interrupt.          */
} SPI_0_CONTROL_URI_Enum;

/* ===============================================  SPI_0 CONTROL SREI [7..7]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_SREI                                                        */
  SPI_0_CONTROL_SREI_NOT_SET           = 0,     /*!< NOT_SET : There is data still present in the transmit FIFO.               */
  SPI_0_CONTROL_SREI_SET               = 1,     /*!< SET : All data has been transferred out of the shift register
                                                     and there is no data waiting in the transmit FIFO.                        */
} SPI_0_CONTROL_SREI_Enum;

/* ==============================================  SPI_0 CONTROL RFILI [8..8]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_RFILI                                                       */
  SPI_0_CONTROL_RFILI_NOT_SET          = 0,     /*!< NOT_SET : Read: An illegal write or read of the receive FIFO
                                                     has not occurred. Write: Clear the flag.                                  */
  SPI_0_CONTROL_RFILI_SET              = 1,     /*!< SET : Read: An illegal write or read of the receive FIFO occurred.
                                                     Write: Force an illegal receive access interrupt.                         */
} SPI_0_CONTROL_RFILI_Enum;

/* ==============================================  SPI_0 CONTROL TFILI [9..9]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_TFILI                                                       */
  SPI_0_CONTROL_TFILI_NOT_SET          = 0,     /*!< NOT_SET : Read: An illegal write or read of the transmit FIFO
                                                     has not occurred. Write: Clear the flag.                                  */
  SPI_0_CONTROL_TFILI_SET              = 1,     /*!< SET : Read: An illegal write or read of the transmit FIFO occurred.
                                                     Write: Force an illegal transmit access interrupt.                        */
} SPI_0_CONTROL_TFILI_Enum;

/* =============================================  SPI_0 CONTROL NSSSTS [14..14]  ============================================= */
typedef enum {                                  /*!< SPI_0_CONTROL_NSSSTS                                                      */
  SPI_0_CONTROL_NSSSTS_LOW             = 0,     /*!< LOW : NSS is currently a logic low.                                       */
  SPI_0_CONTROL_NSSSTS_HIGH            = 1,     /*!< HIGH : NSS is currently a logic high.                                     */
} SPI_0_CONTROL_NSSSTS_Enum;

/* =============================================  SPI_0 CONTROL BUSYF [15..15]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_BUSYF                                                       */
  SPI_0_CONTROL_BUSYF_NOT_SET          = 0,     /*!< NOT_SET : The SPI is not busy and a transfer is not in progress.          */
  SPI_0_CONTROL_BUSYF_SET              = 1,     /*!< SET : The SPI is currently busy and a transfer is in progress.            */
} SPI_0_CONTROL_BUSYF_Enum;

/* =============================================  SPI_0 CONTROL DBGMD [24..24]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONTROL_DBGMD                                                       */
  SPI_0_CONTROL_DBGMD_RUN              = 0,     /*!< RUN : The SPI module will continue to operate while the core
                                                     is halted in debug mode.                                                  */
  SPI_0_CONTROL_DBGMD_HALT             = 1,     /*!< HALT : A debug breakpoint will cause the SPI module to halt.              */
} SPI_0_CONTROL_DBGMD_Enum;

/* ========================================================  CONFIG  ========================================================= */
/* ==============================================  SPI_0 CONFIG RFRQIEN [0..0]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_RFRQIEN                                                      */
  SPI_0_CONFIG_RFRQIEN_DISABLED        = 0,     /*!< DISABLED : Disable the receive FIFO request interrupt.                    */
  SPI_0_CONFIG_RFRQIEN_ENABLED         = 1,     /*!< ENABLED : Enable the receive FIFO request interrupt.                      */
} SPI_0_CONFIG_RFRQIEN_Enum;

/* ==============================================  SPI_0 CONFIG RFORIEN [1..1]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_RFORIEN                                                      */
  SPI_0_CONFIG_RFORIEN_DISABLED        = 0,     /*!< DISABLED : Disable the receive FIFO overrun interrupt.                    */
  SPI_0_CONFIG_RFORIEN_ENABLED         = 1,     /*!< ENABLED : Enable the receive FIFO overrun interrupt.                      */
} SPI_0_CONFIG_RFORIEN_Enum;

/* ==============================================  SPI_0 CONFIG TFRQIEN [2..2]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_TFRQIEN                                                      */
  SPI_0_CONFIG_TFRQIEN_DISABLED        = 0,     /*!< DISABLED : Disable the transmit FIFO data request interrupt.              */
  SPI_0_CONFIG_TFRQIEN_ENABLED         = 1,     /*!< ENABLED : Enable the transmit FIFO data request interrupt.                */
} SPI_0_CONFIG_TFRQIEN_Enum;

