chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  SPI_0 CONFIG TFORIEN [3..3]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_TFORIEN                                                      */
  SPI_0_CONFIG_TFORIEN_DISABLED        = 0,     /*!< DISABLED : Disable the transmit FIFO overrun interrupt.                   */
  SPI_0_CONFIG_TFORIEN_ENABLED         = 1,     /*!< ENABLED : Enable the transmit FIFO overrun interrupt.                     */
} SPI_0_CONFIG_TFORIEN_Enum;

/* =============================================  SPI_0 CONFIG SLVSELIEN [4..4]  ============================================= */
typedef enum {                                  /*!< SPI_0_CONFIG_SLVSELIEN                                                    */
  SPI_0_CONFIG_SLVSELIEN_DISABLED      = 0,     /*!< DISABLED : Disable the slave select interrupt.                            */
  SPI_0_CONFIG_SLVSELIEN_ENABLED       = 1,     /*!< ENABLED : Enable the slave select interrupt.                              */
} SPI_0_CONFIG_SLVSELIEN_Enum;

/* ==============================================  SPI_0 CONFIG MDFIEN [5..5]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_MDFIEN                                                       */
  SPI_0_CONFIG_MDFIEN_DISABLED         = 0,     /*!< DISABLED : Disable the mode fault interrupt.                              */
  SPI_0_CONFIG_MDFIEN_ENABLED          = 1,     /*!< ENABLED : Enable the mode fault interrupt.                                */
} SPI_0_CONFIG_MDFIEN_Enum;

/* ===============================================  SPI_0 CONFIG URIEN [6..6]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_URIEN                                                        */
  SPI_0_CONFIG_URIEN_DISABLED          = 0,     /*!< DISABLED : Disable the underrun interrupt.                                */
  SPI_0_CONFIG_URIEN_ENABLED           = 1,     /*!< ENABLED : Enable the underrun interrupt.                                  */
} SPI_0_CONFIG_URIEN_Enum;

/* ==============================================  SPI_0 CONFIG SREIEN [7..7]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_SREIEN                                                       */
  SPI_0_CONFIG_SREIEN_DISABLED         = 0,     /*!< DISABLED : Disable the shift register empty interrupt.                    */
  SPI_0_CONFIG_SREIEN_ENABLED          = 1,     /*!< ENABLED : Enable the shift register empty interrupt.                      */
} SPI_0_CONFIG_SREIEN_Enum;

/* ===============================================  SPI_0 CONFIG SPIEN [8..8]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_SPIEN                                                        */
  SPI_0_CONFIG_SPIEN_DISABLED          = 0,     /*!< DISABLED : Disable the SPI.                                               */
  SPI_0_CONFIG_SPIEN_ENABLED           = 1,     /*!< ENABLED : Enable the SPI.                                                 */
} SPI_0_CONFIG_SPIEN_Enum;

/* ===============================================  SPI_0 CONFIG MSTEN [9..9]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_MSTEN                                                        */
  SPI_0_CONFIG_MSTEN_DISABLED          = 0,     /*!< DISABLED : Operate in slave mode.                                         */
  SPI_0_CONFIG_MSTEN_ENABLED           = 1,     /*!< ENABLED : Operate in master mode.                                         */
} SPI_0_CONFIG_MSTEN_Enum;

/* =============================================  SPI_0 CONFIG CLKPOL [10..10]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_CLKPOL                                                       */
  SPI_0_CONFIG_CLKPOL_LOW              = 0,     /*!< LOW : The SCK line is low in the idle state.                              */
  SPI_0_CONFIG_CLKPOL_HIGH             = 1,     /*!< HIGH : The SCK line is high in the idle state.                            */
} SPI_0_CONFIG_CLKPOL_Enum;

/* =============================================  SPI_0 CONFIG CLKPHA [11..11]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_CLKPHA                                                       */
  SPI_0_CONFIG_CLKPHA_CENTER           = 0,     /*!< CENTER : The first edge of SCK is the sample edge (center of
                                                     data bit).                                                                */
  SPI_0_CONFIG_CLKPHA_EDGE             = 1,     /*!< EDGE : The first edge of SCK is the shift edge (edge of data
                                                     bit).                                                                     */
} SPI_0_CONFIG_CLKPHA_Enum;

/* =============================================  SPI_0 CONFIG NSSPOL [12..12]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_NSSPOL                                                       */
  SPI_0_CONFIG_NSSPOL_LOW              = 0,     /*!< LOW : NSS is active low.                                                  */
  SPI_0_CONFIG_NSSPOL_HIGH             = 1,     /*!< HIGH : NSS is active high.                                                */
} SPI_0_CONFIG_NSSPOL_Enum;

/* =============================================  SPI_0 CONFIG DDIRSEL [13..13]  ============================================= */
typedef enum {                                  /*!< SPI_0_CONFIG_DDIRSEL                                                      */
  SPI_0_CONFIG_DDIRSEL_MSB_FIRST       = 0,     /*!< MSB_FIRST : Data will be shifted MSB first.                               */
  SPI_0_CONFIG_DDIRSEL_LSB_FIRST       = 1,     /*!< LSB_FIRST : Data will be shifted LSB first.                               */
} SPI_0_CONFIG_DDIRSEL_Enum;

/* ==============================================  SPI_0 CONFIG NSSMD [14..15]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_NSSMD                                                        */
  SPI_0_CONFIG_NSSMD_3_WIRE_MASTER_SLAVE = 0,   /*!< 3_WIRE_MASTER_SLAVE : 3-wire Slave or 3-wire Master.                      */
  SPI_0_CONFIG_NSSMD_4_WIRE_SLAVE      = 1,     /*!< 4_WIRE_SLAVE : 4-wire slave (NSS input). This setting can also
                                                     be used for multi-master configurations.                                  */
  SPI_0_CONFIG_NSSMD_4_WIRE_MASTER_NSS_LOW = 2, /*!< 4_WIRE_MASTER_NSS_LOW : 4-wire master with NSS low (NSS output).          */
  SPI_0_CONFIG_NSSMD_4_WIRE_MASTER_NSS_HIGH = 3,/*!< 4_WIRE_MASTER_NSS_HIGH : 4-wire master with NSS high (NSS output).        */
} SPI_0_CONFIG_NSSMD_Enum;

/* ==============================================  SPI_0 CONFIG RFTH [16..17]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_RFTH                                                         */
  SPI_0_CONFIG_RFTH_ONE                = 0,     /*!< ONE : A DMA / RFRQ request asserts when >= 1 FIFO slot is filled.         */
  SPI_0_CONFIG_RFTH_TWO                = 1,     /*!< TWO : A DMA / RFRQ request asserts when >= 2 FIFO slots are
                                                     filled.                                                                   */
  SPI_0_CONFIG_RFTH_FOUR               = 2,     /*!< FOUR : A DMA / RFRQ request asserts when >= 4 FIFO slots are
                                                     filled.                                                                   */
  SPI_0_CONFIG_RFTH_FULL               = 3,     /*!< FULL : A DMA / RFRQ request asserts when all FIFO slots are
                                                     filled.                                                                   */
} SPI_0_CONFIG_RFTH_Enum;

