chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  SPI_0 CONFIG TFTH [18..19]  =============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_TFTH                                                         */
  SPI_0_CONFIG_TFTH_ONE                = 0,     /*!< ONE : A DMA / TFRQ request asserts when >= 1 FIFO slot is empty.          */
  SPI_0_CONFIG_TFTH_TWO                = 1,     /*!< TWO : A DMA / TFRQ request asserts when >= 2 FIFO slots are
                                                     empty.                                                                    */
  SPI_0_CONFIG_TFTH_FOUR               = 2,     /*!< FOUR : A DMA / TFRQ request asserts when >= 4 FIFO slots are
                                                     empty.                                                                    */
  SPI_0_CONFIG_TFTH_EMPTY              = 3,     /*!< EMPTY : A DMA / TFRQ request asserts when all FIFO slots are
                                                     empty.                                                                    */
} SPI_0_CONFIG_TFTH_Enum;

/* ==============================================  SPI_0 CONFIG DMAEN [24..24]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_DMAEN                                                        */
  SPI_0_CONFIG_DMAEN_DISABLED          = 0,     /*!< DISABLED : Disable DMA requests.                                          */
  SPI_0_CONFIG_DMAEN_ENABLED           = 1,     /*!< ENABLED : Enable DMA requests when the transmit buffer is empty
                                                     or the receive buffer is full.                                            */
} SPI_0_CONFIG_DMAEN_Enum;

/* =============================================  SPI_0 CONFIG RFIFOFL [29..29]  ============================================= */
typedef enum {                                  /*!< SPI_0_CONFIG_RFIFOFL                                                      */
  SPI_0_CONFIG_RFIFOFL_SET             = 1,     /*!< SET : Flush the receive FIFO.                                             */
} SPI_0_CONFIG_RFIFOFL_Enum;

/* =============================================  SPI_0 CONFIG TFIFOFL [30..30]  ============================================= */
typedef enum {                                  /*!< SPI_0_CONFIG_TFIFOFL                                                      */
  SPI_0_CONFIG_TFIFOFL_SET             = 1,     /*!< SET : Flush the transmit FIFO.                                            */
} SPI_0_CONFIG_TFIFOFL_Enum;

/* ==============================================  SPI_0 CONFIG RESET [31..31]  ============================================== */
typedef enum {                                  /*!< SPI_0_CONFIG_RESET                                                        */
  SPI_0_CONFIG_RESET_INACTIVE          = 0,     /*!< INACTIVE : SPI module is not in soft reset.                               */
  SPI_0_CONFIG_RESET_ACTIVE            = 1,     /*!< ACTIVE : SPI module is in soft reset and some of the module
                                                     bits cannot be accessed until this bit is cleared to 0
                                                     by hardware.                                                              */
} SPI_0_CONFIG_RESET_Enum;

/* ========================================================  CLKRATE  ======================================================== */
/* ========================================================  FSTATUS  ======================================================== */


/* =========================================================================================================================== */
/* ================                                           SSG_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* ==============================================  SSG_0 CONFIG SSEL [12..12]  =============================================== */
typedef enum {                                  /*!< SSG_0_CONFIG_SSEL                                                         */
  SSG_0_CONFIG_SSEL_NORMAL             = 0,     /*!< NORMAL : The SSG module runs at normal speed, where each pulse
                                                     and phase cycle consists of 16 ADC clocks.                                */
  SSG_0_CONFIG_SSEL_DOUBLE             = 1,     /*!< DOUBLE : The SSG module runs at double speed, where each pulse
                                                     and phase cycle consists of 8 ADC clocks.                                 */
} SSG_0_CONFIG_SSEL_Enum;

/* =============================================  SSG_0 CONFIG PHGFREN [13..13]  ============================================= */
typedef enum {                                  /*!< SSG_0_CONFIG_PHGFREN                                                      */
  SSG_0_CONFIG_PHGFREN_DISABLED        = 0,     /*!< DISABLED : The Phase Generator runs only when pulse generation
                                                     occurs.                                                                   */
  SSG_0_CONFIG_PHGFREN_ENABLED         = 1,     /*!< ENABLED : The Phase Generator runs when an ADC is enabled, regardless
                                                     of the Pulse Generator settings.                                          */
} SSG_0_CONFIG_PHGFREN_Enum;

/* =============================================  SSG_0 CONFIG PUGFREN [14..14]  ============================================= */
typedef enum {                                  /*!< SSG_0_CONFIG_PUGFREN                                                      */
  SSG_0_CONFIG_PUGFREN_DISABLED        = 0,     /*!< DISABLED : The COUNT field determines the number of pulses generated
                                                     by the Pulse Generator.                                                   */
  SSG_0_CONFIG_PUGFREN_ENABLED         = 1,     /*!< ENABLED : The Pulse Generator always generates pulses regardless
                                                     of COUNT unless all outputs are disabled (EX0EN, EX1EN,
                                                     EX2EN, and EX3EN are all 0).                                              */
} SSG_0_CONFIG_PUGFREN_Enum;

