chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  CONTROL  ======================================================== */
/* =============================================  SSG_0 CONTROL EX0INVEN [0..0]  ============================================= */
typedef enum {                                  /*!< SSG_0_CONTROL_EX0INVEN                                                    */
  SSG_0_CONTROL_EX0INVEN_NORMAL        = 0,     /*!< NORMAL : Do not invert the Pulse Generator output on EX0.                 */
  SSG_0_CONTROL_EX0INVEN_INVERT        = 1,     /*!< INVERT : Invert the Pulse Generator output on EX0.                        */
} SSG_0_CONTROL_EX0INVEN_Enum;

/* =============================================  SSG_0 CONTROL EX1INVEN [1..1]  ============================================= */
typedef enum {                                  /*!< SSG_0_CONTROL_EX1INVEN                                                    */
  SSG_0_CONTROL_EX1INVEN_NORMAL        = 0,     /*!< NORMAL : Do not invert the Pulse Generator output on EX1.                 */
  SSG_0_CONTROL_EX1INVEN_INVERT        = 1,     /*!< INVERT : Invert the Pulse Generator output on EX1.                        */
} SSG_0_CONTROL_EX1INVEN_Enum;

/* =============================================  SSG_0 CONTROL EX2INVEN [2..2]  ============================================= */
typedef enum {                                  /*!< SSG_0_CONTROL_EX2INVEN                                                    */
  SSG_0_CONTROL_EX2INVEN_NORMAL        = 0,     /*!< NORMAL : Do not invert the Pulse Generator output on EX2.                 */
  SSG_0_CONTROL_EX2INVEN_INVERT        = 1,     /*!< INVERT : Invert the Pulse Generator output on EX2.                        */
} SSG_0_CONTROL_EX2INVEN_Enum;

/* =============================================  SSG_0 CONTROL EX3INVEN [3..3]  ============================================= */
typedef enum {                                  /*!< SSG_0_CONTROL_EX3INVEN                                                    */
  SSG_0_CONTROL_EX3INVEN_NORMAL        = 0,     /*!< NORMAL : Do not invert the Pulse Generator output on EX3.                 */
  SSG_0_CONTROL_EX3INVEN_INVERT        = 1,     /*!< INVERT : Invert the Pulse Generator output on EX3.                        */
} SSG_0_CONTROL_EX3INVEN_Enum;

/* ==============================================  SSG_0 CONTROL EX0EN [4..4]  =============================================== */
typedef enum {                                  /*!< SSG_0_CONTROL_EX0EN                                                       */
  SSG_0_CONTROL_EX0EN_DISABLED         = 0,     /*!< DISABLED : Disable the EX0 Pulse Generator output.                        */
  SSG_0_CONTROL_EX0EN_ENABLED          = 1,     /*!< ENABLED : Enable the EX0 Pulse Generator output.                          */
} SSG_0_CONTROL_EX0EN_Enum;

/* ==============================================  SSG_0 CONTROL EX1EN [5..5]  =============================================== */
typedef enum {                                  /*!< SSG_0_CONTROL_EX1EN                                                       */
  SSG_0_CONTROL_EX1EN_DISABLED         = 0,     /*!< DISABLED : Disable the EX1 Pulse Generator output.                        */
  SSG_0_CONTROL_EX1EN_ENABLED          = 1,     /*!< ENABLED : Enable the EX1 Pulse Generator output.                          */
} SSG_0_CONTROL_EX1EN_Enum;

/* ==============================================  SSG_0 CONTROL EX2EN [6..6]  =============================================== */
typedef enum {                                  /*!< SSG_0_CONTROL_EX2EN                                                       */
  SSG_0_CONTROL_EX2EN_DISABLED         = 0,     /*!< DISABLED : Disable the EX2 Pulse Generator output.                        */
  SSG_0_CONTROL_EX2EN_ENABLED          = 1,     /*!< ENABLED : Enable the EX2 Pulse Generator output.                          */
} SSG_0_CONTROL_EX2EN_Enum;

/* ==============================================  SSG_0 CONTROL EX3EN [7..7]  =============================================== */
typedef enum {                                  /*!< SSG_0_CONTROL_EX3EN                                                       */
  SSG_0_CONTROL_EX3EN_DISABLED         = 0,     /*!< DISABLED : Disable the EX3 Pulse Generator output.                        */
  SSG_0_CONTROL_EX3EN_ENABLED          = 1,     /*!< ENABLED : Enable the EX3 Pulse Generator output.                          */
} SSG_0_CONTROL_EX3EN_Enum;

/* ==============================================  SSG_0 CONTROL STATUS [8..8]  ============================================== */
typedef enum {                                  /*!< SSG_0_CONTROL_STATUS                                                      */
  SSG_0_CONTROL_STATUS_IDLE            = 0,     /*!< IDLE : The SSG module is idle and the Pulse Generator is not
                                                     operating.                                                                */
  SSG_0_CONTROL_STATUS_ACTIVE          = 1,     /*!< ACTIVE : The SSG module is active and the Pulse Generator is
                                                     counting.                                                                 */
} SSG_0_CONTROL_STATUS_Enum;



/* =========================================================================================================================== */
/* ================                                          TIMER_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* ==============================================  TIMER_0 CONFIG LCLK [0..1]  =============================================== */
typedef enum {                                  /*!< TIMER_0_CONFIG_LCLK                                                       */
  TIMER_0_CONFIG_LCLK_APB              = 0,     /*!< APB : Select the APB clock as the timer source.                           */
  TIMER_0_CONFIG_LCLK_EXTOSCN          = 1,     /*!< EXTOSCN : Select the external oscillator clock as the timer
                                                     source. The external oscillator must run slower than one-half
                                                     the APB clock.                                                            */
  TIMER_0_CONFIG_LCLK_TIMER_CLKDIV     = 2,     /*!< TIMER_CLKDIV : Select the dedicated 8-bit prescaler as the timer
                                                     source.                                                                   */
  TIMER_0_CONFIG_LCLK_CT_FALLING_EDGE  = 3,     /*!< CT_FALLING_EDGE : Select falling edges of the CT signal as the
                                                     timer clock source.                                                       */
} TIMER_0_CONFIG_LCLK_Enum;

/* =============================================  TIMER_0 CONFIG LMSTREN [4..4]  ============================================= */
typedef enum {                                  /*!< TIMER_0_CONFIG_LMSTREN                                                    */
  TIMER_0_CONFIG_LMSTREN_DISABLED      = 0,     /*!< DISABLED : MSTRUN does not need to be set for the low timer
                                                     to run.                                                                   */
  TIMER_0_CONFIG_LMSTREN_ENABLED       = 1,     /*!< ENABLED : MSTRUN must be set for the low timer to run.                    */
} TIMER_0_CONFIG_LMSTREN_Enum;

