chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  TIMER_0 CONFIG DBGMD [21..21]  ============================================= */
typedef enum {                                  /*!< TIMER_0_CONFIG_DBGMD                                                      */
  TIMER_0_CONFIG_DBGMD_RUN             = 0,     /*!< RUN : The Timer will continue to operate while the core is halted
                                                     in debug mode.                                                            */
  TIMER_0_CONFIG_DBGMD_HALT            = 1,     /*!< HALT : A debug breakpoint will cause the Timer to halt.                   */
} TIMER_0_CONFIG_DBGMD_Enum;

/* ============================================  TIMER_0 CONFIG HEXIEN [22..22]  ============================================= */
typedef enum {                                  /*!< TIMER_0_CONFIG_HEXIEN                                                     */
  TIMER_0_CONFIG_HEXIEN_DISABLED       = 0,     /*!< DISABLED : The state of the HEXI flag does not affect the high
                                                     timer interrupt.                                                          */
  TIMER_0_CONFIG_HEXIEN_ENABLED        = 1,     /*!< ENABLED : A high timer interrupt request is generated if HEXI
                                                     is set to 1.                                                              */
} TIMER_0_CONFIG_HEXIEN_Enum;

/* ============================================  TIMER_0 CONFIG HOVFIEN [23..23]  ============================================ */
typedef enum {                                  /*!< TIMER_0_CONFIG_HOVFIEN                                                    */
  TIMER_0_CONFIG_HOVFIEN_DISABLED      = 0,     /*!< DISABLED : The state of HOVFI does not affect the high timer
                                                     interrupt.                                                                */
  TIMER_0_CONFIG_HOVFIEN_ENABLED       = 1,     /*!< ENABLED : A high timer interrupt request is generated if HOVFI
                                                     is set to 1.                                                              */
} TIMER_0_CONFIG_HOVFIEN_Enum;

/* ==============================================  TIMER_0 CONFIG HMD [24..27]  ============================================== */
typedef enum {                                  /*!< TIMER_0_CONFIG_HMD                                                        */
  TIMER_0_CONFIG_HMD_AUTO_RELOAD       = 0,     /*!< AUTO_RELOAD : The high 16-bit timer or entire 32-bit timer is
                                                     in Auto-Reload Mode.                                                      */
  TIMER_0_CONFIG_HMD_UP_DOWN           = 1,     /*!< UP_DOWN : The high 16-bit timer or entire 32-bit timer is in
                                                     Up/Down Count Mode.                                                       */
  TIMER_0_CONFIG_HMD_FALL_CAPTURE      = 2,     /*!< FALL_CAPTURE : The high 16-bit timer or entire 32-bit timer
                                                     is in Falling Edge Capture Mode.                                          */
  TIMER_0_CONFIG_HMD_RISE_CAPTURE      = 3,     /*!< RISE_CAPTURE : The high 16-bit timer or entire 32-bit timer
                                                     is in Rising Edge Capture Mode.                                           */
  TIMER_0_CONFIG_HMD_LOW_CAPTURE       = 4,     /*!< LOW_CAPTURE : The high 16-bit timer or entire 32-bit timer is
                                                     in Low Time Capture Mode.                                                 */
  TIMER_0_CONFIG_HMD_HIGH_CAPTURE      = 5,     /*!< HIGH_CAPTURE : The high 16-bit timer or entire 32-bit timer
                                                     is in High Time Capture Mode.                                             */
  TIMER_0_CONFIG_HMD_DC_CAPTURE        = 6,     /*!< DC_CAPTURE : The high 16-bit timer or entire 32-bit timer is
                                                     in Duty Cycle Capture Mode.                                               */
  TIMER_0_CONFIG_HMD_ONESHOT           = 7,     /*!< ONESHOT : The high 16-bit timer or entire 32-bit timer is in
                                                     Oneshot Mode.                                                             */
  TIMER_0_CONFIG_HMD_TOGGLE            = 8,     /*!< TOGGLE : The high 16-bit timer or entire 32-bit timer is in
                                                     Toggle Output Mode.                                                       */
  TIMER_0_CONFIG_HMD_PWM               = 9,     /*!< PWM : The high 16-bit timer or entire 32-bit timer is in PWM
                                                     Mode.                                                                     */
} TIMER_0_CONFIG_HMD_Enum;

/* ============================================  TIMER_0 CONFIG HSTATE [28..28]  ============================================= */
typedef enum {                                  /*!< TIMER_0_CONFIG_HSTATE                                                     */
  TIMER_0_CONFIG_HSTATE_NOT_SET        = 0,     /*!< NOT_SET : NOT_SET                                                         */
  TIMER_0_CONFIG_HSTATE_SET            = 1,     /*!< SET : SET                                                                 */
} TIMER_0_CONFIG_HSTATE_Enum;

/* =============================================  TIMER_0 CONFIG HRUN [29..29]  ============================================== */
typedef enum {                                  /*!< TIMER_0_CONFIG_HRUN                                                       */
  TIMER_0_CONFIG_HRUN_STOP             = 0,     /*!< STOP : Stop the high timer or entire 32-bit timer.                        */
  TIMER_0_CONFIG_HRUN_START            = 1,     /*!< START : The high timer runs if HMSTREN = 0 or MSTRUN = 1. The
                                                     full 32-bit timer runs if split mode is disabled and (HMSTREN
                                                     = 0 or MSTRUN = 1).                                                       */
} TIMER_0_CONFIG_HRUN_Enum;

