chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  TIMER_0 CONFIG HEXI [30..30]  ============================================== */
typedef enum {                                  /*!< TIMER_0_CONFIG_HEXI                                                       */
  TIMER_0_CONFIG_HEXI_NOT_SET          = 0,     /*!< NOT_SET : Read: A high timer extra interrupt is not pending.
                                                     Write: Clear the interrupt.                                               */
  TIMER_0_CONFIG_HEXI_SET              = 1,     /*!< SET : Read: Indicates the high 16-bit timer (or 32-bit timer
                                                     if SPLITEN = 0) has been captured, reloaded with all 1's
                                                     when counting down, or the timer matched the capture register
                                                     in PWM mode. This interrupt flag can be set by the timer
                                                     module in all modes except Auto-Reload and Toggle. Write:
                                                     Force a high timer extra interrupt.                                       */
} TIMER_0_CONFIG_HEXI_Enum;

/* =============================================  TIMER_0 CONFIG HOVFI [31..31]  ============================================= */
typedef enum {                                  /*!< TIMER_0_CONFIG_HOVFI                                                      */
  TIMER_0_CONFIG_HOVFI_NOT_SET         = 0,     /*!< NOT_SET : Read: A high timer overflow interrupt is not pending.
                                                     Write: Clear the interrupt.                                               */
  TIMER_0_CONFIG_HOVFI_SET             = 1,     /*!< SET : Read: If split mode is enabled (SPLITEN = 1), this value
                                                     indicates the high 16-bit timer has wrapped or reloaded
                                                     after reaching all 1's. If split mode is disabled (SPLITEN
                                                     = 0), this value indicates the 32-bit timer has wrapped
                                                     or reloaded after reaching all 1's. The timer module can
                                                     set this bit in all modes. Write: Force a high timer overflow
                                                     interrupt.                                                                */
} TIMER_0_CONFIG_HOVFI_Enum;

/* ========================================================  CLKDIV  ========================================================= */
/* =========================================================  COUNT  ========================================================= */
/* ========================================================  CAPTURE  ======================================================== */


/* =========================================================================================================================== */
/* ================                                          TIMER_1                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* ==============================================  TIMER_1 CONFIG LCLK [0..1]  =============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_LCLK                                                       */
  TIMER_1_CONFIG_LCLK_APB              = 0,     /*!< APB : Select the APB clock as the timer source.                           */
  TIMER_1_CONFIG_LCLK_EXTOSCN          = 1,     /*!< EXTOSCN : Select the external oscillator clock as the timer
                                                     source. The external oscillator must run slower than one-half
                                                     the APB clock.                                                            */
  TIMER_1_CONFIG_LCLK_TIMER_CLKDIV     = 2,     /*!< TIMER_CLKDIV : Select the dedicated 8-bit prescaler as the timer
                                                     source.                                                                   */
  TIMER_1_CONFIG_LCLK_CT_FALLING_EDGE  = 3,     /*!< CT_FALLING_EDGE : Select falling edges of the CT signal as the
                                                     timer clock source.                                                       */
} TIMER_1_CONFIG_LCLK_Enum;

/* =============================================  TIMER_1 CONFIG LMSTREN [4..4]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_LMSTREN                                                    */
  TIMER_1_CONFIG_LMSTREN_DISABLED      = 0,     /*!< DISABLED : MSTRUN does not need to be set for the low timer
                                                     to run.                                                                   */
  TIMER_1_CONFIG_LMSTREN_ENABLED       = 1,     /*!< ENABLED : MSTRUN must be set for the low timer to run.                    */
} TIMER_1_CONFIG_LMSTREN_Enum;

/* =============================================  TIMER_1 CONFIG SPLITEN [5..5]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_SPLITEN                                                    */
  TIMER_1_CONFIG_SPLITEN_DISABLED      = 0,     /*!< DISABLED : The timer operates as a single 32-bit timer controlled
                                                     by the high timer fields.                                                 */
  TIMER_1_CONFIG_SPLITEN_ENABLED       = 1,     /*!< ENABLED : The timer operates as two independent 16-bit timers.            */
} TIMER_1_CONFIG_SPLITEN_Enum;

/* =============================================  TIMER_1 CONFIG LEXIEN [6..6]  ============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_LEXIEN                                                     */
  TIMER_1_CONFIG_LEXIEN_DISABLED       = 0,     /*!< DISABLED : The state of the LEXI flag does not affect the low
                                                     timer interrupt.                                                          */
  TIMER_1_CONFIG_LEXIEN_ENABLED        = 1,     /*!< ENABLED : A low timer interrupt request is generated if LEXI
                                                     is set to 1.                                                              */
} TIMER_1_CONFIG_LEXIEN_Enum;

/* =============================================  TIMER_1 CONFIG LOVFIEN [7..7]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_LOVFIEN                                                    */
  TIMER_1_CONFIG_LOVFIEN_DISABLED      = 0,     /*!< DISABLED : The state of LOVFI does not affect the low timer
                                                     interrupt.                                                                */
  TIMER_1_CONFIG_LOVFIEN_ENABLED       = 1,     /*!< ENABLED : A low timer interrupt request is generated if LOVFI
                                                     = 1.                                                                      */
} TIMER_1_CONFIG_LOVFIEN_Enum;

/* ==============================================  TIMER_1 CONFIG LMD [8..10]  =============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_LMD                                                        */
  TIMER_1_CONFIG_LMD_AUTO_RELOAD       = 0,     /*!< AUTO_RELOAD : The low timer is in Auto-Reload Mode.                       */
  TIMER_1_CONFIG_LMD_UP_DOWN           = 1,     /*!< UP_DOWN : The low timer is in Up/Down Count Mode.                         */
  TIMER_1_CONFIG_LMD_FALL_CAPTURE      = 2,     /*!< FALL_CAPTURE : The low timer is in Falling Edge Capture Mode.             */
  TIMER_1_CONFIG_LMD_RISE_CAPTURE      = 3,     /*!< RISE_CAPTURE : The low timer is in Rising Edge Capture Mode.              */
  TIMER_1_CONFIG_LMD_LOW_CAPTURE       = 4,     /*!< LOW_CAPTURE : The low timer is in Low Time Capture Mode.                  */
  TIMER_1_CONFIG_LMD_HIGH_CAPTURE      = 5,     /*!< HIGH_CAPTURE : The low timer is in High Time Capture Mode.                */
  TIMER_1_CONFIG_LMD_DC_CAPTURE        = 6,     /*!< DC_CAPTURE : The low timer is in Duty Cycle Capture Mode.                 */
  TIMER_1_CONFIG_LMD_ONESHOT           = 7,     /*!< ONESHOT : The low timer is in Oneshot Mode.                               */
} TIMER_1_CONFIG_LMD_Enum;

/* ============================================  TIMER_1 CONFIG LSTATE [12..12]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_LSTATE                                                     */
  TIMER_1_CONFIG_LSTATE_NOT_SET        = 0,     /*!< NOT_SET : NOT_SET                                                         */
  TIMER_1_CONFIG_LSTATE_SET            = 1,     /*!< SET : SET                                                                 */
} TIMER_1_CONFIG_LSTATE_Enum;

/* =============================================  TIMER_1 CONFIG LRUN [13..13]  ============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_LRUN                                                       */
  TIMER_1_CONFIG_LRUN_STOP             = 0,     /*!< STOP : Stop the low timer if split mode is enabled (SPLITEN
                                                     = 1).                                                                     */
  TIMER_1_CONFIG_LRUN_START            = 1,     /*!< START : The low timer runs if split mode is enabled (SPLITEN
                                                     = 1) and (LMSTREN = 0 or MSTRUN = 1).                                     */
} TIMER_1_CONFIG_LRUN_Enum;

/* =============================================  TIMER_1 CONFIG LEXI [14..14]  ============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_LEXI                                                       */
  TIMER_1_CONFIG_LEXI_NOT_SET          = 0,     /*!< NOT_SET : Read: A low timer extra interrupt is not pending.
                                                     Write: Clear the interrupt.                                               */
  TIMER_1_CONFIG_LEXI_SET              = 1,     /*!< SET : Read: Indicates the low 16-bit timer has been captured,
                                                     reloaded with all 1's when counting down, or the timer
                                                     matched the capture register in PWM mode. This interrupt
                                                     flag can be set by hardware in all modes except Auto-Reload
                                                     and Toggle. This flag is not set by hardware when split
                                                     mode is disabled (SPLITEN = 0). Write: Force a low timer
                                                     extra interrupt.                                                          */
} TIMER_1_CONFIG_LEXI_Enum;

