chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  TIMER_1 CONFIG LOVFI [15..15]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_LOVFI                                                      */
  TIMER_1_CONFIG_LOVFI_NOT_SET         = 0,     /*!< NOT_SET : Read: A low timer overflow interrupt is not pending.
                                                     Write: Clear the interrupt.                                               */
  TIMER_1_CONFIG_LOVFI_SET             = 1,     /*!< SET : Read: The low 16-bit timer has wrapped or reloaded after
                                                     reaching all 1's. This bit is set by the module regardless
                                                     of the state of SPLITEN and can be set in all modes. Write:
                                                     Force a low timer overflow interrupt.                                     */
} TIMER_1_CONFIG_LOVFI_Enum;

/* =============================================  TIMER_1 CONFIG HCLK [16..17]  ============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_HCLK                                                       */
  TIMER_1_CONFIG_HCLK_APB              = 0,     /*!< APB : Select the APB clock as the timer source.                           */
  TIMER_1_CONFIG_HCLK_EXTOSCN          = 1,     /*!< EXTOSCN : Select the external oscillator clock as the timer
                                                     source. The external oscillator must run slower than one-half
                                                     the APB clock.                                                            */
  TIMER_1_CONFIG_HCLK_TIMER_CLKDIV     = 2,     /*!< TIMER_CLKDIV : Select the dedicated 8-bit prescaler as the timer
                                                     source.                                                                   */
  TIMER_1_CONFIG_HCLK_CT_FALLING_EDGE  = 3,     /*!< CT_FALLING_EDGE : Select falling edges of the CT signal as the
                                                     timer clock source.                                                       */
} TIMER_1_CONFIG_HCLK_Enum;

/* ============================================  TIMER_1 CONFIG MSTRUN [19..19]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_MSTRUN                                                     */
  TIMER_1_CONFIG_MSTRUN_STOP           = 0,     /*!< STOP : Disable the master run control for all timers.                     */
  TIMER_1_CONFIG_MSTRUN_START          = 1,     /*!< START : Enable the master run control for all timers.                     */
} TIMER_1_CONFIG_MSTRUN_Enum;

/* ============================================  TIMER_1 CONFIG HMSTREN [20..20]  ============================================ */
typedef enum {                                  /*!< TIMER_1_CONFIG_HMSTREN                                                    */
  TIMER_1_CONFIG_HMSTREN_DISABLED      = 0,     /*!< DISABLED : MSTRUN does not need to be set for the high timer
                                                     to run.                                                                   */
  TIMER_1_CONFIG_HMSTREN_ENABLED       = 1,     /*!< ENABLED : MSTRUN must be set for the high timer to run.                   */
} TIMER_1_CONFIG_HMSTREN_Enum;

/* =============================================  TIMER_1 CONFIG DBGMD [21..21]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_DBGMD                                                      */
  TIMER_1_CONFIG_DBGMD_RUN             = 0,     /*!< RUN : The Timer will continue to operate while the core is halted
                                                     in debug mode.                                                            */
  TIMER_1_CONFIG_DBGMD_HALT            = 1,     /*!< HALT : A debug breakpoint will cause the Timer to halt.                   */
} TIMER_1_CONFIG_DBGMD_Enum;

/* ============================================  TIMER_1 CONFIG HEXIEN [22..22]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_HEXIEN                                                     */
  TIMER_1_CONFIG_HEXIEN_DISABLED       = 0,     /*!< DISABLED : The state of the HEXI flag does not affect the high
                                                     timer interrupt.                                                          */
  TIMER_1_CONFIG_HEXIEN_ENABLED        = 1,     /*!< ENABLED : A high timer interrupt request is generated if HEXI
                                                     is set to 1.                                                              */
} TIMER_1_CONFIG_HEXIEN_Enum;

/* ============================================  TIMER_1 CONFIG HOVFIEN [23..23]  ============================================ */
typedef enum {                                  /*!< TIMER_1_CONFIG_HOVFIEN                                                    */
  TIMER_1_CONFIG_HOVFIEN_DISABLED      = 0,     /*!< DISABLED : The state of HOVFI does not affect the high timer
                                                     interrupt.                                                                */
  TIMER_1_CONFIG_HOVFIEN_ENABLED       = 1,     /*!< ENABLED : A high timer interrupt request is generated if HOVFI
                                                     is set to 1.                                                              */
} TIMER_1_CONFIG_HOVFIEN_Enum;

/* ==============================================  TIMER_1 CONFIG HMD [24..27]  ============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_HMD                                                        */
  TIMER_1_CONFIG_HMD_AUTO_RELOAD       = 0,     /*!< AUTO_RELOAD : The high 16-bit timer or entire 32-bit timer is
                                                     in Auto-Reload Mode.                                                      */
  TIMER_1_CONFIG_HMD_UP_DOWN           = 1,     /*!< UP_DOWN : The high 16-bit timer or entire 32-bit timer is in
                                                     Up/Down Count Mode.                                                       */
  TIMER_1_CONFIG_HMD_FALL_CAPTURE      = 2,     /*!< FALL_CAPTURE : The high 16-bit timer or entire 32-bit timer
                                                     is in Falling Edge Capture Mode.                                          */
  TIMER_1_CONFIG_HMD_RISE_CAPTURE      = 3,     /*!< RISE_CAPTURE : The high 16-bit timer or entire 32-bit timer
                                                     is in Rising Edge Capture Mode.                                           */
  TIMER_1_CONFIG_HMD_LOW_CAPTURE       = 4,     /*!< LOW_CAPTURE : The high 16-bit timer or entire 32-bit timer is
                                                     in Low Time Capture Mode.                                                 */
  TIMER_1_CONFIG_HMD_HIGH_CAPTURE      = 5,     /*!< HIGH_CAPTURE : The high 16-bit timer or entire 32-bit timer
                                                     is in High Time Capture Mode.                                             */
  TIMER_1_CONFIG_HMD_DC_CAPTURE        = 6,     /*!< DC_CAPTURE : The high 16-bit timer or entire 32-bit timer is
                                                     in Duty Cycle Capture Mode.                                               */
  TIMER_1_CONFIG_HMD_ONESHOT           = 7,     /*!< ONESHOT : The high 16-bit timer or entire 32-bit timer is in
                                                     Oneshot Mode.                                                             */
  TIMER_1_CONFIG_HMD_TOGGLE            = 8,     /*!< TOGGLE : The high 16-bit timer or entire 32-bit timer is in
                                                     Toggle Output Mode.                                                       */
  TIMER_1_CONFIG_HMD_PWM               = 9,     /*!< PWM : The high 16-bit timer or entire 32-bit timer is in PWM
                                                     Mode.                                                                     */
} TIMER_1_CONFIG_HMD_Enum;

