chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  TIMER_1 CONFIG HSTATE [28..28]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_HSTATE                                                     */
  TIMER_1_CONFIG_HSTATE_NOT_SET        = 0,     /*!< NOT_SET : NOT_SET                                                         */
  TIMER_1_CONFIG_HSTATE_SET            = 1,     /*!< SET : SET                                                                 */
} TIMER_1_CONFIG_HSTATE_Enum;

/* =============================================  TIMER_1 CONFIG HRUN [29..29]  ============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_HRUN                                                       */
  TIMER_1_CONFIG_HRUN_STOP             = 0,     /*!< STOP : Stop the high timer or entire 32-bit timer.                        */
  TIMER_1_CONFIG_HRUN_START            = 1,     /*!< START : The high timer runs if HMSTREN = 0 or MSTRUN = 1. The
                                                     full 32-bit timer runs if split mode is disabled and (HMSTREN
                                                     = 0 or MSTRUN = 1).                                                       */
} TIMER_1_CONFIG_HRUN_Enum;

/* =============================================  TIMER_1 CONFIG HEXI [30..30]  ============================================== */
typedef enum {                                  /*!< TIMER_1_CONFIG_HEXI                                                       */
  TIMER_1_CONFIG_HEXI_NOT_SET          = 0,     /*!< NOT_SET : Read: A high timer extra interrupt is not pending.
                                                     Write: Clear the interrupt.                                               */
  TIMER_1_CONFIG_HEXI_SET              = 1,     /*!< SET : Read: Indicates the high 16-bit timer (or 32-bit timer
                                                     if SPLITEN = 0) has been captured, reloaded with all 1's
                                                     when counting down, or the timer matched the capture register
                                                     in PWM mode. This interrupt flag can be set by the timer
                                                     module in all modes except Auto-Reload and Toggle. Write:
                                                     Force a high timer extra interrupt.                                       */
} TIMER_1_CONFIG_HEXI_Enum;

/* =============================================  TIMER_1 CONFIG HOVFI [31..31]  ============================================= */
typedef enum {                                  /*!< TIMER_1_CONFIG_HOVFI                                                      */
  TIMER_1_CONFIG_HOVFI_NOT_SET         = 0,     /*!< NOT_SET : Read: A high timer overflow interrupt is not pending.
                                                     Write: Clear the interrupt.                                               */
  TIMER_1_CONFIG_HOVFI_SET             = 1,     /*!< SET : Read: If split mode is enabled (SPLITEN = 1), this value
                                                     indicates the high 16-bit timer has wrapped or reloaded
                                                     after reaching all 1's. If split mode is disabled (SPLITEN
                                                     = 0), this value indicates the 32-bit timer has wrapped
                                                     or reloaded after reaching all 1's. The timer module can
                                                     set this bit in all modes. Write: Force a high timer overflow
                                                     interrupt.                                                                */
} TIMER_1_CONFIG_HOVFI_Enum;

/* ========================================================  CLKDIV  ========================================================= */
/* =========================================================  COUNT  ========================================================= */
/* ========================================================  CAPTURE  ======================================================== */


/* =========================================================================================================================== */
/* ================                                          UART_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* =============================================  UART_0 CONFIG RSTRTEN [0..0]  ============================================== */
typedef enum {                                  /*!< UART_0_CONFIG_RSTRTEN                                                     */
  UART_0_CONFIG_RSTRTEN_DISABLED       = 0,     /*!< DISABLED : Do not expect a start bit during receptions.                   */
  UART_0_CONFIG_RSTRTEN_ENABLED        = 1,     /*!< ENABLED : Expect a start bit during receptions.                           */
} UART_0_CONFIG_RSTRTEN_Enum;

/* ==============================================  UART_0 CONFIG RPAREN [1..1]  ============================================== */
typedef enum {                                  /*!< UART_0_CONFIG_RPAREN                                                      */
  UART_0_CONFIG_RPAREN_DISABLED        = 0,     /*!< DISABLED : Do not expect a parity bit during receptions.                  */
  UART_0_CONFIG_RPAREN_ENABLED         = 1,     /*!< ENABLED : Expect a parity bit during receptions.                          */
} UART_0_CONFIG_RPAREN_Enum;

/* ==============================================  UART_0 CONFIG RSTPEN [2..2]  ============================================== */
typedef enum {                                  /*!< UART_0_CONFIG_RSTPEN                                                      */
  UART_0_CONFIG_RSTPEN_DISABLED        = 0,     /*!< DISABLED : Do not expect stop bits during receptions.                     */
  UART_0_CONFIG_RSTPEN_ENABLED         = 1,     /*!< ENABLED : Expect stop bits during receptions.                             */
} UART_0_CONFIG_RSTPEN_Enum;

/* ==============================================  UART_0 CONFIG RSTPMD [3..4]  ============================================== */
typedef enum {                                  /*!< UART_0_CONFIG_RSTPMD                                                      */
  UART_0_CONFIG_RSTPMD_0P5_STOP        = 0,     /*!< 0P5_STOP : 0.5 stop bit.                                                  */
  UART_0_CONFIG_RSTPMD_1_STOP          = 1,     /*!< 1_STOP : 1 stop bit.                                                      */
  UART_0_CONFIG_RSTPMD_1P5_STOP        = 2,     /*!< 1P5_STOP : 1.5 stop bits.                                                 */
  UART_0_CONFIG_RSTPMD_2_STOP          = 3,     /*!< 2_STOP : 2 stop bits.                                                     */
} UART_0_CONFIG_RSTPMD_Enum;

