chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  UART_0 CONFIG RPARMD [5..6]  ============================================== */
typedef enum {                                  /*!< UART_0_CONFIG_RPARMD                                                      */
  UART_0_CONFIG_RPARMD_ODD             = 0,     /*!< ODD : Odd Parity.                                                         */
  UART_0_CONFIG_RPARMD_EVEN            = 1,     /*!< EVEN : Even Parity.                                                       */
  UART_0_CONFIG_RPARMD_MARK            = 2,     /*!< MARK : Set (Parity = 1).                                                  */
  UART_0_CONFIG_RPARMD_SPACE           = 3,     /*!< SPACE : Clear (Parity = 0).                                               */
} UART_0_CONFIG_RPARMD_Enum;

/* =============================================  UART_0 CONFIG RDATLN [8..10]  ============================================== */
typedef enum {                                  /*!< UART_0_CONFIG_RDATLN                                                      */
  UART_0_CONFIG_RDATLN_5_BITS          = 0,     /*!< 5_BITS : 5 bits.                                                          */
  UART_0_CONFIG_RDATLN_6_BITS          = 1,     /*!< 6_BITS : 6 bits.                                                          */
  UART_0_CONFIG_RDATLN_7_BITS          = 2,     /*!< 7_BITS : 7 bits.                                                          */
  UART_0_CONFIG_RDATLN_8_BITS          = 3,     /*!< 8_BITS : 8 bits.                                                          */
  UART_0_CONFIG_RDATLN_9_BITS_STORED   = 4,     /*!< 9_BITS_STORED : 9 bits. The 9th bit is stored in the FIFO (normal
                                                     mode).                                                                    */
  UART_0_CONFIG_RDATLN_9_BITS_MATCH    = 5,     /*!< 9_BITS_MATCH : 9 bits. The 9th bit is not stored in the FIFO
                                                     (fixed mode). This mode is used when the 9th bit is only
                                                     used for match operations (see MATMD).                                    */
} UART_0_CONFIG_RDATLN_Enum;

/* =============================================  UART_0 CONFIG RSCEN [12..12]  ============================================== */
typedef enum {                                  /*!< UART_0_CONFIG_RSCEN                                                       */
  UART_0_CONFIG_RSCEN_DISABLED         = 0,     /*!< DISABLED : The receiver does not send a Smartcard parity error
                                                     response.                                                                 */
  UART_0_CONFIG_RSCEN_ENABLED          = 1,     /*!< ENABLED : The receiver sends a Smartcard Parity response.                 */
} UART_0_CONFIG_RSCEN_Enum;

/* ============================================  UART_0 CONFIG RIRDAEN [13..13]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_RIRDAEN                                                     */
  UART_0_CONFIG_RIRDAEN_DISABLED       = 0,     /*!< DISABLED : The receiver does not operate in IrDA mode.                    */
  UART_0_CONFIG_RIRDAEN_ENABLED        = 1,     /*!< ENABLED : The receiver operates in IrDA mode.                             */
} UART_0_CONFIG_RIRDAEN_Enum;

/* =============================================  UART_0 CONFIG RINVEN [14..14]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_RINVEN                                                      */
  UART_0_CONFIG_RINVEN_DISABLED        = 0,     /*!< DISABLED : Do not invert the RX pin signals (the RX idle state
                                                     is high).                                                                 */
  UART_0_CONFIG_RINVEN_ENABLED         = 1,     /*!< ENABLED : Invert the RX pin signals (the RX idle state is low).           */
} UART_0_CONFIG_RINVEN_Enum;

/* ============================================  UART_0 CONFIG TSTRTEN [16..16]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_TSTRTEN                                                     */
  UART_0_CONFIG_TSTRTEN_DISABLED       = 0,     /*!< DISABLED : Do not generate a start bit during transmissions.              */
  UART_0_CONFIG_TSTRTEN_ENABLED        = 1,     /*!< ENABLED : Generate a start bit during transmissions.                      */
} UART_0_CONFIG_TSTRTEN_Enum;

/* =============================================  UART_0 CONFIG TPAREN [17..17]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_TPAREN                                                      */
  UART_0_CONFIG_TPAREN_DISABLED        = 0,     /*!< DISABLED : Do not send a parity bit during transmissions.                 */
  UART_0_CONFIG_TPAREN_ENABLED         = 1,     /*!< ENABLED : Send a parity bit during transmissions.                         */
} UART_0_CONFIG_TPAREN_Enum;

/* =============================================  UART_0 CONFIG TSTPEN [18..18]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_TSTPEN                                                      */
  UART_0_CONFIG_TSTPEN_DISABLED        = 0,     /*!< DISABLED : Do not send stop bits during transmissions.                    */
  UART_0_CONFIG_TSTPEN_ENABLED         = 1,     /*!< ENABLED : Send stop bits during transmissions.                            */
} UART_0_CONFIG_TSTPEN_Enum;

/* =============================================  UART_0 CONFIG TSTPMD [19..20]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_TSTPMD                                                      */
  UART_0_CONFIG_TSTPMD_0P5_STOP        = 0,     /*!< 0P5_STOP : 0.5 stop bit.                                                  */
  UART_0_CONFIG_TSTPMD_1_STOP          = 1,     /*!< 1_STOP : 1 stop bit.                                                      */
  UART_0_CONFIG_TSTPMD_1P5_STOP        = 2,     /*!< 1P5_STOP : 1.5 stop bits.                                                 */
  UART_0_CONFIG_TSTPMD_2_STOP          = 3,     /*!< 2_STOP : 2 stop bits.                                                     */
} UART_0_CONFIG_TSTPMD_Enum;

