chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  UART_0 CONFIG TPARMD [21..22]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_TPARMD                                                      */
  UART_0_CONFIG_TPARMD_ODD             = 0,     /*!< ODD : Odd Parity.                                                         */
  UART_0_CONFIG_TPARMD_EVEN            = 1,     /*!< EVEN : Even Parity.                                                       */
  UART_0_CONFIG_TPARMD_MARK            = 2,     /*!< MARK : Set (Parity = 1).                                                  */
  UART_0_CONFIG_TPARMD_SPACE           = 3,     /*!< SPACE : Clear (Parity = 0).                                               */
} UART_0_CONFIG_TPARMD_Enum;

/* =============================================  UART_0 CONFIG TDATLN [24..26]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_TDATLN                                                      */
  UART_0_CONFIG_TDATLN_5_BITS          = 0,     /*!< 5_BITS : 5 bits.                                                          */
  UART_0_CONFIG_TDATLN_6_BITS          = 1,     /*!< 6_BITS : 6 bits.                                                          */
  UART_0_CONFIG_TDATLN_7_BITS          = 2,     /*!< 7_BITS : 7 bits.                                                          */
  UART_0_CONFIG_TDATLN_8_BITS          = 3,     /*!< 8_BITS : 8 bits.                                                          */
  UART_0_CONFIG_TDATLN_9_BITS_FIFO     = 4,     /*!< 9_BITS_FIFO : 9 bits. The 9th bit is taken from the FIFO data
                                                     (normal mode).                                                            */
  UART_0_CONFIG_TDATLN_9_BITS_TBIT     = 5,     /*!< 9_BITS_TBIT : 9 bits. The 9th bit is set by the value of TBIT
                                                     (fixed mode).                                                             */
} UART_0_CONFIG_TDATLN_Enum;

/* =============================================  UART_0 CONFIG TSCEN [28..28]  ============================================== */
typedef enum {                                  /*!< UART_0_CONFIG_TSCEN                                                       */
  UART_0_CONFIG_TSCEN_DISABLED         = 0,     /*!< DISABLED : The transmitter does not check for a Smartcard parity
                                                     error response.                                                           */
  UART_0_CONFIG_TSCEN_ENABLED          = 1,     /*!< ENABLED : The transmitter checks for a Smartcard parity error
                                                     response.                                                                 */
} UART_0_CONFIG_TSCEN_Enum;

/* ============================================  UART_0 CONFIG TIRDAEN [29..29]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_TIRDAEN                                                     */
  UART_0_CONFIG_TIRDAEN_DISABLED       = 0,     /*!< DISABLED : Disable IrDA transmit mode.                                    */
  UART_0_CONFIG_TIRDAEN_ENABLED        = 1,     /*!< ENABLED : Enable IrDA transmit mode.                                      */
} UART_0_CONFIG_TIRDAEN_Enum;

/* =============================================  UART_0 CONFIG TINVEN [30..30]  ============================================= */
typedef enum {                                  /*!< UART_0_CONFIG_TINVEN                                                      */
  UART_0_CONFIG_TINVEN_DISABLED        = 0,     /*!< DISABLED : Do not invert the TX pin signals (the TX idle state
                                                     is high).                                                                 */
  UART_0_CONFIG_TINVEN_ENABLED         = 1,     /*!< ENABLED : Invert the TX pin signals (the TX idle state is low).           */
} UART_0_CONFIG_TINVEN_Enum;

/* ======================================================  CONFIG_SET  ======================================================= */
/* ======================================================  CONFIG_CLR  ======================================================= */
/* =========================================================  MODE  ========================================================== */
/* ==============================================  UART_0 MODE DBGMD [16..16]  =============================================== */
typedef enum {                                  /*!< UART_0_MODE_DBGMD                                                         */
  UART_0_MODE_DBGMD_RUN                = 0,     /*!< RUN : The UART module will continue to operate while the core
                                                     is halted in debug mode.                                                  */
  UART_0_MODE_DBGMD_HALT               = 1,     /*!< HALT : A debug breakpoint will cause the UART module to halt.
                                                     Any active transmissions and receptions will complete first.              */
} UART_0_MODE_DBGMD_Enum;

/* ===============================================  UART_0 MODE LBMD [18..19]  =============================================== */
typedef enum {                                  /*!< UART_0_MODE_LBMD                                                          */
  UART_0_MODE_LBMD_DISABLED            = 0,     /*!< DISABLED : Loop back is disabled and the TX and RX signals are
                                                     connected to the corresponding external pins.                             */
  UART_0_MODE_LBMD_RX_ONLY             = 1,     /*!< RX_ONLY : Receive loop back. The receiver input path is disconnected
                                                     from the RX pin and internally connected to the transmitter.
                                                     Data transmitted will be sent out on TX and also received
                                                     by the device.                                                            */
  UART_0_MODE_LBMD_TX_ONLY             = 2,     /*!< TX_ONLY : Transmit loop back. The transmitter output path is
                                                     disconnected from the TX pin and the RX input pin is internally
                                                     looped back out to the TX pin. Data received at RX will
                                                     be received by the device and also sent directly back out
                                                     on TX.                                                                    */
  UART_0_MODE_LBMD_BOTH                = 3,     /*!< BOTH : Full loop back. Internally, the transmitter output is
                                                     routed back to the receiver input. Neither the transmitter
                                                     nor receiver are connected to external device pins. The
                                                     device pin RX is looped back to TX in a similar fashion.
                                                     Data transmitted on TX will be sent directly back in on
                                                     RX.                                                                       */
} UART_0_MODE_LBMD_Enum;

/* =============================================  UART_0 MODE DUPLEXMD [27..27]  ============================================= */
typedef enum {                                  /*!< UART_0_MODE_DUPLEXMD                                                      */
  UART_0_MODE_DUPLEXMD_FULL_DUPLEX     = 0,     /*!< FULL_DUPLEX : Full-duplex mode. The transmitter and receiver
                                                     can operate simultaneously.                                               */
  UART_0_MODE_DUPLEXMD_HALF_DUPLEX     = 1,     /*!< HALF_DUPLEX : Half-duplex mode. The transmitter automatically
                                                     inhibits when the receiver is active and the receiver automatically
                                                     inhibits when the transmitter is active.                                  */
} UART_0_MODE_DUPLEXMD_Enum;

/* ==============================================  UART_0 MODE ITSEN [30..30]  =============================================== */
typedef enum {                                  /*!< UART_0_MODE_ITSEN                                                         */
  UART_0_MODE_ITSEN_DISABLED           = 0,     /*!< DISABLED : The TX and UCLK (if in synchronous master mode) pins
                                                     are always an output in this mode, even when idle.                        */
  UART_0_MODE_ITSEN_ENABLED            = 1,     /*!< ENABLED : The TX pin is tristated when idle. If ISTCLK is cleared
                                                     to 0 and the transmitter is configured in synchronous master
                                                     mode, the UCLK pin will also be tristated when idle.                      */
} UART_0_MODE_ITSEN_Enum;

/* =======================================================  MODE_SET  ======================================================== */
/* =======================================================  MODE_CLR  ======================================================== */
/* ========================================================  FLOWCN  ========================================================= */
/* ===============================================  UART_0 FLOWCN RTS [0..0]  ================================================ */
typedef enum {                                  /*!< UART_0_FLOWCN_RTS                                                         */
  UART_0_FLOWCN_RTS_LOW                = 0,     /*!< LOW : RTS pin (before optional inversion) is driven low.                  */
  UART_0_FLOWCN_RTS_HIGH               = 1,     /*!< HIGH : RTS pin (before optional inversion) is driven high.                */
} UART_0_FLOWCN_RTS_Enum;

/* ================================================  UART_0 FLOWCN RX [1..1]  ================================================ */
typedef enum {                                  /*!< UART_0_FLOWCN_RX                                                          */
  UART_0_FLOWCN_RX_LOW                 = 0,     /*!< LOW : RX pin (after optional inversion) is low.                           */
  UART_0_FLOWCN_RX_HIGH                = 1,     /*!< HIGH : RX pin (after optional inversion) is high.                         */
} UART_0_FLOWCN_RX_Enum;

/* =============================================  UART_0 FLOWCN RTSINVEN [5..5]  ============================================= */
typedef enum {                                  /*!< UART_0_FLOWCN_RTSINVEN                                                    */
  UART_0_FLOWCN_RTSINVEN_DISABLED      = 0,     /*!< DISABLED : The UART does not invert the RTS signal before driving
                                                     the pin.                                                                  */
  UART_0_FLOWCN_RTSINVEN_ENABLED       = 1,     /*!< ENABLED : The UART inverts the RTS signal driving the pin.                */
} UART_0_FLOWCN_RTSINVEN_Enum;

