chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  UART_0 FLOWCN RTSTH [6..6]  =============================================== */
typedef enum {                                  /*!< UART_0_FLOWCN_RTSTH                                                       */
  UART_0_FLOWCN_RTSTH_FULL             = 0,     /*!< FULL : RTS is de-asserted when the receive FIFO and shift register
                                                     are full and no more incoming data can be stored.                         */
  UART_0_FLOWCN_RTSTH_ONE_BYTE_FREE    = 1,     /*!< ONE_BYTE_FREE : RTS is de-asserted when the receive FIFO and
                                                     shift register are nearly full and only one more data can
                                                     be received.                                                              */
} UART_0_FLOWCN_RTSTH_Enum;

/* ==============================================  UART_0 FLOWCN RTSEN [7..7]  =============================================== */
typedef enum {                                  /*!< UART_0_FLOWCN_RTSEN                                                       */
  UART_0_FLOWCN_RTSEN_DISABLED         = 0,     /*!< DISABLED : The RTS state is not changed by hardware. The RTS
                                                     bit can be written only when hardware RTS is disabled (RTSEN
                                                     = 0).                                                                     */
  UART_0_FLOWCN_RTSEN_ENABLED          = 1,     /*!< ENABLED : Hardware sets RTS when the receive FIFO is at or above
                                                     the threshold set by RTSTH and clears RTS otherwise.                      */
} UART_0_FLOWCN_RTSEN_Enum;

/* ==============================================  UART_0 FLOWCN CTS [16..16]  =============================================== */
typedef enum {                                  /*!< UART_0_FLOWCN_CTS                                                         */
  UART_0_FLOWCN_CTS_LOW                = 0,     /*!< LOW : Indicates the CTS pin state (after optional inversion)
                                                     is low.                                                                   */
  UART_0_FLOWCN_CTS_HIGH               = 1,     /*!< HIGH : Indicates the CTS pin state (after optional inversion)
                                                     is high.                                                                  */
} UART_0_FLOWCN_CTS_Enum;

/* ===============================================  UART_0 FLOWCN TX [17..17]  =============================================== */
typedef enum {                                  /*!< UART_0_FLOWCN_TX                                                          */
  UART_0_FLOWCN_TX_LOW                 = 0,     /*!< LOW : The TX pin (before optional inversion) is low.                      */
  UART_0_FLOWCN_TX_HIGH                = 1,     /*!< HIGH : The TX pin (before optional inversion) is high.                    */
} UART_0_FLOWCN_TX_Enum;

/* ============================================  UART_0 FLOWCN CTSINVEN [21..21]  ============================================ */
typedef enum {                                  /*!< UART_0_FLOWCN_CTSINVEN                                                    */
  UART_0_FLOWCN_CTSINVEN_DISABLED      = 0,     /*!< DISABLED : The UART does not invert CTS.                                  */
  UART_0_FLOWCN_CTSINVEN_ENABLED       = 1,     /*!< ENABLED : The UART inverts CTS.                                           */
} UART_0_FLOWCN_CTSINVEN_Enum;

/* =============================================  UART_0 FLOWCN CTSEN [23..23]  ============================================== */
typedef enum {                                  /*!< UART_0_FLOWCN_CTSEN                                                       */
  UART_0_FLOWCN_CTSEN_DISABLED         = 0,     /*!< DISABLED : The CTS pin state does not affect transmissions.               */
  UART_0_FLOWCN_CTSEN_ENABLED          = 1,     /*!< ENABLED : Transmissions will begin only if the CTS pin (after
                                                     optional inversion) is low.                                               */
} UART_0_FLOWCN_CTSEN_Enum;

/* ============================================  UART_0 FLOWCN TIRDAPW [28..29]  ============================================= */
typedef enum {                                  /*!< UART_0_FLOWCN_TIRDAPW                                                     */
  UART_0_FLOWCN_TIRDAPW_1_16TH         = 0,     /*!< 1_16TH : The IrDA pulse width is 1/16th of a bit period.                  */
  UART_0_FLOWCN_TIRDAPW_1_8TH          = 1,     /*!< 1_8TH : The IrDA pulse width is 1/8th of a bit period.                    */
  UART_0_FLOWCN_TIRDAPW_3_16TH         = 2,     /*!< 3_16TH : The IrDA pulse width is 3/16th of a bit period.                  */
  UART_0_FLOWCN_TIRDAPW_1_4TH          = 3,     /*!< 1_4TH : The IrDA pulse width is 1/4th of a bit period.                    */
} UART_0_FLOWCN_TIRDAPW_Enum;

/* ======================================================  FLOWCN_SET  ======================================================= */
/* ======================================================  FLOWCN_CLR  ======================================================= */
/* ========================================================  CONTROL  ======================================================== */
/* =============================================  UART_0 CONTROL RFRMERI [0..0]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_RFRMERI                                                    */
  UART_0_CONTROL_RFRMERI_NOT_SET       = 0,     /*!< NOT_SET : Read: A frame error has not occurred since RFRMERI
                                                     was last cleared. Write: Clear the interrupt.                             */
  UART_0_CONTROL_RFRMERI_SET           = 1,     /*!< SET : Read: A frame error occurred. Write: Force a frame error
                                                     interrupt.                                                                */
} UART_0_CONTROL_RFRMERI_Enum;

/* =============================================  UART_0 CONTROL RPARERI [1..1]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_RPARERI                                                    */
  UART_0_CONTROL_RPARERI_NOT_SET       = 0,     /*!< NOT_SET : Read: An invalid parity bit has not been received
                                                     since RPARERI was last cleared. Write: Clear the interrupt.               */
  UART_0_CONTROL_RPARERI_SET           = 1,     /*!< SET : Read: An invalid parity bit has been received since RPARERI
                                                     was last cleared. Write: Force a parity error interrupt.                  */
} UART_0_CONTROL_RPARERI_Enum;

/* ==============================================  UART_0 CONTROL ROREI [2..2]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_ROREI                                                      */
  UART_0_CONTROL_ROREI_NOT_SET         = 0,     /*!< NOT_SET : Read: A receiver overrun has not occurred since ROREI
                                                     was last cleared. Write: Clear the interrupt.                             */
  UART_0_CONTROL_ROREI_SET             = 1,     /*!< SET : Read: A receiver overrun occurred. Write: Force a receiver
                                                     overrun interrupt.                                                        */
} UART_0_CONTROL_ROREI_Enum;

