chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  UART_0 CONTROL RDREQI [3..3]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_RDREQI                                                     */
  UART_0_CONTROL_RDREQI_NOT_SET        = 0,     /*!< NOT_SET : Fewer than RFTH FIFO slots are filled with data.                */
  UART_0_CONTROL_RDREQI_SET            = 1,     /*!< SET : At least RFTH FIFO slots are filled with data.                      */
} UART_0_CONTROL_RDREQI_Enum;

/* =============================================  UART_0 CONTROL RERIEN [5..5]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_RERIEN                                                     */
  UART_0_CONTROL_RERIEN_DISABLED       = 0,     /*!< DISABLED : Disable the receive error interrupt.                           */
  UART_0_CONTROL_RERIEN_ENABLED        = 1,     /*!< ENABLED : Enable the receive error interrupt. A receive error
                                                     interrupt is asserted when ROREI, RFRMERI, or RPARERI is
                                                     set to 1.                                                                 */
} UART_0_CONTROL_RERIEN_Enum;

/* ============================================  UART_0 CONTROL RDREQIEN [6..6]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_RDREQIEN                                                   */
  UART_0_CONTROL_RDREQIEN_DISABLED     = 0,     /*!< DISABLED : Disable the read data request interrupt.                       */
  UART_0_CONTROL_RDREQIEN_ENABLED      = 1,     /*!< ENABLED : Enable the read data request interrupt. A receive
                                                     interrupt is generated when RDREQI is set to 1.                           */
} UART_0_CONTROL_RDREQIEN_Enum;

/* ==============================================  UART_0 CONTROL MATMD [8..9]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_MATMD                                                      */
  UART_0_CONTROL_MATMD_OFF             = 0,     /*!< OFF : Disable the match function.                                         */
  UART_0_CONTROL_MATMD_MCE             = 1,     /*!< MCE : (MCE) Data whose last data bit equals RBIT is accepted
                                                     and stored.                                                               */
  UART_0_CONTROL_MATMD_FRAME           = 2,     /*!< FRAME : (Frame) A framing error is asserted if the last received
                                                     bit matches RBIT.                                                         */
  UART_0_CONTROL_MATMD_STORE           = 3,     /*!< STORE : (Store) Store the last incoming data bit in RBIT. This
                                                     mode can be used inconjunction with the RDATLN setting.                   */
} UART_0_CONTROL_MATMD_Enum;

/* ============================================  UART_0 CONTROL RABDEN [10..10]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_RABDEN                                                     */
  UART_0_CONTROL_RABDEN_DISABLED       = 0,     /*!< DISABLED : Disable receiver auto-baud.                                    */
  UART_0_CONTROL_RABDEN_ENABLED        = 1,     /*!< ENABLED : Enable receiver auto-baud.                                      */
} UART_0_CONTROL_RABDEN_Enum;

/* ============================================  UART_0 CONTROL RBUSYF [11..11]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_RBUSYF                                                     */
  UART_0_CONTROL_RBUSYF_NOT_SET        = 0,     /*!< NOT_SET : The UART receiver is idle.                                      */
  UART_0_CONTROL_RBUSYF_SET            = 1,     /*!< SET : The UART receiver is receiving data.                                */
} UART_0_CONTROL_RBUSYF_Enum;

/* =============================================  UART_0 CONTROL RBIT [12..12]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_RBIT                                                       */
  UART_0_CONTROL_RBIT_NOT_SET          = 0,     /*!< NOT_SET : NOT_SET                                                         */
  UART_0_CONTROL_RBIT_SET              = 1,     /*!< SET : SET                                                                 */
} UART_0_CONTROL_RBIT_Enum;

/* =============================================  UART_0 CONTROL ROSEN [13..13]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_ROSEN                                                      */
  UART_0_CONTROL_ROSEN_DISABLED        = 0,     /*!< DISABLED : Disable one-shot receive mode.                                 */
  UART_0_CONTROL_ROSEN_ENABLED         = 1,     /*!< ENABLED : Enable one-shot receive mode.                                   */
} UART_0_CONTROL_ROSEN_Enum;

/* =============================================  UART_0 CONTROL RINH [14..14]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_RINH                                                       */
  UART_0_CONTROL_RINH_INACTIVE         = 0,     /*!< INACTIVE : The receiver operates normally.                                */
  UART_0_CONTROL_RINH_ACTIVE           = 1,     /*!< ACTIVE : RTS is immediately asserted when RINH is set. The receiver
                                                     will complete any ongoing reception, but ignore all traffic
                                                     after that.                                                               */
} UART_0_CONTROL_RINH_Enum;

