chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  UART_0 CONTROL REN [15..15]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_REN                                                        */
  UART_0_CONTROL_REN_DISABLED          = 0,     /*!< DISABLED : Disable the receiver. The receiver can receive one
                                                     data transaction only if ROSEN is set.                                    */
  UART_0_CONTROL_REN_ENABLED           = 1,     /*!< ENABLED : Enable the receiver.                                            */
} UART_0_CONTROL_REN_Enum;

/* ============================================  UART_0 CONTROL TSCERI [16..16]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_TSCERI                                                     */
  UART_0_CONTROL_TSCERI_NOT_SET        = 0,     /*!< NOT_SET : Read: A Smartcard parity error has not occurred since
                                                     TSCERI was last cleared. Write: Clear the interrupt.                      */
  UART_0_CONTROL_TSCERI_SET            = 1,     /*!< SET : Read: A Smartcard parity error occurred. Write: Force
                                                     a Smartcard parity error interrupt.                                       */
} UART_0_CONTROL_TSCERI_Enum;

/* ============================================  UART_0 CONTROL TDREQI [18..18]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_TDREQI                                                     */
  UART_0_CONTROL_TDREQI_NOT_SET        = 0,     /*!< NOT_SET : The transmitter is not requesting more FIFO data.               */
  UART_0_CONTROL_TDREQI_SET            = 1,     /*!< SET : The transmitter is requesting more FIFO data.                       */
} UART_0_CONTROL_TDREQI_Enum;

/* =============================================  UART_0 CONTROL TCPTI [19..19]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_TCPTI                                                      */
  UART_0_CONTROL_TCPTI_NOT_SET         = 0,     /*!< NOT_SET : Read: A transmit has not completed since TCPTI was
                                                     last cleared. Write: Clear the interrupt.                                 */
  UART_0_CONTROL_TCPTI_SET             = 1,     /*!< SET : Read: A byte was transmitted (TCCPTH = 0) or the last
                                                     available byte was transmitted (TCPTTH = 1). Write: Force
                                                     a transmit complete interrupt.                                            */
} UART_0_CONTROL_TCPTI_Enum;

/* ============================================  UART_0 CONTROL TCPTTH [20..20]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_TCPTTH                                                     */
  UART_0_CONTROL_TCPTTH_SET_ON_TX      = 0,     /*!< SET_ON_TX : A transmit is completed (TCPTI = 1) at the end of
                                                     each transmission.                                                        */
  UART_0_CONTROL_TCPTTH_SET_ON_EMPTY   = 1,     /*!< SET_ON_EMPTY : A transmit is completed (TCPTI = 1) only at the
                                                     end of a transmission when no more data is available to
                                                     transmit.                                                                 */
} UART_0_CONTROL_TCPTTH_Enum;

/* ============================================  UART_0 CONTROL TERIEN [21..21]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_TERIEN                                                     */
  UART_0_CONTROL_TERIEN_DISABLED       = 0,     /*!< DISABLED : Disable the transmit error interrupt.                          */
  UART_0_CONTROL_TERIEN_ENABLED        = 1,     /*!< ENABLED : Enable the transmit error interrupt. A transmit interrupt
                                                     is generated when TUREI or TSCERI is set to 1.                            */
} UART_0_CONTROL_TERIEN_Enum;

/* ===========================================  UART_0 CONTROL TDREQIEN [22..22]  ============================================ */
typedef enum {                                  /*!< UART_0_CONTROL_TDREQIEN                                                   */
  UART_0_CONTROL_TDREQIEN_DISABLED     = 0,     /*!< DISABLED : Disable the transmit data request interrupt.                   */
  UART_0_CONTROL_TDREQIEN_ENABLED      = 1,     /*!< ENABLED : Enable the transmit data request interrupt. A transmit
                                                     interrupt is asserted when TDREQI is set to 1.                            */
} UART_0_CONTROL_TDREQIEN_Enum;

/* ============================================  UART_0 CONTROL TCPTIEN [23..23]  ============================================ */
typedef enum {                                  /*!< UART_0_CONTROL_TCPTIEN                                                    */
  UART_0_CONTROL_TCPTIEN_DISABLED      = 0,     /*!< DISABLED : Disable the transmit complete interrupt.                       */
  UART_0_CONTROL_TCPTIEN_ENABLED       = 1,     /*!< ENABLED : Enable the transmit complete interrupt. A transmit
                                                     interrupt is generated when TCPTI is set to 1.                            */
} UART_0_CONTROL_TCPTIEN_Enum;

/* ============================================  UART_0 CONTROL TBUSYF [27..27]  ============================================= */
typedef enum {                                  /*!< UART_0_CONTROL_TBUSYF                                                     */
  UART_0_CONTROL_TBUSYF_NOT_SET        = 0,     /*!< NOT_SET : The UART transmitter is idle.                                   */
  UART_0_CONTROL_TBUSYF_SET            = 1,     /*!< SET : The UART transmitter is active and transmitting.                    */
} UART_0_CONTROL_TBUSYF_Enum;

/* =============================================  UART_0 CONTROL TBIT [28..28]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_TBIT                                                       */
  UART_0_CONTROL_TBIT_NOT_SET          = 0,     /*!< NOT_SET : NOT_SET                                                         */
  UART_0_CONTROL_TBIT_SET              = 1,     /*!< SET : SET                                                                 */
} UART_0_CONTROL_TBIT_Enum;

/* =============================================  UART_0 CONTROL TINH [30..30]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_TINH                                                       */
  UART_0_CONTROL_TINH_INACTIVE         = 0,     /*!< INACTIVE : The transmitter operates normally.                             */
  UART_0_CONTROL_TINH_ACTIVE           = 1,     /*!< ACTIVE : Transmissions are inhibited. The transmitter will stall
                                                     after any current transmission is complete.                               */
} UART_0_CONTROL_TINH_Enum;

/* ==============================================  UART_0 CONTROL TEN [31..31]  ============================================== */
typedef enum {                                  /*!< UART_0_CONTROL_TEN                                                        */
  UART_0_CONTROL_TEN_DISABLED          = 0,     /*!< DISABLED : Disable the transmitter. When cleared, the transmitter
                                                     immediately aborts any active transmission. Clearing this
                                                     bit does not automatically flush the transmit FIFO.                       */
  UART_0_CONTROL_TEN_ENABLED           = 1,     /*!< ENABLED : Enable the transmitter. The transmitter will initiate
                                                     a transmission when data becomes available in the transmit
                                                     FIFO.                                                                     */
} UART_0_CONTROL_TEN_Enum;

/* ======================================================  CONTROL_SET  ====================================================== */
/* ======================================================  CONTROL_CLR  ====================================================== */
/* ========================================================  IPDELAY  ======================================================== */
/* =======================================================  BAUDRATE  ======================================================== */
/* ========================================================  FIFOCN  ========================================================= */
/* ===============================================  UART_0 FIFOCN RFTH [4..5]  =============================================== */
typedef enum {                                  /*!< UART_0_FIFOCN_RFTH                                                        */
  UART_0_FIFOCN_RFTH_ONE               = 0,     /*!< ONE : A read data request interrupt (RDREQI) is asserted when
                                                     >= 1 FIFO slot is full.                                                   */
  UART_0_FIFOCN_RFTH_TWO               = 1,     /*!< TWO : A read data request interrupt (RDREQI) is asserted when
                                                     >= 2 FIFO slots are full.                                                 */
  UART_0_FIFOCN_RFTH_FOUR              = 2,     /*!< FOUR : A read data request interrupt (RDREQI) is asserted when
                                                     >= 4 FIFO slots are full.                                                 */
} UART_0_FIFOCN_RFTH_Enum;

/* =============================================  UART_0 FIFOCN RFIFOFL [8..8]  ============================================== */
typedef enum {                                  /*!< UART_0_FIFOCN_RFIFOFL                                                     */
  UART_0_FIFOCN_RFIFOFL_SET            = 1,     /*!< SET : Flush the contents of the receive FIFO and any data in
                                                     the receive shift register.                                               */
} UART_0_FIFOCN_RFIFOFL_Enum;

