chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  UART_0 FIFOCN RFERI [9..9]  =============================================== */
typedef enum {                                  /*!< UART_0_FIFOCN_RFERI                                                       */
  UART_0_FIFOCN_RFERI_NOT_SET          = 0,     /*!< NOT_SET : A receive FIFO error has not occurred since RFERI
                                                     was last cleared.                                                         */
  UART_0_FIFOCN_RFERI_SET              = 1,     /*!< SET : A receive FIFO error occurred.                                      */
} UART_0_FIFOCN_RFERI_Enum;

/* ============================================  UART_0 FIFOCN RSRFULLF [10..10]  ============================================ */
typedef enum {                                  /*!< UART_0_FIFOCN_RSRFULLF                                                    */
  UART_0_FIFOCN_RSRFULLF_NOT_SET       = 0,     /*!< NOT_SET : The receive data shift register is not full.                    */
  UART_0_FIFOCN_RSRFULLF_SET           = 1,     /*!< SET : The receive data shift register is full.                            */
} UART_0_FIFOCN_RSRFULLF_Enum;

/* ==============================================  UART_0 FIFOCN TFTH [20..21]  ============================================== */
typedef enum {                                  /*!< UART_0_FIFOCN_TFTH                                                        */
  UART_0_FIFOCN_TFTH_ONE               = 0,     /*!< ONE : A transmit data request interrupt (TDREQI) is asserted
                                                     when >= 1 FIFO slot is empty.                                             */
  UART_0_FIFOCN_TFTH_TWO               = 1,     /*!< TWO : A transmit data request interrupt (TDREQI) is asserted
                                                     when >= 2 FIFO slots are empty.                                           */
  UART_0_FIFOCN_TFTH_FOUR              = 2,     /*!< FOUR : A transmit data request interrupt (TDREQI) is asserted
                                                     when >= 4 FIFO slots are empty.                                           */
} UART_0_FIFOCN_TFTH_Enum;

/* ============================================  UART_0 FIFOCN TFIFOFL [24..24]  ============================================= */
typedef enum {                                  /*!< UART_0_FIFOCN_TFIFOFL                                                     */
  UART_0_FIFOCN_TFIFOFL_SET            = 1,     /*!< SET : Flush the contents of the transmit FIFO. If data is pending
                                                     in the transmit shift register but a transmit has not begun,
                                                     the shift register is also flushed.                                       */
} UART_0_FIFOCN_TFIFOFL_Enum;

/* =============================================  UART_0 FIFOCN TFERI [25..25]  ============================================== */
typedef enum {                                  /*!< UART_0_FIFOCN_TFERI                                                       */
  UART_0_FIFOCN_TFERI_NOT_SET          = 0,     /*!< NOT_SET : A transmit FIFO error has not occurred since TFERI
                                                     was last cleared.                                                         */
  UART_0_FIFOCN_TFERI_SET              = 1,     /*!< SET : A transmit FIFO error occurred.                                     */
} UART_0_FIFOCN_TFERI_Enum;

/* ============================================  UART_0 FIFOCN TSRFULLF [26..26]  ============================================ */
typedef enum {                                  /*!< UART_0_FIFOCN_TSRFULLF                                                    */
  UART_0_FIFOCN_TSRFULLF_NOT_SET       = 0,     /*!< NOT_SET : The transmit shift register is not full.                        */
  UART_0_FIFOCN_TSRFULLF_SET           = 1,     /*!< SET : The transmit shift register is full.                                */
} UART_0_FIFOCN_TSRFULLF_Enum;

/* ======================================================  FIFOCN_SET  ======================================================= */
/* ======================================================  FIFOCN_CLR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                          USART_0                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CONFIG  ========================================================= */
/* =============================================  USART_0 CONFIG RSTRTEN [0..0]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_RSTRTEN                                                    */
  USART_0_CONFIG_RSTRTEN_DISABLED      = 0,     /*!< DISABLED : Do not expect a start bit during receptions.                   */
  USART_0_CONFIG_RSTRTEN_ENABLED       = 1,     /*!< ENABLED : Expect a start bit during receptions.                           */
} USART_0_CONFIG_RSTRTEN_Enum;

/* =============================================  USART_0 CONFIG RPAREN [1..1]  ============================================== */
typedef enum {                                  /*!< USART_0_CONFIG_RPAREN                                                     */
  USART_0_CONFIG_RPAREN_DISABLED       = 0,     /*!< DISABLED : Do not expect a parity bit during receptions.                  */
  USART_0_CONFIG_RPAREN_ENABLED        = 1,     /*!< ENABLED : Expect a parity bit during receptions.                          */
} USART_0_CONFIG_RPAREN_Enum;

/* =============================================  USART_0 CONFIG RSTPEN [2..2]  ============================================== */
typedef enum {                                  /*!< USART_0_CONFIG_RSTPEN                                                     */
  USART_0_CONFIG_RSTPEN_DISABLED       = 0,     /*!< DISABLED : Do not expect stop bits during receptions.                     */
  USART_0_CONFIG_RSTPEN_ENABLED        = 1,     /*!< ENABLED : Expect stop bits during receptions.                             */
} USART_0_CONFIG_RSTPEN_Enum;

/* =============================================  USART_0 CONFIG RSTPMD [3..4]  ============================================== */
typedef enum {                                  /*!< USART_0_CONFIG_RSTPMD                                                     */
  USART_0_CONFIG_RSTPMD_0P5_STOP       = 0,     /*!< 0P5_STOP : 0.5 stop bit.                                                  */
  USART_0_CONFIG_RSTPMD_1_STOP         = 1,     /*!< 1_STOP : 1 stop bit.                                                      */
  USART_0_CONFIG_RSTPMD_1P5_STOP       = 2,     /*!< 1P5_STOP : 1.5 stop bits.                                                 */
  USART_0_CONFIG_RSTPMD_2_STOP         = 3,     /*!< 2_STOP : 2 stop bits.                                                     */
} USART_0_CONFIG_RSTPMD_Enum;

/* =============================================  USART_0 CONFIG RPARMD [5..6]  ============================================== */
typedef enum {                                  /*!< USART_0_CONFIG_RPARMD                                                     */
  USART_0_CONFIG_RPARMD_ODD            = 0,     /*!< ODD : Odd Parity.                                                         */
  USART_0_CONFIG_RPARMD_EVEN           = 1,     /*!< EVEN : Even Parity.                                                       */
  USART_0_CONFIG_RPARMD_MARK           = 2,     /*!< MARK : Set (Parity = 1).                                                  */
  USART_0_CONFIG_RPARMD_SPACE          = 3,     /*!< SPACE : Clear (Parity = 0).                                               */
} USART_0_CONFIG_RPARMD_Enum;

/* =============================================  USART_0 CONFIG RDATLN [8..10]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_RDATLN                                                     */
  USART_0_CONFIG_RDATLN_5_BITS         = 0,     /*!< 5_BITS : 5 bits.                                                          */
  USART_0_CONFIG_RDATLN_6_BITS         = 1,     /*!< 6_BITS : 6 bits.                                                          */
  USART_0_CONFIG_RDATLN_7_BITS         = 2,     /*!< 7_BITS : 7 bits.                                                          */
  USART_0_CONFIG_RDATLN_8_BITS         = 3,     /*!< 8_BITS : 8 bits.                                                          */
  USART_0_CONFIG_RDATLN_9_BITS_STORED  = 4,     /*!< 9_BITS_STORED : 9 bits. The 9th bit is stored in the FIFO (normal
                                                     mode).                                                                    */
  USART_0_CONFIG_RDATLN_9_BITS_MATCH   = 5,     /*!< 9_BITS_MATCH : 9 bits. The 9th bit is not stored in the FIFO
                                                     (fixed mode). This mode is used when the 9th bit is only
                                                     used for match operations (see MATMD).                                    */
} USART_0_CONFIG_RDATLN_Enum;

