chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  USART_0 CONFIG RSCEN [12..12]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_RSCEN                                                      */
  USART_0_CONFIG_RSCEN_DISABLED        = 0,     /*!< DISABLED : The receiver does not send a Smartcard parity error
                                                     response.                                                                 */
  USART_0_CONFIG_RSCEN_ENABLED         = 1,     /*!< ENABLED : The receiver sends a Smartcard parity response.                 */
} USART_0_CONFIG_RSCEN_Enum;

/* ============================================  USART_0 CONFIG RIRDAEN [13..13]  ============================================ */
typedef enum {                                  /*!< USART_0_CONFIG_RIRDAEN                                                    */
  USART_0_CONFIG_RIRDAEN_DISABLED      = 0,     /*!< DISABLED : The receiver does not operate in IrDA mode.                    */
  USART_0_CONFIG_RIRDAEN_ENABLED       = 1,     /*!< ENABLED : The receiver operates in IrDA mode.                             */
} USART_0_CONFIG_RIRDAEN_Enum;

/* ============================================  USART_0 CONFIG RINVEN [14..14]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_RINVEN                                                     */
  USART_0_CONFIG_RINVEN_DISABLED       = 0,     /*!< DISABLED : Do not invert the RX pin signals (the RX idle state
                                                     is high).                                                                 */
  USART_0_CONFIG_RINVEN_ENABLED        = 1,     /*!< ENABLED : Invert the RX pin signals (the RX idle state is low).           */
} USART_0_CONFIG_RINVEN_Enum;

/* ============================================  USART_0 CONFIG RSYNCEN [15..15]  ============================================ */
typedef enum {                                  /*!< USART_0_CONFIG_RSYNCEN                                                    */
  USART_0_CONFIG_RSYNCEN_DISABLED      = 0,     /*!< DISABLED : The receiver operates in asynchronous mode.                    */
  USART_0_CONFIG_RSYNCEN_ENABLED       = 1,     /*!< ENABLED : The receiver operates in synchronous mode.                      */
} USART_0_CONFIG_RSYNCEN_Enum;

/* ============================================  USART_0 CONFIG TSTRTEN [16..16]  ============================================ */
typedef enum {                                  /*!< USART_0_CONFIG_TSTRTEN                                                    */
  USART_0_CONFIG_TSTRTEN_DISABLED      = 0,     /*!< DISABLED : Do not generate a start bit during transmissions.              */
  USART_0_CONFIG_TSTRTEN_ENABLED       = 1,     /*!< ENABLED : Generate a start bit during transmissions.                      */
} USART_0_CONFIG_TSTRTEN_Enum;

/* ============================================  USART_0 CONFIG TPAREN [17..17]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_TPAREN                                                     */
  USART_0_CONFIG_TPAREN_DISABLED       = 0,     /*!< DISABLED : Do not send a parity bit during transmissions.                 */
  USART_0_CONFIG_TPAREN_ENABLED        = 1,     /*!< ENABLED : Send a parity bit during transmissions.                         */
} USART_0_CONFIG_TPAREN_Enum;

/* ============================================  USART_0 CONFIG TSTPEN [18..18]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_TSTPEN                                                     */
  USART_0_CONFIG_TSTPEN_DISABLED       = 0,     /*!< DISABLED : Do not send stop bits during transmissions.                    */
  USART_0_CONFIG_TSTPEN_ENABLED        = 1,     /*!< ENABLED : Send stop bits during transmissions.                            */
} USART_0_CONFIG_TSTPEN_Enum;

/* ============================================  USART_0 CONFIG TSTPMD [19..20]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_TSTPMD                                                     */
  USART_0_CONFIG_TSTPMD_0P5_STOP       = 0,     /*!< 0P5_STOP : 0.5 stop bit.                                                  */
  USART_0_CONFIG_TSTPMD_1_STOP         = 1,     /*!< 1_STOP : 1 stop bit.                                                      */
  USART_0_CONFIG_TSTPMD_1P5_STOP       = 2,     /*!< 1P5_STOP : 1.5 stop bits.                                                 */
  USART_0_CONFIG_TSTPMD_2_STOP         = 3,     /*!< 2_STOP : 2 stop bits.                                                     */
} USART_0_CONFIG_TSTPMD_Enum;

/* ============================================  USART_0 CONFIG TPARMD [21..22]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_TPARMD                                                     */
  USART_0_CONFIG_TPARMD_ODD            = 0,     /*!< ODD : Odd Parity.                                                         */
  USART_0_CONFIG_TPARMD_EVEN           = 1,     /*!< EVEN : Even Parity.                                                       */
  USART_0_CONFIG_TPARMD_MARK           = 2,     /*!< MARK : Set (Parity = 1).                                                  */
  USART_0_CONFIG_TPARMD_SPACE          = 3,     /*!< SPACE : Clear (Parity = 0).                                               */
} USART_0_CONFIG_TPARMD_Enum;

/* ============================================  USART_0 CONFIG TDATLN [24..26]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_TDATLN                                                     */
  USART_0_CONFIG_TDATLN_5_BITS         = 0,     /*!< 5_BITS : 5 bits.                                                          */
  USART_0_CONFIG_TDATLN_6_BITS         = 1,     /*!< 6_BITS : 6 bits.                                                          */
  USART_0_CONFIG_TDATLN_7_BITS         = 2,     /*!< 7_BITS : 7 bits.                                                          */
  USART_0_CONFIG_TDATLN_8_BITS         = 3,     /*!< 8_BITS : 8 bits.                                                          */
  USART_0_CONFIG_TDATLN_9_BITS_FIFO    = 4,     /*!< 9_BITS_FIFO : 9 bits. The 9th bit is taken from the FIFO data
                                                     (normal mode).                                                            */
  USART_0_CONFIG_TDATLN_9_BITS_TBIT    = 5,     /*!< 9_BITS_TBIT : 9 bits. The 9th bit is set by the value of TBIT
                                                     (fixed mode).                                                             */
} USART_0_CONFIG_TDATLN_Enum;

/* =============================================  USART_0 CONFIG TSCEN [28..28]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_TSCEN                                                      */
  USART_0_CONFIG_TSCEN_DISABLED        = 0,     /*!< DISABLED : The transmitter does not check for a Smartcard parity
                                                     error response.                                                           */
  USART_0_CONFIG_TSCEN_ENABLED         = 1,     /*!< ENABLED : The transmitter checks for a Smartcard parity error
                                                     response.                                                                 */
} USART_0_CONFIG_TSCEN_Enum;

