chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  USART_0 CONFIG TIRDAEN [29..29]  ============================================ */
typedef enum {                                  /*!< USART_0_CONFIG_TIRDAEN                                                    */
  USART_0_CONFIG_TIRDAEN_DISABLED      = 0,     /*!< DISABLED : Disable IrDA transmit mode.                                    */
  USART_0_CONFIG_TIRDAEN_ENABLED       = 1,     /*!< ENABLED : Enable IrDA transmit mode.                                      */
} USART_0_CONFIG_TIRDAEN_Enum;

/* ============================================  USART_0 CONFIG TINVEN [30..30]  ============================================= */
typedef enum {                                  /*!< USART_0_CONFIG_TINVEN                                                     */
  USART_0_CONFIG_TINVEN_DISABLED       = 0,     /*!< DISABLED : Do not invert the TX pin signals (the TX idle state
                                                     is high).                                                                 */
  USART_0_CONFIG_TINVEN_ENABLED        = 1,     /*!< ENABLED : Invert the TX pin signals (the TX idle state is low).           */
} USART_0_CONFIG_TINVEN_Enum;

/* ============================================  USART_0 CONFIG TSYNCEN [31..31]  ============================================ */
typedef enum {                                  /*!< USART_0_CONFIG_TSYNCEN                                                    */
  USART_0_CONFIG_TSYNCEN_DISABLED      = 0,     /*!< DISABLED : The transmitter operates in asynchronous mode.                 */
  USART_0_CONFIG_TSYNCEN_ENABLED       = 1,     /*!< ENABLED : The transmitter operates in synchronous mode.                   */
} USART_0_CONFIG_TSYNCEN_Enum;

/* =========================================================  MODE  ========================================================== */
/* ==============================================  USART_0 MODE DBGMD [16..16]  ============================================== */
typedef enum {                                  /*!< USART_0_MODE_DBGMD                                                        */
  USART_0_MODE_DBGMD_RUN               = 0,     /*!< RUN : The USART module will continue to operate while the core
                                                     is halted in debug mode.                                                  */
  USART_0_MODE_DBGMD_HALT              = 1,     /*!< HALT : A debug breakpoint will cause the USART module to halt.
                                                     Any active transmissions and receptions will complete first.              */
} USART_0_MODE_DBGMD_Enum;

/* ==============================================  USART_0 MODE LBMD [18..19]  =============================================== */
typedef enum {                                  /*!< USART_0_MODE_LBMD                                                         */
  USART_0_MODE_LBMD_DISABLED           = 0,     /*!< DISABLED : Loop back is disabled and the TX and RX signals are
                                                     connected to the corresponding external pins.                             */
  USART_0_MODE_LBMD_RXONLY             = 1,     /*!< RXONLY : Receive loop back. The receiver input path is disconnected
                                                     from the RX pin and internally connected to the transmitter.
                                                     Data transmitted will be sent out on TX and also received
                                                     by the device.                                                            */
  USART_0_MODE_LBMD_TXONLY             = 2,     /*!< TXONLY : Transmit loop back. The transmitter output path is
                                                     disconnected from the TX pin and the RX input pin is internally
                                                     looped back out to the TX pin. Data received at RX will
                                                     be received by the device and also sent directly back out
                                                     on TX.                                                                    */
  USART_0_MODE_LBMD_BOTH               = 3,     /*!< BOTH : Full loop back. Internally, the transmitter output is
                                                     routed back to the receiver input. Neither the transmitter
                                                     nor receiver are connected to external device pins. The
                                                     device pin RX is looped back to TX in a similar fashion.
                                                     Data transmitted on TX will be sent directly back in on
                                                     RX.                                                                       */
} USART_0_MODE_LBMD_Enum;

/* ============================================  USART_0 MODE STPSTCLK [21..21]  ============================================= */
typedef enum {                                  /*!< USART_0_MODE_STPSTCLK                                                     */
  USART_0_MODE_STPSTCLK_DISABLED       = 0,     /*!< DISABLED : When the USART is a clock master, the clock is not
                                                     generated during stop bits.                                               */
  USART_0_MODE_STPSTCLK_ENABLED        = 1,     /*!< ENABLED : When the USART is a clock master, the clock is generated
                                                     during stop bits.                                                         */
} USART_0_MODE_STPSTCLK_Enum;

/* ============================================  USART_0 MODE STRTSTCLK [22..22]  ============================================ */
typedef enum {                                  /*!< USART_0_MODE_STRTSTCLK                                                    */
  USART_0_MODE_STRTSTCLK_DISABLED      = 0,     /*!< DISABLED : When the USART is a clock master, the clock is held
                                                     idle during a start bit.                                                  */
  USART_0_MODE_STRTSTCLK_ENABLED       = 1,     /*!< ENABLED : When the USART is a clock master, the clock is generated
                                                     during a start bit.                                                       */
} USART_0_MODE_STRTSTCLK_Enum;

/* =============================================  USART_0 MODE ISTCLK [23..23]  ============================================== */
typedef enum {                                  /*!< USART_0_MODE_ISTCLK                                                       */
  USART_0_MODE_ISTCLK_DISABLED         = 0,     /*!< DISABLED : When the USART is a clock master and CLKESEL is not
                                                     equal to CLKIDLE, the clock is held idle between transmissions.
                                                     When the USART is a clock master and CLKESEL equals CLKIDEL,
                                                     the clock will still be generated between transmissions.
                                                     When the USART is a clock slave, the USART will begin transmissions
                                                     without waiting for the next clock edge.                                  */
  USART_0_MODE_ISTCLK_ENABLED          = 1,     /*!< ENABLED : When the USART is a clock master, the clock is generated
                                                     between transmissions or receptions. When the USART is
                                                     a clock slave, the USART will wait until the next clock
                                                     edge before transmitting.                                                 */
} USART_0_MODE_ISTCLK_Enum;

/* ============================================  USART_0 MODE DUPLEXMD [27..27]  ============================================= */
typedef enum {                                  /*!< USART_0_MODE_DUPLEXMD                                                     */
  USART_0_MODE_DUPLEXMD_FULL_DUPLEX    = 0,     /*!< FULL_DUPLEX : Full-duplex mode. The transmitter and receiver
                                                     can operate simultaneously.                                               */
  USART_0_MODE_DUPLEXMD_HALF_DUPLEX    = 1,     /*!< HALF_DUPLEX : Half-duplex mode. The transmitter automatically
                                                     inhibits when the receiver is active and the receiver automatically
                                                     inhibits when the transmitter is active.                                  */
} USART_0_MODE_DUPLEXMD_Enum;

