chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  USART_0 MODE CLKIDLE [28..28]  ============================================= */
typedef enum {                                  /*!< USART_0_MODE_CLKIDLE                                                      */
  USART_0_MODE_CLKIDLE_IDLE_LOW        = 0,     /*!< IDLE_LOW : The synchronous clock is low when idle.                        */
  USART_0_MODE_CLKIDLE_IDLE_HIGH       = 1,     /*!< IDLE_HIGH : The synchronous clock is high when idle.                      */
} USART_0_MODE_CLKIDLE_Enum;

/* =============================================  USART_0 MODE CLKESEL [29..29]  ============================================= */
typedef enum {                                  /*!< USART_0_MODE_CLKESEL                                                      */
  USART_0_MODE_CLKESEL_FALLING         = 0,     /*!< FALLING : The clock falls in the middle of each bit.                      */
  USART_0_MODE_CLKESEL_RISING          = 1,     /*!< RISING : The clock rises in the middle of each bit.                       */
} USART_0_MODE_CLKESEL_Enum;

/* ==============================================  USART_0 MODE ITSEN [30..30]  ============================================== */
typedef enum {                                  /*!< USART_0_MODE_ITSEN                                                        */
  USART_0_MODE_ITSEN_DISABLED          = 0,     /*!< DISABLED : The TX and UCLK (if in synchronous master mode) pins
                                                     are always an output in this mode, even when idle.                        */
  USART_0_MODE_ITSEN_ENABLED           = 1,     /*!< ENABLED : The TX pin is tristated when idle. If ISTCLK is cleared
                                                     to 0 and the transmitter is configured in synchronous master
                                                     mode, the UCLK pin will also be tristated when idle.                      */
} USART_0_MODE_ITSEN_Enum;

/* ==============================================  USART_0 MODE OPMD [31..31]  =============================================== */
typedef enum {                                  /*!< USART_0_MODE_OPMD                                                         */
  USART_0_MODE_OPMD_SLAVE              = 0,     /*!< SLAVE : The USART operates as a slave.                                    */
  USART_0_MODE_OPMD_MASTER             = 1,     /*!< MASTER : The USART operates as a master.                                  */
} USART_0_MODE_OPMD_Enum;

/* ========================================================  FLOWCN  ========================================================= */
/* ===============================================  USART_0 FLOWCN RTS [0..0]  =============================================== */
typedef enum {                                  /*!< USART_0_FLOWCN_RTS                                                        */
  USART_0_FLOWCN_RTS_LOW               = 0,     /*!< LOW : RTS pin (before optional inversion) is driven low.                  */
  USART_0_FLOWCN_RTS_HIGH              = 1,     /*!< HIGH : RTS pin (before optional inversion) is driven high.                */
} USART_0_FLOWCN_RTS_Enum;

/* ===============================================  USART_0 FLOWCN RX [1..1]  ================================================ */
typedef enum {                                  /*!< USART_0_FLOWCN_RX                                                         */
  USART_0_FLOWCN_RX_LOW                = 0,     /*!< LOW : RX pin (after optional inversion) is low.                           */
  USART_0_FLOWCN_RX_HIGH               = 1,     /*!< HIGH : RX pin (after optional inversion) is high.                         */
} USART_0_FLOWCN_RX_Enum;

/* ============================================  USART_0 FLOWCN RTSINVEN [5..5]  ============================================= */
typedef enum {                                  /*!< USART_0_FLOWCN_RTSINVEN                                                   */
  USART_0_FLOWCN_RTSINVEN_DISABLED     = 0,     /*!< DISABLED : The USART does not invert the RTS signal before driving
                                                     the pin.                                                                  */
  USART_0_FLOWCN_RTSINVEN_ENABLED      = 1,     /*!< ENABLED : The USART inverts the RTS signal driving the pin.               */
} USART_0_FLOWCN_RTSINVEN_Enum;

/* ==============================================  USART_0 FLOWCN RTSTH [6..6]  ============================================== */
typedef enum {                                  /*!< USART_0_FLOWCN_RTSTH                                                      */
  USART_0_FLOWCN_RTSTH_FULL            = 0,     /*!< FULL : RTS is de-asserted when the receive FIFO and shift register
                                                     are full and no more incoming data can be stored.                         */
  USART_0_FLOWCN_RTSTH_ONE_BYTE_FREE   = 1,     /*!< ONE_BYTE_FREE : RTS is de-asserted when the receive FIFO and
                                                     shift register are nearly full and only one more data can
                                                     be received.                                                              */
} USART_0_FLOWCN_RTSTH_Enum;

/* ==============================================  USART_0 FLOWCN RTSEN [7..7]  ============================================== */
typedef enum {                                  /*!< USART_0_FLOWCN_RTSEN                                                      */
  USART_0_FLOWCN_RTSEN_DISABLED        = 0,     /*!< DISABLED : The RTS state is not changed by hardware. The RTS
                                                     bit can be written only when hardware RTS is disabled (RTSEN
                                                     = 0).                                                                     */
  USART_0_FLOWCN_RTSEN_ENABLED         = 1,     /*!< ENABLED : Hardware sets RTS when the receive FIFO is at or above
                                                     the threshold set by RTSTH and clears RTS otherwise.                      */
} USART_0_FLOWCN_RTSEN_Enum;

