chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  USART_0 FLOWCN CTS [16..16]  ============================================== */
typedef enum {                                  /*!< USART_0_FLOWCN_CTS                                                        */
  USART_0_FLOWCN_CTS_LOW               = 0,     /*!< LOW : Indicates the CTS pin state (after optional inversion)
                                                     is low.                                                                   */
  USART_0_FLOWCN_CTS_HIGH              = 1,     /*!< HIGH : Indicates the CTS pin state (after optional inversion)
                                                     is high.                                                                  */
} USART_0_FLOWCN_CTS_Enum;

/* ==============================================  USART_0 FLOWCN TX [17..17]  =============================================== */
typedef enum {                                  /*!< USART_0_FLOWCN_TX                                                         */
  USART_0_FLOWCN_TX_LOW                = 0,     /*!< LOW : The TX pin (before optional inversion) is low.                      */
  USART_0_FLOWCN_TX_HIGH               = 1,     /*!< HIGH : The TX pin (before optional inversion) is high.                    */
} USART_0_FLOWCN_TX_Enum;

/* =============================================  USART_0 FLOWCN UCLK [18..18]  ============================================== */
typedef enum {                                  /*!< USART_0_FLOWCN_UCLK                                                       */
  USART_0_FLOWCN_UCLK_LOW              = 0,     /*!< LOW : The UCLK pin is low.                                                */
  USART_0_FLOWCN_UCLK_HIGH             = 1,     /*!< HIGH : The UCLK pin is high.                                              */
} USART_0_FLOWCN_UCLK_Enum;

/* ===========================================  USART_0 FLOWCN CTSINVEN [21..21]  ============================================ */
typedef enum {                                  /*!< USART_0_FLOWCN_CTSINVEN                                                   */
  USART_0_FLOWCN_CTSINVEN_DISABLED     = 0,     /*!< DISABLED : The USART does not invert CTS.                                 */
  USART_0_FLOWCN_CTSINVEN_ENABLED      = 1,     /*!< ENABLED : The USART inverts CTS.                                          */
} USART_0_FLOWCN_CTSINVEN_Enum;

/* =============================================  USART_0 FLOWCN CTSEN [23..23]  ============================================= */
typedef enum {                                  /*!< USART_0_FLOWCN_CTSEN                                                      */
  USART_0_FLOWCN_CTSEN_DISABLED        = 0,     /*!< DISABLED : The CTS pin state does not affect transmissions.               */
  USART_0_FLOWCN_CTSEN_ENABLED         = 1,     /*!< ENABLED : Transmissions will begin only if the CTS pin (after
                                                     optional inversion) is low.                                               */
} USART_0_FLOWCN_CTSEN_Enum;

/* ============================================  USART_0 FLOWCN TIRDAPW [28..29]  ============================================ */
typedef enum {                                  /*!< USART_0_FLOWCN_TIRDAPW                                                    */
  USART_0_FLOWCN_TIRDAPW_1_16TH        = 0,     /*!< 1_16TH : The IrDA pulse width is 1/16th of a bit period.                  */
  USART_0_FLOWCN_TIRDAPW_1_8TH         = 1,     /*!< 1_8TH : The IrDA pulse width is 1/8th of a bit period.                    */
  USART_0_FLOWCN_TIRDAPW_3_16TH        = 2,     /*!< 3_16TH : The IrDA pulse width is 3/16th of a bit period.                  */
  USART_0_FLOWCN_TIRDAPW_1_4TH         = 3,     /*!< 1_4TH : The IrDA pulse width is 1/4th of a bit period.                    */
} USART_0_FLOWCN_TIRDAPW_Enum;

/* ========================================================  CONTROL  ======================================================== */
/* ============================================  USART_0 CONTROL RFRMERI [0..0]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_RFRMERI                                                   */
  USART_0_CONTROL_RFRMERI_NOT_SET      = 0,     /*!< NOT_SET : Read: A frame error has not occurred since RFRMERI
                                                     was last cleared. Write: Clear the interrupt.                             */
  USART_0_CONTROL_RFRMERI_SET          = 1,     /*!< SET : Read: A frame error occurred. Write: Force a frame error
                                                     interrupt.                                                                */
} USART_0_CONTROL_RFRMERI_Enum;

/* ============================================  USART_0 CONTROL RPARERI [1..1]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_RPARERI                                                   */
  USART_0_CONTROL_RPARERI_NOT_SET      = 0,     /*!< NOT_SET : Read: An invalid parity bit has not been received
                                                     since RPARERI was last cleared. Write: Clear the interrupt.               */
  USART_0_CONTROL_RPARERI_SET          = 1,     /*!< SET : Read: An invalid parity bit has been received since RPARERI
                                                     was last cleared. Write: Force a parity error interrupt.                  */
} USART_0_CONTROL_RPARERI_Enum;

/* =============================================  USART_0 CONTROL ROREI [2..2]  ============================================== */
typedef enum {                                  /*!< USART_0_CONTROL_ROREI                                                     */
  USART_0_CONTROL_ROREI_NOT_SET        = 0,     /*!< NOT_SET : Read: A receiver overrun has not occurred since ROREI
                                                     was last cleared. Write: Clear the interrupt.                             */
  USART_0_CONTROL_ROREI_SET            = 1,     /*!< SET : Read: A receiver overrun occurred. Write: Force a receiver
                                                     overrun interrupt.                                                        */
} USART_0_CONTROL_ROREI_Enum;

/* =============================================  USART_0 CONTROL RDREQI [3..3]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_RDREQI                                                    */
  USART_0_CONTROL_RDREQI_NOT_SET       = 0,     /*!< NOT_SET : Fewer than RFTH FIFO slots are filled with data.                */
  USART_0_CONTROL_RDREQI_SET           = 1,     /*!< SET : At least RFTH FIFO slots are filled with data.                      */
} USART_0_CONTROL_RDREQI_Enum;

/* =============================================  USART_0 CONTROL RERIEN [5..5]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_RERIEN                                                    */
  USART_0_CONTROL_RERIEN_DISABLED      = 0,     /*!< DISABLED : Disable the receive error interrupt.                           */
  USART_0_CONTROL_RERIEN_ENABLED       = 1,     /*!< ENABLED : Enable the receive error interrupt. A receive error
                                                     interrupt is asserted when ROREI, RFRMERI, or RPARERI is
                                                     set to 1.                                                                 */
} USART_0_CONTROL_RERIEN_Enum;

/* ============================================  USART_0 CONTROL RDREQIEN [6..6]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_RDREQIEN                                                  */
  USART_0_CONTROL_RDREQIEN_DISABLED    = 0,     /*!< DISABLED : Disable the read data request interrupt.                       */
  USART_0_CONTROL_RDREQIEN_ENABLED     = 1,     /*!< ENABLED : Enable the read data request interrupt. A receive
                                                     interrupt is generated when RDREQI is set to 1.                           */
} USART_0_CONTROL_RDREQIEN_Enum;

/* =============================================  USART_0 CONTROL MATMD [8..9]  ============================================== */
typedef enum {                                  /*!< USART_0_CONTROL_MATMD                                                     */
  USART_0_CONTROL_MATMD_OFF            = 0,     /*!< OFF : Disable the match function.                                         */
  USART_0_CONTROL_MATMD_MCE            = 1,     /*!< MCE : (MCE) Data whose last data bit equals RBIT is accepted
                                                     and stored.                                                               */
  USART_0_CONTROL_MATMD_FRAME          = 2,     /*!< FRAME : (Frame) A framing error is asserted if the last received
                                                     bit matches RBIT.                                                         */
  USART_0_CONTROL_MATMD_STORE          = 3,     /*!< STORE : (Store) Store the last incoming data bit in RBIT. This
                                                     mode can be used inconjunction with the RDATLN setting.                   */
} USART_0_CONTROL_MATMD_Enum;

/* ============================================  USART_0 CONTROL RABDEN [10..10]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_RABDEN                                                    */
  USART_0_CONTROL_RABDEN_DISABLED      = 0,     /*!< DISABLED : Disable receiver auto-baud.                                    */
  USART_0_CONTROL_RABDEN_ENABLED       = 1,     /*!< ENABLED : Enable receiver auto-baud.                                      */
} USART_0_CONTROL_RABDEN_Enum;

/* ============================================  USART_0 CONTROL RBUSYF [11..11]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_RBUSYF                                                    */
  USART_0_CONTROL_RBUSYF_NOT_SET       = 0,     /*!< NOT_SET : The USART receiver is idle.                                     */
  USART_0_CONTROL_RBUSYF_SET           = 1,     /*!< SET : The USART receiver is receiving data.                               */
} USART_0_CONTROL_RBUSYF_Enum;

/* =============================================  USART_0 CONTROL RBIT [12..12]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_RBIT                                                      */
  USART_0_CONTROL_RBIT_NOT_SET         = 0,     /*!< NOT_SET : NOT_SET                                                         */
  USART_0_CONTROL_RBIT_SET             = 1,     /*!< SET : SET                                                                 */
} USART_0_CONTROL_RBIT_Enum;

/* ============================================  USART_0 CONTROL ROSEN [13..13]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_ROSEN                                                     */
  USART_0_CONTROL_ROSEN_DISABLED       = 0,     /*!< DISABLED : Disable one-shot receive mode.                                 */
  USART_0_CONTROL_ROSEN_ENABLED        = 1,     /*!< ENABLED : Enable one-shot receive mode.                                   */
} USART_0_CONTROL_ROSEN_Enum;

/* =============================================  USART_0 CONTROL RINH [14..14]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_RINH                                                      */
  USART_0_CONTROL_RINH_INACTIVE        = 0,     /*!< INACTIVE : The receiver operates normally.                                */
  USART_0_CONTROL_RINH_ACTIVE          = 1,     /*!< ACTIVE : RTS is immediately asserted when RINH is set. The receiver
                                                     will complete any ongoing reception, but ignore all traffic
                                                     after that.                                                               */
} USART_0_CONTROL_RINH_Enum;

/* =============================================  USART_0 CONTROL REN [15..15]  ============================================== */
typedef enum {                                  /*!< USART_0_CONTROL_REN                                                       */
  USART_0_CONTROL_REN_DISABLED         = 0,     /*!< DISABLED : Disable the receiver. The receiver can receive one
                                                     data transaction only if ROSEN is set.                                    */
  USART_0_CONTROL_REN_ENABLED          = 1,     /*!< ENABLED : Enable the receiver.                                            */
} USART_0_CONTROL_REN_Enum;

/* ============================================  USART_0 CONTROL TSCERI [16..16]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_TSCERI                                                    */
  USART_0_CONTROL_TSCERI_NOT_SET       = 0,     /*!< NOT_SET : Read: A Smartcard parity error has not occurred since
                                                     TSCERI was last cleared. Write: Clear the interrupt.                      */
  USART_0_CONTROL_TSCERI_SET           = 1,     /*!< SET : Read: A Smartcard parity error occurred. Write: Force
                                                     a Smartcard parity error interrupt.                                       */
} USART_0_CONTROL_TSCERI_Enum;

