chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  USART_0 CONTROL TUREI [17..17]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_TUREI                                                     */
  USART_0_CONTROL_TUREI_NOT_SET        = 0,     /*!< NOT_SET : Read: A transmitter underrun has not occurred since
                                                     TUREI was last cleared. Write: Clear the interrupt.                       */
  USART_0_CONTROL_TUREI_SET            = 1,     /*!< SET : Read: A transmitter underrun occurred. Write: Force a
                                                     transmitter underrun interrupt.                                           */
} USART_0_CONTROL_TUREI_Enum;

/* ============================================  USART_0 CONTROL TDREQI [18..18]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_TDREQI                                                    */
  USART_0_CONTROL_TDREQI_NOT_SET       = 0,     /*!< NOT_SET : The transmitter is not requesting more FIFO data.               */
  USART_0_CONTROL_TDREQI_SET           = 1,     /*!< SET : The transmitter is requesting more FIFO data.                       */
} USART_0_CONTROL_TDREQI_Enum;

/* ============================================  USART_0 CONTROL TCPTI [19..19]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_TCPTI                                                     */
  USART_0_CONTROL_TCPTI_NOT_SET        = 0,     /*!< NOT_SET : Read: A transmit has not completed since TCPTI was
                                                     last cleared. Write: Clear the interrupt.                                 */
  USART_0_CONTROL_TCPTI_SET            = 1,     /*!< SET : Read: A byte was transmitted (TCCPTH = 0) or the last
                                                     available byte was transmitted (TCPTTH = 1). Write: Force
                                                     a transmit complete interrupt.                                            */
} USART_0_CONTROL_TCPTI_Enum;

/* ============================================  USART_0 CONTROL TCPTTH [20..20]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_TCPTTH                                                    */
  USART_0_CONTROL_TCPTTH_SET_ON_TX     = 0,     /*!< SET_ON_TX : A transmit is completed (TCPTI = 1) at the end of
                                                     each transmission.                                                        */
  USART_0_CONTROL_TCPTTH_SET_ON_EMPTY  = 1,     /*!< SET_ON_EMPTY : A transmit is completed (TCPTI = 1) only at the
                                                     end of a transmission when no more data is available to
                                                     transmit.                                                                 */
} USART_0_CONTROL_TCPTTH_Enum;

/* ============================================  USART_0 CONTROL TERIEN [21..21]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_TERIEN                                                    */
  USART_0_CONTROL_TERIEN_DISABLED      = 0,     /*!< DISABLED : Disable the transmit error interrupt.                          */
  USART_0_CONTROL_TERIEN_ENABLED       = 1,     /*!< ENABLED : Enable the transmit error interrupt. A transmit interrupt
                                                     is generated when TUREI or TSCERI is set to 1.                            */
} USART_0_CONTROL_TERIEN_Enum;

/* ===========================================  USART_0 CONTROL TDREQIEN [22..22]  =========================================== */
typedef enum {                                  /*!< USART_0_CONTROL_TDREQIEN                                                  */
  USART_0_CONTROL_TDREQIEN_DISABLED    = 0,     /*!< DISABLED : Disable the transmit data request interrupt.                   */
  USART_0_CONTROL_TDREQIEN_ENABLED     = 1,     /*!< ENABLED : Enable the transmit data request interrupt. A transmit
                                                     interrupt is asserted when TDREQI is set to 1.                            */
} USART_0_CONTROL_TDREQIEN_Enum;

/* ===========================================  USART_0 CONTROL TCPTIEN [23..23]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_TCPTIEN                                                   */
  USART_0_CONTROL_TCPTIEN_DISABLED     = 0,     /*!< DISABLED : Disable the transmit complete interrupt.                       */
  USART_0_CONTROL_TCPTIEN_ENABLED      = 1,     /*!< ENABLED : Enable the transmit complete interrupt. A transmit
                                                     interrupt is generated when TCPTI is set to 1.                            */
} USART_0_CONTROL_TCPTIEN_Enum;

/* ============================================  USART_0 CONTROL TBUSYF [27..27]  ============================================ */
typedef enum {                                  /*!< USART_0_CONTROL_TBUSYF                                                    */
  USART_0_CONTROL_TBUSYF_NOT_SET       = 0,     /*!< NOT_SET : The USART transmitter is idle.                                  */
  USART_0_CONTROL_TBUSYF_SET           = 1,     /*!< SET : The USART transmitter is active and transmitting.                   */
} USART_0_CONTROL_TBUSYF_Enum;

/* =============================================  USART_0 CONTROL TBIT [28..28]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_TBIT                                                      */
  USART_0_CONTROL_TBIT_NOT_SET         = 0,     /*!< NOT_SET : NOT_SET                                                         */
  USART_0_CONTROL_TBIT_SET             = 1,     /*!< SET : SET                                                                 */
} USART_0_CONTROL_TBIT_Enum;

/* =============================================  USART_0 CONTROL TINH [30..30]  ============================================= */
typedef enum {                                  /*!< USART_0_CONTROL_TINH                                                      */
  USART_0_CONTROL_TINH_INACTIVE        = 0,     /*!< INACTIVE : The transmitter operates normally.                             */
  USART_0_CONTROL_TINH_ACTIVE          = 1,     /*!< ACTIVE : Transmissions are inhibited. The transmitter will stall
                                                     after any current transmission is complete.                               */
} USART_0_CONTROL_TINH_Enum;

/* =============================================  USART_0 CONTROL TEN [31..31]  ============================================== */
typedef enum {                                  /*!< USART_0_CONTROL_TEN                                                       */
  USART_0_CONTROL_TEN_DISABLED         = 0,     /*!< DISABLED : Disable the transmitter. When cleared, the transmitter
                                                     immediately aborts any active transmission. Clearing this
                                                     bit does not automatically flush the transmit FIFO.                       */
  USART_0_CONTROL_TEN_ENABLED          = 1,     /*!< ENABLED : Enable the transmitter. The transmitter will initiate
                                                     a transmission when data becomes available in the transmit
                                                     FIFO.                                                                     */
} USART_0_CONTROL_TEN_Enum;

