chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ========================================================  IPDELAY  ======================================================== */
/* =======================================================  BAUDRATE  ======================================================== */
/* ========================================================  FIFOCN  ========================================================= */
/* ==============================================  USART_0 FIFOCN RFTH [4..5]  =============================================== */
typedef enum {                                  /*!< USART_0_FIFOCN_RFTH                                                       */
  USART_0_FIFOCN_RFTH_ONE              = 0,     /*!< ONE : A DMA request or read data request interrupt (RDREQI)
                                                     is asserted when >= 1 FIFO slot is full.                                  */
  USART_0_FIFOCN_RFTH_TWO              = 1,     /*!< TWO : A DMA request or read data request interrupt (RDREQI)
                                                     is asserted when >= 2 FIFO slots are full.                                */
  USART_0_FIFOCN_RFTH_FOUR             = 2,     /*!< FOUR : A DMA request or read data request interrupt (RDREQ)
                                                     is asserted when >= 4 FIFO slots are full.                                */
} USART_0_FIFOCN_RFTH_Enum;

/* =============================================  USART_0 FIFOCN RDMAEN [7..7]  ============================================== */
typedef enum {                                  /*!< USART_0_FIFOCN_RDMAEN                                                     */
  USART_0_FIFOCN_RDMAEN_DISABLED       = 0,     /*!< DISABLED : Disable receive FIFO DMA requests.                             */
  USART_0_FIFOCN_RDMAEN_ENABLED        = 1,     /*!< ENABLED : Enable receive FIFO DMA requests.                               */
} USART_0_FIFOCN_RDMAEN_Enum;

/* =============================================  USART_0 FIFOCN RFIFOFL [8..8]  ============================================= */
typedef enum {                                  /*!< USART_0_FIFOCN_RFIFOFL                                                    */
  USART_0_FIFOCN_RFIFOFL_SET           = 1,     /*!< SET : Flush the contents of the receive FIFO and any data in
                                                     the receive shift register.                                               */
} USART_0_FIFOCN_RFIFOFL_Enum;

/* ==============================================  USART_0 FIFOCN RFERI [9..9]  ============================================== */
typedef enum {                                  /*!< USART_0_FIFOCN_RFERI                                                      */
  USART_0_FIFOCN_RFERI_NOT_SET         = 0,     /*!< NOT_SET : A receive FIFO error has not occurred since RFERI
                                                     was last cleared.                                                         */
  USART_0_FIFOCN_RFERI_SET             = 1,     /*!< SET : A receive FIFO error occurred.                                      */
} USART_0_FIFOCN_RFERI_Enum;

/* ===========================================  USART_0 FIFOCN RSRFULLF [10..10]  ============================================ */
typedef enum {                                  /*!< USART_0_FIFOCN_RSRFULLF                                                   */
  USART_0_FIFOCN_RSRFULLF_NOT_SET      = 0,     /*!< NOT_SET : The receive data shift register is not full.                    */
  USART_0_FIFOCN_RSRFULLF_SET          = 1,     /*!< SET : The receive data shift register is full.                            */
} USART_0_FIFOCN_RSRFULLF_Enum;

/* =============================================  USART_0 FIFOCN TFTH [20..21]  ============================================== */
typedef enum {                                  /*!< USART_0_FIFOCN_TFTH                                                       */
  USART_0_FIFOCN_TFTH_ONE              = 0,     /*!< ONE : A DMA request or transmit data request interrupt (TDREQI)
                                                     is asserted when >= 1 FIFO slot is empty.                                 */
  USART_0_FIFOCN_TFTH_TWO              = 1,     /*!< TWO : A DMA request or transmit data request interrupt (TDREQI)
                                                     is asserted when >= 2 FIFO slots are empty.                               */
  USART_0_FIFOCN_TFTH_FOUR             = 2,     /*!< FOUR : A DMA request or transmit data request interrupt (TDREQ)
                                                     is asserted when >= 4 FIFO slots are empty.                               */
} USART_0_FIFOCN_TFTH_Enum;

/* ============================================  USART_0 FIFOCN TDMAEN [23..23]  ============================================= */
typedef enum {                                  /*!< USART_0_FIFOCN_TDMAEN                                                     */
  USART_0_FIFOCN_TDMAEN_DISABLED       = 0,     /*!< DISABLED : Disable transmit FIFO DMA requests.                            */
  USART_0_FIFOCN_TDMAEN_ENABLED        = 1,     /*!< ENABLED : Enable transmit FIFO DMA requests.                              */
} USART_0_FIFOCN_TDMAEN_Enum;

/* ============================================  USART_0 FIFOCN TFIFOFL [24..24]  ============================================ */
typedef enum {                                  /*!< USART_0_FIFOCN_TFIFOFL                                                    */
  USART_0_FIFOCN_TFIFOFL_SET           = 1,     /*!< SET : Flush the contents of the transmit FIFO. If data is pending
                                                     in the transmit shift register but a transmit has not begun,
                                                     the shift register is also flushed.                                       */
} USART_0_FIFOCN_TFIFOFL_Enum;

/* =============================================  USART_0 FIFOCN TFERI [25..25]  ============================================= */
typedef enum {                                  /*!< USART_0_FIFOCN_TFERI                                                      */
  USART_0_FIFOCN_TFERI_NOT_SET         = 0,     /*!< NOT_SET : A transmit FIFO error has not occurred since TFERI
                                                     was last cleared.                                                         */
  USART_0_FIFOCN_TFERI_SET             = 1,     /*!< SET : A transmit FIFO error occurred.                                     */
} USART_0_FIFOCN_TFERI_Enum;

/* ===========================================  USART_0 FIFOCN TSRFULLF [26..26]  ============================================ */
typedef enum {                                  /*!< USART_0_FIFOCN_TSRFULLF                                                   */
  USART_0_FIFOCN_TSRFULLF_NOT_SET      = 0,     /*!< NOT_SET : The transmit shift register is not full.                        */
  USART_0_FIFOCN_TSRFULLF_SET          = 1,     /*!< SET : The transmit shift register is full.                                */
} USART_0_FIFOCN_TSRFULLF_Enum;

/* =========================================================  DATA  ========================================================== */


/* =========================================================================================================================== */
/* ================                                           USB_0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  FADDR  ========================================================= */
/* ==============================================  USB_0 FADDR FADDRUPD [7..7]  ============================================== */
typedef enum {                                  /*!< USB_0_FADDR_FADDRUPD                                                      */
  USB_0_FADDR_FADDRUPD_NOT_SET         = 0,     /*!< NOT_SET : The last address written to FADDR is in effect.                 */
  USB_0_FADDR_FADDRUPD_SET             = 1,     /*!< SET : The last address written to FADDR is not yet in effect.             */
} USB_0_FADDR_FADDRUPD_Enum;

/* =========================================================  POWER  ========================================================= */
/* ===============================================  USB_0 POWER SUSDEN [0..0]  =============================================== */
typedef enum {                                  /*!< USB_0_POWER_SUSDEN                                                        */
  USB_0_POWER_SUSDEN_DISABLED          = 0,     /*!< DISABLED : Disable suspend detection. The USB module will ignore
                                                     suspend signaling on the bus.                                             */
  USB_0_POWER_SUSDEN_ENABLED           = 1,     /*!< ENABLED : Enable suspend detection. The USB module will enter
                                                     suspend mode if it detects suspend signalling on the bus.                 */
} USB_0_POWER_SUSDEN_Enum;

/* ===============================================  USB_0 POWER SUSMDF [1..1]  =============================================== */
typedef enum {                                  /*!< USB_0_POWER_SUSMDF                                                        */
  USB_0_POWER_SUSMDF_NOT_SET           = 0,     /*!< NOT_SET : The USB module is not in suspend mode.                          */
  USB_0_POWER_SUSMDF_SET               = 1,     /*!< SET : The USB module is in suspend mode.                                  */
} USB_0_POWER_SUSMDF_Enum;

/* ===============================================  USB_0 POWER RESUME [2..2]  =============================================== */
typedef enum {                                  /*!< USB_0_POWER_RESUME                                                        */
  USB_0_POWER_RESUME_STOP              = 0,     /*!< STOP : STOP                                                               */
  USB_0_POWER_RESUME_GENERATE          = 1,     /*!< GENERATE : GENERATE                                                       */
} USB_0_POWER_RESUME_Enum;

/* ==============================================  USB_0 POWER RSTDETF [3..3]  =============================================== */
typedef enum {                                  /*!< USB_0_POWER_RSTDETF                                                       */
  USB_0_POWER_RSTDETF_NOT_SET          = 0,     /*!< NOT_SET : Reset signaling is not present on the bus.                      */
  USB_0_POWER_RSTDETF_SET              = 1,     /*!< SET : Reset signaling detected on the bus.                                */
} USB_0_POWER_RSTDETF_Enum;

/* ===============================================  USB_0 POWER USBINH [4..4]  =============================================== */
typedef enum {                                  /*!< USB_0_POWER_USBINH                                                        */
  USB_0_POWER_USBINH_INACTIVE          = 0,     /*!< INACTIVE : Enable the USB module.                                         */
  USB_0_POWER_USBINH_ACTIVE            = 1,     /*!< ACTIVE : USB module inhibited. All USB traffic is ignored.                */
} USB_0_POWER_USBINH_Enum;

/* ===============================================  USB_0 POWER DITHEN [5..5]  =============================================== */
typedef enum {                                  /*!< USB_0_POWER_DITHEN                                                        */
  USB_0_POWER_DITHEN_DISABLED          = 0,     /*!< DISABLED : Disable automatic USB dithering.                               */
  USB_0_POWER_DITHEN_ENABLED           = 1,     /*!< ENABLED : Enable automatic USB dithering.                                 */
} USB_0_POWER_DITHEN_Enum;

/* ==============================================  USB_0 POWER ISOUPDMD [7..7]  ============================================== */
typedef enum {                                  /*!< USB_0_POWER_ISOUPDMD                                                      */
  USB_0_POWER_ISOUPDMD_SEND_ON_IN      = 0,     /*!< SEND_ON_IN : When software writes IPRDYI = 1, USB will send
                                                     the packet when the next IN token is received.                            */
  USB_0_POWER_ISOUPDMD_SEND_ON_SOF     = 1,     /*!< SEND_ON_SOF : When software writes IPRDYI = 1, USB will wait
                                                     for a SOF token before sending the packet. If an IN token
                                                     is received before a SOF token, USB will send a zero-length
                                                     data packet.                                                              */
} USB_0_POWER_ISOUPDMD_Enum;

/* =========================================================  IOINT  ========================================================= */
/* ================================================  USB_0 IOINT EP0I [0..0]  ================================================ */
typedef enum {                                  /*!< USB_0_IOINT_EP0I                                                          */
  USB_0_IOINT_EP0I_NOT_SET             = 0,     /*!< NOT_SET : Read: Endpoint 0 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_EP0I_SET                 = 1,     /*!< SET : Read: Endpoint 0 interrupt occurred. Write: Clear the
                                                     interrupt.                                                                */
} USB_0_IOINT_EP0I_Enum;

