chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ================================================  USB_0 IOINT IN1I [1..1]  ================================================ */
typedef enum {                                  /*!< USB_0_IOINT_IN1I                                                          */
  USB_0_IOINT_IN1I_NOT_SET             = 0,     /*!< NOT_SET : Read: IN Endpoint 1 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_IN1I_SET                 = 1,     /*!< SET : Read: IN Endpoint 1 interrupt occurred. Write: Clear the
                                                     interrupt.                                                                */
} USB_0_IOINT_IN1I_Enum;

/* ================================================  USB_0 IOINT IN2I [2..2]  ================================================ */
typedef enum {                                  /*!< USB_0_IOINT_IN2I                                                          */
  USB_0_IOINT_IN2I_NOT_SET             = 0,     /*!< NOT_SET : Read: IN Endpoint 2 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_IN2I_SET                 = 1,     /*!< SET : Read: IN Endpoint 2 interrupt occurred. Write: Clear the
                                                     interrupt.                                                                */
} USB_0_IOINT_IN2I_Enum;

/* ================================================  USB_0 IOINT IN3I [3..3]  ================================================ */
typedef enum {                                  /*!< USB_0_IOINT_IN3I                                                          */
  USB_0_IOINT_IN3I_NOT_SET             = 0,     /*!< NOT_SET : Read: IN Endpoint 3 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_IN3I_SET                 = 1,     /*!< SET : Read: IN Endpoint 3 interrupt occurred. Write: Clear the
                                                     interrupt.                                                                */
} USB_0_IOINT_IN3I_Enum;

/* ================================================  USB_0 IOINT IN4I [4..4]  ================================================ */
typedef enum {                                  /*!< USB_0_IOINT_IN4I                                                          */
  USB_0_IOINT_IN4I_NOT_SET             = 0,     /*!< NOT_SET : Read: IN Endpoint 4 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_IN4I_SET                 = 1,     /*!< SET : Read: IN Endpoint 4 interrupt occurred. Write: Clear the
                                                     interrupt.                                                                */
} USB_0_IOINT_IN4I_Enum;

/* ==============================================  USB_0 IOINT OUT1I [17..17]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINT_OUT1I                                                         */
  USB_0_IOINT_OUT1I_NOT_SET            = 0,     /*!< NOT_SET : Read: OUT Endpoint 1 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_OUT1I_SET                = 1,     /*!< SET : Read: OUT Endpoint 1 interrupt occurred. Write: Clear
                                                     the interrupt.                                                            */
} USB_0_IOINT_OUT1I_Enum;

/* ==============================================  USB_0 IOINT OUT2I [18..18]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINT_OUT2I                                                         */
  USB_0_IOINT_OUT2I_NOT_SET            = 0,     /*!< NOT_SET : Read: OUT Endpoint 2 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_OUT2I_SET                = 1,     /*!< SET : Read: OUT Endpoint 2 interrupt occurred. Write: Clear
                                                     the interrupt.                                                            */
} USB_0_IOINT_OUT2I_Enum;

/* ==============================================  USB_0 IOINT OUT3I [19..19]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINT_OUT3I                                                         */
  USB_0_IOINT_OUT3I_NOT_SET            = 0,     /*!< NOT_SET : Read: OUT Endpoint 3 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_OUT3I_SET                = 1,     /*!< SET : Read: OUT Endpoint 3 interrupt occurred. Write: Clear
                                                     the interrupt.                                                            */
} USB_0_IOINT_OUT3I_Enum;

/* ==============================================  USB_0 IOINT OUT4I [20..20]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINT_OUT4I                                                         */
  USB_0_IOINT_OUT4I_NOT_SET            = 0,     /*!< NOT_SET : Read: OUT Endpoint 4 interrupt has not occurred. Write:
                                                     No effect.                                                                */
  USB_0_IOINT_OUT4I_SET                = 1,     /*!< SET : Read: OUT Endpoint 4 interrupt occurred. Write: Clear
                                                     the interrupt.                                                            */
} USB_0_IOINT_OUT4I_Enum;

