chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =========================================================  CMINT  ========================================================= */
/* ================================================  USB_0 CMINT SUSI [0..0]  ================================================ */
typedef enum {                                  /*!< USB_0_CMINT_SUSI                                                          */
  USB_0_CMINT_SUSI_NOT_SET             = 0,     /*!< NOT_SET : Read: Suspend interrupt has not occurred. Write: No
                                                     effect.                                                                   */
  USB_0_CMINT_SUSI_SET                 = 1,     /*!< SET : Read: Suspend interrupt occurred. Write: Clear the interrupt.       */
} USB_0_CMINT_SUSI_Enum;

/* ================================================  USB_0 CMINT RESI [1..1]  ================================================ */
typedef enum {                                  /*!< USB_0_CMINT_RESI                                                          */
  USB_0_CMINT_RESI_NOT_SET             = 0,     /*!< NOT_SET : Read: Resume interrupt has not occurred. Write: No
                                                     effect.                                                                   */
  USB_0_CMINT_RESI_SET                 = 1,     /*!< SET : Read: Resume interrupt occurred. Write: Clear the interrupt.        */
} USB_0_CMINT_RESI_Enum;

/* ================================================  USB_0 CMINT RSTI [2..2]  ================================================ */
typedef enum {                                  /*!< USB_0_CMINT_RSTI                                                          */
  USB_0_CMINT_RSTI_NOT_SET             = 0,     /*!< NOT_SET : Read: Reset interrupt has not occurred. Write: No
                                                     effect.                                                                   */
  USB_0_CMINT_RSTI_SET                 = 1,     /*!< SET : Read: Reset interrupt occurred. Write: Clear the interrupt.         */
} USB_0_CMINT_RSTI_Enum;

/* ================================================  USB_0 CMINT SOFI [3..3]  ================================================ */
typedef enum {                                  /*!< USB_0_CMINT_SOFI                                                          */
  USB_0_CMINT_SOFI_NOT_SET             = 0,     /*!< NOT_SET : Read: SOF interrupt has not occurred. Write: No effect.         */
  USB_0_CMINT_SOFI_SET                 = 1,     /*!< SET : Read: SOF interrupt occurred. Write: Clear the interrupt.           */
} USB_0_CMINT_SOFI_Enum;

/* ========================================================  IOINTE  ========================================================= */
/* ==============================================  USB_0 IOINTE EP0IEN [0..0]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINTE_EP0IEN                                                       */
  USB_0_IOINTE_EP0IEN_DISABLED         = 0,     /*!< DISABLED : Disable the Endpoint 0 interrupt.                              */
  USB_0_IOINTE_EP0IEN_ENABLED          = 1,     /*!< ENABLED : Enable the Endpoint 0 interrupt.                                */
} USB_0_IOINTE_EP0IEN_Enum;

/* ==============================================  USB_0 IOINTE IN1IEN [1..1]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINTE_IN1IEN                                                       */
  USB_0_IOINTE_IN1IEN_DISABLED         = 0,     /*!< DISABLED : Disable the IN Endpoint 1 interrupt.                           */
  USB_0_IOINTE_IN1IEN_ENABLED          = 1,     /*!< ENABLED : Enable the IN Endpoint 1 interrupt.                             */
} USB_0_IOINTE_IN1IEN_Enum;

/* ==============================================  USB_0 IOINTE IN2IEN [2..2]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINTE_IN2IEN                                                       */
  USB_0_IOINTE_IN2IEN_DISABLED         = 0,     /*!< DISABLED : Disable the IN Endpoint 2 interrupt.                           */
  USB_0_IOINTE_IN2IEN_ENABLED          = 1,     /*!< ENABLED : Enable the IN Endpoint 2 interrupt.                             */
} USB_0_IOINTE_IN2IEN_Enum;

/* ==============================================  USB_0 IOINTE IN3IEN [3..3]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINTE_IN3IEN                                                       */
  USB_0_IOINTE_IN3IEN_DISABLED         = 0,     /*!< DISABLED : Disable the IN Endpoint 3 interrupt.                           */
  USB_0_IOINTE_IN3IEN_ENABLED          = 1,     /*!< ENABLED : Enable the IN Endpoint 3 interrupt.                             */
} USB_0_IOINTE_IN3IEN_Enum;

/* ==============================================  USB_0 IOINTE IN4IEN [4..4]  =============================================== */
typedef enum {                                  /*!< USB_0_IOINTE_IN4IEN                                                       */
  USB_0_IOINTE_IN4IEN_DISABLED         = 0,     /*!< DISABLED : Disable the IN Endpoint 4 interrupt.                           */
  USB_0_IOINTE_IN4IEN_ENABLED          = 1,     /*!< ENABLED : Enable the IN Endpoint 4 interrupt.                             */
} USB_0_IOINTE_IN4IEN_Enum;

/* =============================================  USB_0 IOINTE OUT1IEN [17..17]  ============================================= */
typedef enum {                                  /*!< USB_0_IOINTE_OUT1IEN                                                      */
  USB_0_IOINTE_OUT1IEN_DISABLED        = 0,     /*!< DISABLED : Disable the OUT Endpoint 1 interrupt.                          */
  USB_0_IOINTE_OUT1IEN_ENABLED         = 1,     /*!< ENABLED : Enable the OUT Endpoint 1 interrupt.                            */
} USB_0_IOINTE_OUT1IEN_Enum;

/* =============================================  USB_0 IOINTE OUT2IEN [18..18]  ============================================= */
typedef enum {                                  /*!< USB_0_IOINTE_OUT2IEN                                                      */
  USB_0_IOINTE_OUT2IEN_DISABLED        = 0,     /*!< DISABLED : Disable the OUT Endpoint 2 interrupt.                          */
  USB_0_IOINTE_OUT2IEN_ENABLED         = 1,     /*!< ENABLED : Enable the OUT Endpoint 2 interrupt.                            */
} USB_0_IOINTE_OUT2IEN_Enum;

