chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  USB_0 IOINTE OUT3IEN [19..19]  ============================================= */
typedef enum {                                  /*!< USB_0_IOINTE_OUT3IEN                                                      */
  USB_0_IOINTE_OUT3IEN_DISABLED        = 0,     /*!< DISABLED : Disable the OUT Endpoint 3 interrupt.                          */
  USB_0_IOINTE_OUT3IEN_ENABLED         = 1,     /*!< ENABLED : Enable the OUT Endpoint 3 interrupt.                            */
} USB_0_IOINTE_OUT3IEN_Enum;

/* =============================================  USB_0 IOINTE OUT4IEN [20..20]  ============================================= */
typedef enum {                                  /*!< USB_0_IOINTE_OUT4IEN                                                      */
  USB_0_IOINTE_OUT4IEN_DISABLED        = 0,     /*!< DISABLED : Disable the OUT Endpoint 4 interrupt.                          */
  USB_0_IOINTE_OUT4IEN_ENABLED         = 1,     /*!< ENABLED : Enable the OUT Endpoint 4 interrupt.                            */
} USB_0_IOINTE_OUT4IEN_Enum;

/* =======================================================  CMINTEPE  ======================================================== */
/* =============================================  USB_0 CMINTEPE SUSIEN [0..0]  ============================================== */
typedef enum {                                  /*!< USB_0_CMINTEPE_SUSIEN                                                     */
  USB_0_CMINTEPE_SUSIEN_DISABLED       = 0,     /*!< DISABLED : Disable the Suspend interrupt.                                 */
  USB_0_CMINTEPE_SUSIEN_ENABLED        = 1,     /*!< ENABLED : Enable the Suspend interrupt.                                   */
} USB_0_CMINTEPE_SUSIEN_Enum;

/* =============================================  USB_0 CMINTEPE RESIEN [1..1]  ============================================== */
typedef enum {                                  /*!< USB_0_CMINTEPE_RESIEN                                                     */
  USB_0_CMINTEPE_RESIEN_DISABLED       = 0,     /*!< DISABLED : Disable the Resume interrupt.                                  */
  USB_0_CMINTEPE_RESIEN_ENABLED        = 1,     /*!< ENABLED : Enable the Resume interrupt.                                    */
} USB_0_CMINTEPE_RESIEN_Enum;

/* =============================================  USB_0 CMINTEPE RSTIEN [2..2]  ============================================== */
typedef enum {                                  /*!< USB_0_CMINTEPE_RSTIEN                                                     */
  USB_0_CMINTEPE_RSTIEN_DISABLED       = 0,     /*!< DISABLED : Disable the Reset interrupt.                                   */
  USB_0_CMINTEPE_RSTIEN_ENABLED        = 1,     /*!< ENABLED : Enable the Reset interrupt.                                     */
} USB_0_CMINTEPE_RSTIEN_Enum;

/* =============================================  USB_0 CMINTEPE SOFIEN [3..3]  ============================================== */
typedef enum {                                  /*!< USB_0_CMINTEPE_SOFIEN                                                     */
  USB_0_CMINTEPE_SOFIEN_DISABLED       = 0,     /*!< DISABLED : Disable the SOF interrupt.                                     */
  USB_0_CMINTEPE_SOFIEN_ENABLED        = 1,     /*!< ENABLED : Enable the SOF interrupt.                                       */
} USB_0_CMINTEPE_SOFIEN_Enum;

/* =============================================  USB_0 CMINTEPE EP0EN [16..16]  ============================================= */
typedef enum {                                  /*!< USB_0_CMINTEPE_EP0EN                                                      */
  USB_0_CMINTEPE_EP0EN_DISABLED        = 0,     /*!< DISABLED : Disable Endpoint 0 (no NACK, ACK, or STALL on the
                                                     USB network).                                                             */
  USB_0_CMINTEPE_EP0EN_ENABLED         = 1,     /*!< ENABLED : Enable Endpoint 0 (normal).                                     */
} USB_0_CMINTEPE_EP0EN_Enum;

/* =============================================  USB_0 CMINTEPE EP1EN [17..17]  ============================================= */
typedef enum {                                  /*!< USB_0_CMINTEPE_EP1EN                                                      */
  USB_0_CMINTEPE_EP1EN_DISABLED        = 0,     /*!< DISABLED : Disable Endpoint 1 (no NACK, ACK, or STALL on the
                                                     USB network).                                                             */
  USB_0_CMINTEPE_EP1EN_ENABLED         = 1,     /*!< ENABLED : Enable Endpoint 1 (normal).                                     */
} USB_0_CMINTEPE_EP1EN_Enum;

/* =============================================  USB_0 CMINTEPE EP2EN [18..18]  ============================================= */
typedef enum {                                  /*!< USB_0_CMINTEPE_EP2EN                                                      */
  USB_0_CMINTEPE_EP2EN_DISABLED        = 0,     /*!< DISABLED : Disable Endpoint 2 (no NACK, ACK, or STALL on the
                                                     USB network).                                                             */
  USB_0_CMINTEPE_EP2EN_ENABLED         = 1,     /*!< ENABLED : Enable Endpoint 2 (normal).                                     */
} USB_0_CMINTEPE_EP2EN_Enum;

/* =============================================  USB_0 CMINTEPE EP3EN [19..19]  ============================================= */
typedef enum {                                  /*!< USB_0_CMINTEPE_EP3EN                                                      */
  USB_0_CMINTEPE_EP3EN_DISABLED        = 0,     /*!< DISABLED : Disable Endpoint 3 (no NACK, ACK, or STALL on the
                                                     USB network).                                                             */
  USB_0_CMINTEPE_EP3EN_ENABLED         = 1,     /*!< ENABLED : Enable Endpoint 3 (normal).                                     */
} USB_0_CMINTEPE_EP3EN_Enum;

/* =============================================  USB_0 CMINTEPE EP4EN [20..20]  ============================================= */
typedef enum {                                  /*!< USB_0_CMINTEPE_EP4EN                                                      */
  USB_0_CMINTEPE_EP4EN_DISABLED        = 0,     /*!< DISABLED : Disable Endpoint 4 (no NACK, ACK, or STALL on the
                                                     USB network).                                                             */
  USB_0_CMINTEPE_EP4EN_ENABLED         = 1,     /*!< ENABLED : Enable Endpoint 4 (normal).                                     */
} USB_0_CMINTEPE_EP4EN_Enum;

/* =======================================================  CRCONTROL  ======================================================= */
/* ==============================================  USB_0 CRCONTROL OLEN [4..4]  ============================================== */
typedef enum {                                  /*!< USB_0_CRCONTROL_OLEN                                                      */
  USB_0_CRCONTROL_OLEN_DISABLED        = 0,     /*!< DISABLED : Do not freeze the USB oscillator output frequency
                                                     (closed loop mode).                                                       */
  USB_0_CRCONTROL_OLEN_ENABLED         = 1,     /*!< ENABLED : Freeze the USB oscillator output frequency (open loop
                                                     mode).                                                                    */
} USB_0_CRCONTROL_OLEN_Enum;

/* =============================================  USB_0 CRCONTROL LSCRMD [5..5]  ============================================= */
typedef enum {                                  /*!< USB_0_CRCONTROL_LSCRMD                                                    */
  USB_0_CRCONTROL_LSCRMD_FULL_SPEED    = 0,     /*!< FULL_SPEED : Full Speed Mode.                                             */
  USB_0_CRCONTROL_LSCRMD_LOW_SPEED     = 1,     /*!< LOW_SPEED : Low Speed Mode.                                               */
} USB_0_CRCONTROL_LSCRMD_Enum;

/* =============================================  USB_0 CRCONTROL CRSSEN [6..6]  ============================================= */
typedef enum {                                  /*!< USB_0_CRCONTROL_CRSSEN                                                    */
  USB_0_CRCONTROL_CRSSEN_DISABLED      = 0,     /*!< DISABLED : Normal calibration mode.                                       */
  USB_0_CRCONTROL_CRSSEN_ENABLED       = 1,     /*!< ENABLED : Single step mode.                                               */
} USB_0_CRCONTROL_CRSSEN_Enum;

