chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==============================================  USB_0 CRCONTROL CREN [7..7]  ============================================== */
typedef enum {                                  /*!< USB_0_CRCONTROL_CREN                                                      */
  USB_0_CRCONTROL_CREN_DISABLED        = 0,     /*!< DISABLED : Disable clock recovery.                                        */
  USB_0_CRCONTROL_CREN_ENABLED         = 1,     /*!< ENABLED : Enable clock recovery.                                          */
} USB_0_CRCONTROL_CREN_Enum;

/* =========================================================  FRAME  ========================================================= */
/* =======================================================  TCONTROL  ======================================================== */
/* ===============================================  USB_0 TCONTROL DN [0..0]  ================================================ */
typedef enum {                                  /*!< USB_0_TCONTROL_DN                                                         */
  USB_0_TCONTROL_DN_LOGIC_0            = 0,     /*!< LOGIC_0 : D- signal currently at logic 0.                                 */
  USB_0_TCONTROL_DN_LOGIC_1            = 1,     /*!< LOGIC_1 : D- signal currently at logic 1.                                 */
} USB_0_TCONTROL_DN_Enum;

/* ===============================================  USB_0 TCONTROL DP [1..1]  ================================================ */
typedef enum {                                  /*!< USB_0_TCONTROL_DP                                                         */
  USB_0_TCONTROL_DP_LOGIC_0            = 0,     /*!< LOGIC_0 : D+ signal currently at logic 0.                                 */
  USB_0_TCONTROL_DP_LOGIC_1            = 1,     /*!< LOGIC_1 : D+ signal currently at logic 1.                                 */
} USB_0_TCONTROL_DP_Enum;

/* ==============================================  USB_0 TCONTROL DFREC [2..2]  ============================================== */
typedef enum {                                  /*!< USB_0_TCONTROL_DFREC                                                      */
  USB_0_TCONTROL_DFREC_DIFF_0          = 0,     /*!< DIFF_0 : Differential 0 signalling is present on the bus.                 */
  USB_0_TCONTROL_DFREC_DIFF_1          = 1,     /*!< DIFF_1 : Differential 1 signalling is present on the bus.                 */
} USB_0_TCONTROL_DFREC_Enum;

/* =============================================  USB_0 TCONTROL PHYTST [3..4]  ============================================== */
typedef enum {                                  /*!< USB_0_TCONTROL_PHYTST                                                     */
  USB_0_TCONTROL_PHYTST_MODE0          = 0,     /*!< MODE0 : Mode 0: Normal (non-test mode) (D+ = X, D- = X).                  */
  USB_0_TCONTROL_PHYTST_MODE1          = 1,     /*!< MODE1 : Mode 1: Differential 1 Forced (D+ = 1, D- = 0).                   */
  USB_0_TCONTROL_PHYTST_MODE2          = 2,     /*!< MODE2 : Mode 2: Differential 0 Forced (D+ = 0, D- = 1).                   */
  USB_0_TCONTROL_PHYTST_MODE3          = 3,     /*!< MODE3 : Mode 3: Single-Ended 0 Forced (D+ = 0, D- = 0).                   */
} USB_0_TCONTROL_PHYTST_Enum;

/* ==============================================  USB_0 TCONTROL SSEL [5..5]  =============================================== */
typedef enum {                                  /*!< USB_0_TCONTROL_SSEL                                                       */
  USB_0_TCONTROL_SSEL_LOW_SPEED        = 0,     /*!< LOW_SPEED : USB operates as a Low Speed device. If enabled,
                                                     the internal pull-up resistor appears on the D- line.                     */
  USB_0_TCONTROL_SSEL_FULL_SPEED       = 1,     /*!< FULL_SPEED : USB operates as a Full Speed device. If enabled,
                                                     the internal pull-up resistor appears on the D+ line.                     */
} USB_0_TCONTROL_SSEL_Enum;

/* ==============================================  USB_0 TCONTROL PHYEN [6..6]  ============================================== */
typedef enum {                                  /*!< USB_0_TCONTROL_PHYEN                                                      */
  USB_0_TCONTROL_PHYEN_DISABLED        = 0,     /*!< DISABLED : Disable the USB physical layer Transceiver (suspend).          */
  USB_0_TCONTROL_PHYEN_ENABLED         = 1,     /*!< ENABLED : Enable the USB physical layer Transceiver (normal).             */
} USB_0_TCONTROL_PHYEN_Enum;

/* ==============================================  USB_0 TCONTROL PUEN [7..7]  =============================================== */
typedef enum {                                  /*!< USB_0_TCONTROL_PUEN                                                       */
  USB_0_TCONTROL_PUEN_DISABLED         = 0,     /*!< DISABLED : Disable the internal pull-up resistor (device effectively
                                                     detached from the USB network).                                           */
  USB_0_TCONTROL_PUEN_ENABLED          = 1,     /*!< ENABLED : Enable the internal pull-up resistor when VBUS is
                                                     present (device is attached to the USB network).                          */
} USB_0_TCONTROL_PUEN_Enum;

/* ========================================================  CLKSEL  ========================================================= */
/* ==============================================  USB_0 CLKSEL CLKSEL [0..1]  =============================================== */
typedef enum {                                  /*!< USB_0_CLKSEL_CLKSEL                                                       */
  USB_0_CLKSEL_CLKSEL_USBNOSC          = 0,     /*!< USBNOSC : Select the USB Oscillator as the USB clock.                     */
  USB_0_CLKSEL_CLKSEL_PLLNOSC          = 1,     /*!< PLLNOSC : Select the PLL output as the USB clock.                         */
  USB_0_CLKSEL_CLKSEL_EXTOSCN          = 2,     /*!< EXTOSCN : Select the External Oscillator output (EXTOSCn) as
                                                     the USB clock.                                                            */
} USB_0_CLKSEL_CLKSEL_Enum;

/* ==============================================  USB_0 CLKSEL CLKDIV [4..5]  =============================================== */
typedef enum {                                  /*!< USB_0_CLKSEL_CLKDIV                                                       */
  USB_0_CLKSEL_CLKDIV_DIV1             = 0,     /*!< DIV1 : The USB module uses the selected input clock divided
                                                     by 1.                                                                     */
  USB_0_CLKSEL_CLKDIV_DIV2             = 1,     /*!< DIV2 : The USB module uses the selected input clock divided
                                                     by 2.                                                                     */
  USB_0_CLKSEL_CLKDIV_DIV4             = 2,     /*!< DIV4 : The USB module uses the selected input clock divided
                                                     by 4.                                                                     */
  USB_0_CLKSEL_CLKDIV_DIV8             = 3,     /*!< DIV8 : The USB module uses the selected input clock divided
                                                     by 8.                                                                     */
} USB_0_CLKSEL_CLKDIV_Enum;

/* ===============================================  USB_0 CLKSEL RESET [6..6]  =============================================== */
typedef enum {                                  /*!< USB_0_CLKSEL_RESET                                                        */
  USB_0_CLKSEL_RESET_NOT_SET           = 0,     /*!< NOT_SET : Do not reset the USB module.                                    */
  USB_0_CLKSEL_RESET_SET               = 1,     /*!< SET : Reset the USB module.                                               */
} USB_0_CLKSEL_RESET_Enum;

/* ======================================================  OSCCONTROL  ======================================================= */
/* ============================================  USB_0 OSCCONTROL SUSPEND [5..5]  ============================================ */
typedef enum {                                  /*!< USB_0_OSCCONTROL_SUSPEND                                                  */
  USB_0_OSCCONTROL_SUSPEND_DISABLED    = 0,     /*!< DISABLED : The USB oscillator is not suspended.                           */
  USB_0_OSCCONTROL_SUSPEND_ENABLED     = 1,     /*!< ENABLED : Suspend the USB oscillator.                                     */
} USB_0_OSCCONTROL_SUSPEND_Enum;

