chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  USB_0 OSCCONTROL OSCEN [7..7]  ============================================= */
typedef enum {                                  /*!< USB_0_OSCCONTROL_OSCEN                                                    */
  USB_0_OSCCONTROL_OSCEN_DISABLED      = 0,     /*!< DISABLED : Disable the USB oscillator.                                    */
  USB_0_OSCCONTROL_OSCEN_ENABLED       = 1,     /*!< ENABLED : Enable the USB oscillator.                                      */
} USB_0_OSCCONTROL_OSCEN_Enum;

/* =======================================================  AFADJUST  ======================================================== */
/* =============================================  USB_0 AFADJUST DITHEN [6..6]  ============================================== */
typedef enum {                                  /*!< USB_0_AFADJUST_DITHEN                                                     */
  USB_0_AFADJUST_DITHEN_DISABLED       = 0,     /*!< DISABLED : Disable USB oscillator dithering.                              */
  USB_0_AFADJUST_DITHEN_ENABLED        = 1,     /*!< ENABLED : Enable USB oscillator dithering.                                */
} USB_0_AFADJUST_DITHEN_Enum;

/* ========================================================  FADJUST  ======================================================== */
/* ========================================================  DMAFIFO  ======================================================== */
/* ======================================================  DMACONTROL  ======================================================= */
/* =============================================  USB_0 DMACONTROL DBGMD [4..4]  ============================================= */
typedef enum {                                  /*!< USB_0_DMACONTROL_DBGMD                                                    */
  USB_0_DMACONTROL_DBGMD_RUN           = 0,     /*!< RUN : The USB module will continue to operate while the core
                                                     is halted in debug mode.                                                  */
  USB_0_DMACONTROL_DBGMD_HALT          = 1,     /*!< HALT : A debug breakpoint will prevent the USB DMA buffer from
                                                     transferring data to and from the USB FIFOs when the core
                                                     is halted.                                                                */
} USB_0_DMACONTROL_DBGMD_Enum;

/* =============================================  USB_0 DMACONTROL TERRF [5..5]  ============================================= */
typedef enum {                                  /*!< USB_0_DMACONTROL_TERRF                                                    */
  USB_0_DMACONTROL_TERRF_NOT_SET       = 0,     /*!< NOT_SET : A timeout error has not occurred.                               */
  USB_0_DMACONTROL_TERRF_SET           = 1,     /*!< SET : A timeout error occurred.                                           */
} USB_0_DMACONTROL_TERRF_Enum;

/* ============================================  USB_0 DMACONTROL DBUSYF [6..6]  ============================================= */
typedef enum {                                  /*!< USB_0_DMACONTROL_DBUSYF                                                   */
  USB_0_DMACONTROL_DBUSYF_NOT_SET      = 0,     /*!< NOT_SET : The DMA buffer is not busy.                                     */
  USB_0_DMACONTROL_DBUSYF_SET          = 1,     /*!< SET : The DMA buffer is busy reading or writing an 8-word packet.         */
} USB_0_DMACONTROL_DBUSYF_Enum;

/* ============================================  USB_0 DMACONTROL DFIFOFL [7..7]  ============================================ */
typedef enum {                                  /*!< USB_0_DMACONTROL_DFIFOFL                                                  */
  USB_0_DMACONTROL_DFIFOFL_SET         = 1,     /*!< SET : Flush the USB DMA buffer.                                           */
} USB_0_DMACONTROL_DFIFOFL_Enum;

/* ======================================================  EP0CONTROL  ======================================================= */
/* ============================================  USB_0 EP0CONTROL OPRDYI [0..0]  ============================================= */
typedef enum {                                  /*!< USB_0_EP0CONTROL_OPRDYI                                                   */
  USB_0_EP0CONTROL_OPRDYI_NOT_SET      = 0,     /*!< NOT_SET : A packet is not available.                                      */
  USB_0_EP0CONTROL_OPRDYI_SET          = 1,     /*!< SET : A packet is available.                                              */
} USB_0_EP0CONTROL_OPRDYI_Enum;

/* ============================================  USB_0 EP0CONTROL IPRDYI [1..1]  ============================================= */
typedef enum {                                  /*!< USB_0_EP0CONTROL_IPRDYI                                                   */
  USB_0_EP0CONTROL_IPRDYI_NOT_SET      = 0,     /*!< NOT_SET : A packet is not ready for transmission to host.                 */
  USB_0_EP0CONTROL_IPRDYI_SET          = 1,     /*!< SET : A packet is ready for transmission to host.                         */
} USB_0_EP0CONTROL_IPRDYI_Enum;

/* ============================================  USB_0 EP0CONTROL STSTLI [2..2]  ============================================= */
typedef enum {                                  /*!< USB_0_EP0CONTROL_STSTLI                                                   */
  USB_0_EP0CONTROL_STSTLI_NOT_SET      = 0,     /*!< NOT_SET : Read: A STALL handshake has not been sent or is cleared.
                                                     Write: Clear the interrupt.                                               */
  USB_0_EP0CONTROL_STSTLI_SET          = 1,     /*!< SET : Read: STALL handshake sent. Write: No effect.                       */
} USB_0_EP0CONTROL_STSTLI_Enum;

/* =============================================  USB_0 EP0CONTROL DEND [3..3]  ============================================== */
typedef enum {                                  /*!< USB_0_EP0CONTROL_DEND                                                     */
  USB_0_EP0CONTROL_DEND_NOT_SET        = 0,     /*!< NOT_SET : The current packet is not the last packet of the transfer.      */
  USB_0_EP0CONTROL_DEND_SET            = 1,     /*!< SET : The current packet is the last packet of the transfer.              */
} USB_0_EP0CONTROL_DEND_Enum;

/* ============================================  USB_0 EP0CONTROL SUENDI [4..4]  ============================================= */
typedef enum {                                  /*!< USB_0_EP0CONTROL_SUENDI                                                   */
  USB_0_EP0CONTROL_SUENDI_NOT_SET      = 0,     /*!< NOT_SET : The current packet is not the last packet of setup.             */
  USB_0_EP0CONTROL_SUENDI_SET          = 1,     /*!< SET : The current packet is the last packet of setup.                     */
} USB_0_EP0CONTROL_SUENDI_Enum;

