chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  USB_0 EP0CONTROL SDSTL [5..5]  ============================================= */
typedef enum {                                  /*!< USB_0_EP0CONTROL_SDSTL                                                    */
  USB_0_EP0CONTROL_SDSTL_NOT_SET       = 0,     /*!< NOT_SET : The STALL handshake has been transmitted or not triggered.      */
  USB_0_EP0CONTROL_SDSTL_SET           = 1,     /*!< SET : Initiate a STALL condition.                                         */
} USB_0_EP0CONTROL_SDSTL_Enum;

/* ============================================  USB_0 EP0CONTROL OPRDYIS [6..6]  ============================================ */
typedef enum {                                  /*!< USB_0_EP0CONTROL_OPRDYIS                                                  */
  USB_0_EP0CONTROL_OPRDYIS_NOT_SET     = 0,     /*!< NOT_SET : The out packet has not been processed.                          */
  USB_0_EP0CONTROL_OPRDYIS_SET         = 1,     /*!< SET : The out packet has been received and accepted.                      */
} USB_0_EP0CONTROL_OPRDYIS_Enum;

/* ============================================  USB_0 EP0CONTROL SUENDIS [7..7]  ============================================ */
typedef enum {                                  /*!< USB_0_EP0CONTROL_SUENDIS                                                  */
  USB_0_EP0CONTROL_SUENDIS_NOT_SET     = 0,     /*!< NOT_SET : Setup end has not been serviced.                                */
  USB_0_EP0CONTROL_SUENDIS_SET         = 1,     /*!< SET : Setup end has been serviced.                                        */
} USB_0_EP0CONTROL_SUENDIS_Enum;

/* =======================================================  EP0COUNT  ======================================================== */
/* ========================================================  EP0FIFO  ======================================================== */
/* ======================================================  EPMPSIZE_1  ======================================================= */
/* ======================================================  EPCONTROL_1  ====================================================== */
/* ============================================  USB_0 EPCONTROL_1 IPRDYI [0..0]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_IPRDYI                                                  */
  USB_0_EPCONTROL_1_IPRDYI_NOT_SET     = 0,     /*!< NOT_SET : The packet has been sent or there is an open FIFO
                                                     slot.                                                                     */
  USB_0_EPCONTROL_1_IPRDYI_SET         = 1,     /*!< SET : A packet is loaded in the FIFO.                                     */
} USB_0_EPCONTROL_1_IPRDYI_Enum;

/* ===========================================  USB_0 EPCONTROL_1 IFIFONEF [1..1]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_IFIFONEF                                                */
  USB_0_EPCONTROL_1_IFIFONEF_NOT_SET   = 0,     /*!< NOT_SET : The IN Endpoint FIFO is empty.                                  */
  USB_0_EPCONTROL_1_IFIFONEF_SET       = 1,     /*!< SET : The IN Endpoint FIFO contains one or more packets.                  */
} USB_0_EPCONTROL_1_IFIFONEF_Enum;

/* =============================================  USB_0 EPCONTROL_1 IURF [2..2]  ============================================= */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_IURF                                                    */
  USB_0_EPCONTROL_1_IURF_NOT_SET       = 0,     /*!< NOT_SET : Underrun has not occurred.                                      */
  USB_0_EPCONTROL_1_IURF_SET           = 1,     /*!< SET : Underrun occurred.                                                  */
} USB_0_EPCONTROL_1_IURF_Enum;

/* ===========================================  USB_0 EPCONTROL_1 IFIFOFL [3..3]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_IFIFOFL                                                 */
  USB_0_EPCONTROL_1_IFIFOFL_SET        = 1,     /*!< SET : Flush the IN FIFO.                                                  */
} USB_0_EPCONTROL_1_IFIFOFL_Enum;

/* ============================================  USB_0 EPCONTROL_1 ISDSTL [4..4]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_ISDSTL                                                  */
  USB_0_EPCONTROL_1_ISDSTL_NOT_SET     = 0,     /*!< NOT_SET : Stop sending a stall.                                           */
  USB_0_EPCONTROL_1_ISDSTL_SET         = 1,     /*!< SET : Generate a stall.                                                   */
} USB_0_EPCONTROL_1_ISDSTL_Enum;

/* ===========================================  USB_0 EPCONTROL_1 ISTSTLI [5..5]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_ISTSTLI                                                 */
  USB_0_EPCONTROL_1_ISTSTLI_NOT_SET    = 0,     /*!< NOT_SET : Read: A stall condition has not been sent since this
                                                     bit was last cleared. Write: Clear the interrupt.                         */
  USB_0_EPCONTROL_1_ISTSTLI_SET        = 1,     /*!< SET : Read: A stall condition has been sent since this bit was
                                                     last cleared. Write: No effect.                                           */
} USB_0_EPCONTROL_1_ISTSTLI_Enum;

/* ============================================  USB_0 EPCONTROL_1 ICLRDT [6..6]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_ICLRDT                                                  */
  USB_0_EPCONTROL_1_ICLRDT_NO_RESET    = 0,     /*!< NO_RESET : Do not reset the IN data toggle.                               */
  USB_0_EPCONTROL_1_ICLRDT_RESET       = 1,     /*!< RESET : Reset the IN data toggle.                                         */
} USB_0_EPCONTROL_1_ICLRDT_Enum;

/* ==========================================  USB_0 EPCONTROL_1 SPLITEN [10..10]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_SPLITEN                                                 */
  USB_0_EPCONTROL_1_SPLITEN_DISABLED   = 0,     /*!< DISABLED : Do not split the endpoint FIFO.                                */
  USB_0_EPCONTROL_1_SPLITEN_ENABLED    = 1,     /*!< ENABLED : Split the endpoint FIFO.                                        */
} USB_0_EPCONTROL_1_SPLITEN_Enum;

/* ===========================================  USB_0 EPCONTROL_1 FDTEN [11..11]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_FDTEN                                                   */
  USB_0_EPCONTROL_1_FDTEN_DISABLED     = 0,     /*!< DISABLED : The endpoint data toggle switches only when an ACK
                                                     is received following a data packet transmission.                         */
  USB_0_EPCONTROL_1_FDTEN_ENABLED      = 1,     /*!< ENABLED : The endpoint data toggle is forced to switch after
                                                     every data packet is transmitted, regardless of ACK reception.            */
} USB_0_EPCONTROL_1_FDTEN_Enum;

