chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  USB_0 EPCONTROL_1 OISOEN [30..30]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_OISOEN                                                  */
  USB_0_EPCONTROL_1_OISOEN_BULK_INT    = 0,     /*!< BULK_INT : Configure the endpoint for Bulk/Interrupt transfers.           */
  USB_0_EPCONTROL_1_OISOEN_ISO         = 1,     /*!< ISO : Configure the endpoint for Isochronous transfers.                   */
} USB_0_EPCONTROL_1_OISOEN_Enum;

/* =========================================  USB_0 EPCONTROL_1 AUTOCLREN [31..31]  ========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_1_AUTOCLREN                                               */
  USB_0_EPCONTROL_1_AUTOCLREN_DISABLED = 0,     /*!< DISABLED : The OPRDYI bit is not automatically cleared by hardware.       */
  USB_0_EPCONTROL_1_AUTOCLREN_ENABLED  = 1,     /*!< ENABLED : The OPRDYI bit is automatically cleared by hardware.            */
} USB_0_EPCONTROL_1_AUTOCLREN_Enum;

/* =======================================================  EPCOUNT_1  ======================================================= */
/* =======================================================  EPFIFO_1  ======================================================== */
/* ======================================================  EPMPSIZE_2  ======================================================= */
/* ======================================================  EPCONTROL_2  ====================================================== */
/* ============================================  USB_0 EPCONTROL_2 IPRDYI [0..0]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_IPRDYI                                                  */
  USB_0_EPCONTROL_2_IPRDYI_NOT_SET     = 0,     /*!< NOT_SET : The packet has been sent or there is an open FIFO
                                                     slot.                                                                     */
  USB_0_EPCONTROL_2_IPRDYI_SET         = 1,     /*!< SET : A packet is loaded in the FIFO.                                     */
} USB_0_EPCONTROL_2_IPRDYI_Enum;

/* ===========================================  USB_0 EPCONTROL_2 IFIFONEF [1..1]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_IFIFONEF                                                */
  USB_0_EPCONTROL_2_IFIFONEF_NOT_SET   = 0,     /*!< NOT_SET : The IN Endpoint FIFO is empty.                                  */
  USB_0_EPCONTROL_2_IFIFONEF_SET       = 1,     /*!< SET : The IN Endpoint FIFO contains one or more packets.                  */
} USB_0_EPCONTROL_2_IFIFONEF_Enum;

/* =============================================  USB_0 EPCONTROL_2 IURF [2..2]  ============================================= */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_IURF                                                    */
  USB_0_EPCONTROL_2_IURF_NOT_SET       = 0,     /*!< NOT_SET : Underrun has not occurred.                                      */
  USB_0_EPCONTROL_2_IURF_SET           = 1,     /*!< SET : Underrun occurred.                                                  */
} USB_0_EPCONTROL_2_IURF_Enum;

/* ===========================================  USB_0 EPCONTROL_2 IFIFOFL [3..3]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_IFIFOFL                                                 */
  USB_0_EPCONTROL_2_IFIFOFL_SET        = 1,     /*!< SET : Flush the IN FIFO.                                                  */
} USB_0_EPCONTROL_2_IFIFOFL_Enum;

/* ============================================  USB_0 EPCONTROL_2 ISDSTL [4..4]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_ISDSTL                                                  */
  USB_0_EPCONTROL_2_ISDSTL_NOT_SET     = 0,     /*!< NOT_SET : Stop sending a stall.                                           */
  USB_0_EPCONTROL_2_ISDSTL_SET         = 1,     /*!< SET : Generate a stall.                                                   */
} USB_0_EPCONTROL_2_ISDSTL_Enum;

/* ===========================================  USB_0 EPCONTROL_2 ISTSTLI [5..5]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_ISTSTLI                                                 */
  USB_0_EPCONTROL_2_ISTSTLI_NOT_SET    = 0,     /*!< NOT_SET : Read: A stall condition has not been sent since this
                                                     bit was last cleared. Write: Clear the interrupt.                         */
  USB_0_EPCONTROL_2_ISTSTLI_SET        = 1,     /*!< SET : Read: A stall condition has been sent since this bit was
                                                     last cleared. Write: No effect.                                           */
} USB_0_EPCONTROL_2_ISTSTLI_Enum;

/* ============================================  USB_0 EPCONTROL_2 ICLRDT [6..6]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_ICLRDT                                                  */
  USB_0_EPCONTROL_2_ICLRDT_NO_RESET    = 0,     /*!< NO_RESET : Do not reset the IN data toggle.                               */
  USB_0_EPCONTROL_2_ICLRDT_RESET       = 1,     /*!< RESET : Reset the IN data toggle.                                         */
} USB_0_EPCONTROL_2_ICLRDT_Enum;

/* ==========================================  USB_0 EPCONTROL_2 SPLITEN [10..10]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_SPLITEN                                                 */
  USB_0_EPCONTROL_2_SPLITEN_DISABLED   = 0,     /*!< DISABLED : Do not split the endpoint FIFO.                                */
  USB_0_EPCONTROL_2_SPLITEN_ENABLED    = 1,     /*!< ENABLED : Split the endpoint FIFO.                                        */
} USB_0_EPCONTROL_2_SPLITEN_Enum;

