chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ===========================================  USB_0 EPCONTROL_2 FDTEN [11..11]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_FDTEN                                                   */
  USB_0_EPCONTROL_2_FDTEN_DISABLED     = 0,     /*!< DISABLED : The endpoint data toggle switches only when an ACK
                                                     is received following a data packet transmission.                         */
  USB_0_EPCONTROL_2_FDTEN_ENABLED      = 1,     /*!< ENABLED : The endpoint data toggle is forced to switch after
                                                     every data packet is transmitted, regardless of ACK reception.            */
} USB_0_EPCONTROL_2_FDTEN_Enum;

/* ===========================================  USB_0 EPCONTROL_2 IDMAEN [12..12]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_IDMAEN                                                  */
  USB_0_EPCONTROL_2_IDMAEN_DISABLED    = 0,     /*!< DISABLED : Disable the DMA request for the IN endpoint.                   */
  USB_0_EPCONTROL_2_IDMAEN_ENABLED     = 1,     /*!< ENABLED : Enable the DMA request for the IN endpoint.                     */
} USB_0_EPCONTROL_2_IDMAEN_Enum;

/* ===========================================  USB_0 EPCONTROL_2 DIRSEL [13..13]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_DIRSEL                                                  */
  USB_0_EPCONTROL_2_DIRSEL_OUT         = 0,     /*!< OUT : Select the endpoint direction as OUT.                               */
  USB_0_EPCONTROL_2_DIRSEL_IN          = 1,     /*!< IN : Select the endpoint direction as IN.                                 */
} USB_0_EPCONTROL_2_DIRSEL_Enum;

/* ===========================================  USB_0 EPCONTROL_2 IISOEN [14..14]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_IISOEN                                                  */
  USB_0_EPCONTROL_2_IISOEN_BULK_INT    = 0,     /*!< BULK_INT : Configure the endpoint for Bulk/Interrupt transfers.           */
  USB_0_EPCONTROL_2_IISOEN_ISO         = 1,     /*!< ISO : Configure the endpoint for Isochronous transfers.                   */
} USB_0_EPCONTROL_2_IISOEN_Enum;

/* =========================================  USB_0 EPCONTROL_2 AUTOSETEN [15..15]  ========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_AUTOSETEN                                               */
  USB_0_EPCONTROL_2_AUTOSETEN_DISABLED = 0,     /*!< DISABLED : The IPRDYI bit is not automatically set by hardware.           */
  USB_0_EPCONTROL_2_AUTOSETEN_ENABLED  = 1,     /*!< ENABLED : The IPRDYI bit is automatically set by hardware.                */
} USB_0_EPCONTROL_2_AUTOSETEN_Enum;

/* ===========================================  USB_0 EPCONTROL_2 OPRDYI [16..16]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_OPRDYI                                                  */
  USB_0_EPCONTROL_2_OPRDYI_NOT_SET     = 0,     /*!< NOT_SET : A data packet is not available.                                 */
  USB_0_EPCONTROL_2_OPRDYI_SET         = 1,     /*!< SET : A data packet is available.                                         */
} USB_0_EPCONTROL_2_OPRDYI_Enum;

/* ==========================================  USB_0 EPCONTROL_2 OFIFOFF [17..17]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_OFIFOFF                                                 */
  USB_0_EPCONTROL_2_OFIFOFF_NOT_SET    = 0,     /*!< NOT_SET : The OUT endpoint FIFO is not full.                              */
  USB_0_EPCONTROL_2_OFIFOFF_SET        = 1,     /*!< SET : The OUT endpoint FIFO is full.                                      */
} USB_0_EPCONTROL_2_OFIFOFF_Enum;

/* ============================================  USB_0 EPCONTROL_2 OORF [18..18]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_OORF                                                    */
  USB_0_EPCONTROL_2_OORF_NOT_SET       = 0,     /*!< NOT_SET : No data overrun.                                                */
  USB_0_EPCONTROL_2_OORF_SET           = 1,     /*!< SET : A data packet was lost because of a full FIFO since this
                                                     flag was last cleared.                                                    */
} USB_0_EPCONTROL_2_OORF_Enum;

/* ===========================================  USB_0 EPCONTROL_2 ODERRF [19..19]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_ODERRF                                                  */
  USB_0_EPCONTROL_2_ODERRF_NOT_SET     = 0,     /*!< NOT_SET : A CRC or bit-stuff error has not occurred.                      */
  USB_0_EPCONTROL_2_ODERRF_SET         = 1,     /*!< SET : A CRC or bit-stuff error occurred.                                  */
} USB_0_EPCONTROL_2_ODERRF_Enum;

/* ==========================================  USB_0 EPCONTROL_2 OFIFOFL [20..20]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_OFIFOFL                                                 */
  USB_0_EPCONTROL_2_OFIFOFL_SET        = 1,     /*!< SET : Flush the OUT FIFO.                                                 */
} USB_0_EPCONTROL_2_OFIFOFL_Enum;

/* ===========================================  USB_0 EPCONTROL_2 OSDSTL [21..21]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_OSDSTL                                                  */
  USB_0_EPCONTROL_2_OSDSTL_STOP        = 0,     /*!< STOP : Stop sending a stall.                                              */
  USB_0_EPCONTROL_2_OSDSTL_SEND        = 1,     /*!< SEND : Generate a stall.                                                  */
} USB_0_EPCONTROL_2_OSDSTL_Enum;

