chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ==========================================  USB_0 EPCONTROL_2 OSTSTLI [22..22]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_OSTSTLI                                                 */
  USB_0_EPCONTROL_2_OSTSTLI_NOT_SET    = 0,     /*!< NOT_SET : Read: A stall condition has not been sent since this
                                                     bit was last cleared. Write: Clear the interrupt.                         */
  USB_0_EPCONTROL_2_OSTSTLI_SET        = 1,     /*!< SET : Read: A stall condition has been sent since this bit was
                                                     last cleared. Write: No effect.                                           */
} USB_0_EPCONTROL_2_OSTSTLI_Enum;

/* ===========================================  USB_0 EPCONTROL_2 OCLRDT [23..23]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_OCLRDT                                                  */
  USB_0_EPCONTROL_2_OCLRDT_NO_RESET    = 0,     /*!< NO_RESET : Do not reset the OUT data toggle.                              */
  USB_0_EPCONTROL_2_OCLRDT_RESET       = 1,     /*!< RESET : Reset the OUT data toggle.                                        */
} USB_0_EPCONTROL_2_OCLRDT_Enum;

/* ===========================================  USB_0 EPCONTROL_2 ODMAMD [28..28]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_ODMAMD                                                  */
  USB_0_EPCONTROL_2_ODMAMD_AUTO_DMA    = 0,     /*!< AUTO_DMA : Automatic DMA service is requested on the last packet
                                                     of the transfer until less than four bytes remain in the
                                                     packet. At this time, an interrupt is generated. The firmware
                                                     must read or write the last few bytes of the packet, if
                                                     any remain.                                                               */
  USB_0_EPCONTROL_2_ODMAMD_NO_DMA      = 1,     /*!< NO_DMA : No DMA service is requested on the last packet of the
                                                     transfer. When the DMA recognizes the last packet, an interrupt
                                                     is generated. The firmware must handle the entirety of
                                                     the last packet.                                                          */
} USB_0_EPCONTROL_2_ODMAMD_Enum;

/* ===========================================  USB_0 EPCONTROL_2 ODMAEN [29..29]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_ODMAEN                                                  */
  USB_0_EPCONTROL_2_ODMAEN_DISABLED    = 0,     /*!< DISABLED : Disable the DMA request for the OUT endpoint.                  */
  USB_0_EPCONTROL_2_ODMAEN_ENABLED     = 1,     /*!< ENABLED : Enable the DMA request for the OUT endpoint.                    */
} USB_0_EPCONTROL_2_ODMAEN_Enum;

/* ===========================================  USB_0 EPCONTROL_2 OISOEN [30..30]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_OISOEN                                                  */
  USB_0_EPCONTROL_2_OISOEN_BULK_INT    = 0,     /*!< BULK_INT : Configure the endpoint for Bulk/Interrupt transfers.           */
  USB_0_EPCONTROL_2_OISOEN_ISO         = 1,     /*!< ISO : Configure the endpoint for Isochronous transfers.                   */
} USB_0_EPCONTROL_2_OISOEN_Enum;

/* =========================================  USB_0 EPCONTROL_2 AUTOCLREN [31..31]  ========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_2_AUTOCLREN                                               */
  USB_0_EPCONTROL_2_AUTOCLREN_DISABLED = 0,     /*!< DISABLED : The OPRDYI bit is not automatically cleared by hardware.       */
  USB_0_EPCONTROL_2_AUTOCLREN_ENABLED  = 1,     /*!< ENABLED : The OPRDYI bit is automatically cleared by hardware.            */
} USB_0_EPCONTROL_2_AUTOCLREN_Enum;

/* =======================================================  EPCOUNT_2  ======================================================= */
/* =======================================================  EPFIFO_2  ======================================================== */
/* ======================================================  EPMPSIZE_3  ======================================================= */
/* ======================================================  EPCONTROL_3  ====================================================== */
/* ============================================  USB_0 EPCONTROL_3 IPRDYI [0..0]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_IPRDYI                                                  */
  USB_0_EPCONTROL_3_IPRDYI_NOT_SET     = 0,     /*!< NOT_SET : The packet has been sent or there is an open FIFO
                                                     slot.                                                                     */
  USB_0_EPCONTROL_3_IPRDYI_SET         = 1,     /*!< SET : A packet is loaded in the FIFO.                                     */
} USB_0_EPCONTROL_3_IPRDYI_Enum;

/* ===========================================  USB_0 EPCONTROL_3 IFIFONEF [1..1]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_IFIFONEF                                                */
  USB_0_EPCONTROL_3_IFIFONEF_NOT_SET   = 0,     /*!< NOT_SET : The IN Endpoint FIFO is empty.                                  */
  USB_0_EPCONTROL_3_IFIFONEF_SET       = 1,     /*!< SET : The IN Endpoint FIFO contains one or more packets.                  */
} USB_0_EPCONTROL_3_IFIFONEF_Enum;

