chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =============================================  USB_0 EPCONTROL_3 IURF [2..2]  ============================================= */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_IURF                                                    */
  USB_0_EPCONTROL_3_IURF_NOT_SET       = 0,     /*!< NOT_SET : Underrun has not occurred.                                      */
  USB_0_EPCONTROL_3_IURF_SET           = 1,     /*!< SET : Underrun occurred.                                                  */
} USB_0_EPCONTROL_3_IURF_Enum;

/* ===========================================  USB_0 EPCONTROL_3 IFIFOFL [3..3]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_IFIFOFL                                                 */
  USB_0_EPCONTROL_3_IFIFOFL_SET        = 1,     /*!< SET : Flush the IN FIFO.                                                  */
} USB_0_EPCONTROL_3_IFIFOFL_Enum;

/* ============================================  USB_0 EPCONTROL_3 ISDSTL [4..4]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_ISDSTL                                                  */
  USB_0_EPCONTROL_3_ISDSTL_NOT_SET     = 0,     /*!< NOT_SET : Stop sending a stall.                                           */
  USB_0_EPCONTROL_3_ISDSTL_SET         = 1,     /*!< SET : Generate a stall.                                                   */
} USB_0_EPCONTROL_3_ISDSTL_Enum;

/* ===========================================  USB_0 EPCONTROL_3 ISTSTLI [5..5]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_ISTSTLI                                                 */
  USB_0_EPCONTROL_3_ISTSTLI_NOT_SET    = 0,     /*!< NOT_SET : Read: A stall condition has not been sent since this
                                                     bit was last cleared. Write: Clear the interrupt.                         */
  USB_0_EPCONTROL_3_ISTSTLI_SET        = 1,     /*!< SET : Read: A stall condition has been sent since this bit was
                                                     last cleared. Write: No effect.                                           */
} USB_0_EPCONTROL_3_ISTSTLI_Enum;

/* ============================================  USB_0 EPCONTROL_3 ICLRDT [6..6]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_ICLRDT                                                  */
  USB_0_EPCONTROL_3_ICLRDT_NO_RESET    = 0,     /*!< NO_RESET : Do not reset the IN data toggle.                               */
  USB_0_EPCONTROL_3_ICLRDT_RESET       = 1,     /*!< RESET : Reset the IN data toggle.                                         */
} USB_0_EPCONTROL_3_ICLRDT_Enum;

/* ==========================================  USB_0 EPCONTROL_3 SPLITEN [10..10]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_SPLITEN                                                 */
  USB_0_EPCONTROL_3_SPLITEN_DISABLED   = 0,     /*!< DISABLED : Do not split the endpoint FIFO.                                */
  USB_0_EPCONTROL_3_SPLITEN_ENABLED    = 1,     /*!< ENABLED : Split the endpoint FIFO.                                        */
} USB_0_EPCONTROL_3_SPLITEN_Enum;

/* ===========================================  USB_0 EPCONTROL_3 FDTEN [11..11]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_FDTEN                                                   */
  USB_0_EPCONTROL_3_FDTEN_DISABLED     = 0,     /*!< DISABLED : The endpoint data toggle switches only when an ACK
                                                     is received following a data packet transmission.                         */
  USB_0_EPCONTROL_3_FDTEN_ENABLED      = 1,     /*!< ENABLED : The endpoint data toggle is forced to switch after
                                                     every data packet is transmitted, regardless of ACK reception.            */
} USB_0_EPCONTROL_3_FDTEN_Enum;

/* ===========================================  USB_0 EPCONTROL_3 IDMAEN [12..12]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_IDMAEN                                                  */
  USB_0_EPCONTROL_3_IDMAEN_DISABLED    = 0,     /*!< DISABLED : Disable the DMA request for the IN endpoint.                   */
  USB_0_EPCONTROL_3_IDMAEN_ENABLED     = 1,     /*!< ENABLED : Enable the DMA request for the IN endpoint.                     */
} USB_0_EPCONTROL_3_IDMAEN_Enum;

/* ===========================================  USB_0 EPCONTROL_3 DIRSEL [13..13]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_DIRSEL                                                  */
  USB_0_EPCONTROL_3_DIRSEL_OUT         = 0,     /*!< OUT : Select the endpoint direction as OUT.                               */
  USB_0_EPCONTROL_3_DIRSEL_IN          = 1,     /*!< IN : Select the endpoint direction as IN.                                 */
} USB_0_EPCONTROL_3_DIRSEL_Enum;

/* ===========================================  USB_0 EPCONTROL_3 IISOEN [14..14]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_IISOEN                                                  */
  USB_0_EPCONTROL_3_IISOEN_BULK_INT    = 0,     /*!< BULK_INT : Configure the endpoint for Bulk/Interrupt transfers.           */
  USB_0_EPCONTROL_3_IISOEN_ISO         = 1,     /*!< ISO : Configure the endpoint for Isochronous transfers.                   */
} USB_0_EPCONTROL_3_IISOEN_Enum;

/* =========================================  USB_0 EPCONTROL_3 AUTOSETEN [15..15]  ========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_AUTOSETEN                                               */
  USB_0_EPCONTROL_3_AUTOSETEN_DISABLED = 0,     /*!< DISABLED : The IPRDYI bit is not automatically set by hardware.           */
  USB_0_EPCONTROL_3_AUTOSETEN_ENABLED  = 1,     /*!< ENABLED : The IPRDYI bit is automatically set by hardware.                */
} USB_0_EPCONTROL_3_AUTOSETEN_Enum;

/* ===========================================  USB_0 EPCONTROL_3 OPRDYI [16..16]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_OPRDYI                                                  */
  USB_0_EPCONTROL_3_OPRDYI_NOT_SET     = 0,     /*!< NOT_SET : A data packet is not available.                                 */
  USB_0_EPCONTROL_3_OPRDYI_SET         = 1,     /*!< SET : A data packet is available.                                         */
} USB_0_EPCONTROL_3_OPRDYI_Enum;

/* ==========================================  USB_0 EPCONTROL_3 OFIFOFF [17..17]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_OFIFOFF                                                 */
  USB_0_EPCONTROL_3_OFIFOFF_NOT_SET    = 0,     /*!< NOT_SET : The OUT endpoint FIFO is not full.                              */
  USB_0_EPCONTROL_3_OFIFOFF_SET        = 1,     /*!< SET : The OUT endpoint FIFO is full.                                      */
} USB_0_EPCONTROL_3_OFIFOFF_Enum;

/* ============================================  USB_0 EPCONTROL_3 OORF [18..18]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_OORF                                                    */
  USB_0_EPCONTROL_3_OORF_NOT_SET       = 0,     /*!< NOT_SET : No data overrun.                                                */
  USB_0_EPCONTROL_3_OORF_SET           = 1,     /*!< SET : A data packet was lost because of a full FIFO since this
                                                     flag was last cleared.                                                    */
} USB_0_EPCONTROL_3_OORF_Enum;

/* ===========================================  USB_0 EPCONTROL_3 ODERRF [19..19]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_ODERRF                                                  */
  USB_0_EPCONTROL_3_ODERRF_NOT_SET     = 0,     /*!< NOT_SET : A CRC or bit-stuff error has not occurred.                      */
  USB_0_EPCONTROL_3_ODERRF_SET         = 1,     /*!< SET : A CRC or bit-stuff error occurred.                                  */
} USB_0_EPCONTROL_3_ODERRF_Enum;

/* ==========================================  USB_0 EPCONTROL_3 OFIFOFL [20..20]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_OFIFOFL                                                 */
  USB_0_EPCONTROL_3_OFIFOFL_SET        = 1,     /*!< SET : Flush the OUT FIFO.                                                 */
} USB_0_EPCONTROL_3_OFIFOFL_Enum;

/* ===========================================  USB_0 EPCONTROL_3 OSDSTL [21..21]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_OSDSTL                                                  */
  USB_0_EPCONTROL_3_OSDSTL_STOP        = 0,     /*!< STOP : Stop sending a stall.                                              */
  USB_0_EPCONTROL_3_OSDSTL_SEND        = 1,     /*!< SEND : Generate a stall.                                                  */
} USB_0_EPCONTROL_3_OSDSTL_Enum;

/* ==========================================  USB_0 EPCONTROL_3 OSTSTLI [22..22]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_OSTSTLI                                                 */
  USB_0_EPCONTROL_3_OSTSTLI_NOT_SET    = 0,     /*!< NOT_SET : Read: A stall condition has not been sent since this
                                                     bit was last cleared. Write: Clear the interrupt.                         */
  USB_0_EPCONTROL_3_OSTSTLI_SET        = 1,     /*!< SET : Read: A stall condition has been sent since this bit was
                                                     last cleared. Write: No effect.                                           */
} USB_0_EPCONTROL_3_OSTSTLI_Enum;

/* ===========================================  USB_0 EPCONTROL_3 OCLRDT [23..23]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_OCLRDT                                                  */
  USB_0_EPCONTROL_3_OCLRDT_NO_RESET    = 0,     /*!< NO_RESET : Do not reset the OUT data toggle.                              */
  USB_0_EPCONTROL_3_OCLRDT_RESET       = 1,     /*!< RESET : Reset the OUT data toggle.                                        */
} USB_0_EPCONTROL_3_OCLRDT_Enum;

/* ===========================================  USB_0 EPCONTROL_3 ODMAMD [28..28]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_ODMAMD                                                  */
  USB_0_EPCONTROL_3_ODMAMD_AUTO_DMA    = 0,     /*!< AUTO_DMA : Automatic DMA service is requested on the last packet
                                                     of the transfer until less than four bytes remain in the
                                                     packet. At this time, an interrupt is generated. The firmware
                                                     must read or write the last few bytes of the packet, if
                                                     any remain.                                                               */
  USB_0_EPCONTROL_3_ODMAMD_NO_DMA      = 1,     /*!< NO_DMA : No DMA service is requested on the last packet of the
                                                     transfer. When the DMA recognizes the last packet, an interrupt
                                                     is generated. The firmware must handle the entirety of
                                                     the last packet.                                                          */
} USB_0_EPCONTROL_3_ODMAMD_Enum;

/* ===========================================  USB_0 EPCONTROL_3 ODMAEN [29..29]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_ODMAEN                                                  */
  USB_0_EPCONTROL_3_ODMAEN_DISABLED    = 0,     /*!< DISABLED : Disable the DMA request for the OUT endpoint.                  */
  USB_0_EPCONTROL_3_ODMAEN_ENABLED     = 1,     /*!< ENABLED : Enable the DMA request for the OUT endpoint.                    */
} USB_0_EPCONTROL_3_ODMAEN_Enum;

/* ===========================================  USB_0 EPCONTROL_3 OISOEN [30..30]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_OISOEN                                                  */
  USB_0_EPCONTROL_3_OISOEN_BULK_INT    = 0,     /*!< BULK_INT : Configure the endpoint for Bulk/Interrupt transfers.           */
  USB_0_EPCONTROL_3_OISOEN_ISO         = 1,     /*!< ISO : Configure the endpoint for Isochronous transfers.                   */
} USB_0_EPCONTROL_3_OISOEN_Enum;

/* =========================================  USB_0 EPCONTROL_3 AUTOCLREN [31..31]  ========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_3_AUTOCLREN                                               */
  USB_0_EPCONTROL_3_AUTOCLREN_DISABLED = 0,     /*!< DISABLED : The OPRDYI bit is not automatically cleared by hardware.       */
  USB_0_EPCONTROL_3_AUTOCLREN_ENABLED  = 1,     /*!< ENABLED : The OPRDYI bit is automatically cleared by hardware.            */
} USB_0_EPCONTROL_3_AUTOCLREN_Enum;

