chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  EPCOUNT_3  ======================================================= */
/* =======================================================  EPFIFO_3  ======================================================== */
/* ======================================================  EPMPSIZE_4  ======================================================= */
/* ======================================================  EPCONTROL_4  ====================================================== */
/* ============================================  USB_0 EPCONTROL_4 IPRDYI [0..0]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_IPRDYI                                                  */
  USB_0_EPCONTROL_4_IPRDYI_NOT_SET     = 0,     /*!< NOT_SET : The packet has been sent or there is an open FIFO
                                                     slot.                                                                     */
  USB_0_EPCONTROL_4_IPRDYI_SET         = 1,     /*!< SET : A packet is loaded in the FIFO.                                     */
} USB_0_EPCONTROL_4_IPRDYI_Enum;

/* ===========================================  USB_0 EPCONTROL_4 IFIFONEF [1..1]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_IFIFONEF                                                */
  USB_0_EPCONTROL_4_IFIFONEF_NOT_SET   = 0,     /*!< NOT_SET : The IN Endpoint FIFO is empty.                                  */
  USB_0_EPCONTROL_4_IFIFONEF_SET       = 1,     /*!< SET : The IN Endpoint FIFO contains one or more packets.                  */
} USB_0_EPCONTROL_4_IFIFONEF_Enum;

/* =============================================  USB_0 EPCONTROL_4 IURF [2..2]  ============================================= */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_IURF                                                    */
  USB_0_EPCONTROL_4_IURF_NOT_SET       = 0,     /*!< NOT_SET : Underrun has not occurred.                                      */
  USB_0_EPCONTROL_4_IURF_SET           = 1,     /*!< SET : Underrun occurred.                                                  */
} USB_0_EPCONTROL_4_IURF_Enum;

/* ===========================================  USB_0 EPCONTROL_4 IFIFOFL [3..3]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_IFIFOFL                                                 */
  USB_0_EPCONTROL_4_IFIFOFL_SET        = 1,     /*!< SET : Flush the IN FIFO.                                                  */
} USB_0_EPCONTROL_4_IFIFOFL_Enum;

/* ============================================  USB_0 EPCONTROL_4 ISDSTL [4..4]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_ISDSTL                                                  */
  USB_0_EPCONTROL_4_ISDSTL_NOT_SET     = 0,     /*!< NOT_SET : Stop sending a stall.                                           */
  USB_0_EPCONTROL_4_ISDSTL_SET         = 1,     /*!< SET : Generate a stall.                                                   */
} USB_0_EPCONTROL_4_ISDSTL_Enum;

/* ===========================================  USB_0 EPCONTROL_4 ISTSTLI [5..5]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_ISTSTLI                                                 */
  USB_0_EPCONTROL_4_ISTSTLI_NOT_SET    = 0,     /*!< NOT_SET : Read: A stall condition has not been sent since this
                                                     bit was last cleared. Write: Clear the interrupt.                         */
  USB_0_EPCONTROL_4_ISTSTLI_SET        = 1,     /*!< SET : Read: A stall condition has been sent since this bit was
                                                     last cleared. Write: No effect.                                           */
} USB_0_EPCONTROL_4_ISTSTLI_Enum;

/* ============================================  USB_0 EPCONTROL_4 ICLRDT [6..6]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_ICLRDT                                                  */
  USB_0_EPCONTROL_4_ICLRDT_NO_RESET    = 0,     /*!< NO_RESET : Do not reset the IN data toggle.                               */
  USB_0_EPCONTROL_4_ICLRDT_RESET       = 1,     /*!< RESET : Reset the IN data toggle.                                         */
} USB_0_EPCONTROL_4_ICLRDT_Enum;

/* ==========================================  USB_0 EPCONTROL_4 SPLITEN [10..10]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_SPLITEN                                                 */
  USB_0_EPCONTROL_4_SPLITEN_DISABLED   = 0,     /*!< DISABLED : Do not split the endpoint FIFO.                                */
  USB_0_EPCONTROL_4_SPLITEN_ENABLED    = 1,     /*!< ENABLED : Split the endpoint FIFO.                                        */
} USB_0_EPCONTROL_4_SPLITEN_Enum;

/* ===========================================  USB_0 EPCONTROL_4 FDTEN [11..11]  ============================================ */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_FDTEN                                                   */
  USB_0_EPCONTROL_4_FDTEN_DISABLED     = 0,     /*!< DISABLED : The endpoint data toggle switches only when an ACK
                                                     is received following a data packet transmission.                         */
  USB_0_EPCONTROL_4_FDTEN_ENABLED      = 1,     /*!< ENABLED : The endpoint data toggle is forced to switch after
                                                     every data packet is transmitted, regardless of ACK reception.            */
} USB_0_EPCONTROL_4_FDTEN_Enum;

/* ===========================================  USB_0 EPCONTROL_4 IDMAEN [12..12]  =========================================== */
typedef enum {                                  /*!< USB_0_EPCONTROL_4_IDMAEN                                                  */
  USB_0_EPCONTROL_4_IDMAEN_DISABLED    = 0,     /*!< DISABLED : Disable the DMA request for the IN endpoint.                   */
  USB_0_EPCONTROL_4_IDMAEN_ENABLED     = 1,     /*!< ENABLED : Enable the DMA request for the IN endpoint.                     */
} USB_0_EPCONTROL_4_IDMAEN_Enum;

