chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  EPCOUNT_4  ======================================================= */
/* =======================================================  EPFIFO_4  ======================================================== */


/* =========================================================================================================================== */
/* ================                                          VMON_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* ============================================  VMON_0 CONTROL VREGINSEN [0..0]  ============================================ */
typedef enum {                                  /*!< VMON_0_CONTROL_VREGINSEN                                                  */
  VMON_0_CONTROL_VREGINSEN_DISABLED    = 0,     /*!< DISABLED : Disable the VREGIN supply monitor.                             */
  VMON_0_CONTROL_VREGINSEN_ENABLED     = 1,     /*!< ENABLED : Enable the VREGIN supply monitor.                               */
} VMON_0_CONTROL_VREGINSEN_Enum;

/* ============================================  VMON_0 CONTROL VREGINLI [1..1]  ============================================= */
typedef enum {                                  /*!< VMON_0_CONTROL_VREGINLI                                                   */
  VMON_0_CONTROL_VREGINLI_VREGIN_IS_LOW = 0,    /*!< VREGIN_IS_LOW : VREGIN is not above the interrupt threshold.              */
  VMON_0_CONTROL_VREGINLI_VREGIN_IS_OK = 1,     /*!< VREGIN_IS_OK : VREGIN is above the interrupt threshold.                   */
} VMON_0_CONTROL_VREGINLI_Enum;

/* =============================================  VMON_0 CONTROL VDDRSTF [2..2]  ============================================= */
typedef enum {                                  /*!< VMON_0_CONTROL_VDDRSTF                                                    */
  VMON_0_CONTROL_VDDRSTF_VDD_IS_BELOW_RESET = 0,/*!< VDD_IS_BELOW_RESET : The VDD voltage is below the VDD reset
                                                     threshold.                                                                */
  VMON_0_CONTROL_VDDRSTF_VDD_IS_ABOVE_RESET = 1,/*!< VDD_IS_ABOVE_RESET : The VDD voltage is above the VDD reset
                                                     threshold.                                                                */
} VMON_0_CONTROL_VDDRSTF_Enum;

/* ==============================================  VMON_0 CONTROL VDDLI [3..3]  ============================================== */
typedef enum {                                  /*!< VMON_0_CONTROL_VDDLI                                                      */
  VMON_0_CONTROL_VDDLI_VDD_IS_LOW      = 0,     /*!< VDD_IS_LOW : The VDD voltage is below the early warning threshold.        */
  VMON_0_CONTROL_VDDLI_VDD_IS_OK       = 1,     /*!< VDD_IS_OK : The VDD voltage is above the early warning threshold.         */
} VMON_0_CONTROL_VDDLI_Enum;

/* ============================================  VMON_0 CONTROL VDDHITHEN [4..4]  ============================================ */
typedef enum {                                  /*!< VMON_0_CONTROL_VDDHITHEN                                                  */
  VMON_0_CONTROL_VDDHITHEN_DISABLED    = 0,     /*!< DISABLED : Use the standard VDD thresholds.                               */
  VMON_0_CONTROL_VDDHITHEN_ENABLED     = 1,     /*!< ENABLED : Use the high VDD thresholds.                                    */
} VMON_0_CONTROL_VDDHITHEN_Enum;

/* =============================================  VMON_0 CONTROL VDDLIEN [6..6]  ============================================= */
typedef enum {                                  /*!< VMON_0_CONTROL_VDDLIEN                                                    */
  VMON_0_CONTROL_VDDLIEN_DISABLED      = 0,     /*!< DISABLED : Disable the VDD low interrupt.                                 */
  VMON_0_CONTROL_VDDLIEN_ENABLED       = 1,     /*!< ENABLED : Enable the VDD low interrupt.                                   */
} VMON_0_CONTROL_VDDLIEN_Enum;

/* ===========================================  VMON_0 CONTROL VREGINLIEN [7..7]  ============================================ */
typedef enum {                                  /*!< VMON_0_CONTROL_VREGINLIEN                                                 */
  VMON_0_CONTROL_VREGINLIEN_DISABLED   = 0,     /*!< DISABLED : Disable the VREGIN low interrupt.                              */
  VMON_0_CONTROL_VREGINLIEN_ENABLED    = 1,     /*!< ENABLED : Enable the VREGIN low interrupt.                                */
} VMON_0_CONTROL_VREGINLIEN_Enum;

/* ============================================  VMON_0 CONTROL VMONEN [31..31]  ============================================= */
typedef enum {                                  /*!< VMON_0_CONTROL_VMONEN                                                     */
  VMON_0_CONTROL_VMONEN_DISABLED       = 0,     /*!< DISABLED : Disable the VDD supply monitor.                                */
  VMON_0_CONTROL_VMONEN_ENABLED        = 1,     /*!< ENABLED : Enable the VDD supply monitor.                                  */
} VMON_0_CONTROL_VMONEN_Enum;



/* =========================================================================================================================== */
/* ================                                          VREF_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* =============================================  VREF_0 CONTROL VREF2X [0..0]  ============================================== */
typedef enum {                                  /*!< VREF_0_CONTROL_VREF2X                                                     */
  VREF_0_CONTROL_VREF2X_DISABLED       = 0,     /*!< DISABLED : VREF output is nominally 1.2 V                                 */
  VREF_0_CONTROL_VREF2X_ENABLED        = 1,     /*!< ENABLED : VREF output is nominally 2.4 V                                  */
} VREF_0_CONTROL_VREF2X_Enum;

/* =============================================  VREF_0 CONTROL TEMPEN [1..1]  ============================================== */
typedef enum {                                  /*!< VREF_0_CONTROL_TEMPEN                                                     */
  VREF_0_CONTROL_TEMPEN_DISABLED       = 0,     /*!< DISABLED : Disable the temperature sensor.                                */
  VREF_0_CONTROL_TEMPEN_ENABLED        = 1,     /*!< ENABLED : Enable the temperature sensor.                                  */
} VREF_0_CONTROL_TEMPEN_Enum;

