chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  VREF_0 CONTROL VREFEN [31..31]  ============================================= */
typedef enum {                                  /*!< VREF_0_CONTROL_VREFEN                                                     */
  VREF_0_CONTROL_VREFEN_DISABLED       = 0,     /*!< DISABLED : Disable the Voltage Reference.                                 */
  VREF_0_CONTROL_VREFEN_ENABLED        = 1,     /*!< ENABLED : Enable the Voltage Reference.                                   */
} VREF_0_CONTROL_VREFEN_Enum;



/* =========================================================================================================================== */
/* ================                                         EXTVREG_0                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* =============================================  EXTVREG_0 CONTROL SAEN [0..0]  ============================================= */
typedef enum {                                  /*!< EXTVREG_0_CONTROL_SAEN                                                    */
  EXTVREG_0_CONTROL_SAEN_DISABLED      = 0,     /*!< DISABLED : Use the external regulator in normal mode.                     */
  EXTVREG_0_CONTROL_SAEN_ENABLED       = 1,     /*!< ENABLED : Use the external regulator in stand-alone mode.                 */
} EXTVREG_0_CONTROL_SAEN_Enum;

/* ==========================================  EXTVREG_0 CONTROL WPULLEN [24..24]  =========================================== */
typedef enum {                                  /*!< EXTVREG_0_CONTROL_WPULLEN                                                 */
  EXTVREG_0_CONTROL_WPULLEN_DISABLED   = 0,     /*!< DISABLED : Disable the external regulator weak pull-up/down
                                                     resistor on the EXREGBD pin and weak pull-down resistor
                                                     on the EXREGOUT pin.                                                      */
  EXTVREG_0_CONTROL_WPULLEN_ENABLED    = 1,     /*!< ENABLED : Enable the external regulator weak pull-up/down resistor
                                                     on the EXREGBD pin and weak pull-down resistor on the EXREGOUT
                                                     pin.                                                                      */
} EXTVREG_0_CONTROL_WPULLEN_Enum;

/* ===========================================  EXTVREG_0 CONTROL FBLEN [25..25]  ============================================ */
typedef enum {                                  /*!< EXTVREG_0_CONTROL_FBLEN                                                   */
  EXTVREG_0_CONTROL_FBLEN_DISABLED     = 0,     /*!< DISABLED : Disable foldback limiting.                                     */
  EXTVREG_0_CONTROL_FBLEN_ENABLED      = 1,     /*!< ENABLED : Enable foldback limiting.                                       */
} EXTVREG_0_CONTROL_FBLEN_Enum;

/* ===========================================  EXTVREG_0 CONTROL PNSEL [26..26]  ============================================ */
typedef enum {                                  /*!< EXTVREG_0_CONTROL_PNSEL                                                   */
  EXTVREG_0_CONTROL_PNSEL_NPN          = 0,     /*!< NPN : Select NPN Mode.                                                    */
  EXTVREG_0_CONTROL_PNSEL_PNP          = 1,     /*!< PNP : Select PNP Mode.                                                    */
} EXTVREG_0_CONTROL_PNSEL_Enum;

/* ==========================================  EXTVREG_0 CONTROL FBPINSEL [27..27]  ========================================== */
typedef enum {                                  /*!< EXTVREG_0_CONTROL_FBPINSEL                                                */
  EXTVREG_0_CONTROL_FBPINSEL_EXREGSN   = 0,     /*!< EXREGSN : Use the input to the EXREGSN pin for foldback limiting.         */
  EXTVREG_0_CONTROL_FBPINSEL_VREGIN    = 1,     /*!< VREGIN : Use the input to the VREGIN pin for foldback limiting.           */
} EXTVREG_0_CONTROL_FBPINSEL_Enum;

/* ==========================================  EXTVREG_0 CONTROL EVREGEN [31..31]  =========================================== */
typedef enum {                                  /*!< EXTVREG_0_CONTROL_EVREGEN                                                 */
  EXTVREG_0_CONTROL_EVREGEN_DISABLED   = 0,     /*!< DISABLED : Disable the external regulator.                                */
  EXTVREG_0_CONTROL_EVREGEN_ENABLED    = 1,     /*!< ENABLED : Enable the external regulator.                                  */
} EXTVREG_0_CONTROL_EVREGEN_Enum;

/* ========================================================  CONFIG  ========================================================= */
/* ===========================================  EXTVREG_0 CONFIG IMINFINE [0..1]  ============================================ */
typedef enum {                                  /*!< EXTVREG_0_CONFIG_IMINFINE                                                 */
  EXTVREG_0_CONFIG_IMINFINE_0_UA       = 0,     /*!< 0_UA : Minimum current limit is IMIN current + 0 uA.                      */
  EXTVREG_0_CONFIG_IMINFINE_0P25_UA    = 1,     /*!< 0P25_UA : Minimum current limit is IMIN current + 0.25 uA.                */
  EXTVREG_0_CONFIG_IMINFINE_0P5_UA     = 2,     /*!< 0P5_UA : Minimum current limit is IMIN current + 0.50 uA.                 */
  EXTVREG_0_CONFIG_IMINFINE_0P75_UA    = 3,     /*!< 0P75_UA : Minimum current limit is IMIN current + 0.75 uA.                */
} EXTVREG_0_CONFIG_IMINFINE_Enum;

/* =============================================  EXTVREG_0 CONFIG IMIN [2..4]  ============================================== */
typedef enum {                                  /*!< EXTVREG_0_CONFIG_IMIN                                                     */
  EXTVREG_0_CONFIG_IMIN_1_UA           = 0,     /*!< 1_UA : Minimum current limit is 1 uA + IMINFINE current.                  */
  EXTVREG_0_CONFIG_IMIN_2_UA           = 1,     /*!< 2_UA : Minimum current limit is 2 uA + IMINFINE current.                  */
  EXTVREG_0_CONFIG_IMIN_3_UA           = 2,     /*!< 3_UA : Minimum current limit is 3 uA + IMINFINE current.                  */
  EXTVREG_0_CONFIG_IMIN_4_UA           = 3,     /*!< 4_UA : Minimum current limit is 4 uA + IMINFINE current.                  */
  EXTVREG_0_CONFIG_IMIN_5_UA           = 4,     /*!< 5_UA : Minimum current limit is 5 uA + IMINFINE current.                  */
  EXTVREG_0_CONFIG_IMIN_6_UA           = 5,     /*!< 6_UA : Minimum current limit is 6 uA + IMINFINE current.                  */
  EXTVREG_0_CONFIG_IMIN_7_UA           = 6,     /*!< 7_UA : Minimum current limit is 7 uA + IMINFINE current.                  */
  EXTVREG_0_CONFIG_IMIN_8_UA           = 7,     /*!< 8_UA : Minimum current limit is 8 uA + IMINFINE current.                  */
} EXTVREG_0_CONFIG_IMIN_Enum;

/* ===========================================  EXTVREG_0 CONFIG FBVOSEL [8..10]  ============================================ */
typedef enum {                                  /*!< EXTVREG_0_CONFIG_FBVOSEL                                                  */
  EXTVREG_0_CONFIG_FBVOSEL_0_V         = 0,     /*!< 0_V : Foldback voltage offset is 0 V.                                     */
  EXTVREG_0_CONFIG_FBVOSEL_0P5_V       = 1,     /*!< 0P5_V : Foldback voltage offset is 0.5 V.                                 */
  EXTVREG_0_CONFIG_FBVOSEL_1_V         = 2,     /*!< 1_V : Foldback voltage offset is 1 V.                                     */
  EXTVREG_0_CONFIG_FBVOSEL_1P5_V       = 3,     /*!< 1P5_V : Foldback voltage offset is 1.5 V.                                 */
  EXTVREG_0_CONFIG_FBVOSEL_2_V         = 4,     /*!< 2_V : Foldback voltage offset is 2 V.                                     */
  EXTVREG_0_CONFIG_FBVOSEL_2P5_V       = 5,     /*!< 2P5_V : Foldback voltage offset is 2.5 V.                                 */
  EXTVREG_0_CONFIG_FBVOSEL_3_V         = 6,     /*!< 3_V : Foldback voltage offset is 3 V.                                     */
  EXTVREG_0_CONFIG_FBVOSEL_3P5_V       = 7,     /*!< 3P5_V : Foldback voltage offset is 3.5 V.                                 */
} EXTVREG_0_CONFIG_FBVOSEL_Enum;

/* ===========================================  EXTVREG_0 CONFIG FBRATE [12..14]  ============================================ */
typedef enum {                                  /*!< EXTVREG_0_CONFIG_FBRATE                                                   */
  EXTVREG_0_CONFIG_FBRATE_4_UA_PER_V   = 0,     /*!< 4_UA_PER_V : Set the foldback rate to 4 uA/V.                             */
  EXTVREG_0_CONFIG_FBRATE_2_UA_PER_V   = 1,     /*!< 2_UA_PER_V : Set the foldback rate to 2 uA/V.                             */
  EXTVREG_0_CONFIG_FBRATE_1_UA_PER_V   = 2,     /*!< 1_UA_PER_V : Set the foldback rate to 1 uA/V.                             */
  EXTVREG_0_CONFIG_FBRATE_0P5_UA_PER_V = 3,     /*!< 0P5_UA_PER_V : Set the foldback rate to 0.5 uA/V.                         */
  EXTVREG_0_CONFIG_FBRATE_8_UA_PER_V   = 5,     /*!< 8_UA_PER_V : Set the foldback rate to 8 uA/V.                             */
  EXTVREG_0_CONFIG_FBRATE_16_UA_PER_V  = 6,     /*!< 16_UA_PER_V : Set the foldback rate to 16 uA/V.                           */
  EXTVREG_0_CONFIG_FBRATE_32_UA_PER_V  = 7,     /*!< 32_UA_PER_V : Set the foldback rate to 32 uA/V.                           */
} EXTVREG_0_CONFIG_FBRATE_Enum;

/* ============================================  EXTVREG_0 CONFIG IMAX [16..18]  ============================================= */
typedef enum {                                  /*!< EXTVREG_0_CONFIG_IMAX                                                     */
  EXTVREG_0_CONFIG_IMAX_2_UA           = 0,     /*!< 2_UA : Maximum current limit is 2 uA.                                     */
  EXTVREG_0_CONFIG_IMAX_3_UA           = 1,     /*!< 3_UA : Maximum current limit is 3 uA.                                     */
  EXTVREG_0_CONFIG_IMAX_4_UA           = 2,     /*!< 4_UA : Maximum current limit is 4 uA.                                     */
  EXTVREG_0_CONFIG_IMAX_5_UA           = 3,     /*!< 5_UA : Maximum current limit is 5 uA.                                     */
  EXTVREG_0_CONFIG_IMAX_6_UA           = 4,     /*!< 6_UA : Maximum current limit is 6 uA.                                     */
  EXTVREG_0_CONFIG_IMAX_7_UA           = 5,     /*!< 7_UA : Maximum current limit is 7 uA.                                     */
  EXTVREG_0_CONFIG_IMAX_8_UA           = 6,     /*!< 8_UA : Maximum current limit is 8 uA.                                     */
  EXTVREG_0_CONFIG_IMAX_9_UA           = 7,     /*!< 9_UA : Maximum current limit is 9 uA.                                     */
} EXTVREG_0_CONFIG_IMAX_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ============================================  EXTVREG_0 STATUS FBMAXF [0..0]  ============================================= */
typedef enum {                                  /*!< EXTVREG_0_STATUS_FBMAXF                                                   */
  EXTVREG_0_STATUS_FBMAXF_NOT_SET      = 0,     /*!< NOT_SET : Maximum foldback has not been reached.                          */
  EXTVREG_0_STATUS_FBMAXF_SET          = 1,     /*!< SET : Maximum foldback has been reached.                                  */
} EXTVREG_0_STATUS_FBMAXF_Enum;

/* =======================================================  CSCONTROL  ======================================================= */
/* ==========================================  EXTVREG_0 CSCONTROL ISNSEN [30..30]  ========================================== */
typedef enum {                                  /*!< EXTVREG_0_CSCONTROL_ISNSEN                                                */
  EXTVREG_0_CSCONTROL_ISNSEN_DISABLED  = 0,     /*!< DISABLED : Disable external regulator current sensing.                    */
  EXTVREG_0_CSCONTROL_ISNSEN_ENABLED   = 1,     /*!< ENABLED : Enable external regulator current sensing.                      */
} EXTVREG_0_CSCONTROL_ISNSEN_Enum;

/* ========================================  EXTVREG_0 CSCONTROL ADCISNSEN [31..31]  ========================================= */
typedef enum {                                  /*!< EXTVREG_0_CSCONTROL_ADCISNSEN                                             */
  EXTVREG_0_CSCONTROL_ADCISNSEN_DISABLED = 0,   /*!< DISABLED : Disable ADC current sensing.                                   */
  EXTVREG_0_CSCONTROL_ADCISNSEN_ENABLED = 1,    /*!< ENABLED : Enable ADC current sensing.                                     */
} EXTVREG_0_CSCONTROL_ADCISNSEN_Enum;

