chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* =======================================================  CSCONFIG  ======================================================== */
/* ==========================================  EXTVREG_0 CSCONFIG ISADCGAIN [0..2]  ========================================== */
typedef enum {                                  /*!< EXTVREG_0_CSCONFIG_ISADCGAIN                                              */
  EXTVREG_0_CSCONFIG_ISADCGAIN_16X     = 0,     /*!< 16X : ADC current sensing input gain is 16.                               */
  EXTVREG_0_CSCONFIG_ISADCGAIN_8X      = 1,     /*!< 8X : ADC current sensing input gain is 8.                                 */
  EXTVREG_0_CSCONFIG_ISADCGAIN_4X      = 2,     /*!< 4X : ADC current sensing input gain is 4.                                 */
  EXTVREG_0_CSCONFIG_ISADCGAIN_2X      = 3,     /*!< 2X : ADC current sensing input gain is 2.                                 */
  EXTVREG_0_CSCONFIG_ISADCGAIN_1X      = 4,     /*!< 1X : ADC current sensing input gain is 1.                                 */
} EXTVREG_0_CSCONFIG_ISADCGAIN_Enum;

/* ===========================================  EXTVREG_0 CSCONFIG ISOGAIN [3..5]  =========================================== */
typedef enum {                                  /*!< EXTVREG_0_CSCONFIG_ISOGAIN                                                */
  EXTVREG_0_CSCONFIG_ISOGAIN_16X       = 0,     /*!< 16X : External regulator current sensing gain is 16.                      */
  EXTVREG_0_CSCONFIG_ISOGAIN_8X        = 1,     /*!< 8X : External regulator current sensing gain is 8.                        */
  EXTVREG_0_CSCONFIG_ISOGAIN_4X        = 2,     /*!< 4X : External regulator current sensing gain is 4.                        */
  EXTVREG_0_CSCONFIG_ISOGAIN_2X        = 3,     /*!< 2X : External regulator current sensing gain is 2.                        */
  EXTVREG_0_CSCONFIG_ISOGAIN_1X        = 4,     /*!< 1X : External regulator current sensing gain is 1.                        */
} EXTVREG_0_CSCONFIG_ISOGAIN_Enum;

/* ===========================================  EXTVREG_0 CSCONFIG ISINSEL [6..7]  =========================================== */
typedef enum {                                  /*!< EXTVREG_0_CSCONFIG_ISINSEL                                                */
  EXTVREG_0_CSCONFIG_ISINSEL_MODE0     = 0,     /*!< MODE0 : Select external regulator current sensing mode 0.                 */
  EXTVREG_0_CSCONFIG_ISINSEL_MODE1     = 1,     /*!< MODE1 : Select external regulator current sensing mode 1.                 */
  EXTVREG_0_CSCONFIG_ISINSEL_MODE2     = 2,     /*!< MODE2 : Select external regulator current sensing mode 2.                 */
} EXTVREG_0_CSCONFIG_ISINSEL_Enum;



/* =========================================================================================================================== */
/* ================                                          VREG_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* ============================================  VREG_0 CONTROL VBUSVLDF [0..0]  ============================================= */
typedef enum {                                  /*!< VREG_0_CONTROL_VBUSVLDF                                                   */
  VREG_0_CONTROL_VBUSVLDF_NOT_SET      = 0,     /*!< NOT_SET : The current voltage on the VBUS pin is below the valid
                                                     threshold.                                                                */
  VREG_0_CONTROL_VBUSVLDF_SET          = 1,     /*!< SET : The current voltage on the VBUS pin is above the valid
                                                     threshold.                                                                */
} VREG_0_CONTROL_VBUSVLDF_Enum;

/* ==============================================  VREG_0 CONTROL SUSEN [1..1]  ============================================== */
typedef enum {                                  /*!< VREG_0_CONTROL_SUSEN                                                      */
  VREG_0_CONTROL_SUSEN_DISABLED        = 0,     /*!< DISABLED : Disable regulator suspend mode.                                */
  VREG_0_CONTROL_SUSEN_ENABLED         = 1,     /*!< ENABLED : Enable regulator suspend mode.                                  */
} VREG_0_CONTROL_SUSEN_Enum;

/* ==============================================  VREG_0 CONTROL BGDIS [5..5]  ============================================== */
typedef enum {                                  /*!< VREG_0_CONTROL_BGDIS                                                      */
  VREG_0_CONTROL_BGDIS_INACTIVE        = 0,     /*!< INACTIVE : Enable the voltage regulator band gap.                         */
  VREG_0_CONTROL_BGDIS_ACTIVE          = 1,     /*!< ACTIVE : Disable the voltage regulator band gap.                          */
} VREG_0_CONTROL_BGDIS_Enum;

/* =============================================  VREG_0 CONTROL SENSEEN [6..6]  ============================================= */
typedef enum {                                  /*!< VREG_0_CONTROL_SENSEEN                                                    */
  VREG_0_CONTROL_SENSEEN_DISABLED      = 0,     /*!< DISABLED : Disable VREGIN voltage sensing.                                */
  VREG_0_CONTROL_SENSEEN_ENABLED       = 1,     /*!< ENABLED : Enable VREGIN voltage sensing.                                  */
} VREG_0_CONTROL_SENSEEN_Enum;

/* ============================================  VREG_0 CONTROL VBUSIVLDI [7..7]  ============================================ */
typedef enum {                                  /*!< VREG_0_CONTROL_VBUSIVLDI                                                  */
  VREG_0_CONTROL_VBUSIVLDI_NOT_SET     = 0,     /*!< NOT_SET : The voltage on the VBUS pin has not dropped below
                                                     the valid threshold.                                                      */
  VREG_0_CONTROL_VBUSIVLDI_SET         = 1,     /*!< SET : The voltage on the VBUS pin dropped below the valid threshold
                                                     since the last time this bit was cleared.                                 */
} VREG_0_CONTROL_VBUSIVLDI_Enum;

/* ===========================================  VREG_0 CONTROL VBUSIVLDIEN [8..8]  =========================================== */
typedef enum {                                  /*!< VREG_0_CONTROL_VBUSIVLDIEN                                                */
  VREG_0_CONTROL_VBUSIVLDIEN_DISABLED  = 0,     /*!< DISABLED : Disable the VBUS invalid interrupt.                            */
  VREG_0_CONTROL_VBUSIVLDIEN_ENABLED   = 1,     /*!< ENABLED : Enable the VBUS invalid interrupt.                              */
} VREG_0_CONTROL_VBUSIVLDIEN_Enum;

