chrta/zephyr-sim3u/soc/arm/silabs_sim3/sim3u/SIM3U167_B.h
/* ============================================  VREG_0 CONTROL VREGDIS [31..31]  ============================================ */
typedef enum {                                  /*!< VREG_0_CONTROL_VREGDIS                                                    */
  VREG_0_CONTROL_VREGDIS_INACTIVE      = 0,     /*!< INACTIVE : Enable the voltage regulator.                                  */
  VREG_0_CONTROL_VREGDIS_ACTIVE        = 1,     /*!< ACTIVE : Disable the voltage regulator.                                   */
} VREG_0_CONTROL_VREGDIS_Enum;



/* =========================================================================================================================== */
/* ================                                           LDO_0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* =============================================  LDO_0 CONTROL LDOIBIAS [1..1]  ============================================= */
typedef enum {                                  /*!< LDO_0_CONTROL_LDOIBIAS                                                    */
  LDO_0_CONTROL_LDOIBIAS_HIGHBIAS      = 0,     /*!< HIGHBIAS : Select high bias.                                              */
  LDO_0_CONTROL_LDOIBIAS_LOWBIAS       = 1,     /*!< LOWBIAS : Select low bias (AHB frequency <= 2.5 MHz).                     */
} LDO_0_CONTROL_LDOIBIAS_Enum;

/* =============================================  LDO_0 CONTROL LDOAEN [31..31]  ============================================= */
typedef enum {                                  /*!< LDO_0_CONTROL_LDOAEN                                                      */
  LDO_0_CONTROL_LDOAEN_DISABLE         = 0,     /*!< DISABLE : LDO0 analog output disabled.                                    */
  LDO_0_CONTROL_LDOAEN_ENABLE          = 1,     /*!< ENABLE : LDO0 analog output enabled.                                      */
} LDO_0_CONTROL_LDOAEN_Enum;



/* =========================================================================================================================== */
/* ================                                         WDTIMER_0                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  CONTROL  ======================================================== */
/* ============================================  WDTIMER_0 CONTROL EWIEN [0..0]  ============================================= */
typedef enum {                                  /*!< WDTIMER_0_CONTROL_EWIEN                                                   */
  WDTIMER_0_CONTROL_EWIEN_DISABLED     = 0,     /*!< DISABLED : Disable the early warning interrupt (EWI).                     */
  WDTIMER_0_CONTROL_EWIEN_ENABLED      = 1,     /*!< ENABLED : Enable the early warning interrupt (EWI).                       */
} WDTIMER_0_CONTROL_EWIEN_Enum;

/* ============================================  WDTIMER_0 CONTROL DBGMD [1..1]  ============================================= */
typedef enum {                                  /*!< WDTIMER_0_CONTROL_DBGMD                                                   */
  WDTIMER_0_CONTROL_DBGMD_RUN          = 0,     /*!< RUN : The WDTIMER module will continue to operate while the
                                                     core is halted in debug mode.                                             */
  WDTIMER_0_CONTROL_DBGMD_HALT         = 1,     /*!< HALT : A debug breakpoint will cause the WDTIMER module to halt.          */
} WDTIMER_0_CONTROL_DBGMD_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ============================================  WDTIMER_0 STATUS KEYSTS [0..0]  ============================================= */
typedef enum {                                  /*!< WDTIMER_0_STATUS_KEYSTS                                                   */
  WDTIMER_0_STATUS_KEYSTS_IDLE         = 0,     /*!< IDLE : No keys have been processed by the interface.                      */
  WDTIMER_0_STATUS_KEYSTS_READY        = 1,     /*!< READY : The attention key has been received and the module is
                                                     awaiting a command.                                                       */
} WDTIMER_0_STATUS_KEYSTS_Enum;

/* ============================================  WDTIMER_0 STATUS PRIVSTS [1..1]  ============================================ */
typedef enum {                                  /*!< WDTIMER_0_STATUS_PRIVSTS                                                  */
  WDTIMER_0_STATUS_PRIVSTS_READ_ONLY   = 0,     /*!< READ_ONLY : The watchdog timer registers are currently read-only.         */
  WDTIMER_0_STATUS_PRIVSTS_READ_WRITE  = 1,     /*!< READ_WRITE : A write transaction can be performed on the module
                                                     registers.                                                                */
} WDTIMER_0_STATUS_PRIVSTS_Enum;

/* ==============================================  WDTIMER_0 STATUS EWI [2..2]  ============================================== */
typedef enum {                                  /*!< WDTIMER_0_STATUS_EWI                                                      */
  WDTIMER_0_STATUS_EWI_NOT_SET         = 0,     /*!< NOT_SET : Read: An early warning match did not occur. Write:
                                                     Clear the early warning interrupt.                                        */
  WDTIMER_0_STATUS_EWI_SET             = 1,     /*!< SET : Read: An early warning match occurred and the interrupt
                                                     is pending. Write: Force a watchdog timer early warning
                                                     interrupt to occur.                                                       */
} WDTIMER_0_STATUS_EWI_Enum;

/* =============================================  WDTIMER_0 STATUS RTHF [3..3]  ============================================== */
typedef enum {                                  /*!< WDTIMER_0_STATUS_RTHF                                                     */
  WDTIMER_0_STATUS_RTHF_LT             = 0,     /*!< LT : The counter is currently less than the reset threshold
                                                     (RTH) value.                                                              */
  WDTIMER_0_STATUS_RTHF_GTE            = 1,     /*!< GTE : The counter is currently greater than or equal to the
                                                     reset threshold (RTH) value.                                              */
} WDTIMER_0_STATUS_RTHF_Enum;

/* ============================================  WDTIMER_0 STATUS UPDSTS [4..4]  ============================================= */
typedef enum {                                  /*!< WDTIMER_0_STATUS_UPDSTS                                                   */
  WDTIMER_0_STATUS_UPDSTS_IDLE         = 0,     /*!< IDLE : An update completed or is not pending. The EWTH and RTH
                                                     fields can be written.                                                    */
  WDTIMER_0_STATUS_UPDSTS_UPDATING     = 1,     /*!< UPDATING : An update of the threshold register is occurring.
                                                     The EWTH and RTH fields should not be modified until hardware
                                                     clears UPDSTS to 0.                                                       */
} WDTIMER_0_STATUS_UPDSTS_Enum;

/* =======================================================  THRESHOLD  ======================================================= */
/* ========================================================  WDTKEY  ========================================================= */
/* ==============================================  WDTIMER_0 WDTKEY KEY [0..7]  ============================================== */
typedef enum {                                  /*!< WDTIMER_0_WDTKEY_KEY                                                      */
  WDTIMER_0_WDTKEY_KEY_ATTN            = 165,   /*!< ATTN : Attention key to start the command sequence.                       */
  WDTIMER_0_WDTKEY_KEY_RESET           = 204,   /*!< RESET : Reset the watchdog timer.                                         */
  WDTIMER_0_WDTKEY_KEY_DISABLE         = 221,   /*!< DISABLE : Disable the watchdog timer.                                     */
  WDTIMER_0_WDTKEY_KEY_START           = 238,   /*!< START : Start the watchdog timer.                                         */
  WDTIMER_0_WDTKEY_KEY_WRITE           = 241,   /*!< WRITE : Allow one write access to the module registers.                   */
  WDTIMER_0_WDTKEY_KEY_LOCK            = 255,   /*!< LOCK : Lock the module from any other writes until the next
                                                     system reset.                                                             */
} WDTIMER_0_WDTKEY_KEY_Enum;


/** @} */ /* End of group EnumValue_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* SIM3U167_B_H */


/** @} */ /* End of group SIM3U167_B */

/** @} */ /* End of group  */
